{
    "video_id": "SKLTEOK2aZA",
    "channel_url": "@davidguetta",
    "transcript": "Crazy. It's crazy. >> I maybe uh it sounds even better than the uh the original, >> but it's going to hurt my ego. It's going to hurt my ego. >> Hi, I'm David Geta. >> Hey, it's Nikki Romero. >> And we're going to master a track using our new plugin, Faster Master. So uh we have the project of a premaster here of shout which we worked on uh not too long ago and we have the faster master plugin right here. >> The idea is uh the plugin is going to listen to the song first. So we we go to the loud part. Let's do it. >> Let's do it. >> Okay. Here we go. It shows a uh a quick message that the the volume the levels will change with 12 1/2 dB which is a lot. Normally you're like okay I need to put the volume down otherwise you're going to you're going to be unhappy with the volume. And now I think it's great that whenever we open the plugin we do the analysis of the record. So the plugin knows what key it's in. It knows the speed. It knows the peaks. It knows the transions and it will throw a few presets. and it gives you a couple of smart presets where the plug-in thinks it does the best job on this record. So, let's just click a few and see what the different sounding uh curves are. So, we have, for example, ethereal and glossy, modern and refined, versatile and dark. [Music] All these presets have their own character. So it will change the EQ accordingly together with the transions and compress and but these are presets that the plug-in comes up with based upon what you feed it into it. So based upon you know the the record that we just analyzed called shout. I think what was interesting when we worked on this >> was to compare your original master >> with uh that requires 15 years of uh knowledge uh >> 15 years of trying >> you know and and all those plugins and studying it and that >> we got to 95% uh close Brazil just by doing it itself. So that's pretty incredible. >> And it also took a long time to get the master sounding the way it did eventually. Remember that we sent the master back and forth many times. You add a lot of the subbase that you wanted to add and then I had to work that into the master and I send it back. So we we spend a lot of time to get it uh sounding as good as I think it does right now. Then we also have all the different styles uh that you can reference. So we we could also say like okay um electronic uh clean and pure and then it's is it's like a different a little more air. Basically, I think that usually the plug-in knows what it's doing >> 100%. >> And maybe better than us. >> And uh my experience with it uh was that for me at least, it was best to take what the plug-in is proposing and maybe correct a little bit. I think what's important is um if you if you're doing mastering, you're going to have to use many many uh uh plugins. And the idea of this is we take things in order actually the the plug-in does it for you. So the first thing is to EQ and you see that it's proposing what the plugin feels is the best EQ possible. Then there's a transient would be like the attack of of different sounds and we can modify all of it of course. So you know EQ I could say you think that need less K but let's put a little bit more or like transient if you want more just need to move it like that is going to give you more punch this is going to give you less punch compression uh stereo and the limiter which really is defining uh how loud we want it to be. Uh so really you have all in one and it does it all for you and then you can listen and do the little changes that you think are necessary or not. You know what also is great a great feature what I think that uh faster master has is when whenever you're happy with the EQ part you know you don't want to change the EQ part you can lock it here by clicking on the top like this way it locks the settings on the EQ and whenever I go to a different preset now it will only change the other sections like transition compress stereo where we get to later >> but you can also lock certain parts without losing the curve you just made which I thought was really helpful. >> I remember insisting on that um because uh you know uh there's one one thing is it's so basic but it's it's stupid but like >> every time you use uh uh any uh plugin the fact that it changes the volume influences us so much because >> basically the louder it is >> the best you're going to think it sounds like but >> okay it will become I learned over the years. But, you know, it's actually  Like, so you want to be able to compare >> for what it is, meaning that it's at the same volume and everything is volume matched. Because otherwise, >> this is what I see with, let's say, beginners, they tend to always do anything that is going to make it sound louder >> without being necessarily better. every move you're going to make on any of of the EQ, the transient, the compression, uh, anything is always going to be level match. So, it's honest, which I think is really important because especially if I look at myself when I was uh just started producing, I just wanted my track to sound as loud as your as possible. And it became like a war on my >> So, we were we were part of that generation, don't we? Everybody want to have the loudest master. It makes no sense because eventually you play your track out on a live stage and they have a great sounding PA with probably a live engineer that's still correcting things. So it makes no sense to only get it louder. So you want to have loudness compared to, you know, your favorite tracks and the ones that you think that sound great live. Oh yeah, by the way, we have that too. We have the the references. We can like upload a track here and reference it uh if we want to sound like this track. And then faster master is going to take the track you upload and try to make it sound the same. >> Yeah, exactly. >> Obviously needs to be a little bit in the same style, >> but >> you can obviously not compare a pop song to a club record because it's completely, you know, like if >> unless unless you get a record because >> No, but if you take let's say one of, you know, one of one of the records that you made, let's say 10 20 >> Yeah. Yeah. But if you if you compare I don't know like country music or classical music to electronic then of course >> it needs to be comparable. Yeah. But I think the fundament of the plugin and is that is that's easy to uh to get to a certain result with a few clicks without suffering quality and also being able to listen to it on a uh very honest comparing volume. H and this is something that is really really important. All right. So EQ on masters can be a little uh scary because uh first you need to be very gentle and uh second sometimes is phase issues and this from all the feedbacks we got from different engineers is really sounding as good as it gets. there's already a selection of of where to move things around. >> Yeah, I think again with with with the sliders here and and the the little uh knobs that you can move, uh it's it's just very convenient to make little tweaks as the plugin always does, let's say a 95%, you know, uh job on getting close to the result that you want. You can always make a few tweaks here with a dB or two and db and a half and it gets really scary close to uh to your to your reference track. in in our case, the original master from Shout, which I've done what, like 10 plugins. >> Yeah. Yeah. >> And of course, you can bypass the entire EQ. So, you only have the other sections here of the plugin working for you. >> All right. Let's go to transient. So, this is going to define how much punch you want, how much you want to feel the attack. So, same here. It's just so easy because like you just have to move this knob. It's really like cannot get easier than that. So you see that here you can you can feel the kick more. And here it's a little bit less aggressive. This is a matter of taste. Um again the plug-in choses it for you. Uh if you do the type of music we want, we like to have a lot of punch in the kick. Uh but maybe uh if you were doing more housey stuff, you >> we spoke about it before. Yeah, >> this is really again so so easy. Like we have a light compression now, but we could, you know, squeeze it more. Uh, but it's really easy like you have three options and that's it. >> I think one thing with the compression air we have a really cool feature here in the right top which is side chain and this way you can leave out the low frequencies. I believe it was under 250 htz it will not take that uh when you're compressing. So when you're doing dynamic when you make changes here it will leave out everything under 250. >> So the kick and the bass are not going to muddy up your entire mix. And then we have the stereo field. >> To be honest, we both have the the the impression that we kind of always use a little bit the similar tricks. >> Always on >> the way. >> I think I still use yours to be honest. >> On the way we uh we we create a we retouch the stereo on the master. So basically we we put in the plugin what we do basically. >> Exactly. Yeah. But honestly, I think these days and I had this conversation especially with a lot of Dutch DJs. I speak to let's say Hardwell, WW, Martin Garrick, and it's always >> this there is very few plugins that can do very good stereo width imaging. I feel like I don't know how many you know, but I only know let's say two, three, >> and then the rest I do on an SSL like on an actual mixing desk because that's to me still, you know, a result that I cannot get close to with any digital plugins. But I think how close we got right now with this plugin is really, really crazy. I don't want to sound too exaggerated, but this section I think still blows my mind every time I use it. >> All right. Limiter. >> Limiter. >> Again, when you have no experience, uh, sometimes you just like it because it's louder, but you lose on quality. Exactly. >> So, I like that Ptor Master is not going to take you to some insane place where you're ruining your sound just because you want to be loud. >> But again, if you choose to do it, you can. And you can also add some drive, which will give you a perception that it's also louder. We're trying to always be reasonable, let's say. Um, and then if you want to be crazy, then that's all. >> You can go crazy. You can go 100% crazy. I think I think what we tried after a couple of times of of uh of testing the plug-in whenever you use it in combination with other plugins, let's say you have other plugins or for an effect that that affects the you know the loudness and you want to make sure that it's measured the right way and whenever you do that. So whenever you have a plugin before faster master in your chain that affects the volume, you can always click this button here and it will rememeasure the loudness of the record in consideration what the other plugins do. And this way you still have a fair comparison of how loud your record is comparing to others. But what I think is really crazy is, for example, when you have a premaster of a record, you can compare your premaster in the plug-in live and using this knob of level match bypass. It will adapt the volume of your premaster to the mastered version. And this way, you're not, you know, you're not misled to making choices you would not make. >> So now we're going to compare this to your original master without touching anything. So just what faster master did on its own. We didn't retouch anything. >> There's no other plugin on the master than faster master right now. And it's going to compare to a master that has at least 10 different plugins on the master chain. Uh yeah. Um let's uh let's compare it. [Music] That's really impressive. That's crazy. Yeah. [Music] >> Crazy. >> It's crazy. >> I maybe uh it sounds even better than the uh the original, >> but it's going to hurt my ego. It's going to hurt my ego. [Music]",
    "start_time": 0.0,
    "end_time": 870.48
}