{
    "video_id": "WSKKzzYJxv0",
    "channel_url": "@dafuqboom",
    "transcript": "Cathy? Cat! Cathy! Are you ok? Dave? You don't look good ;) No I'm f... I'm fine! Can you get up? You were unconscious... Something terrible happened... We need to get out of here... as soon as we can... You think it's the grand experiment? Whole system overloaded... only one thing could cause this... Not good... Is this blood? Wait! Where is everybody? Either left... Or stuck somewhere... What was that? Look... other part of facility is still powered... See if you can find the others... Try to contact the surface... And what about you? I'll go to the test chamber... And find out what the hell happened! Wait... Let's be reasonable, okay? What if it's dangerous? You heard it... Someone may be in trouble... I'm not leaving anyone behind... I don't care if it's dangerous or not... I care... Don't worry... I'll be ok... I promise ;) C A L M  D O W N ! Y O U  N E E D  U P G R A D E S  F I R S T ! NOW, YOU WILL DIE! WHERE ARE YOU, SON? I DON'T SEE YOU ON MY RADARS! follow me, if you wanna live WHERE ARE YOU? :'( I CAN SEE YOU THROUGH WALLS! WHAT? my sister served as a national guard, when all this happened... i tried to find her there... at alpha hills... i... don't know if she's even alive anymore... smells like shit, bro i ain't eatin all dat! let me cook... hehe, that was tough one! last time i tried to use toilet - it almost killed me! xD why you looking like that? it's just plunger! Who worked at Alpha-Hills? Come here! Know your place... Have you analyzed every arrived survivor? Then tell me... What the hell is that! Stop it! I came here to speak on behalf of my peoples In these hard times... We must seize the opportunity to form a new union. Time to bury the hatchet! Don't you think? Hello again! Their leaders are hiding inside my facility! They stole our technologies! I'M ANGRY! My anger is immeasurable. *bonk* They think they're safe inside! They're wrong! This device is my personal master key! It opens every door... Grants access to any COMPUTER inside ;) I can't do a lot from here... But I'm sure... your army can handle this. Good luck. HOW DARE YOU RESIST? TRAITOROUS SCUM! Time... To die :) Stay back! Samples first! Move imbeciles! Before they find us again! There's nothing you can do :/ Someone tampering in our communications. Squad that was chasing a titan is missing... You sure you want to participate? I will keep my promise. PROCEED WITH THE PLAN. Analyze this... thoroughly. You will regret it.. Hey! Your friends... You did not bother saving them... Without our help, they would die... Now, lil bro... Your base.. is OUR base ;) LARGE TV: DUM BICH! WHY ARE WE ALLYING WITH THE SHITHEADS?? ARE WE THIS DESPERATE? Scientist TV: This is necessary... If we want to survive.. We must organise a meeting with their hiding leader. He knows something that can help us... TITAN TV: ONLY THING I'M ORGANISING IS HIS FUNERAL HOW CAN YOU TRUST HIM?? AFTER ALL THE GENOCIDE Scientist TV: You've seen what the invaders can do... Their weakest units... Wipe out entire legions... They kill everything in their way... Do you think we have a choice? TITAN TV: WE DO. ACQUIRE BIGGER SAMPLES... DEVELOP STRONGER UPGRADES... JUST LIKE BEFORE. Scientist TV: This is not just like before.. Our advantage is being underground, in secrecy... But we have to be cautious and slow.. If they find us, access our technology.. This will be the end of our world... TITAN TV: OUR WORLD HAS ALREADY ENDED  ITS THEIRS NOW... THAT IS NOT ENOUGH POWER. THEY'VE LOST THEIR GUIDANCE MARCHING TO THEIR IMMINENT DEATH ARE WE GOING TO STAY, AND WATCH THEM DIE?? It takes sacrifice to achieve progress... Better safe than sorry. I learnt it the hard way... YOU IMBECILE! SOON NO PLACE WILL BE SAFE! Speakermen were preparing their armada this whole time... They'll come, just give them time! Moment you get out, they'll send their strongest against you! THAT... IS MY PLAN EVERYTHING WILL CHANGE TODAY! *cough* Don't shoot! We're not enemy! I've seen likes of you helping out other people. Can you get us to a safer place? No! Can't you see?! The church is on fire! *gasp* Why bro is aiming at me?? Is he stupid? We saved your life! RELAX... WE AIN'T HERE TO HURT NOBODY TIME FOR US TO BECOME FRIENDS OFFICIALLY ;) *peak alpha male laugh* WE ARE NOT ASKING :| HEHEHE! LESSGO! :D DAYUM :P As one... Until the end... WHAT ARE YOU DOING HERE? ARE YOU INSANE?? GET OUT! 🗣️ MY TURN, SHITHEAD! S O M E O N E  I S  D Y I N G  H E R E ... A N D   I T   A I N ' T   M E ! L O O K   A T   M E! Y O U R  T I T A N  W O U L D N ' T  W A N T  Y O U  T O  D I E \n M E A N I N G L E S S L Y L E A V E   W H I L E   Y O U   S T I L L   C A N ! TOO SLOW! B I I I I I T C H ! ! Y O U  C A N ' T  K I L L  T H E  D E A D ! I ' L L  S H O W  Y O U  W H A T  T H E  O T H E R S I D E  L O O K S  L I K E ! YOU DID WELL WE TELEPORTED EVERYONE TO BASE WE MUST GET OUT, NOW! P A T H E T I C  T R A S H ! G I V E  M E  S O M E O N E  W O R T H Y  T O  F I G H T ! YOU... ARE NOT ESCAPING THIS TIME. PATHETIC! S U R P R I S E ! YOU DARE USE MY WEAPON AGAINST ME? W O M P  W O M P G O N N A  C R Y ? I'LL SEE YOU SOON... COWARD. GET UP! GET UP! UNDERWHELMING SLAUGHTER! THAT, WAS YOUR STRONGEST SOLDIER? STAY DOWN! RESISTANCE IS FUTILE! THAT CHANGES NOTHING! SOON YOU WILL MEET YOUR FATE... WORSE THAN DEATH! MISSED ME? WHAT MADE YOU SHOW UP... COMMANDER? YOU KNOW ME... I'M NOT LEAVING MY BEST FRIENDS BEHIND ;) W H A T  A R E  Y O U  Y A P P I N G  A B O U T ! ! ! ? ? ? DUKE WONT FORGIVE YOU BETRAYAL. YOU DON'T STAND A CHANCE AGAINST OUR FLEET! REALLY? THAT'S CRAZY! ONE SMALL ISSUE... I DON'T REMEMBER ASKING! THAT'S ALL EARTH GAVE YOU? WHAT'S LEFT OF YOUR FORMER GLORY? TRY ME :) Look at yourself! Why did you stay?! Y O U  N E E D E D  S A M P L E S I   B R O U G H T   Y O U   S A M P L E S Why... Gate.. It's not closing. Where do you think you're going, silly?  I C A N ' T M O V E TRACKING DEVICE! How do you like the pain? I T  T A K E S  M O R E  T H A N  T H A T  T O  H U R T  M E This is just the beginning... Serve your new master... Watchman of Doom. WHAT FOR - THIS FIGHT? You tell me ;) ACCEPT YOUR DEFEAT WITH AN HONOR... IF YOU STILL HAVE IT! Why such hostility? Did you forget how we conquered the worlds together? For me, you were always like brother... For them... an expandable pawn! STOP YAPPING AND FIGHT ME! WHY ARE YOU RUNNING? I don't want to fight you, my old friend... I want you by my side! JOIN YOU... AFTER YOU HURT MY BABY? *LOCKS IN* You know there was no choice! But... I know what it's like... Seeing your child suffer... Unable to help... Join me, and your legacy shall never know opression again. You have my word! WORD... WHAT'S THE PRICE OF YOUR WORDS? ONE OF YOUR TITANS IS IN THEIR POSSESSION! SOMEONE YOU KNOW IS THERE TOO... WITH SPECIAL REQUEST. WOULD YOU DO WHAT'S NECESSARY... WHEN TIME COMES? They would have to find me first ;) FIND YOU? ARE YOU KIDDING ME!? A secret weapon is preparing... waiting for the right moment. When it strikes... YOU better be on our side. I would hate for your children to become parentless ;) Where is he? COMMANDER ESCAPED Commander!? I am. Your. Commander. You already failed me twice... Shall I doubt your efficiency... Or loyalty. Lock in. Your next failure will be your last. I WILL NOT FAIL... COMMANDER. Very soon, there won't be a place on Earth this RAT can hide in... Go back to MOTHERSHIP and get repairs. Annihilate this place. SKIBIDI TOILET BY DAFUQBOOM TO BE CONTINUED...",
    "start_time": 13.323,
    "end_time": 3051.4139999999998
}