{
    "video_id": "kljxVDeApFQ",
    "channel_url": "@dudeperfect",
    "transcript": "Welcome to our brand new series, Squad Games. [Music] >> Today's matchup, Dude Perfect verse. Good good. These guys have gained millions of views hitting some of the most insane golf shots the internet has ever seen. But can they hang with us off the course? It's time to find out. Welcome to Squad Games. It is time for the coin flip. Matt, call it in the air. Failed. >> It's failed. Well done. >> All right, you guys have the first pick. What sport are we going with, >> guys? We know golf. >> We got to do golf. Let's do it. >> Come on, baby. >> Come on, baby. >> That's fine. >> All right, we are here. Competition one. Good has selected golf jock. We've got Brad and Shawn taking on Ty and Kobe. >> That's right, Ty. Breaking news out of the Dude Perfect camp. Garrett Hilbert on IR for four to six weeks with emergency hernia surgery. Tough tough. The golf, the kicking, that's going to take a toll. >> Yeah. Well, let's go ahead and give this one to Good. Good. I got a good good. >> Welcome to the golf competition. Three holes, two man teams, but it's the T flip scramble. Each player will hit their shot and then they have to flip a T which ball to play next. The squad with the lowest score after three holes wins game one. Let it rip. A little chunky to the left. He's going to need a roll out. >> Go ball turbo. It all comes down to this. >> Come on. Skilled toss here. >> Dang it. That's fine. >> Come on, Sean Walsh. Don't mess up. >> Let me uh I got to fix this quick. [Laughter] >> Thanks for straightening that out. >> Oh yeah, that looks pretty dude. That's different. Oh >> yeah, we'll take it. [Applause] >> They got away with going there. >> I'm not going to lie. It's a YouTube video just like we do all the time, but I felt a little more adrenaline. >> Yours is a little more juice. >> Yeah. Let's go, boys. >> Let's go. flip a tea. It doesn't even matter. >> You're the worst. >> I'm not tea flipping anymore. [Music] >> Oh, wow. >> Hey, I want that T for the next flip. Go ahead and knock that in. Good part. [Music] >> Anything is possible. [Music] >> The more shots that are needed on the hole, the better chance that >> something's going to go bad for them. >> For that, >> I think this is where we get exposed. >> Oh my goodness. >> That's it. That was exceptional. >> Yeah, it's in the bunker. [Music] [Applause] [Music] >> Oh my goodness. >> Is that perfect? >> The whole round is about to change. >> Every time [Music] this thing kick right kick. Okay, >> let's go. Ty, let's go play it. Let's go make a putt. >> It might be a really tough putt. >> It's a great place to >> That's fine for us. >> You got it. >> That's all right. Hey, we're good. We got two good options. We want Sean. >> You got it locked down, man. >> Yeah. Under rotation. >> The grass is a little wet, so it didn't get that bounce. >> We are far. I mean, this is probably a 60footer. >> I don't think he gets within 15 ft. Wow. 40 yards away. >> Much better. Good. >> We know it's going to Kobe, but good putt. Unlimited mojo. Unlimited Kobe. >> Ty's a good golfer and a horrible flipper. >> There's the left and then the right. >> Wow. Good putt. Pick it up, boys. We're okay with it. That's good. Good by us. better. I see it. You got it. >> Down by one. Last hole. >> We're saving my talents for the next one. I don't know what it's going to be, but I'll be fresh. [Music] >> Oh gosh. >> Oh, that is a yank. >> I like zoink scoop. >> That might be short of it. >> Dagger. >> Huge T flip. Yes. >> Whoa. We should have looked at that one. >> That might have been a reflip on our channel, but we'll let it slide. We'll let it slide. >> They're going to be losing golf, >> dude. Perfect >> Come on now. >> Oh, they're celebrating. They're celebrating. I think that means Brad's fine. >> We got some work to do either way. >> Yeah. Bunker. >> Bunker. Let's go. >> Bunker. Okay. They they got life. They got life. >> Go. >> Jump at all. >> It was the best. >> They want this. We want this. >> Get that out of here. >> The T beat us. >> Could have changed it. Yeah, it was the T. I feel like we got a win. We got it on Shawn. That's all we needed. Get these boys out of here. Next sport, baby. >> Here's the cold hard reality. We need to make this. If we miss it, a two putt's good enough for them and they're pretty close. >> Let's not delay the inevitable, coach. Hit your sand shot. >> Oh my goodness. Come back. >> Shot. >> The golf game's over. I think we can we can see. >> We knew we were going to do this. >> We knew that. We knew that. >> It's time to admit defeat. Move on to game two. Well done. Well done as always. >> Loser picks. >> Game two. I think they're expecting us to go basketball. I think we save that. We keep that in the pocket. I think we hit him with a beach volleyball. We Kobe and Cody. We've done this before. >> It's time for beach volleyball. >> Wow. >> Group up. Figure out the direction you're headed. We'll see you there. >> All right. For volleyball, I'm kind of I'm down to go with experience. >> Real quick, let's go through our experience. I dated a girl. She played volleyball. So, I would practice with her. watched volleyball in the Olympics >> in high school PE. We did have a volleyball circuit and you were good. >> We played on the women's. >> So, we do have to film the rest of the video today. I don't know. >> Okay. Okay. Good. All right. >> Ladies and gentlemen, I'd like to welcome you to the world of a champ. >> Game two. We're in a deficit. Dudes chose sand volleyball. Gentlemen, good luck. >> Good luck, guys. >> Let's do this. >> Best of luck, boys. >> First to 21. Let's go. Get up now. [Music] >> Best of 21. >> Come on, baby. Good serve there. >> Let go. Let go. Let go. [Music] >> Over, Cody. Easy. Over. Got it. This game over. [Music] >> Do we have any like cheers for that? What do they do? Like >> he got a piece of it, but we all [Music] go, baby. >> Good. Good. Ouch. Over. Over. Over. >> Yeah. Let it go. >> Yeah. >> Oh, good. That's all right. Come on. >> So good, dude. >> Come on. >> Over. Over. >> My efforts in the game right here. Got to pump up the engines. If I don't get it, I >> That's all right. Hey, that's all right. We needed that. >> We needed that. >> Do something. >> Great try. >> Oh my god. >> Yeah, baby. [Music] >> Yes. Good calm. We're good. We're good. We're good. Nice shot. [Music] >> Get up there. >> John, come on, man. >> Get in there, >> Sean. [Music] Boy, keep it going. Keep it rolling. Keep it rolling. This is over. This is over quickly. [Music] >> Yeah. Ate him alive. That a boy. Needed it. Needed it. >> Had a boy. >> Yes. Right back in it. Let's go. Let's go. High IQ V ball right there. >> Right back at him. Beat them up. Shortip >> gap closing. Maximum pressure. >> It ain't no change. [Music] >> Hey, we're fine. We're fine. [Music] >> Hey, team. One more. Lock in. Can't stop break. [Music] >> What happened? >> What happened? Dang. >> Heck of a fight. Heck of a fight. Heck of a fight. >> Two and0 for you, huh? >> Darn it. >> Down two 0. >> Have to go to whatever our absolute safest play is. And I'd say that cautiously. >> All right, it's Bball time with a vengeance >> and it's time to make a statement. >> All right, boys. Being down O2, thought we need a little pickme up. Perfect time to announce our new sponsor, Seven Brew Coffee. Got a little station right here for you guys. This is so clutch out here. >> Got some coffee. Got some Fizz energy drinks. [Music] >> Wow, that's actually amazing. What's it going to take for us to get one of these full time? >> I think we can figure something out. >> Yes. Come on now. >> Thank y'all very much. >> Of course, man. Thank you. [Music] >> Game three. Ball. >> We need it. >> Dudes need it in a bad way. Down 02. This is where the tides turn. Remember this moment, boys. How you feeling? >> I feel great. >> You do? >> I love my team. You got a lot of good chemistry. >> Four on four half court. First to 21. Let's party, boys. [Music] >> Man, Sparks, it's good to be back in the booth with you, dude. It's been a while. >> Here we go. >> Here we go. Early and often. Oh, they're ripping out behind the back. >> Cory needs to relish that rebound. >> Good start is what Jones. need screen coming. Nope. There we go. >> Goes under screen. >> Bubby makes him pay. [Music] >> There you go. Come on, Sean. >> Sean with the clutch three. >> That's going to be short. Need this >> jump stop in the lane. Right hand. [Music] I like this. Cody. Cody. >> Oh, he smoked it. There you go. Yeah, that little boy follows his own shot. >> You need a three ball. Got a three ball. Hey, Jonesy, there you go. You made up for those blown layups there. >> How bad Jones was at sand volleyball. He's redeeming himself here on >> this is for the people. >> A little hardwood. That's not in his game. It's not him. >> I don't You know what? For that shot, I hope Good rips off 14 straight and wins it. It's ridiculous shot. >> That is Oh, and speaking of ridiculous shot selection, Sharp climbs. It's the genetics. Why does everything look so uncomfortable for the team in white? >> Okay, >> you're not wrong. >> And look at that pass. Look at that kick >> to the shooter himself. >> No, no, no, no, no, no, no. >> Oh, look at the pass. >> Look at the pass. And a left hand finish by Seb [Music] lefty. >> That's technical left hand. Shoot the ball, coaches. This is your game, Kobe. Take over. >> Take over, Kobe. Take over. >> A right hand, a left hand, a right hand. >> Looks like Good's taking a 20 second timeout. They should make it a fool. But that does give us time uh to give a little shout out. G, >> I think it's time to announce our brand new channel, our very own podcast, Almost Athletes with Dude Perfect. >> Almost. live every Wednesday talking sports, comedy, life, unscripted, just behind the scenes, dude perfect stuff. >> And the best part, everybody from the family can enjoy G. We got big names coming through, celebs, athletes, >> actual athletes that we're going to be interviewing. Episode one live right now. >> Click right here. Check it out. Wherever you listen to podcasts, it will be there. >> Almost athletes, but do perfect. >> And Kobe with the kick out to Cody. >> Kick it out. Jones. Oh, >> Jones is a flamethrower. >> Yeah, >> Cory for >> Cory from long range. You betcha. And he holds up the hand to let you know about it. >> Driving kick. Oh, and Bubby's standing a foot out of bounds. [Music] >> Four court disposition leads to a turnover which leads to a tie. Cody Jones. >> How many points does Cody have? Can we get a point counter? Cute little running right hand. Kobe, if it ain't broke, don't fix it. The ball in the hands of 10 yet again. Yes, >> Kobe baseline. Yeah, let him eat. >> Big lead here. Good needs to catch a heater. >> Oh my. A Brad bomb that almost left the HQ. >> Quick pull by Jones. >> Oh, he's feeling himself. >> Oh my god. >> You know what you would call this game, Sparks? >> What's that? >> Almost athletes. >> Oh yeah. That's why we named our podcast that because we're not quite there, but we are almost there. >> On the precipice. >> Great turn around jumper by Ty. >> Jones wants it. He gets it. Jones using his rear end to create space. Beautiful right hand. >> And I want a three to end this. Come on, Cory. End this right here. >> Cory job. You want to see it? You talked him into that. You talked him into that. >> Hey, I like that. Cory, I need something out of you. Get some confidence up. >> Whoa. Whoa. Whoa. Do you think they come back from >> If they do, consider this series cooked. >> Dude, the pressure's on them. >> Oh my. >> This is the guy you want shooting. This is the guy you want shooting. >> That's why you want shooting. All they need is a one. >> A Jones drive. Spinny. >> Game point for the dudes to get back into this series. They need it badly. >> Dump it inside. Jones. He loves going right there. He'll finish it. That's game >> right is right in this scenario. Dudes 21 to8 over Good. And just like that, the sleeping giant has awoke. Two to1 series. The dudes right back in it. >> Where do you think Good goes next? >> Good fight. Good battle. Terrible. >> But we're still winning. Two to one. And we got to figure out what we're doing next. I think the game plan was PK's, right? >> I will gladly step in. >> Promise he will block every single shot. >> I will try my best. I will try my It's a guessing game. >> One of us has to sit out. We got to figure >> I'm out. All right, Sean's out. All right, that's the decision. >> I need a break. >> Perfect. >> We're gonna go do PK. We'll see you guys there. [Music] >> Good thing we got the Great Wall of China in there. >> He's who we want. That's our best shot of the day. >> Hey, we're leaning on you. >> You're him. >> You're him. >> You're him, Timmy. >> Say one of the five. That's all. >> Trust your instincts. >> All right, here we go. PK shootout. We each get five shots. Whoever scores the most wins. >> Welcome to the chat, Stephen. What is this? Round four and you're finally in it. >> Yeah. This is Stephen and I's first challenge. >> Go. Come on. I told you ain't giving up it. I'm giving up. >> Ah, great try, T. Come on, Jones. Yeah, you, baby. Do what you do, Cody. >> Let's go, Jones. Big kick out of you. Big kick out of you. >> Nasty. >> Come on, Garrett. Let's go, baby. >> Come on, G. That left corner. Dude, those are impossible. [Music] >> Let's go, baby. >> Here we go. Here we go. >> Yeah, I'm told you ain't giving up to it. [Applause] boy. >> Hey, give him time. >> Boy, come on. >> All right, Bobby. Come on. Let's get another one. >> Hey, review. Review. >> I would like a review. That's a rekick. Goalie was off his line. >> Off his line. >> We have Show the video footage. >> Really >> video footage. >> I didn't know there was a rule. >> Hey, do it again. Hey, come on. >> All right. Here we go. Yeah. Come on. What a dog. >> Good luck for you, dude. Good luck. >> He makes this one, then they have to make their last two. >> I got a good >> Wow. >> That was >> Come on, Sharp. >> This is it. If they save it, >> you got this, dog. You got it. Home. We're fine. [Music] It's >> over the day. Come on. >> All right, boys. Let's htal up. >> 31 Herz. >> Is our brand done? >> It's on life support right now. >> We're have to 2016 Cleveland cab this thing. What are we doing? >> I don't know. >> What do we have available to us? Dodgeballing. >> Can we do >> cornhole racing simulator >> though? He just looks like he'd be good at dodgeball. >> Bare knuckle fist fight. I mean, we can get scrappy with it. I'd watch that. >> I feel like Bubby beats us for >> Yeah, he's got some dog in him. >> There's track. There's bowling. >> Oh, they might do bowling. >> Is pickle ball on the list? We have a much better chance of winning that. Pickle ball would be huge. >> What do you think, T? >> It's probably our best bet. >> I agree. >> I think so, too. >> Here's our guys. >> I think me and T. >> I think we need a hustler in there. >> Yeah, I agree. >> All right. Pickle ball. >> Me and Ty. >> All right, boys. Picks in. Pickle ball. Oh, that's that's my sport. That's literally my sport. All right, Shark. I think we'll be just fine. Walk off pickle ball again. Let's do it. All [Music] [Applause] [Music] right. Facing the first ever elimination game. >> Yeah. >> In game five. >> Shark. Steve. >> Yeah. Come on. >> Y'all can make history right now. This is the first ever Dude Perfect Squad games >> and y'all have a chance to clinch this for good. >> On their home ter on their own in their house. Are we washed? Maybe has the tea toss mojo stayed around a little longer than we thought. Maybe you know we win this and we are alive. We're going to put a banner right there. 4-1. It's not even making a thing right now. All right, it's game of runs. Let's go on a run. >> Pickle ball threeame series. Here we go. >> I want to win my business. I'm counting. I'm winning. Ain't no debating. I want it. I'm in it. Run it up. You know the sky is the limit. Made it from nothing but now it's a limit. I give everything. Come on down. Head above water. They hated to drown. Championships. How does it sound? I got no reason to settle. I'll keep working for the metal. Foot on the pedal and chasing it. >> It's not you. >> From nothing, but now it's a living. I give everything now. They made it. So I'mma keep holding it down. Head above water. They hated drown. >> How does it sound? I got no reason to settle. I'll keep working for the medals. Foot on the pedal and chasing it down. [Applause] They hated toion. How does it sound? I got no reason to settle. Yeah. I keep working for the metals. Yeah. Foot on the pedal and chasing it down. Can't tell me there's no one better. Win. Giving my everything every round. Win. The way to defeat is a heavy sound. I want to I want to win win. I want to win. Yeah. I want to win win. >> We're going to put a banner right there. >> For one, it's not even making a thing right now. >> When y'all hit hard at them, they're seem to be making mistakes. >> Yeah. >> So, I'm saying there's no >> You can't be scared to swing at them. It's going to happen. If you miss it, you miss it. Send it. Leave it all out there. >> Let's go back again. Back again. Put the whole team on my back again. If I go >> see them. If you want to be them, you got to beat them. >> Meet the legends in the guide to build a fortune in the end. I got no reason to settle. Yeah, I keep working for the medals. Yeah. Foot on the pedal and chasing it down. Can't tell me there's no one better. [Music] Yeah, go. It >> was good teamwork. Proud of Ty and how we both played. We need to finish this thing off. >> We'll be fine. We'll be fine. We're good. >> We need Steve to get a little bit of hydration in. >> Steve's a finely oiled machine. He's got to get a little electrolytes in them. >> They are tired. >> Yeah, I'll just keep pounding them. >> Yeah, I'll finish it off. >> Here we go. >> Minding my business. I'm counting. I'm winning. Ain't no debating. I want it. I'm in it. Run it up. You know the sky is the limit. Made it from nothing but >> now it's not just a crowd. They made it. So I'mma keep holding it down. Head above water. They hatedion as it >> go. I keep working for the medals. Yeah. Foot on the pedal and chasing it down. Can't tell me there's no one back. >> My everything. >> Here we go, Steve. >> Put a little salt on it, kid. >> Hey, we're good. Let's go pick them, baby. >> Got a boy. Good eye. Good eye. Good eye. Got to be the winner. The legends in the guides. >> Come on, fellas. >> Fortune in the enterprise. The only wisdom is the eyes. >> We're playing too far back. >> No reason to settle. I'll keep working. >> Yes, sir. >> I want to win. >> Let's go to work, boys. Time out. Quick. Time out. >> That's how you fight. Come on. Hey, come on. Come on. [Music] Let's go, boys. [Music] >> Yes. Yes. [Music] Yeah. >> We're good. We're good. Let's go. One more. Pass point. Pass point. You >> stay alive. >> That's it. You step up. Good game. Good stuff. Good job. Good game. Good play. >> We're good. >> Good try. >> We're good. Well played. >> Way to grind. >> All right. So, we're between two sports. It's either bowling or punt, pass kick. What are we thinking of? >> Personally, I think punt pass kick. >> If we want to close it out, punt pass kick. We win. I have a feeling a couple of them have their own bowling balls. >> Pump pass kick is the way to go. >> I like it. >> Okay, game six. >> Wow. Game six if necessary. And it is. >> Get some rest, boys. Let's do it. We'll see you tomorrow. See you in the morning. Good work, gentlemen. >> Welcome to day two. Good has selected the punt, pass kick competition. Four players from each squad will get three attempts to make the lowest time. The first guy will start at the end zone. You will punt it to a person who will then throw it to a person who will then kick it through the uprights. Your time stops when a successful field goal is made. The team with the fastest time wins. Here we go. >> The dude perfect guys are they're duding, man. They're they're all good. They all know what they're doing. So, we get three chances alternate. It's going to be a lot of fun. I'm excited. >> Sharp shaker. Oh. Oh, no. A good recovery on his part. [Music] >> In classic good fashion, an up and down to save par. >> That was good disaster avoidance. That was not our best run. Good kick. Good kick. Good kick. Gosh, I kicked it off the side of my foot right here. Ah. Hey, we're good. We're good. That was your honestly cuz you got the ball on the ground quick. >> Yeah, that was that was great. That was a shout out Bubby there. >> Oh, it's going to be tough to beat. We got to execute perfectly here. >> Here we go, boys. Lock in. Coming to you, Spark. >> That's not what you want. That's actually going to work out well. Nope. Oh, no. Flip. Yeah, we're done. All right. >> Yay. >> I mean, that's that's a warm-up. >> And the do perfect guys. Obviously kind of struggled there. First attempt. That's going to be pretty natural. Couple of nerves trying to hit a decent punt, but I like our chances over the second time. [Music] >> I got no laces. No laces. >> That's awesome. >> Oh, the effort. Oh my god. >> We did it though. Gosh dang it. How did I not catch that? >> Wow. These guys. I cannot believe what I did. >> They're scrambling, >> dude. We're scrambling. >> They are scrambling. >> See that? >> The dot. It It didn't even matter when they mess up. It just >> I didn't think we had a chance. >> I got to catch it. You're good. I didn't I didn't get laces. I turned and just threw. Dude, >> that's okay. Gosh dang it. >> Here we go, boys. Let's get a number on the board. [Music] No, that was it. >> That was >> That was really good. >> That was it. >> We know what we need to do. [Music] >> We miss it. >> Had we made it, that was in the nines. That would have been better than ours. That was scary. >> I just tried to rush the kick too fast. I really want to win it here. That's it. I just want to win this whole series and I feel great to win the uh inaugural squad game. So, let's get the job done. Put up a 93 94 and I feel that should be enough to take home the dub. >> They have a ton of pressure on their last run now, though. So, let's just add a little bit to that, huh? >> That's hanging. That's hanging. >> This is it. This is it. Here we go, Bubby. Oh no. Oh, shiny. Shiny. Sean. Open door. Open door. Open door. Yes. Finally. That's what we needed. That's what we needed. >> Come on. Oh my gosh. Catch a football. >> Hey, 103 is a tough time to beat. We're good. We have a chance to force game seven. Good punt. Good catch by Kobe. Nice little tight spiral to Sparky. A great hold and a kick through the uprights in under 10 seconds. We're moving right along. There's a lot of pressure on Ty cuz they could do everything perfect. If he misses the kick, it's over. >> This is the series. >> That's what it all comes down to. >> Hey, Ty, do you know that if you guys don't beat 103 that it's the it's over. Fully aware. >> Okay. I just wanted I just didn't want you operating under different. >> Yeah. >> Fully confident in you, Jones. Put a good one up there. Enjoy the pressure. Hey, why not us? Why not us? Why not right now? Here we go, baby. Love you, Spark. Coming right at you, bud. Yeah. [Music] >> Yes. Yes. >> Talk to me. Talk to me. >> Perfect. Final time. 9.4. Still alive. Still alive. >> Pressure. >> Pressure is a privilege. Love you, coach. >> The two best words in sports. Game seven. >> We get to choose game seven. I at least like that aspect. >> Yeah. Hey, this is cinema. Let's win in game seven. >> Guys, I think we got a good chance in speed bowling. >> I do, too. I'm I'm a good bowler. You're a good bowler. >> All right, let's just win bowling. >> Yeah, let's win bowling. Come on. All righty, boys. I think we're ready. >> Huge moment. Game seven deemed necessary. >> We are doing a little speed bowling. >> So, I'll meet you at the lane. Let's go, baby. >> Headed to game seven. Don't underestimate the importance of a good pregame outfit. Collared shirt available at goodgoodgolf.com. We look better than these guys. I'll say that. >> I don't think we look too shabby. This is freaking amazing. Home >> cool and collected in a sick t-shirt. >> Come on. Check it out. dude perfect.store. Let's get out. [Music] We are here finishing off game seven of the series with speed bowling. Each squad consists of five players bowling back to back. A player must knock down all 10 pins before their next teammate can bowl. The team that clears all five lanes the fastest is your first ever squad games champ. >> Good luck, fellas. Good luck, boys. >> I never thought bowling would feel this intense, but six other sports are on the line right now. how it all comes down to bowling, >> especially with the hot start that we got off to. To let it slip away now would feel >> we're not going to we're going to show up. We have uh 10 grown men at a bowling alley and arcade >> grown men >> trying to win the prestigious inaugural squad games. >> How are you feeling? >> I'm thinking about one thing and it's good good standing on our pickle ball court talking about where they're going to hang a championship banner >> in our office. >> We're going to put a banner right there. the audacity. >> And I said, \"Remember that moment.\" >> Let's lock it in. Let's get this done. Come on. >> Here we go, boys. For all the glory. 3 2 1 B. All right. All right. We're good. We're good. We're good. We're good. Keep going. Got it. You got it. That's got to be it. Grab a ball. No. Finish it. >> Ah, you got it, baby. Come on. Got it. >> Nice. Go, go, go. >> Let's go [Music] a boy. Good. >> Nope. [Music] >> A boy. Get another one. Get him. Come on, Sharp. Get ready, Cody. Get out your lane. Go, go, go, go. You got time, Cody. You got time. [Music] Get another for the win. [Applause] We did it. We got it. We won. >> Oh man. >> Oh, we won our own video. >> I love this series. >> Oh man, we just >> Well done, boys. That's crazy. >> Good game. >> Yes, sir. >> Good game. Appreciate it. Enjoyed it. >> I appreciate it. I appreciate it. Enjoy it, boys. Great playing. Thanks, bro. Thanks for coming out with you guys. Appreciate you guys. That will do it for the first ever squad games. Come from behind victory. Not how we drew it up, boys. >> No, not ideal. >> Comment below who we should take on next. We'll see you next time. Pound it. See you. [Music] >> Mark your calendars, people. September 26th, our tour is coming to theaters. Get tickets now to have a great night with your family. >> Dude, perfect.",
    "start_time": 0.4,
    "end_time": 2147.68
}