{
    "video_id": "TIPBeJq2CA8",
    "channel_url": "@dudeperfect",
    "transcript": "Garrett and Sparky are about to try and break the record for the fastest time to visit every Disney park. >> While they're doing that, our other employees are competing to try and break records of their own. >> Oh my gosh, that is hot. Focus. We're attempting to break the fastest time to visit all 12 Disney parks. The current record 75 hours 6 minutes. My time starts now. And our journey starts at Disneyland Hong Kong, where they're celebrating their 20th anniversary. So, naturally, we'll be here for about 20 minutes. The rule is we got to ride a ride at all 12 parks. >> All right, we got to go. We got to go. >> Yeah, we do. We're 15 seconds in. All right, the ride we chose, Big Grizzly Mountain Runaway Minecarts. Ride one of 12 starts now. I love this record, man. I can do this all day. Oh, we're going up another hill. Back up Big Grizz Mountain. Is with this tone being set, it's going to be really hard to top Disneyland Hong Kong. We're going to go back to throw it in reverse, Terry. >> I got good news and bad news. Sparks, >> give me the bad news first. We got to go to the airport. Oh, what's the good news? >> We just We got the ride roller coaster, dude. Sick. >> I don't think we're done. >> This is incredible. [Music] >> What's up, guys? I'm Mark and I'm about to get on this plane and attempt to break the world's highest basketball dunk. The record was 13,000 ft. Today we're going to be flying at 14,000 ft. >> Uh, hey Mark, I have you down for the uh sticky notes on face record. I have your sticky notes right here. I think the record is like 60 seconds or something. Ty told me to drive down here. I have literally have no clue what I'm doing. Falling from the sky is nice and safe. Being close to the ground is very dangerous. It's not a stunt for just anybody. Let's go do this. >> Let's do this. >> All right. >> Yeah. I'm extremely nervous for Mark. >> We're packing world record height, baby. It's time to jump. [Music] >> Oh my gosh, that is hot. Let's go make a world record. Let's do this thing. [Music] >> Let's go, Mark. I believe in you. >> Oh no. >> Gosh, man. >> Had to be close. >> I was a little bit far away from the hoop. Yeah. >> Um, I couldn't quite reach it. I'm not a quitter. >> Okay. >> Uh, we're definitely going to go up again. I think the second one's going to be a lot better, though. >> Here we go. You got it. Let's go, baby. >> Round two. [Music] >> Good morning, Ryan. >> Good morning, sir. >> How you feeling? >> I'm feeling good. >> Looks like you'll be attempting the world's longest firing of a modified foam blaster dart. >> Sir, are you aware of who currently has this world record? >> I do. Our friend Mark Robber has a blaster that shot about 45 yards. >> Oh, yes, he did. >> What size head are you? >> I don't know. I worry about your ability to compete with him. All right, >> let's see what you got. >> All right, we're coming for you, Mark. Best of >> luck. >> All right, for context, typical Nerf dart shoots about 70 ft per second. All right, spring loaded. This baby nitrogen loaded. It's going to shoot about 220 ft per second, which means that field goal right there, no problem. >> In three, two, one. Oh my goodness. >> We might have put too much PSI in there. I don't know what happened. You can't compete with a NASA engineer. >> Good news is if you're able to launch another one, I watch it. >> Can you give me 20 minutes? >> I'll give you 20 minutes. All right. Not a second longer. >> Garrett's not the only one trying to break a record on this journey. I'll be traveling completely around the globe in order to have one attempt at one basketball shot. >> This is the furthest distance traveled for a singular basketball shot. [Music] All right, made it to Tokyo. We are at Tokyo Disney Sea. We are officially at 9 hours and 40 minutes. >> We got two rides to ride here cuz there's two parks. Here we go. Come on. Come on. >> Say Mickey Mouse. >> Mickey Mouse. >> Yeah. >> We're here at Rapunzel's Lantern Festival. Only one of these exists. in all the Disney parks. One of one >> and it's right here in town. >> We're about to ride it right here, right now. Get your game face on. Let's rock and roll. >> Oh, look. She's in the window. >> Can you imagine having the problem of too much hair? >> No. >> I was just magical, man. >> Yeah, magical is a good word. >> Romantic's a good word. >> There's still one more park in Tokyo that we have to hit. >> Come on now. >> Good news, bad news. Good news, get to ride another ride. Bad news. We got to hustle. >> Athlete, >> we got to go. >> Wait up. How's the fit? >> I look good, brother. Let's go. We're entering the happy ride with Baymax. Let's do it. >> Go time. >> We're happy. >> Okay. All right. Okay. That's happy, baby. [Applause] Yeah. Say Baymax. Baymax. >> Oh, that's the best pick I've taken yet, brother. >> There's no way the dudes are having as much fun as. >> Can you imagine Kelsey right now? Is Cody's just yelling at her. >> All right, welcome to the track. This is Kelsey. She's attempting the fastest mile while dribbling two basketballs. >> Did you play basketball in middle school, high school? I did not, but my mom always wanted me to. >> That's not going to translate. In three, two, one, hit it. >> Okay, she's off. Look at the pace here, baby. >> This is a new record. Uh, it looks like if she can complete it within 12 minutes, then she is the new world record holder. Must be dribbling basketballs. If she loses the ball, she's got to restart at that point. >> Way to go, Kelsey. >> Split. 224. Three to go. >> I'm doing my thing. >> Here we have intern Jackson and intern Graham. And because they have absolutely nothing better to do, they will be attempting Keepy Upies, aka keeping the balloon in the air, for a whopping 10 hours, 1 minute, and 16 seconds, cuz 15 seconds is the current record. Let's do this in three, two, one. Keep your upies. There it is. The clock has started. Let's see if you guys can pull this off. Good luck, fellas. You got this. Thanks, Cory. >> Shout out to our friends at Body River Sports Drink for keeping us hydrated as we attempt to break these records. Grab yours today at Walmart or a local grocery store near you. >> Real hydration, real ingredients, no artificial flavors, sweeteners, or dots. Body Armor. Choose better. Hey, first ad read. Let's go. [Music] >> Safe travels. >> I think we did it. Did we? Yeah. There's another dog. Ready to fly. >> Score to beat. 45 yds. Let's launch this sucker in three, two, one. See you, Mark. [Music] You obliterated. [Music] Did you see that right the giant sky? That was crazy. It almost went over the fence. 197 yards. Whiteheaded. Your move, Mark. [Music] >> Just got on the plane to Shanghai. We were delayed an hour. We have to make that flight from Shanghai to Paris. If we don't get that, this record's done. So, just got to Disneyland Shanghai. We were supposed to have a couple more hours here, but we got like 15 minutes. We got to go. >> Sense of urgency. Alltime high. Come on, Gary. >> I mean, Garrett's ready to ride. I'll tell you what. He's on a mission, man. >> Brother, we got a flight to catch the bear. >> Yeah, we do. We got to save the Zootopia concert. Uh-oh. We're going dark. What did I just >> I don't know what's happening right now, but I love it. Wow. >> Oh, man. Wow, >> dude. I felt like I was there. Sir, we made it, baby. Just in time. >> Yeah. Woo! Zootopia a success. Ching. Except for >> the castle. We go there now. >> Let's go. Castle. Here we go, Gary. Three, two, one. Say, \"Mickey.\" Mickey. There we go. I actually like this one. Got to go catch a flight to Paris. It's going from Shanghai to Shanghai. We got to go. We got to go. >> I'm just doing my thing. I'm just doing my thing. I'm just doing my thing. Living a dream where I want to be. Come and go get it with me. Doing my thing. I'm doing my thing. >> Oh, we have a dribble fiasco. She's going to have to collect this ball and retrace her steps. Head back. She is not completing two laps yet, folks. She's ready. And she's back at it. 511. Here we go. Come on now. Just past the halfway mark. Feeling good. Here's the problem, though. Me and Grim really have to pee. >> Oh man, you just have to get so incredibly close to that goal, man. It's pretty dangerous. And so we're trying to be as safe as possible. A little defeating. >> Record 60 seconds. So we'll just, you know, go ahead and start. >> Okay. Well, [Music] here we are. We are back at DPHQ with our receptionist Aaron attempting to break the new Do Perfect record for >> the most Post-it notes on my face. >> Wow. In 60 seconds in 5 4 3 2 1 go. >> I'm just [Music] living a dream where I want to be with me. You're at 30 seconds. [Music] >> 7 6 5 4 3 2 1 Time. The sticky notes must hold for 10 seconds. 5 4 3 2 1 You got it, >> dude. Perfect. Congratulations. On the net. >> I'm doing my thing. [Music] 38 hours in to the record. Just landed in Paris. >> Yes, we did. >> Uh we're running on fumes at this point. All right, park number five, Disneyland Paris. >> Oh, no. That is >> quick, quick, quick. We got to go. We got Hey. >> Whoa. >> Wow. >> Look at him. Look at him. Look at him. >> Yeah. >> Best one yet, Gary, by far. >> Man, I got to say, dude, this place is just elegant, unique. Nothing like we've seen so far as far as it comes to Disneyland's. >> No. >> Are we sure we have to leave? Like we can just not break the record. >> You have to break this record. >> Baby, baby. Oh, the unies. They got the undies. >> I don't think I've changed undies all trip. >> I'm also out of undies. >> One ride done hitting the next park. You got about 3 seconds to soak that in. That's all we can do. We got to go. >> I want to soak more. I want to soak more. >> Big smile. 3 2 1. >> Oh, >> there it is. >> Oh, I'm on my game in Paris. I'll tell you what, >> man. I love Paris. Somebody just came up and gave me this Ratatouille rat. >> The headband >> and a hat. >> Ratatouille. I mean, you can't come to Paris without riding some Ratatouille. Come on, enjoy the ride, brother. >> Our time in France. >> This is your ride. This is your ride. >> Oh, that's spinning. That is spinning. >> Yeah. Oh, Garrett, I could stay here for a long, long time, right? >> Paris Disney favorite park, souvenir airport. All right, >> let's ride, baby. >> Let's do it. >> Oh, no. >> Put the knife away. Put the knife away. >> We need to play defense. >> It's getting pretty hard. Uh, mentally, I'm really tired. You know, we got to pull through for the dudes. They're counting on us to get this done. >> Oh my goodness. Get me out of here. >> I'm not going yet, brother. What? I'm going to do the Eiffel Tower, man. I'm a first- time French visitor. >> I'm going to go do it. You want to join? >> No. No. I'll be there. I'm getting home, dude. My family. >> I'll see you at the airport. >> All right. >> God, he's going to miss it. >> Is the body getting tired or the brain? >> The lungs. >> The lungs. Come on. We got one more lap. You're killing it. Lap three is complete. 8:30. One to go. Oh, this is getting nuts. >> Kelsey, you are the queen. You are the best. We can do this together. We're going to be under 12. Come on, sister. Make us proud. This is Kelsey Morris, queen of the DP Palace, and she has now broken a world record. Woo! How do you feel, Kelsey? >> Victorious. >> Are you even tired? >> I'm very tired. >> Well done, sis. Next up, fastest time to pop 100 balloons. Time starts on the first pop. >> Let's see if any employees can beat this. >> Justice Woods. I'm Will Troy. >> I'm Jack. My name's Tyler Rice. I'm Shelby Rampy. >> Trent Johnson. I'mma go fast. Wow. [Music] Heat. [Music] We have 30 minutes before boarding ends. I don't see Sparky. I called him. I text him. He's not answering. >> I heart Paris, baby. Cuz I do. I do. Now it's off to the Eiffel where hopefully we get a pick to send back home to mom. >> Yeah, baby. But I'm not waiting. After a slice of pizza, we're headed to the airport in a hurry. It's a lot of traffic, so wish me luck. >> This is Bon Voyage for Sparky. This was supposed to be a seat. Um, I 1,000% missed the flight. Oh, well. Hey, record goes on, baby. We got to keep going. >> The amount of adrenaline that has been pumping through my body has been a crazy amount. And I'm feeling really nauseous. I don't know if I can continue if I miss this time. [Music] So close. Jackson, you're up. That's not real, right? >> Get the harness on, brother. And while Jackson prepares for his jump, we're headed down to Disney World Orlando to surprise Garrett. Dude, this is sick. Got a windmill. Lazy river. What more could you ask for? I'll tell you what I'm glad that I'm not on is a flight. >> I'm not going to lie, this is relaxing. It was relaxing until you kept talking. >> Sorry. >> How do you think G's doing? >> Uh, got to get to rental. Rental. Rental. Rental's this way. We got to bust it. 20 hours left. It's a minivan. Get it. Mini van. Anyways, we got to go. >> Why are y'all hitting it as hard as you can out the backboard? >> Oh, he's playing the slope. He's playing the slope. Oh, Jonesy. Wow. >> I'm getting another ice cream. >> All right, just entered Disney World Resort. Got four parks to check off. Going to Animal Kingdom first. Got to get a picture in front of the landmark. Oh, what's up? I didn't know y'all were coming. >> You might need a little encouragement to be here. >> Where's Sparky? Sparky had to see the Eiffel Tower and miss his flight. So, I'm going to need you to take a photo of me in front of >> I do this. This is like my thing. Three, two, one. >> Dude, last time I checked, we're like middle breaking a record. So, >> yeah, we got to go. >> Let's go. All right, Avatar, this way. >> We're We're breaking a record, dude. Thanks for picking the slowest ride here. >> This I didn't pick this. >> Go, boys. Go. >> Guys, we're trying to hustle. >> All right, we've arrived at my favorite ride, Slinky Dog. >> This is a good one. You pick good. Oh, it already feels great. This thing cooks, baby. Slinky time. >> This thing cooks. >> Yeah. >> As far as rides go, number one. That takes the cake. Let's grab the pit, coach. >> Oh, this is so good. Golden hour. Dude, that's got to be the best photo of the trip. >> Easy choice. Guardians of the Galaxy. >> All right. I love that. Cody's never done this before. I know he's going to love it. It ain't no Slinky Dog. I'll tell you that. >> Oh, wait. Well, smash Slinky Dog. Jumping back. Yeah, baby. Hey, baby. Hey, baby. Oh, yes. That was absolutely delightful. >> Final part. Tron and fireworks. Those are the two priorities. >> Then we got plane to catch. Gonna be tough to top the last one, but if any ride can do it, this is it. >> Full exposure. >> You know what I will say, Ty? That probably takes the cake. >> Thank you. >> Run it back. Run it back. >> I got to go, dude. >> Who cares about the record? We're at Disney, dude. I'm toast, dude. >> Garrett thinks we came here for moral support. I was here for one reason and one reason only, and it was that. Sorry. >> Yeah. >> Oh, it was that. >> I thought I was like, \"Wow, you're you're here for me, >> boy.\" >> Hey, better late than never. >> I'm glad you made it, man. We got a flight to catch in 30 minutes. You ready? >> No. >> I feel bad. I felt bad. I pulled some strings. >> I booked you the most exclusive room you can get. Cinderella's Castle. That castle. >> Don't play with me, G. >> For real? Yeah. >> No way. No way. >> You Yeah. >> All right. Yeah. After party at my place in the castle. >> All right. You ready for this? >> I can't wait. >> Probably the most exclusive hotel on the planet. >> Come on. >> Welcome to Cinderella's Castle. >> And for the viewers at home, boy, do I got something for you. When you donate $10 or more to support Make a Wish, you're entered in for a chance to win a vacation to Walt Disney World and to stay in this room, Cinderella's Castle, for one night, you and your family. Sparks, I got to hit a world record. Have fun. I'll see you back at the office. I'm on the LA. >> Feeling good. I'm so ready to be done. So ready to get food. Ready to use the restroom. My mind is blank. All I can think about is just hitting this red ball. >> I'm just doing my thing. I'm just doing my thing. I'm just doing my thing. [Music] >> I can see the light at the end of the tunnel. [Music] I'm doing my thing. >> 4 3 2 1. You done it. >> You Thank you. gentlemen are officially two perfect record holders. Not so fast. Not so fast. >> It has come to my attention >> that we may need to go to a booth for review. >> What did he say? >> I'm going to need you all to go stand in that corner. >> Okay, hold on. When did this happen? >> Um, at the 9 hour just past the 9h hour mark. They're feeling They're feeling funny. Oh, we're dancing. We're doing Jenzish. >> Give me Give me Give me the booth. >> Wait, did he touch the chair? >> Let's go to slow-mo. Let's go to the slow-mo angle. >> This is not real. After further review, it has come to my attention, our attention as the adjudicators here at DPR that this record has now been deemed >> unsuccessful, >> nullified, >> trash, void, >> garbage, >> gone. a lack of concentration and a downright embarrassment to the company as seen depicted by this face made on this adolescent irresponsible child. He thought, \"Oh, I'm going to get fun and do some gritties.\" And guess what happens when you play games? This This is what happens. What's the rules? It can't touch anything. >> Slow-mo. No, >> that slowmo is valid. That's >> Thank you. >> Planes dehydrates you. Walking 85 miles in Disneylands dehydrates you. But you know what hydrates you? Body armor. Flash IV. The best. We got to go. We got to go. [Music] This is what I was worried about. I mean, look at this. We are in stand still. >> There it is. Landmark. I'm going to need you to take a photo cuz Sparky bailed. >> 3 2 1 Great. Got it. >> All right, we're hitting cars. We got to go to cars. We got to go to cars. >> Oh, no. 80 minutes. Yeah, it's over. We're not going to make it. Just kidding. We got the lightning lane pass you silly. >> This is the speed I need to break the record. Let's go. [Applause] Finish the race. All right. Fun ride. One left for the record. Disneyland. The OG. I got a good ride for us. Come on. >> I'm actually really glad that Jackson decided to do this. I think he's going to be really happy he did. >> This is so dope. Why did I do this? >> 10 seconds out from the drop zone. You >> got this, kid. Make us proud. >> The world's tire. Come on, J. >> We're going through a cloud right now. Come on, Jackson. [Music] I'm doing my thing. Bang, baby. That's how you do it. >> Yes. Yes. We did it. World's highest. >> All right. Made it to Disneyland, the original Disney park, celebrating 70 years of being open. All the other Disney parks get their inspiration from here. Only fitting they try to break the world record in this park. It's going to be close. Let's go ride the ride. Three, two, one. >> There she is, Chad. The last ride, the record breaker. And you're going to get wet >> for the record. It's going to be tight. Oh, what have we done? >> No, it's fine, Phil. That's Oh, I'm so bro. I'm soaking wet. Oh. Oh, no. No. No. No. No. No. No. No. No. No. Oh my gosh. Oh wa. Oh no. Thanks for coming along to ride with us. It's been a journey. We're sleepdeprived. There it is. 74 hours 14 minutes. New world record holder. I'm going to go sleep for 74 hours now. [Music] Dude, perfect. Oh no. I hope the guys don't see",
    "start_time": 0.24,
    "end_time": 1662.24
}