{
    "video_id": "gTgrHPax0hk",
    "channel_url": "@dream",
    "transcript": "Dream: This video, me and two of my friends each have a unique task in Minecraft that we need to complete before the others. Dream: But the catch is that we're all the same player. Dream: Every minute we switch who is controlling the player and we don't know each other's tasks. Dream: There's lots of trickery and strategy as we try and complete our tasks without the other players stopping us... Dream: Or figuring out what our tasks are. Dream: The first to complete their task wins. Dream: Who is the Minecraft Taskmaster? Dream: Also, only a small percentage of people watching my videos are actually subscribed, so if you end up liking this video, consider subscribing. Dream: It's free, and you can always change your mind. Dream: Enjoy the video. Dream: Okay, so... Dream: I have to kill one of every colored sheep with an iron shovel. Dream: Um... Dream: I do not know how I'm gonna do that. Dream: Every color? Dream: That seems like a lot. Dream: I guess their tasks are probably equally hard. Dream: I need to, like, open a Wiki. Dream: Alright, I guess I'll just- I'll review this dye while I have the two- the two minutes. Sapnap: Okay. Sapnap: It's my turn. Sapnap: I mean, I guess I could help. Sapnap: I guess I could help these guys out and get them some stone tools. Sapnap: Seeing as it does benefit my agenda of killing an iron golem in the Nether with a bed. Sapnap: It's kind of a ridiculous task or whatever. Sapnap: I'm just gonna mine some stone. Sapnap: Whatever. Sapnap: I got them some wood and some stone. Sapnap: I've done my job. George: I'm in. George: Okay, so what do I need to do? George: I need to fall from the surface to bedrock and die of full damage on the bedrock block. George: Okay, so I have an idea of what I want to do. George: I want to just basically... George: Get out of here... George: And I want to... George: Go to water... George: Like this. George: Oh wait, this is kind of annoying. George: [laughs] George: Uh... George: I guess this plan isn't... George: That good... George: Oh... George: Yeah, I don't know what I'm doing, actually. George: Oh, there's 10 seconds left. George: Okay, I don't want them to know my coords, though. George: So let me see the coords. George: It's minus 140. George: I'm just going to run over here so they don't see it. Dream: Okay... Dream: Uh... Dream: Interesting... Dream: I feel like we need to go in a cave. Dream: So we need to get... Dream: Iron... Dream: We also do need... Dream: Good amount of... Dream: Dye... Dream: But I don't want them to like, figure out what I'm doing, so I can't- that's the interesting thing... Dream: I'm gonna get us- I'll get- I'll get us some coal. Dream: Progress our... Dream: Progress our - Plans Sapnap: What the heck? Sapnap: Where the heck am I? Sapnap: I'm going to go ahead and put these idiots near a cave so they can start mining iron for me. Sapnap: Ooh, if I could find a pumpkin, that would be fire. Sapnap: I need to find a pumpkin. Sapnap: It's all contingent on me finding a pumpkin and them not throwing it out. Sapnap: I need a pumpkin! George: [laughs] George: Oh no. George: Oh my God, they ran so far away! George: This is not... George: Going how I expected it to go! George: You know what? George: I'm just gonna throw everything out. George: I'm gonna slow everyone down. George: You don't get any stuff. George: Because I don't have time to think, so then you don't have time to think. George: [laughs] George: [laughs] x2 Dream: Oh. Dream: What? Dream: What? x2 Dream: I'm really confused. Dream: What? Dream: Where are we? Dream: I don't understand. Sapnap: Bro, who died? Sapnap: Bro, who died? - Nah Sapnap: Oh, pumpkin! Sapnap: Oh, no, I can't let them know. Sapnap: Alright, I need to remember these coords. Sapnap: I need to remember these coords. Sapnap: 6- uh, 65 negative 278. Sapnap: 65 negative 278. Sapnap: There's pumpkins there. George: [laughs] x3 George: [laughs] George: Um... George: But I know where all the stuff is. George: It's right here. George: I'll just go grab it. George: Ah, how am I gonna get... George: And also, in this version, bedrock is just so far down. George: Like, it's... George: Minus 64 is where bedrock is. George: How? George: Here's my strategy. George: What if I just dig straight down every time it's my turn? George: I don't know. George: Maybe my plan will... George: [laughs] Dream: Okay... Dream: Interesting... Dream: Interesting - Okay Dream: So we need- Dream: I need... Dream: Stuff... Sapnap: Why am I in a hole? Sapnap: I wanna go get my pumpkin. Sapnap: I'm gonna go get my pumpkin. Sapnap: I feel like I don't wanna go by this lava pit, though. Sapnap: I'm gonna face the other way. Sapnap: Away from the lava. Sapnap: Away from the lava. x2 Sapnap: Away from the lava. x3 George: [sighs] George: They just keep getting me out of the hole! George: Oh my God, okay, we're just going straight down again, let's see what happens. George: I don't even know like, how I could possibly get them to stay in the- George: Oh my God. George: Wait a second. George: This is good! George: How do I get down there? George: No! George: No! George: No! George: No! - [gasps] George: No! George: [gasps] Dream: Oh? Dream: Oh? - I'm back Dream: Okay. Dream: Okay, so we're dead. Dream: I don't like this. Dream: I feel like... Dream: George's task is related to dying. Dream: Let's just go far. Dream: Let's just get away from spawn. Dream: Alright, well, if I'm going to keep dying, then I can't really do anything. Sapnap: Bro, what? Sapnap: I mean, if George is just killing himself, I mean, I just don't know how I'm ever going to win. Sapnap: I don't have a pumpkin anymore. Sapnap: Like, I feel like I just need to wait. Sapnap: I just need to wait. Sapnap: I feel like my game is just to wait for the opportune time. Sapnap: Because there's no way that's going to let me stack 36 iron in my inventory. Sapnap: I can't get 36 iron in a minute. Sapnap: Hopefully George can be baited by the treasure map. Sapnap: I mean, I don't know. George: Alright, well... George: I guess he wants this shipwreck. George: I honestly don't know like... George: What I can even do right now. George: Another treasure map. George: [laughs] George: I think I might just try to kill myself again just so they think my task is to try to kill myself. George: You know, I'm going to put us on like one heart though. George: Just for the \"lols\". George: Just to confuse them. George: I say confuse them. George: That's- that's what I've got to do. Dream: Okay. Dream: What I need to do is make a chest.... Dream: And keep this stuff. Dream: I'm going to make a sign and tell Sapnap to do it. Sapnap: Store stuff... Sapnap: [chuckles] Sapnap: Under this tree... George: Oh. George: Playing with some signs, are we? George: Wait, how do we have nothing? George: Wait, how do we have nothing? - Wait George: I think Sapnap... George: Or Dream- no, Dream must have killed us. George: Or Sapnap killed us. George: Wait, I have an idea. George: What if I can manipulate them into doing what I want? George: Let's... George: Work... George: As a team to get diamonds. Sapnap: All right, Dream. Sapnap: I mean, I hid the stuff. Dream: Okay, where'd you hide it? Dream: Where'd you hide it? Sapnap: [scoffs] Sapnap: Wouldn't you like to know, Dream? Sapnap: Wouldn't you like to know, Dream?\nDream: Well, no, no, no. Dream: That's the whole point. Dream: That's the whole point. x2 Dream: Look, we can- we can keep- we can- we can- we can communicate during this time.\nSapnap: [laughs] Dream: Look, we can- we can keep- we can- we can- we can communicate during this time. Dream: It's a good strategy. Dream: It's a good strategy.\nSapnap: Alright, go to- go to- Sapnap: Alright, go to- go to- Sapnap: All right, Dream, let's just say it's at 585, 45 under a tree. George: Okay. George: So now I'm like, tricking them into thinking... George: Hmm, I don't know what they're going to think. George: I'm basically going to try and manipulate them... George: Into going down all the way to get diamonds... George: But maybe not. I, you know, honestly, I was never good at Among Us. George: I don't know how this is going to turn out. George: I don't know how this is going to turn out - Let's see Dream: Let's work as a team to get diamonds. Dream: Interesting... Dream: Okay, well, Sapnap said it's... Dream: Five something under a tree. Dream: Crap, I didn't hear his... Dream: I'm not going to look for it the entire time. Dream: We need- we need to go underground because I- I need like, materials. Dream: Oh, I don't know. Dream: Oh, I don't know. x2 Sapnap: I'm in my mind. Sapnap: I'm thinking I want to bide my time and wait. Sapnap: Like if George is trolling, I feel like I can't bide my time and that I need to work with Dream. Sapnap: But like, I don't trust Dream at the same time. George: Um... George: [chuickles] George: We have nothing. George: I'm just going to make a nice little staircase. George: And we continue to make this staircase until we're at bedrock. Dream: Okay, we're making progress. Dream: Got some iron. Dream: Uh... Dream: That's enough for a pickaxe, which I think is... Dream: Good... Sapnap: Where was that- Sapnap: I just don't see a world where I'm going to be able to get 36 iron extra. Sapnap: My only time I'm going to have any chance is like, whilst they're making their armor. Sapnap: I need to like go into the Nether basically. George: Okay... George: We're still in the hole. George: I'm just going to keep bringing us down further and further into the mines. George: Dream is going to be oh so suspicious though when he spawns in and sees us so low down. George: I do not know how he's going to react to that. Dream: Okay. Dream: Why'd he ignore this? Dream: He didn't get the furnaces either. Dream: And he ignored this iron. Dream: Interesting... Dream: Let's just- Dream: I don't want them to know what my task is. Dream: Let's just get iron. Sapnap: 10 iron is pretty good. Sapnap: 10 iron is pretty good - [scoffs] Sapnap: I need to find a pumpkin. Sapnap: If I don't find a pumpkin, I only got one chance, pretty much. Sapnap: I need a pumpkin. Sapnap: If I don't get a pumpkin, it's all pointless. George: What- George: We left the hole. George: I'm going back. George: I'm just putting us back in there. George: Where's the hole entrance? George: Wait, what? George: They went so far. George: I just spent my entire time coming back here. George: Where's the hole? George: [gasps] George: There it is. George: Oh my god, I just spent my entire time coming back to this hole. George: I'm not even going to make it down to the bottom. Dream: Okay. Dream: Um... Dream: I don't know. Dream: I'm confused because George is before me and George mined past the iron to go down. Sapnap: Ah, I'm just screwed, like I'm- Sapnap: I'm just so contingent on a pumpkin. Sapnap: I was going to keep bringing him to the top. Sapnap: I don't know what else to do. Sapnap: I'm just going to go up here. George: Oh, no. George: Oh, no! George: Okay, there's the hole. George: Let's go. George: Come on, let's get as far down in this hole as possible. George: Come on, let's get as far down in this hole as possible - You know what? George: I'm just going for this. George: Let's just do this. George: Oh. George: The Minecraft Gods reward me for my... George: For my courage! George: Yes! George: Yes! x2 George: Down more! Dream: Okay, we're in a cave. Dream: Oh, I'm so tempted to make a shovel, but I won't. Dream: Oh, there's diamonds. Dream: Let me mine them just in case his is like, mine diamonds. Dream: It could be something to do with diamonds. Dream: I guess we could learn a lot. Dream: That could be helping him, but we also could just learn a lot. Dream: All right, Sapnap, good luck. Sapnap: Oh my God. Sapnap: Okay, now I'm worried. Sapnap: I'm gonna throw away the diamond. Sapnap: I'm gonna throw away the diamond - [gasps] Sapnap: I'm gonna throw away the diamond. Sapnap: There's no way that's George's task. Sapnap: It's even more likely his task is... Sapnap: [incoherent laughs] Sapnap: Throw them away. Sapnap: Oh my God. George: We need to go deeper, guys. George: [gasps] George: Oh my God, we're at minus 44. George: The problem is, they're just not going to let me... George: Stay by the bedrock. George: Like, they- they have no incentive to stay by the bedrock. George: This is just so difficult. Dream: Oh, there's more diamonds. Dream: I'll get these. Dream: I want a diamond pick. Dream: I want us to mine quickly. Dream: Alright. Dream: Um, I don't know what their task could be... Dream: But I want to be in control of what we... Dream: Get... Dream: So I'm just going to craft both of these. Sapnap: Oh my God, there's so many diamonds. Sapnap: Okay, whatever. Sapnap: I don't even care anymore. Sapnap: I'm cooked. Sapnap: Like, I don't... I don't... We have 1 iron. George: We are still here. George: At minus 54, we're so close. George: Diamond pickaxe, yes! George: That's actually really good. George: That's going to help me get down to bedrock and out even quicker. George: There's bedrock! George: What if I just make them think I'm trying to kill them? George: When in reality, that's not the situation. George: Like, they're not actually going to think I'm trying to kill them. George: Hang on. Dream: Okay. Dream: Um... Dream: That is... Dream: Interesting... Dream: Um... Dream: Oh, what? Dream: I kind of want this chicken jockey. Dream: I want to make someone think this is my task. Sapnap: What? Sapnap: This is weird. Sapnap: I'm killing it. Sapnap: I'm killing it. x2 Sapnap: I don't care if I'm getting baited. Sapnap: I'm just going to confuse George. Sapnap: I'm just going to mine him randomly in here. George: Wait, where are we? George: Oh, they're just towering straight up. George: Oh, they're just towering straight up - No George: Okay... George: We have to tower up like this. George: If I can tower up like this... George: With a hole next to us the whole time... George: It's going to be incredible. George: But I can't let them know I'm doing it. George: That's the problem. George: I need to dig up like this. George: Okay, look, I'm going to cover this. Dream: Huh... Dream: Okay, I guess we need food. Sapnap: [gasps] Sapnap: Oh my God, we're gonna die. Sapnap: Yeah, we died. Sapnap: Well, I think that benefits me in the long run, to be honest. George: No. George: [gasps] George: What? George: They are so dumb. George: Whoever just did that is very, very, very stupid! George: I think I actually could have done it and Sapnap killed us. George: I don't even know what to do. George: I don't even know what to do - [laughs] George: I don't know what to do now. George: Oh, Sapnap! Dream: How do we die? Dream: How do we die? x2 Dream: Okay... Dream: So we're tryna... Dream: Find our stuff, I guess. Dream: I guess we died. Dream: I wonder if I can... Dream: Do something quickly... Dream: Is there any mobs around? Dream: Because I can kill... I can- Dream: I can do it really quickly. Sapnap: Oh my God, it's night time. Sapnap: This is bad. Sapnap: I'm gonna try and, like, convince them that we need a bed to sleep tonight. Sapnap: What- Sapnap: Oh my God. Sapnap: Oh my God - [sighs] Sapnap: [sighs] x2 Sapnap: Jesus Christ. George: We died. George: Oh, my God! George: These guys are so stupid. George: They're so stupid. George: They're so stupid! George: Ugh. George: Guys, guys, guys! George: Stop dying, please. George: Look at all this leaf litter. George: I'm going to leave a trail of leaf litter as I go. George: Here, take that, skeleton. George: Here, take that, skeleton - Ooh George: Ooh, parkour. George: Look at me. George: Ooh! George: Call me the parkour God. George: Lurver. Dream: Why do we keep dying? Dream: Okay, so now... Dream: We don't have anything that I need. Dream: Ugh, I'm going to have to kill these guys even though I'm not going to get anything for it yet. Dream: Oh, God... Sapnap: What? Sapnap: Yes, yes a bed, yes! My plan is working, my plan is working! Sapnap: Oh my God, and pumpkins! Sapnap: Oh my God. Sapnap: Oh my God! Sapnap: Oh my God, oh my God, yes! Sapnap: [inhales] Sapnap: Yes! Sapnap: This is good, we got a bed. Sapnap: We need the pumpkins, then all we need is iron! George: Bro. George: Why am I on two hearts on a tree? George: I don't even know. George: They've definitely despawned now, surely. Dream: Oh my God. Dream: What is happening? Dream: Well, we ate the raw food. Dream: Who keeps eating the raw food? Dream: Um, I kind of want us to stay right around here. Sapnap: We need to go back, we need to keep us... Sapnap: Nice and close. Sapnap: These pumpkins! Sapnap: It's all coming according to plan! George: Hmm. George: It appears we're digging. George: Okay, you know what? George: I can get on board with this. Sapnap: Look, I don't know what George- I think George was diabolically close to completing his tasks one time when he swapped in here he was like, talking about coords. Dream: Coords... He has to go somewhere specific. George: You know what? Let's just do it and see what happens. George: If I just dig down a 2x2 hole... George: Maybe they'll copy me... George: And they'll just give me a free victory. George: Maybe, just maybe. Dream: Um, he dug us all the way to bedrock... Dream: One of the times. George: I am kind of interested to see how they'll react to this, like what they'll say. Dream: Okay. Dream: Um... Dream: I'm going to the surface. Dream: I want to hide this hole. Dream: Do we have any iron? Dream: Surely there's at least one iron here in this cave. Sapnap: Okay... Sapnap: Let's make this... Sapnap: And literally, let's just gather some more stuff, and then maybe we'll grab the pumpkin and just slide it in our inventory over here, you know, in the back... Sapnap: Where they don't notice it. Sapnap: Yeah, I'm just collecting more food. Sapnap: Uh, 0, 0 negative 200. Sapnap: That's where the pumpkin is. Sapnap: Roughly 0 negative 200. George: And we're out of the hole. George: All my digging was for nothing. George: Oh, well, I fell in the water. George: Okay, let's make the most of it. Dream: George, uh... Dream: Dug us down again. Dream: I don't know, like he needs to do something underground, for sure. Dream: For certain, he needs to do something underground. George: Alright, we're digging down again. George: This- this- this plan is just not going to work. Sapnap: Yeah, but I mean, I think we should get like iron armor and stuff, no? Dream: Well I agree, we need- but- but- I feel like we can find a way to do that through like... Dream: Well I agree, we need- but- but- I feel like we can find a way to do that through like...\nSapnap: [laughs] Dream: Well I agree, we need- but- but- I feel like we can find a way to do that through like... Dream: Just maybe me and you can try and keep us up like, do iron like- get iron from surface caves and stuff. George: It is not gonna work. George: I need a different idea. George: I don't know how to do it, though, and all I can do is just dig down in the meantime. Dream: Come on. Dream: Come on. x2 Dream: Come on. x3 Dream: Come on. x4 Dream: All right, one down. Sapnap: Yes, Dream. Sapnap: Get me iron. Sapnap: I like that. Sapnap: Let's uh, let's grab a singular pumpkin. Sapnap: Let's grab a bunch of leaves and this stuff and seeds and dirt. Sapnap: Let's just sneak a pumpkin in there and see what happens. Sapnap: Maybe they won't notice. Sapnap: All we need is iron. Sapnap: All we need is iron! Sapnap: [inhales] Sapnap: [yells] Sapnap: I mean, literally, I think we just do nothing. Sapnap: We have everything we need. Sapnap: We just let them get the iron for us. Sapnap: That's a Nether portal right there. Sapnap: Bing, boop, bop. George: Okay, I'm just going to use this time to think out loud. George: How can I get myself... George: Down to bedrock... George: Without... George: Them... George: Stopping me. George: It's just so far down. George: I need to dig like 100 blocks from now. Dream: George tried digging us down again. Sapnap: He's obsessed with digging us down. Sapnap: He's obsessed with digging us down.\nDream: Yeah. Dream: He wants to dig us down. Dream: I just wanted, I was just like, again, all he did, he just literally by the second it started, started digging down. George: But I can't dig a hole... George: Because I start digging... George: And... George: By the time I get anywhere, it's my time to swap. George: And then they just... George: They just tower back out of the hole. George: So my, my- my digging was for nothing. Dream: Yes! Dream: Okay. Sapnap: Pumpkin's still here, okay... Sapnap: Pumpkin's still suspiciously in the inventory. George: Hmm, wait, what if I make a bed... George: And make it so that we respawn near a hole that I know about? George: Okay, look at this. George: I'm gonna put the bed down here... George: Respawn point... George: Respawn point - And George: I can... George: Start digging a hole... George: Right here... George: And then look, 10 seconds... George: I just go up... George: And I hide the hole. George: Okay. George: I'm gonna keep doing this every time. Dream: Okay, cool. Dream: We slept the night away. Dream: We can get some... Dream: Iron. Sapnap: Why are we not going into this cave? Sapnap: What is this? George: Okay. George: It's time to get to work. George: What? George: He exposed my hole! George: [laughs] George: Okay, I'm starting a new hole. Sapnap: Alright, somebody's doing some weird stuff, bro. Sapnap: Somebody's doing something suspicious. Dream: I feel like everyone's being suspicious now. George: Okay, I'm going to start towering up. George: Come on. George: Come on. x2 George: Yes, 10 seconds. George: I think I have enough time. George: Okay. George: I'm just going to look like I'm getting the food. Dream: Okay. Dream: There's nothing it's barren, I need... Dream: More... Dream: But also, I cannot give away... Dream: What I'm doing. Sapnap: So if, those were our pumpkin. Sapnap: We're- we're crudded. Sapnap: We're back to like square one. Sapnap: Oh, this is perfect. Sapnap: Oh my God, this is perfect. Sapnap: This is literally perfect. Sapnap: We need the lava. Sapnap: We need all the iron here. George: Oh. George: Well, this is quite interesting to say the least. George: Wait. George: Does this go down? George: All the way down? George: Ooh, it does! George: I just can't resist coming down here. George: Diamonds! George: Okay, let's get a diamond pickaxe. George: Surely that's the move. Dream: How are we here? Dream: Oh, no, no, no, no, no. Dream: I don't like this. Dream: I wanna mine these... Dream: Because I don't want George to mine them, or... Dream: I don't want him to decide what we get. Dream: I don't want him to decide what we get - Perfect Sapnap: I'm locking in. Sapnap: I'm locking in, guys. Sapnap: I'm locking in. Sapnap: We need iron. Sapnap: We need 39 iron. Sapnap: We need to not die. Sapnap: If you ever bet on us, we have the pumpkin. Sapnap: We literally just need enough iron. Sapnap: And George is clearly just prioritizing diamonds. Sapnap: So, I mean, I don't know. Sapnap: This is it. Sapnap: We're in the endgame. Sapnap: It- someone's going to win here. George: What- George: Where did the diamonds go? George: Is Sapnap actually burning the diamonds? George: He's burning the diamonds still, but he didn't burn these ones. George: [chuckles] George: Oh, Sapnap... George: Why do you think I need diamonds? George: I actually think I might need a diamond pickaxe because that could be the... George: Time-saving thing that I need. Dream: Okay. Dream: Okay - Iron Dream: Let's get some iron. Dream: I do not want... Dream: To stay down. Dream: Somebody needs to- why is there so much iron? Dream: Go up. Dream: I got iron. Dream: Yeah, we need to not go down because somebody really needs to be down... Dream: Because they keep going- digging us down, I think it's George right before me. Sapnap: Oh my God, oh my God, my heart's beating. Sapnap: We can do this, we can actually win. Sapnap: Oh my God, we almost have enough iron. Sapnap: We just need Dream to not craft anything though. Sapnap: The problem is if he crafts, we need excess. Sapnap: Because if he crafts more, if he crafts our stuff, honestly maybe the thing is to keep him down here. George: Okay, you know what? George: I'm just going for it. George: What we need to do is we need to find bedrock, expose it to where it's not so obvious that that's what I'm doing, and then just tower up... George: All the way. George: How about right underneath this water? George: Only a few more blocks. George: Okay, there's bedrock. George: 62, 278. Dream: Okay. Dream: I just want to get up as far as I can. Dream: We can cook our iron above. Dream: Perfect. Dream: Let's stai in this biome as well. Dream: Let's stai in this biome as well - Perfect Sapnap: Oh my God, we have enough iron. Sapnap: Oh my God, we still have the pumpkin. Sapnap: We have the bed. Sapnap: Oh my God, we're by the lava pit. Sapnap: Oh my God, oh my God, oh my God, oh my God. Sapnap: We have to be quick. Sapnap: We have to build the portal so quick, dude. George: What- George: Minus 60. George: Minus 60 - Wait George: Minus 62. George: Oh my God. George: Oh my God - This could be it George: Minus 62. George: Bedrock should be right underneath this block. George: 278. George: 278 - Here Sapnap: He's probably just gonna go down. Sapnap: He's probably literally just gonna go down. Sapnap: We just need to keep going up. Dream: I'll go up- I'll go up- I'll go up if he does. George: You know what? George: I don't even want to risk it. George: I'm going to go up now. George: Okay. George: Okay, I'm going to put them back over here. George: And I'm going to continue that next time I get in here. Dream: Okay. Dream: Sweet. Dream: Cooking the iron. Dream: We have our bed here. Dream: Oh, I need like... Dream: Dyes... Dream: Let's see if there's any... Dream: Sheep around here- what's in our inventory? Dream: We have... Dream: A pumpkin... Dream: And snow... Dream: You know what? Sapnap: Oh my God, we need to hide. Sapnap: Oh my God, 20 iron. Sapnap: Oh my God. Sapnap: [keyboard spamming] Sapnap: Oh my God. Sapnap: Oh my God, oh my God, oh my God, oh my God, oh my God, oh my God, oh my God, oh my God. Sapnap: Oh my God, we have enough iron. Sapnap: Oh my God, oh my God, the next time we can do it. Sapnap: Oh my God, the next time we can do it. Sapnap: Oh my God, the next time we can do it! Sapnap: Oh my God, the next time we can do it! - We're quick George: Run. George: Okay, I need to continue my hole. George: I need to find out a way to get down this hole. George: I need like a bucket of water or something. George: That's what I need. George: We have no iron. George: No! Dream: Hmm. Dream: Hmm - Okay Dream: Where's our iron? Dream: Did he throw our iron out? Dream: Um, okay... Dream: He threw our iron out. Sapnap: Wait, we need to make uh- we need to make a bucket. George: I just had a new idea. George: What if I make ladders? George: What if I make ladders and I use them so I don't have to keep towering up and wasting time going back up? George: We're going to go down the hole... George: Make ladders... George: Okay, this is the hole. Sapnap: Wait, what happened? Dream: What do you mean? Sapnap: We're so far away from everything and I ran back and our iron's not there. Dream: No, iron's gone. Dream: I don't know. Dream: I guess George must have thrown in the lava or something. Dream: I feel stupid that he was letting us mine it. Dream: That doesn't make any sense. George: Eight seconds. Dream: Okay. Dream: Why is there... Dream: Ladders? Dream: I really need mobs to... Dream: Respawn. Dream: I'm just going to leave this area. Dream: Maybe, maybe we, maybe we, maybe someone's doing something over there. Dream: I don't need that area. Dream: I don't need that area - So Sapnap: Bro, what? Sapnap: Where are we? Sapnap: Oh my God, we keep getting so far away. Dream: I don't know- who- did you destroy our iron? George: No. Dream: You didn't? Dream: Sapnap... Dream: Said you did it, and I assumed you did it. George: He's lying, Dream. Dream: Oh God.\nGeorge: I'm telling you, he's lying. George: Work it out. George: Work out what he's doing. George: I'm telling you, it's something with Sapnap. Dream: Iron? But he doesn't want us to craft because if he took the iron he doesn't want us to craft with it. George: Okay, I gotta go, go, go. George: Come on, come on, come on. Dream: Wait, Sapnap... Dream: Wait, Sapnap...\nSapnap: What? Dream: You're a little sneaky devil. Sapnap: How am I a sneaky devil? Dream: Oh, George said that he didn't- that he- that why- \"why don't we have any iron\" he asked me Sapnap: He's playing you. Dream: I just want to get as far as I can away from this area because we keep going back to this area... Dream: And we lost our iron. Dream: My guess is that someone took the iron and like needs it and it's in that area... Dream: Hidden somewhere, and we have a bucket. Dream: Why do we have a bucket? Dream: There's a village. Dream: I'll put us in here. Sapnap: Bro, where are we? Sapnap: Oh no, they're sabotaging me now. Sapnap: Bro, where are we? Sapnap: Yeah, I don't know where we're at. George: What? George: How are we so far away? George: Oh my God, I'm never getting back there. George: I thought I was actually going to be able to do this. George: I thought I was actually going to be able to do this - [sighs] George: I just need to dig down in that hole. George: I just need to dig down. George: I'm so close. George: I'm so close. x2 Dream: We're back in this same area again! Dream: No! Dream: Someone, either one or both of them need to be in this area. Dream: I really don't like this. Dream: I just need sheep. Dream: If sheep were spawning right now, I could do so many. Dream: There's so many... Dream: There's so many flowers and everything. Sapnap: Basically, I just need to act not suspicious. Sapnap: We're close enough. Sapnap: I know where it's at. Sapnap: I just need to bide my time. George: They keep running away from the stupid place. George: Just stay over there, please. George: Oh my God, there's my hole. George: It's there. George: [gasps] George: No, this is not what I wanted. George: This is really bad. George: Oh, well, there's my time gone, probably. George: That water wasted all my time I could have dug down in. Dream: Okay, I'm in. Dream: Um... Dream: I'm gonna go back to this area. Dream: I guess we're not, nobody's sleeping through the night. Sapnap: Now we can just do it. Sapnap: We can just kill ourselves at any point. Sapnap: We'll act like we were just doing this. Sapnap: Like that. Sapnap: We'll even light it so they really believe it. George: Oh my God, why do I always spend so much time trying to find my goddarn way back? George: Oh my God, I just wasted so much stupid time. George: Okay, here we go. George: Okay, here we go - Down the hole Dream: Only problem is I don't know if George is like secretly... Dream: Completing his task and like, just we just don't know because we're too focused on each other or what, I don't know. Sapnap: Yeah, I mean, I don't know. George: Oh my God, I don't have ladders. George: No! George: I need ladders again. George: I need ladders! Dream: We're still here. Dream: I want to leave this area... Dream: Cause we- I need more... Dream: Mob spawns. George: Okay, who's lying, Sapnap? Sapnap: What do you mean? George: Dream's saying that you're, like, doing something with the iron. George: You're saying I'm burning the iron. Dream: We don't have the bucket. Dream: We don't have the bucket! Dream: Oh my God. Dream: I think I've just like... Dream: Pieced it together. Dream: Okay. Dream: Someone put all this stuff in a chest... Dream: Because they can kill themselves; I need to break the bed. Dream: No, no, no, no, no, no, no. Sapnap: I think I can do it. Sapnap: I just need to be quick. Sapnap: I need to be quick. Sapnap: I'm going to say he dug me in a hole. Dream: George. George: What. Dream: Did you do something with our bucket? George: No. Dream: Our bucket is in a chest! Dream: Sapnap's doing something! Sapnap: And hopefully Dream will get up... Sapnap: Right in time. Dream: He's going to put it, he- he- he has something he's close to his task. Dream: I'm telling you he's close to his task. George: What? George: Oh my God what is going on... George: This is really like, Sapnap did hide the bucket or throw the bucket out or something Sapnap: Bro, spawned me in a hole, bro. Sapnap: Like he literally- I'm- I'm- I'm in a hole. Dream: Who spawned you in a hole? Sapnap: I'm- I guess, George. Dream: Well, no, I didn't put you in a hole. Dream: You weren't in a hole.\nSapnap: Aw, f*ck Dream: It was me. Dream: It was me before you. Dream: Why are you lying?\nSapnap: Did you- Sapnap: [yells] Sapnap: [angrily laughs] Sapnap: [angrily laughs]\nDream: Wait, what was that about? Sapnap: [angrily laughs] x2 Sapnap: [angrily laughs] x2\nDream: Why're you lying? Sapnap: [angrily laughs] x2\nDream: I didn't put you in a hole. Sapnap: [angrily laughs] x2 Sapnap: I'm so mad. Dream: I was like on the side of the forest. Dream: What do you mean?\nSapnap: [angrily laughs] Sapnap: [angrily laughs] Dream: Okay. Dream: I want to move this bed. Dream: I don't like someone has a chest somewhere. Dream: We don't have our bucket... Dream: And we're by a lava pool... Dream: Maybe someone needs to do something in the Nether. George: Okay, here we go. George: This is actually good. George: Minus 62. George: Okay, here's my hole. George: Where is that cave? George: Look, we're making progress, though. George: Oh, God. Dream: Huh? Dream: Okay. Dream: Well, this is convenient because I do need to go to the surface. Dream: I need... Dream: Damn sheep! Dream: Like, why are there no sheep? Dream: Every time I come here, there's no sheep. Sapnap: I'm gonna... Sapnap: Hide the bed in the chest. George: [gasps] George: No, he ran away! George: Oh, wait, it's right here. George: Oh, wait, it's right here - [inhales] George: Okay, Dream wasn't... George: Suspicious of my ladder somehow. George: Which maybe... George: He's gonna regret... George: Very soon. George: We'll see, though. George: We'll see, though - [gasps] George: [gasps] x2 Dream: Interesting. Dream: What is George's task? Dream: What is George's task? - The sheep! Dream: At least one. Dream: Okay, yellow. George: [gasps] x3 George: He is going to the Nether! George: No! George: [laughs] George: Yeah! George: I blocked Sapnap's portal. George: Yeah, it is something to do with the Nether. George: Dream was right. George: Oh no. Dream: Oh god. Dream: Oh my God. Dream: Oh we're so screwed. Sapnap: Oh. Sapnap: Oh - [chuckles] George: [gasps] George: Oh, he's suspicious of me. George: He's suspicious. George: We died. George: We have nothing. George: Wait, this could actually be close to the end. George: Okay, wait, let me just analyze this scenario. George: Is the bedrock visible? George: Is the bedrock visible? - Let's see George: Oh no, it's not. Sapnap: It was like literally right- oh I got our stuff. George: Oh my God. George: This is it. George: This is my chance. George: It really does make things easier that I don't have to pretend like I'm, oh, I don't need to hide this hole from them. George: [gasps] George: Oh my God, there's the bedrock. George: Oh my God, there's the bedrock - It's there George: I just need to get rid of the water. George: No! George: No! George: Oh my God. George: I just had to get rid of the water and then the next cycle I would have won! Dream: What? Dream: Why do we have nothing? Dream: Why do we have nothing? x2 Dream: Clearly... Dream: George died in this round. Dream: What is George doing? George: Oh my God. George: Oh my God. x2 George: Oh my God. x3 George: Give me some blocks. George: I just need to block that stupid water off and I should have a clear shot down to the bedrock. Dream: I think he failed whatever he's trying to do. Dream: He's starting to like fall, fall really far or something. Dream: Like he has to fall over a certain number of blocks, but that could be it. Dream: Like he has to fall over a certain number of blocks, but that could be it - That could be it George: Come on. George: Come on - Quick George: Get in. George: Get in - Oh my God George: How am I going to block this water off? George: Yes! Dream: Oh God, I don't know where all our stuff is. Dream: Do I have what I need? Dream: Do I have what I need? - Nope Dream: I need the shovel. Dream: I don't know. Dream: And previously, you went down the cave with nothing. Dream: Why would you go down the cave with nothing unless you're trying to die... Dream: In a specific way? George: Now I'm trying to find the bedrock. Dream: You're trying to find the bedrock? George: Yes. Dream: What does that mean? George: What do you mean? Dream: You're trying to find the bedrock? Dream: What does that mean? George: [laughs] George: Oh my god. George: I actually said bedrock instead of diamonds. George: I'm such an idiot. George: [laughs] George: I just leaked it. George: I just leaked it - [gasps] George: But I might win right now. George: It might be over. Dream: I think- I think George just slipped up. Dream: He said something about bedrock on like, on accident. Dream: Like it was- like a Freudian slip. Dream: And then I was like \"Bedrock?\" Sapnap: Oh, what if he needs to die on bedrock? Dream: Mmm... Dream: That could be it, actually. Sapnap: Look, well, now we know it's probably both in our best interest to stay up, bro. Dream: I agree.\nSapnap: We cannot let him go to bedrock. Sapnap: We cannot let him go to bedrock.\nDream: I agree. x2 Dream: No, I agree. George: Is the bedrock visible? George: Is the bedrock visible? - No George: How's- George: [punches desk] George: [screams] George: How is the water not gone? George: Oh my God, I'm gonna crash out. George: I'm actually gonna crash out. George: I leaked my stupid plan to Dream, and then I threw. George: I threw. George: Like, what is wrong with me? George: I'm like, I'm sick in the head. George: I'm- I'm an idiot. George: I'm actually stupid. Dream: We died again. Dream: This is not good. Dream: Yeah, George definitely, his task definitely has to do with... Dream: Killing himself and a cave. George: [laughs] George: Like that's actually the stupidest way that I could have thrown in like the history of anything. Sapnap: Oh yeah, he's- he's trying- he's trying to drop himself. Sapnap: Yeah, 100% it has to be it. Sapnap: We need to like, if we find it, like grief it. Dream: Yeah, we need to grief it, we need to grief his like... Dream: His little hole. George: Oh my God. George: And he's gonna tell Sapnap, and then they're just gonna block it off and i'm not gonna be able to do anything and he's gonna- George: [sighs] George: My whole plan is ruined, my whole plan is ruined. George: Because I... George: I told him my plan like a moron! Dream: George keeps... Dream: Dying... Dream: And he's going in that cave and he has that like hole with the ladder. Dream: I don't know where it is. Dream: Where did I come up? Dream: I came up somewhere over here, right? Dream: I need to grief it. Dream: I need to grief it. x2 Dream: Uh, I don't know. Dream: I don't know where it is. Sapnap: The problem is the mobs are really annoying. Sapnap: Oh my God. Sapnap: If it wasn't raining, I could have built the portal, but these guys are really cucking me. Dream: There's no- do we really have no iron? Dream: We just need to, I need to stop them and I need, I need literally one piece of iron! Sapnap: Bro, there's still mobs! Sapnap: No, no, no, that would be so bad. Sapnap: No! Sapnap: Oh my God, that's so bad. Sapnap: That's so bad! Sapnap: Our stuff's gonna get discovered. Sapnap: Our stuff's gonna get discovered - I'm cooked George: I'm just so far away... George: Yet so close. George: Ugh... George: And Sapnap's going to keep running the opposite way every time he gets in. Dream: Okay... Dream: We died again. Dream: Oh, we didn't ruin the rest of the lava. Dream: Guess I don't know why we didn't do that. Dream: There's gotta be a chest around here somewhere from somebody. Sapnap: Oh my God. Sapnap: Wait, there's no way. George: Jesus. George: Jesus! George: Sapnap is killing us. Dream: Okay... Dream: Clearly someone's trying to go to the Nether. Dream: Let's stop that. Dream: I need a singular piece of iron, guys. Dream: Teammates. Dream: Okay, there's a sheep over there. Dream: Could be useful. Sapnap: Oh my God, I have a bucket. Sapnap: Oh my God, George griefed it, or Dream griefed it. Sapnap: I mean, it's cooked. Sapnap: It's cooked! Sapnap: And there's just infinite mobs! Sapnap: I don't know what else to do. Sapnap: I'm- I lirerally don't know what else to do. George: Oh my God. George: He killed us again. George: Sapnap is actually a freak. Dream: Every time I spawn in... Dream: I have nothing. Dream: I have nothing - I don't know Dream: I guess I don't know what to do. Dream: I need iron. George: Why do you keep killing us? George: Idiot. Sapnap: Because I don't want you to win, moron! George: So what are you even doing? George: Like you just, are you even doing anything? Sapnap: Yes! George: How are you even making progress with like 50 seconds? Sapnap: I just am. Sapnap: Slowly but surely. Sapnap: Slowly but surely.\nGeorge: Oh my God. George: Did I do it? George: Did I do it? - [gasps] Dream: Okay. Dream: So he killed himself. Dream: How am I meant to do anything? Dream: I still have a lot of sheep I gotta kill, guys! Let me... Dream: Let me go. George: Okay, there's a chance I run over here, and this is the end. George: I think the water might have cleared. George: It's possible that the end is right over here. George: It's possible. George: It's possible - I don't know George: I'd have to go see it again. Dream: Someone has a chest right around here. Dream: I'm finding it. Dream: I'm going to do everything in my power to find this damn chest. Dream: He probably would put it right next to the... Dream: Thing... Dream: Thing - Here George: Oh my God, I'm close. George: I have no food. George: Oh my God, I need to just walk over there. George: I have no food, I'm just walking! George: Please let me look down this hole and see bedrock. George: Please, please, please, please, please. George: No! George: How is there water still? George: Bedrock's exposed. George: The bedrock's exposed. George: The bedrock's exposed. x2 George: The bedrock's exposed! Dream: Okay... Dream: I'm just investigating them. Dream: So I want to know why he keeps coming down here. Dream: I don't see why he would want to come down here. Dream: I'm looking for like a hole. Sapnap: No, st- I'm dead. Sapnap: [scoffs] Sapnap: [sighs] Sapnap: George is going to be mad at me. Sapnap: I died, but it was an accident. George: My plan worked. George: My plan worked. x2 George: I'm dead! George: [laughs] George: He put me right where I needed to be! George: He put me right where I needed to be! - [gasps] George: He put me right where I needed to be! George: He put me right where I needed to be! - [gasps] George: It's over there! George: It's over there! - [gasps] George: It's over there! George: [hyperventilating] George: Please. George: Please. George: Hours and hours of grinding. George: There's Sapnap's stupid portal. George: Over the ice we go. George: Over here. George: My heart is racing. George: My heart is racing. x2 George: Please bedrock. George: Please be exposed. George: It's there. George: Yes! George: Yes! - [gasps] George: Yes! George: Yes! - [gasps] George: Yes! George: Yes! - [gasps] George: Yes! Dream: Okay. George: Yes! x2 George: Yes! x2\nDream: Wait, George won. George: [gasps] George: Yes! George: Yes!\nDream: George won. Dream: George won.\nGeorge: Yes! - [gasps] George: Yes! Dream: What?\nGeorge: Yes! - [gasps] - Yes! George: Yes! - [gasps] - Yes!",
    "start_time": 0.169,
    "end_time": 2490.2960000000003
}