{
    "video_id": "VAImDf4Sgto",
    "channel_url": "@dream",
    "transcript": "Dream: This This video, This video, I This video, I try This video, I try and This video, I try and speedrun This video, I try and speedrun and This video, I try and speedrun and beat This video, I try and speedrun and beat Minecraft while while two while two of while two of my while two of my friends while two of my friends try while two of my friends try and while two of my friends try and stop while two of my friends try and stop me while two of my friends try and stop me at while two of my friends try and stop me at all while two of my friends try and stop me at all costs. while two of my friends try and stop me at all costs. Except, Except, there's Except, there's a Except, there's a twist. Except, there's a twist. Every Every minute, Every minute, the Every minute, the server Every minute, the server automatically Every minute, the server automatically swaps who's who's in who's in control who's in control of who's in control of the who's in control of the speedrunning who's in control of the speedrunning player who's in control of the speedrunning player that's who's in control of the speedrunning player that's being who's in control of the speedrunning player that's being hunted. who's in control of the speedrunning player that's being hunted. I I tried I tried this I tried this with I tried this with Daquavis and and we and we won. and we won. Now, Now, we're Now, we're trying Now, we're trying it Now, we're trying it with Now, we're trying it with Baablu. A A Manhunt A Manhunt expert A Manhunt expert who's A Manhunt expert who's done A Manhunt expert who's done many A Manhunt expert who's done many Manhunt A Manhunt expert who's done many Manhunt challenge A Manhunt expert who's done many Manhunt challenge videos A Manhunt expert who's done many Manhunt challenge videos and A Manhunt expert who's done many Manhunt challenge videos and spinoffs. A Manhunt expert who's done many Manhunt challenge videos and spinoffs. We We decided We decided that We decided that the We decided that the hunters We decided that the hunters should We decided that the hunters should be We decided that the hunters should be split. We decided that the hunters should be split. So So one So one of So one of the So one of the hunters So one of the hunters is So one of the hunters is a So one of the hunters is a hunter So one of the hunters is a hunter from So one of the hunters is a hunter from his So one of the hunters is a hunter from his videos. And And one And one of And one of the And one of the hunters And one of the hunters is And one of the hunters is a And one of the hunters is a hunter And one of the hunters is a hunter from And one of the hunters is a hunter from my And one of the hunters is a hunter from my videos. And one of the hunters is a hunter from my videos. Can Can we Can we beat Can we beat the Can we beat the game or or will or will the or will the hunters or will the hunters win? or will the hunters win? This This is This is Minecraft This is Minecraft Speedrunner This is Minecraft Speedrunner Swap. This is Minecraft Speedrunner Swap. Also, Also, only Also, only a Also, only a small Also, only a small percentage Also, only a small percentage of Also, only a small percentage of people Also, only a small percentage of people watching Also, only a small percentage of people watching my Also, only a small percentage of people watching my videos Also, only a small percentage of people watching my videos are Also, only a small percentage of people watching my videos are actually Also, only a small percentage of people watching my videos are actually subscribed. Also, only a small percentage of people watching my videos are actually subscribed. So So if So if you So if you end So if you end up So if you end up liking So if you end up liking this So if you end up liking this video, So if you end up liking this video, consider So if you end up liking this video, consider subscribing. So if you end up liking this video, consider subscribing. It's It's free, It's free, and It's free, and you It's free, and you can It's free, and you can always It's free, and you can always change It's free, and you can always change your It's free, and you can always change your mind. It's free, and you can always change your mind. Bye! Faanst: O Faanst: Ok Faanst: Oka Faanst: Okay, Faanst: Okay, Faanst: Okay, Faanst: Okay, Faanst: Okay, Faanst: Okay, Faanst: Okay, Faanst: Okay, Faanst: Okay, BadBoyHalo: [gasps] BadBoyHalo: [gasps] BadBoyHalo: [gasps] BadBoyHalo: [gasps] BadBoyHalo: [gasps] BadBoyHalo: [gasps] BadBoyHalo: [gasps] BadBoyHalo: [gasps] Okay, g Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, Okay, go, g Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go Okay, go, go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! [[[quickly]] [[quickly]] go, go, go! Get Get him. Get him. Oh, Oh, there Oh, there we Oh, there we go. Ooh Ooh f- Ooh f- There's There's a Oh, Oh, and There's a village! Oh, and there's There's a village! He's Oh, and there's a Oh, and there's a village, There's a village! He's heading Oh, and there's a village, yep. There's a village! He's heading towards There's a village! He's heading towards it. There's a village! He's heading towards it. And And there's And there's a And there's a ruin And there's a ruin portal. Ooo! Oooo! Ooooo! Y Y Yo Yo You- You- You- You- You- You- Oooooo! y yo you g you go you got you gott you gotta- you gotta- you gotta- Careful. Ooooooo! y yo you g you go you gott you gotta Ooooooo! Ooooooo! you gotta g you gotta go you gotta go you gotta go you gotta go a you gotta go ah you gotta go ahea you gotta go ahead you gotta go ahead o you gotta go ahead of you gotta go ahead of you gotta go ahead of you gotta go ahead of h you gotta go ahead of hi you gotta go ahead of him you gotta go ahead of him you gotta go ahead of him you gotta go ahead of him g go a go ahe go ahead go ahead go ahead o go ahead of go ahead of go ahead of go ahead of h go ahead of hi go ahead of him go ahead of him go ahead of him go ahead of him g g go a go ah go ahea go ahead go ahead o go ahead of go ahead of go ahead of go ahead of h go ahead of hi go ahead of him, go ahead of him, go ahead of him, p go ahead of him, pl go ahead of him, ple go ahead of him, plea go ahead of him, pleas go ahead of him, please. go ahead of him, please. Okay- Okay- N N No Nop Nope, Nope, n Nope, no Nope, nop Nope, nope, Nope, nope, Nope, nope, Nope, nope, Nope, nope, n Nope, nope, no Nope, nope, nop Nope, nope, nope. Nope, nope, nope. Nope, nope, nope. Nope, nope, nope. Nope, nope, nope. Oh Oh my Oh my god you Is you can Is the- you can maybe you can maybe reach you can maybe reach through you can maybe reach through the Oh- you can maybe reach through the chest? you can maybe reach through the chest? [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] And Oh And he And he got Oh god! And he got it. He- Oh, Oh, Oh, Oh, Oh, Oh, did Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! did he did he get Oh, fudge! I'm Oh, fudge! I'm Oh, fudge! I'm Oh, fudge! I'm Oh, fudge! I'm Oh, fudge! I'm Oh, fudge! I'm Oh, fudge! I'm did he get everything? Oh, fudge! I'm on Oh, fudge! I'm on Oh, fudge! I'm on Oh, fudge! I'm on Oh, fudge! I'm on Oh, fudge! I'm on Oh, fudge! I'm on Oh, fudge! I'm on Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, fudge! I'm on fire. Oh, [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Oh, I'm Oh, I'm trying. Oh, I'm trying. There's There's There's There's There's a There's ac There's act There's actu There's actua There's actual There's actuall There's actually a There's actually a There's actually a There's actually a There's actually a There's actually a There's actually a There's actually a f There's actually a fi There's actually a fir There's actually a fire There's actually a fire There's actually a fire There's actually a fire There's actually a fire c There's actually a fire ch There's actually a fire cha There's actually a fire char There's actually a fire charg There's actually a fire charge, There's actually a fire charge, There's actually a fire charge, p There's actually a fire charge, pe There's actually a fire charge, per There's actually a fire charge, perf There's actually a fire charge, perfe There's actually a fire charge, perfec There's actually a fire charge, perfect. There's actually a fire charge, perfect. There's actually a fire charge, perfect. I'm I'm gonna I'm gonna light I'm gonna light him I'm gonna light him on I'm gonna light him on fire. I'm gonna light him on fire. Yes! Yes! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] And Oh, And he's Oh, he And he's at Oh, he got And he's at another And he's at another village. Oh, he got a Oh, he got a chest! Oh, he got a chest! Nice. I I I I I I I I He He got I mean, I mean, I mean, I mean, I mean, I mean, I mean, I mean, I mean, He got bread! I mean, not I mean, not I mean, not I mean, not I mean, not I mean, not I mean, not I mean, not I mean, not I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. I mean, not nice. G G G Go, Go, Go, Oh Oh god. Go, g Go, g Go, go, Go, go, Go, go, Go, go, Go, go, Go, go, Go, go, g Go, go, go! Go, go, go! Go, go, go! Go, go, go! Go, go, go! Go, go, go! Go, go, go! Go, go, go! Nice. Nice. Oh, Oh, I Oh, I glitched! Oh, Oh, I glitched! In Oh, what Oh, what is Oh, I glitched! In the Oh, what is that? Oh, I glitched! In the blocks Oh, I glitched! In the blocks down- Oh, I glitched! In the blocks down- Oh Oh my Oh my goodness. Oh my goodness. How How do How do you How do you get How do you get hot How do you get hot stuff? [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] What? What? What? What? What? What? What? What? What? What? He's He's killing He's killing me, He's killing me, with Baablu: What's Baablu: What's Baablu: What's Baablu: What's What's u What's up What's up What's up What's up What's up He's killing me, with lava! What's up e What's up ev What's up eve What's up ever What's up every What's up everyb What's up everybo What's up everybody? What's up everybody? And And And And And And And And And And And And And And And And And And He- he- And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's And that's Oh! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! And that's Baablu?! Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh! Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god they- what what what what what is what is what is what is what is what is what is what is what is Oh they what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? what is happening? Oh my Oh my god! they swapped! [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] What? Careful. Careful. Baablu! Baablu! Come Yo, Come Yo, what's Yo, what's going Come here! Come here! Yo, what's going on, Yo, what's going on, guys? Yo, what's going on, guys? Oh, Oh, Oh, I Oh, I Oh, I Oh, I Oh, I Oh, I have Oh, I have Oh, I have Oh, I have Oh, I have Oh, I have so Oh, I have so Oh, I have so Oh, I have so Oh, I have so Oh, I have so much Oh, I have so much Oh, I have so much Oh, I have so much Oh, I have so much Oh, I have so much loot. Oh, I have so much loot. Oh, I have so much loot. Oh, I have so much loot. Oh, I have so much loot. Oh, I have so much loot. Oh, I have so much loot. Wait, Hey! Wait, you Wait, you guys Wait, you guys are Yeah, Wait, you guys are screwed. Yeah, Dream- Dream Dream set Dream set you Dream set you up Dream set you up perfectly, Dream set you up perfectly, didn't Dream set you up perfectly, didn't he? How How are How are you How are you catching How are you catching up How are you catching up to How are you catching up to me? How are you catching up to me? Because Because we're- we're He we're good He got we're good at He got you we're good at parkour. you're you're going you're going down. you're going down. What He's What is He's MLGing What is this? He's MLGing down He's MLGing down the We're He's MLGing down the mountain. We're just We're just doing- we're we're actually we're actually doing we're actually doing circles. we're actually doing circles. Okay. Okay. Or Or just- stay stay on stay on him. We- We We need- We We need We need to We need to get We need to get food We need to get food or We need to get food or something. We need to get food or something. Y Y Ye Ye Yea Yeah, Yeah, Yeah, Yeah, y Yeah, ye Yeah, yea Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, y Yeah, yeah, ye Yeah, yeah, yea Yeah, yeah, yeah Yeah, yeah, yeah Yeah, yeah, yeah Yeah, yeah, yeah Yeah, yeah, yeah Yeah, yeah, yeah i is t is the is there is there h is there hay is there hay is there hay b is there hay bal is there hay bales is there hay bales h is there hay bales he is there hay bales her is there hay bales here? is there hay bales here? is there hay bales here? Oh, Oh, oh, Oh, oh, oh he's he's on he's on hay he's on hay bales he's he's on he's on hay he's on hay bale he's on hay bale duty he's he's on he's on hay he's on hay bale he's on hay bale duty. he's on hay bale duty. Wait, Wait, what? Wait, what? Hey, Hey, I'm- I'm I'm pretty I'm pretty sure I'm pretty sure he's Got Got him. I'm pretty sure he's on I'm pretty sure he's on wood. I'm pretty sure he's on wood. Yeah, Yeah, he's Yeah, he's on Yeah, he's on wood he's he's he's he's he's he's he's he's o he's on he's on he's on he's on he's on he's on he's on he's on w he's on wo he's on woo he's on wood he's on wood he's on wood he's on wood he's on wood YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! he's he's o he's on he's on he's on w he's on wo he's on woo he's on wood he's on wood he's on wood he's he's o he's on he's on he's on w he's on wo he's on woo he's on wood he's on wood he's on wood t thank y thank yo thank you thank you thank you thank you t t th th the w the wo the woo the wood, the wood, the wood, the wood, n the wood, no! the wood, no! the wood, no! the wood, no! the wood, no! the wood, no! the wood, no! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Come Come on, Come on, bro! Come on, bro! [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Oh, Oh, what? Oh, what? Oh. Oh. Oh, Oh- Oh, I'm Oh, I'm back. Okay. Okay. [sings] Welcome [sings] Welcome back! [sings] Welcome back! Well, Well, where Well, where are Well, where are we? Are Are we Are we going Are we going back Are we going back towards Are we going back towards spawn? Are we going back towards spawn? Yeah, Yeah, he Yeah, he did Yeah, he did a Yeah, he did a loop-de-loop. Yeah, he did a loop-de-loop. I I have I have a I have a fire I have a fire charge I have a fire charge with I have a fire charge with your I have a fire charge with your name I have a fire charge with your name on I have a fire charge with your name on it. I have a fire charge with your name on it. Come Come here! Come here! Why What What do Why does What do I Why does he What do I have? Why does he have I Why does he have two I have Why does he have two nuggets? I have bread. [snorts] [snorts] More He's More than He's going More than we More than we do He's going down. I I guess, I guess, yeah. I guess, yeah. [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Oh, fudge. Okay, Okay, Okay, Okay, Okay, Okay, Okay, Okay, okay, Okay, okay, Okay, okay, Okay, okay, Okay, okay, Okay, okay, Okay, okay, Okay, okay, Okay, okay, I'm Okay, okay, I'm Okay, okay, I'm Okay, okay, I'm Okay, okay, I'm Okay, okay, I'm Okay, okay, I'm Okay, okay, I'm Okay, okay, I'm actually- Okay, okay, I'm actually- Okay, okay, I'm actually- Okay, okay, I'm actually- Okay, okay, I'm actually- Okay, okay, I'm actually- Okay, okay, I'm actually- Okay, okay, I'm actually- I'm I'm I'm actually I'm actually I'm actually I'm actually I'm actually really I'm actually really I'm actually really I'm actually really I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. I'm actually really low. Oh, Oh, come Oh, come here, Oh, come here, Bad! Oh, come here, Bad! Try Try and Try and make You're Try and make a- You're in Oh, Oh, fudge. You're in trouble, Make Make Make Make Make Make You're in trouble, Bad! Make a Make a Make a Make a Make a Make a Make a Make a Make a crafting Make a crafting Make a crafting Make a crafting Make a crafting Make a crafting Make a crafting Make a crafting Make a crafting table. Make a crafting table. Make a crafting table. Make a crafting table. Make a crafting table. Make a crafting table. Make a crafting table. Make a crafting table. I've I've got I've got hay I've got hay bales. I'm I'm I'm I'm t I'm tr I'm try I'm tryin I'm trying, I'm trying, I'm trying, I'm I'm trying, I'm I'm trying, I'm I'm trying, I'm I'm trying, I'm I'm trying, I'm I'm trying, I'm g I'm trying, I'm go I'm trying, I'm gon I'm trying, I'm gonna I'm trying, I'm gonna I'm trying, I'm gonna I'm trying, I'm gonna t I'm trying, I'm gonna tr I'm trying, I'm gonna try. I'm trying, I'm gonna try. I'm trying, I'm gonna try. I'm trying, I'm gonna try. I'm trying, I'm gonna try. I'm trying, I'm gonna try. I'm trying, I'm gonna try. H H Hu Hur Hurr Hurry, Hurry, h Hurry, hu Hurry, hur Hurry, hurr Hurry, hurry, Hurry, hurry, Hurry, hurry, Hurry, hurry, Hurry, hurry, h Hurry, hurry, hu Hurry, hurry, hur Hurry, hurry, hurry! Hurry, hurry, hurry! Hurry, hurry, hurry! Hurry, hurry, hurry! Hurry, hurry, hurry! Hurry, hurry, hurry! [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] He's He's coming! He's coming! Go, Oh, Oh, no, Go, go, Oh, no, no, Go, go, hurry! Oh, no, no, no. Here, [grunting] Here, I Here, I made Here, I made the Here, I made the crafting Here, I made the crafting table! Here, I made the crafting table! H H He Her Here, Here, h Here, he Here, her Here, here, Here, here, Here, here, Here, here, Here, here, c Here, here, co Here, here, com Here, here, come Here, here, come Here, here, come Here, here, come Here, here, come h Here, here, come he Here, here, come her Here, here, come here Here, here, come here Here, here, come here Here, here, come here Here, here, come here come h come here, come here, c come here, come come here, come h come here, come he come here, come here! come here, come here! come here, come here! come here, come here! come here, come here! come here, come here! come here, come here! come here, come here! Alright! C Cr Cra Craf Craft, Craft, Craft, Craft, Craft, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, look Ah, look Ah, look Ah, look Ah, look Ah, look Ah, look Ah, look Ah, look Craft, c Craft, cr Craft, cra Craft, craft, Craft, craft, Craft, craft, Craft, craft, Craft, craft, Craft, craft, Craft, craft, Craft, craft, Ah, look out! Ah, look out! Ah, look out! Ah, look out! Ah, look out! Ah, look out! Ah, look out! Ah, look out! Ah, look out! Ah, look out! Craft, craft, c Craft, craft, cr Craft, craft, craf Craft, craft, craft Craft, craft, craft Craft, craft, craft Craft, craft, craft Craft, craft, craft Craft, craft, craft Craft, craft, craft Craft, craft, craft Craft, craft, craft Watch Watch out! c cr cra craf craft, craft, c craft, cr craft, cra craft, craf craft, craft, craft, craft, craft, craft, craft, craft, c craft, craft, cr craft, craft, cra craft, craft, craf craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! craft, craft, craft! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Ah, Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Please!!! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! Ah, fudge! [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Oh Oh Oh Oh Oh Oh Oh Oh [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Ah, Ah, he's Ah, he's so Ah, he's so low! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] I'm I'm back Come I'm back guys, Come here, I'm back guys, what's I'm back guys, what's up? Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Come here, Baablu! Oh, Oh, my [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] How Oh, my gosh. How was How was that How was that little How was that little encounter? Oh Oh my Oh my god I'm Oh, I'm so Oh, my I'm so fully I'm so fully healed Oh, my gosh. I'm so fully healed up I'm so fully healed up and I'm so fully healed up and I'm I'm so fully healed up and I'm gonna I'm so fully healed up and I'm gonna kill I'm so fully healed up and I'm gonna kill you I'm so fully healed up and I'm gonna kill you right I'm so fully healed up and I'm gonna kill you right now, I'm so fully healed up and I'm gonna kill you right now, go! I'm so fully healed up and I'm gonna kill you right now, go! I'm I'm catching I'm catching up just- just- stay stay with stay with him. stay with him. Yeah, Yeah, we're Yeah, we're literally Yeah, we're literally right Yeah, we're literally right next Yeah, we're literally right next to Yeah, we're literally right next to spawn you- so so you're so you're good. so you're good. Oh, Oh, what's Oh, what's in Oh, what's in this? Oh, what's in this? Oh, Oh, what's in this? Oh, bread! Oh, what's in this? Oh, bread! I'm I'm just I'm just gonna- I'm just gonna- Keep You Keep being You guys Keep being behind You guys are- Keep being behind you You Baablu You guys You guys are you're you're not You guys are over you're not gonna you're not gonna lose You guys are over here? you're not gonna lose me! you're not gonna lose me! Yeah, Yeah, we're- we're- we're- we're we're in we're in the Oh, we're in the village Oh, I we're in the village where Oh, I see we're in the village where you Oh, I see you we're in the village where you found we're in the village where you found the- I I see I see you. where where you where you found where you found the where you found the bucket, where you found the bucket, I where you found the bucket, I think. where you found the bucket, I think. What What did What did you What did you just What did you just make? What did you just make? Did What did you just make? Did you What did you just make? Did you just What did you just make? Did you just make What did you just make? Did you just make a What did you just make? Did you just make a. What did you just make? Did you just make a.. What did you just make? Did you just make a... What did you just make? Did you just make a... Shovel? Shovel? Okay, Okay, he- he he has he has the he has the lava he has the lava bucket I'm I'm actually I'm actually kind I'm actually kind of Okay. I'm actually kind of scared I'm actually kind of scared to I'm actually kind of scared to fight I'm actually kind of scared to fight him I'm actually kind of scared to fight him now. I'm actually kind of scared to fight him now. Hey, Hey, should- should should I should I make should I make us should I make us swords? Y Y Ye Yea Yea Yeah, Yeah, Yeah, Yeah, y Yeah, ye Yeah, yea Yeah, yeah- Yeah, yeah- Yeah, yeah- Yeah, yeah- Yeah, yeah- Yeah, yeah- Yeah, yeah- m mak make a- make a- make a- make a- make a- make a- m ma make a make a make a make a make a s make a sw make a swo make a swor make a sword make a sword make a sword m make a make a make a make a s make a sw make a swor make a sword. make a sword. make a sword. Okay, Okay, I'm Okay, I'm gonna- I'm I'm gonna-I'm I'm gonna-I'm gonna I'm gonna-I'm gonna get I'm gonna-I'm gonna get off I'm gonna-I'm gonna get off him I'm gonna-I'm gonna get off him for I'm gonna-I'm gonna get off him for a I'm gonna-I'm gonna get off him for a sec I'm gonna-I'm gonna get off him for a sec cause I'm gonna-I'm gonna get off him for a sec cause he's I'm gonna-I'm gonna get off him for a sec cause he's kind I'm gonna-I'm gonna get off him for a sec cause he's kind of I'm gonna-I'm gonna get off him for a sec cause he's kind of scary. I'm gonna-I'm gonna get off him for a sec cause he's kind of scary. Hey, Hey, look Hey, look at Hey, look at that, Hey, look at that, guys. Hey, look at that, guys. I I got I got iron. I got iron. What? What? Oh- Oh Oh my Oh my gosh. How? D Dr Dre Drea Dream, Dream, t Dream, ta Dream, tak Dream, take Dream, take Dream, take Dream, take Dream, take Dream, take o Dream, take ov Dream, take ove Dream, take over! Dream, take over! Dream, take over! Dream, take over! Dream, take over! And And I've And I've got And I've got two And I've got two swords one one for one for each one for each of one for each of us. Where Where are Where are you? Where are you? Okay, Okay, uh, Okay, uh, they- they they swapped they swapped to they swapped to Dream they they swapped they swapped to they swapped to Dream. they swapped to Dream. Alright, Alright, let's Alright, let's get Alright, let's get him. Where Where is Where is he? Where is he? Where Where did Where did he Where did he go? Where did he go? He He is He is. He is.. He is... He is... He's He's straight He's straight ahead. He's straight ahead. Where Where are Where are you? Where are you? You Come You can't Come out, You can't. You can't.. You can't... Come out, come Come out, come out wherever wherever you Yeah, wherever you are. Yeah, he- he he probably he probably can't he probably can't be he probably can't be too he probably can't be too far. he probably can't be too far. Unless Unless it Unless it switched Unless it switched to Unless it switched to Baablu Unless it switched to Baablu now. Unless it switched to Baablu now. Yeah, Yeah, I Yeah, I did. Yeah, I did. [scoffs] [scoffs] So So So So So So So So So annoying. So annoying. So annoying. So annoying. So annoying. So annoying. So annoying. So annoying. So annoying. So annoying. So annoying. So annoying. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] What's What's going What's going on? Yeah, Yeah, okay. Wait, Wait, Wait, Oh, Wait, it Wait, it Wait, it Wait, it Wait, it Wait, it Oh, hey Wait, it actually Wait, it actually Wait, it actually Wait, it actually Wait, it actually Wait, it actually Oh, hey guys. Wait, it actually did! Wait, it actually did! Wait, it actually did! Wait, it actually did! Wait, it actually did! Wait, it actually did! Wait, it actually did! Wait, it actually did! What? [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] What? What? What? Hey Hey everyone. Hey everyone. Dream Dream got Dream got you Dream got you pretty Dream got you pretty far but but still but still no but still no resources but still no resources to but still no resources to your but still no resources to your name. but still no resources to your name. It's It's true, It's true, I It's true, I don't It's true, I don't have It's true, I don't have much, It's true, I don't have much, but. It's It's definitely It's definitely enough It's definitely enough to It's definitely enough to take It's definitely enough to take you It's definitely enough to take you down so so I so I don't so I don't care. so I don't care. Funny, Funny, bro. Funny, bro. [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? When When When When did When did When did When did When did When did you When did you When did you When did you When did you When did you have When did you have When did you have When did you have When did you have When did you have a When did you have a When did you have a When did you have a When did you have a [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? When did you have a sword? N N N No, No, Where Where you No, n No, n No, no, No, no, No, no, No, no, No, no, No, no, Where you going, No, no, n No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no Where you going, Faanst? Where you going, Faanst? no, n no, no, no, no, no, no, n no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! no, no, no! When When When When When did When did When did When did When did When did When did When did you When did you When did you When did you When did you When did you When did you When did you get When did you get When did you get When did you get When did you get When did you get When did you get Oh, Oh, you When did you get a When did you get a When did you get a When did you get a When did you get a When did you get a When did you get a Oh, you gotta When did you get a sword? When did you get a sword? When did you get a sword? When did you get a sword? When did you get a sword? When did you get a sword? When did you get a sword? When did you get a sword? Oh, you gotta be Oh, you gotta be low. Oh, you gotta be low. You You gotta You gotta be You gotta be low, I I I need I need I need I need You gotta be low, bro. I need help. I need help. I need help. I need help. I need help. I need help. I need help. I need help. I need help. I I I need I need I need I need I need help. I need help. I need help. I need help. I need help. I need help. I I need I need I need I need I need help. I need help. I need help. I need help. I need help. I need help. I I need I need I need I need help. I need help. I need help. I need help. I need help. I need help. I'm I'm coming I'm coming I'm coming I'm coming to I'm coming to I'm coming to I'm coming to you. I'm coming to you. I'm coming to you. I'm coming to you. I'm coming to you. I'm I'm coming I'm coming I'm coming I'm coming to I'm coming to I'm coming to I'm coming to you. I'm coming to you. I'm coming to you. I'm coming to you. I'm coming to you. I'm coming to you. Just Just Just Just Just Just Just Just keep Just keep Just keep Just keep Just keep Just keep Just keep Just keep Just keep swimming, Just keep swimming, Just keep swimming, Just keep swimming, Just keep swimming, Just keep swimming, Just keep swimming, Just keep swimming, Just keep swimming, keep Just keep swimming, keep Just keep swimming, keep Just keep swimming, keep Just keep swimming, keep Just keep swimming, keep Just keep swimming, keep Just keep swimming, keep Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! Just keep swimming, keep swimming! G G Go, Go, Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Alright. Go, g Go, go, Go, go, Go, go, Go, go, Go, go, Go, go, g Go, go, go, Go, go, go, Go, go, go, Go, go, go, Go, go, go, Go, go, go, g Go, go, go, go. Go, go, go, go. Go, go, go, go. Go, go, go, go. Go, go, go, go. Go, go, go, go. Go, go, go, go. Go, go, go, go. Wait, Wait, is Wait, is this Wait, is this an Wait, is this an island? Wait, is this an island? Is Is he Is he stuck? I I think I think it I think it might I think it might be. This This is This is an This is an island, This is an island, I This is an island, I think. This is an island, I think. Oh, Oh, he Oh, he has Oh, he has a Oh, he has a shield. Oh, he has a shield. Oh, Oh, that's Oh, that's actually Oh, that's actually bad. Oh, that's actually bad. Okay, Okay, okay, Okay, okay, do Okay, okay, do you Okay, okay, do you have Okay, okay, do you have an Okay, okay, do you have an axe? Okay, okay, do you have an axe? No, No, I No, I think No, I think we No, I think we should No, I think we should make No, I think we should make an No, I think we should make an axe No, I think we should make an axe though. No, I think we should make an axe though. Ah, Ah, they're Ah, they're not Ah, they're not going Ah, they're not going to Ah, they're not going to come Ah, they're not going to come in Ah, they're not going to come in the Ah, they're not going to come in the water. I I think- I I think I think we I think we just I think we just follow I think we just follow him. I think we just follow him. You You know You know what? Let's- let's let's circle let's circle this let's circle this island. Let's Let's see. Let's see. Yeah, Yeah, we Yeah, we can Yeah, we can kind Yeah, we can kind of Yeah, we can kind of keep Yeah, we can kind of keep him Yeah, we can kind of keep him in Yeah, we can kind of keep him in there. Yeah, we can kind of keep him in there. L Lo Loo Look, Look, l Look, lo Look, loo Look, look, Look, look, Look, look, Look, look, l Look, look, lo Look, look, loo Look, look, look, Look, look, look, Look, look, look, Look, look, look, l Look, look, look, lo Look, look, look, loo Look, look, look, look! Look, look, look, look! Look, look, look, look! Look, look, look, look! Look, look, look, look! Look, look, look, look! We We cut We cut him We cut him off. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Oh Oh god. [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. I'm I'm back I'm back to I'm back to clutch I'm back to clutch up. What's What's up, What's up, everybody? What's up, everybody? Oh Oh no, Oh no, there Oh no, there we Oh no, there we go. Oh no, there we go. We We gotta We gotta do We gotta do quick, This This. We gotta do quick, quick This.. This... We gotta do quick, quick crafting. We gotta do quick, quick crafting. This This. This.. This... This... This... Alright! Oh Oh Oh Oh Oh Oh Oh Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's He's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! Oh, he's here!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's behind Oh fudge, he's behind Oh fudge, he's behind Oh fudge, he's behind Oh fudge, he's behind Oh fudge, he's behind Oh fudge, he's behind Oh fudge, he's behind He's He's He's He's He's He's He's He's He's He's He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! He's here!!! Oh fudge, he's behind us! Oh fudge, he's behind us! Oh fudge, he's behind us! Oh fudge, he's behind us! Oh fudge, he's behind us! Oh fudge, he's behind us! Oh fudge, he's behind us! Oh fudge, he's behind us! Oh fudge, he's behind us! He's He's He's He's He's He's [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] He's h He's he He's her He's here! He's here! He's here! He's here! He's here! He's here! He's here! He's here! He's here! No! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No!!! No! F- No! F- Oh Oh my Oh my god. Fudge! Faanst, Faanst, come Faanst, come here! Faanst, come here! N N No, No, No, n No, n No, no, No, no, No, no, No, no, No, no, No, no, n No, no, no, No, no, no, No, no, no, No, no, no, No, no, no, No, no, no, No, no, no, n No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. It's It's okay. It's It's okay. It's okay. [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Bye! Oh Oh my Oh my god, Oh my god, you- Oh my god, you- [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] [mockingly laughs] I I don't I don't want I don't want to I don't want to die I don't want to die and I don't want to die and then I don't want to die and then get I don't want to die and then get sent I don't want to die and then get sent all I don't want to die and then get sent all the I don't want to die and then get sent all the way I don't want to die and then get sent all the way back I don't want to die and then get sent all the way back to I don't want to die and then get sent all the way back to spawn. So So. So.. So... So... I'm I'm good. I'm good. Well, Well, I'm Well, I'm not Well, I'm not gonna Well, I'm not gonna be Well, I'm not gonna be the Well, I'm not gonna be the one Well, I'm not gonna be the one that Well, I'm not gonna be the one that kills Well, I'm not gonna be the one that kills you. Well, I'm not gonna be the one that kills you. Bad, Bad, are Bad, are you Bad, are you at Bad, are you at the Bad, are you at the village? Honestly, Honestly, I Honestly, I kind Honestly, I kind of Honestly, I kind of want Honestly, I kind of want to Honestly, I kind of want to come Honestly, I kind of want to come back Honestly, I kind of want to come back and Honestly, I kind of want to come back and just Honestly, I kind of want to come back and just like Honestly, I kind of want to come back and just like. Honestly, I kind of want to come back and just like.. Honestly, I kind of want to come back and just like... Honestly, I kind of want to come back and just like... get get resources. Yeah, Yeah, I- I'm I'm heading I'm heading back I'm heading back there I'm heading back there right I'm heading back there right now. I'm heading back there right now. I'm I'm gonna I'm gonna try I'm gonna try and I'm gonna try and get I'm gonna try and get us I'm gonna try and get us some I'm gonna try and get us some uh some some more some more food. some more food. I I will I will focus I will focus on I will focus on collecting I will focus on collecting all I will focus on collecting all the I will focus on collecting all the wheat. I will focus on collecting all the wheat. Yo! Oh, Oh, what's Oh, what's up, Oh, what's up, Baablu? Oh, what's up, Baablu? There There is There is no There is no more There is no more food There is no more food at There is no more food at the There is no more food at the village There is no more food at the village though, There is no more food at the village though, so There is no more food at the village though, so. There is no more food at the village though, so.. There is no more food at the village though, so... There is no more food at the village though, so... Oh, Oh, okay. Oh, okay. Yeah, Yeah, all Yeah, all the- all all the all the wheat's all the wheat's gone. all the wheat's gone. Oh, Oh, okay. He He didn't He didn't pick He didn't pick up He didn't pick up any He didn't pick up any of He didn't pick up any of your He didn't pick up any of your food. I'm- I'm I'm back I'm back at I'm back at your I'm back at your loot. I I picked I picked up I picked up some- Oh, some Oh, nice! some stuff. some stuff. And And I'm And I'm just And I'm just going And I'm just going to And I'm just going to kill And I'm just going to kill some And I'm just going to kill some pigs. And I'm just going to kill some pigs. Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, well. Oh, well. Oh, well. Oh, well. Oh, well. Oh, well. Oh, well. Oh, well. Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- Oh, I- I I I I I I I I might I might I might I might I might I might I might I might I might have I might have I might have I might have I might have I might have I might have I might have I might have seen I might have seen I might have seen I might have seen I might have seen I might have seen I might have seen I might have seen I might have seen him, I might have seen him, I might have seen him, I might have seen him, I might have seen him, I might have seen him, I might have seen him, I might have seen him, I might have seen him, actually. I might have seen him, actually. I might have seen him, actually. I might have seen him, actually. I might have seen him, actually. I might have seen him, actually. I might have seen him, actually. I might have seen him, actually. I might have seen him, actually. He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- He's- he's he's going he's going he's going he's going he's going up he's going up he's going up he's going up he's going up a he's going up a he's going up a he's going up a he's going up a mountain. he's going up a mountain. he's going up a mountain. he's going up a mountain. he's going up a mountain. he's going up a mountain. he's going up a mountain. It's It's not It's not too It's not too much. It's It's like- it's it's like maybe maybe 100 maybe 100 blocks maybe 100 blocks away maybe 100 blocks away from maybe 100 blocks away from the- from from the from the island from the island bed. Just Just trying Just trying to Just trying to get Just trying to get us Just trying to get us more Just trying to get us more food so so we so we have so we have plenty so we have plenty of so we have plenty of food. so we have plenty of food. Hey, Hey, you Hey, you guys. Hey, you guys. Hey! Did Hey. Did you Did you miss Did you miss me? Did you miss me? So So. So.. So... So... No, No, I Kind No, I. No, I.. Kind of No, I... Kind of. Kind of.. No, I... Not Kind of... Kind of... Kind of... Not really. I I mean, I mean, no. I mean, no. What Yeah, What the Yeah, no, What the hell What the hell is Yeah, no, no. What the hell is wrong What the hell is wrong with What the hell is wrong with you What the hell is wrong with you guys? You You can You can be You can be a You can be a little You can be a little nice You can be a little nice to You can be a little nice to me You can be a little nice to me even You can be a little nice to me even though You can be a little nice to me even though we're You can be a little nice to me even though we're competing You can be a little nice to me even though we're competing against You can be a little nice to me even though we're competing against each You can be a little nice to me even though we're competing against each other. You [scoffs] You can You can be You can be kind. You can be kind. Ow! Ow! Ow! Ow! Ow! Ow! Ow! Ow! Ow! Ow! Ow! [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Baablu! Baablu! Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Wait, Wait, Wait, Get Get him. Wait, why Wait, why Wait, why Wait, why Wait, why Wait, why did Wait, why did Wait, why did Wait, why did Wait, why did Wait, why did that Wait, why did that Wait, why did that Wait, why did that Wait, why did that Wait, why did that do Wait, why did that do Wait, why did that do Wait, why did that do Wait, why did that do Wait, why did that do actually Wait, why did that do actually Wait, why did that do actually Wait, why did that do actually Wait, why did that do actually Wait, why did that do actually so Wait, why did that do actually so Wait, why did that do actually so Wait, why did that do actually so Wait, why did that do actually so Wait, why did that do actually so much Wait, why did that do actually so much Wait, why did that do actually so much Wait, why did that do actually so much Wait, why did that do actually so much Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? Wait, why did that do actually so much damage? [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] N N No, No, No, n No, no, No, no, No, no, No, no, No, no, No, no, n No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! No, no, no! Oh, Oh, oh, Oh, oh, oh! Oh, oh, oh! Oh Oh my Oh my god! Just Just run, Oh Just run, just Oh my Just run, just run. Oh my god! Oh my god! I'm I'm I'm I'm I'm g I'm go I'm goo I'm good, I'm good, I'm good, I'm good, I'm good, I'm I'm good, I'm I'm good, I'm I'm good, I'm I'm good, I'm I'm good, I'm I'm good, I'm I'm good, I'm g I'm good, I'm go I'm good, I'm goo I'm good, I'm good, I'm good, I'm good, I'm good, I'm good, I'm good, I'm good, I'm good, I'm good, I'm I'm good, I'm good, I'm I'm good, I'm good, I'm I'm good, I'm good, I'm I'm good, I'm good, I'm I'm good, I'm good, I'm I'm good, I'm good, I'm I'm good, I'm good, I'm g I'm good, I'm good, I'm go I'm good, I'm good, I'm goo I'm good, I'm good, I'm good. I'm good, I'm good, I'm good. I'm good, I'm good, I'm good. I'm good, I'm good, I'm good. I'm good, I'm good, I'm good. I'm good, I'm good, I'm good. Half No, Half my No, I- Half my health Half my health was Half my health was gone. yeah. yeah. Yeah, Yeah, I'm Yeah, I'm going Yeah, I'm going to Yeah, I'm going to just Yeah, I'm going to just run Yeah, I'm going to just run straight Yeah, I'm going to just run straight line Yeah, I'm going to just run straight line towards Yeah, I'm going to just run straight line towards you. I'll I'll get I'll get any I'll get any food I'll get any food we Okay. I'll get any food we need I'll get any food we need on I'll get any food we need on the I'll get any food we need on the way. I'll get any food we need on the way. Are Are you Are you kind Are you kind of Are you kind of low Are you kind of low Dream? Are you kind of low Dream? Why Why would Why would I Why would I be Why would I be low? Why would I be low? Might Might have Might have hit Might have hit you Might have hit you with Might have hit you with a Might have hit you with a stone Might have hit you with a stone sword Might have hit you with a stone sword a Might have hit you with a stone sword a little Might have hit you with a stone sword a little bit or or actually or actually your or actually your friend. or actually your friend. He He must He must have He must have healed He must have healed very He must have healed very quickly He must have healed very quickly then. He must have healed very quickly then. Okay, Okay, I Okay, I cooked Okay, I cooked up Okay, I cooked up a Okay, I cooked up a lot Okay, I cooked up a lot of Okay, I cooked up a lot of food. Well, Well, not Well, not a Well, not a lot but but a but a good but a good amount. but a good amount. Wow, Wow, Wow, Wow, Wow, Wow, Wow, Wow, Wow, you Wow, you Wow, you Wow, you Wow, you Wow, you Wow, you Wow, you Wow, you guys Wow, you guys Wow, you guys Wow, you guys Wow, you guys Wow, you guys Wow, you guys Wow, you guys Wow, you guys went Wow, you guys went Wow, you guys went Wow, you guys went Wow, you guys went Wow, you guys went Wow, you guys went Wow, you guys went Wow, you guys went really Wow, you guys went really Wow, you guys went really Wow, you guys went really Wow, you guys went really Wow, you guys went really Wow, you guys went really Wow, you guys went really Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Wow, you guys went really far. Oh Oh. Oh.. Oh... Oh... Oh... They They went They went this They went this direction? They went this direction? Yeah, Yeah, there Yeah, there is Yeah, there is a Yeah, there is a shipwreck Yeah, there is a shipwreck here. I I wonder I wonder if I wonder if they I wonder if they got I wonder if they got it? They They actually They actually could I'm I'm going They actually could have, They actually could have, yeah. I'm going to I'm going to check I'm going to check this I'm going to check this shipwreck. I'm going to check this shipwreck. Oh Oh yeah, Oh yeah, they Oh yeah, they looted Oh yeah, they looted it. Oh yeah, they looted it. The The shipwreck The shipwreck is The shipwreck is gone. The shipwreck is gone. It's- Oh I Oh my I think I think they I think they only Oh my god. I think they only got I think they only got the I think they only got the food I think they only got the food half I think they only got the food half though. I think they only got the food half though. I I don't I don't see I don't see him but but he but he was but he was definitely but he was definitely close but he was definitely close to but he was definitely close to this but he was definitely close to this spot. but he was definitely close to this spot. Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh, Oh, I Oh, I see Oh, I see him. He's He's in He's in the He's in the ocean He's in the ocean again. He's in the ocean again. He's He's in He's in the He's in the ocean. He's in the ocean. Now Now he's Now he's on- he's he's on- he's he's on he's on land. He's He's like, He's like, in He's like, in the He's like, in the jungle He's like, in the jungle biome He's like, in the jungle biome to He's like, in the jungle biome to the He's like, in the jungle biome to the left He's like, in the jungle biome to the left of He's like, in the jungle biome to the left of the He's like, in the jungle biome to the left of the shipwreck. He's like, in the jungle biome to the left of the shipwreck. I'm I'm doing I'm doing insane I'm doing insane parkour Hmm I'm doing insane parkour to Hmm. Hmm.. I'm doing insane parkour to get Hmm... I'm doing insane parkour to get to Hmm... Hmm... I'm doing insane parkour to get to him. I'm doing insane parkour to get to him. Oh, Oh, I Oh, I see Oh, I see you. Oh, I see you. I I see I see you. I see you. Okay. Okay. Okay. Okay. Nice. Nice. Okay. Stone Stone shovel, Uh Uh. Uh.. Uh... Stone shovel, but Uh... Stone shovel, but. Stone shovel, but.. Stone shovel, but... Stone shovel, but... I I will I will drop I will drop you I will drop you some- some some things some things right some things right now, some things right now, real some things right now, real quick. some things right now, real quick. Okay. Okay. They're They're right They're right up They're right up here. They're right up here. I I hit I hit him- I hit him- Oh, Oh, nice. Nice. Nice. There There we There we go. There we go. Thank Thank you. Thank you. Okay, Okay, nice. Okay, nice. Stop Stop hiding. Stop hiding. We'll We'll find We'll find you We'll find you eventually. We'll find you eventually. You You can You can be You can be as You can be as sneaky You can be as sneaky as You can be as sneaky as you You can be as sneaky as you want but but we're but we're going but we're going to but we're going to be but we're going to be right but we're going to be right behind but we're going to be right behind you but we're going to be right behind you all but we're going to be right behind you all the but we're going to be right behind you all the time. but we're going to be right behind you all the time. Nice. Nice. Oh Oh my Oh my god. I I thought I thought you I thought you took I thought you took fall I thought you took fall damage. I thought you took fall damage. We're We're not We're not too We're not too far We're not too far from We're not too far from you! We're not too far from you! Ooh Come Ooh. Ooh.. Come here. Ooh... Ooh... Ooh... Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at that! Oh, look at that! Oh, look at that! Oh, look at that! Oh, look at that! Oh, look at that! Oh, look at that! Oh, look at that! Oh, look at that! Oh, look at that! It's It's a It's a new It's a new little It's a new little pink It's a new little pink guy. It's a new little pink guy. Oh Oh my Oh my god. Oh my god. I Slow I. Slow down, I.. I... Slow down, we Slow down, we just Slow down, we just wanna Slow down, we just wanna. Slow down, we just wanna.. Slow down, we just wanna... Slow down, we just wanna... talk. talk. Yeah Yeah. Yeah.. Yeah... Yeah... Yeah... He's He's He's He's He's He's getting He's getting He's getting He's getting He's getting He's getting He's getting He's getting He's getting a He's getting a He's getting a He's getting a He's getting a He's getting a He's getting a He's getting a He's getting a dolphin He's getting a dolphin He's getting a dolphin He's getting a dolphin He's getting a dolphin He's getting a dolphin He's getting a dolphin He's getting a dolphin [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] he's he's he's he's getting he's getting he's getting he's getting he's getting he's getting he's getting a he's getting a he's getting a he's getting a he's getting a he's getting a he's getting a dolphin, he's getting a dolphin, he's getting a dolphin, he's getting a dolphin, he's getting a dolphin, he's getting a dolphin, he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! he's getting a dolphin, please! Are Are Are Are Are Are Are Are Are Are Are Are Are Are Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Oh, come Oh, come Oh, come Oh, come Oh, come Oh, come Oh, come Oh, come Oh, come Oh, come Oh, come Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Are you kidding Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Oh, come on. Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Are you kidding me?! Okay, Okay, wait, Okay, wait, wait why why is why is it why is it not why is it not. why is it not.. why is it not... why is it not... why is it not... Fast Fast at Fast at all? [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Wait, Wait, why Wait, why are Wait, why are we Wait, why are we still Wait, why are we still catching Oh Oh my Wait, why are we still catching up? Oh my god. Oh my god. Oh, Oh, my How How are Oh, my goodness How are you- we we got we got it I'm I'm like we got we got him. I'm like getting- Hey Oh, Oh, this Oh, this is Hey Baablu! Oh, this is it Glitched this this is this is it. Glitched now. Glitched now. [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Come Come Come on. Come here! Come here! Oh, Oh Oh my Oh, you're Oh my god. Oh, you're so Oh, you're so close. Oh, you're so close. Oh Yeah, Yeah, get Yeah, get back Yeah, get back in Oh my Yeah, get back in your Yeah, get back in your boat. Get N N N No, No, No, Oh my god, Get back No, n No, n No, no, No, no, No, no, No, no, No, no, No, no, Get back in Get back in your No, no, n No, no, no. No, no, no. No, no, no. No, no, no. No, no, no. No, no, no. No, no, no. Oh my god, bro. Get back in your little Get back in your little boat. Get back in your little boat. Here, Yeah, Oh. Here, here, Here, here, get Yeah, yeah, Here, here, get in, Here, here, get in, get Yeah, yeah, yeah. Here, here, get in, get in. Here, here, get in, get in. [sighs] Alright. Alright. What What What What What What What What What What What What What What What What Oh, Oh, you What is What is What is What is What is What is What is What is What is What is What is What is What is What is What is What is What is What is What is What is What is Oh, you lost What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this What is this Oh, you lost your What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! What is this tactic?! Oh, you lost your boat! Oh, you lost your boat! [hisses] [hisses] Oh, Oh, come Oh, come on. Oh, come on. B B Be c Be ca Be care Be carefu Be careful, Be careful, b Be careful, be Be careful, be Be careful, be Be careful, be Be careful, be c Be careful, be ca Be careful, be care Be careful, be carefu Be careful, be careful, Be careful, be careful, b Be careful, be careful, be Be careful, be careful, be Be careful, be careful, be Be careful, be careful, be Be careful, be careful, be c Be careful, be careful, be ca Be careful, be careful, be car Be careful, be careful, be care Be careful, be careful, be caref Be careful, be careful, be carefu Be careful, be careful, be careful. Be careful, be careful, be careful. Ooh! Ooh! B B B Be c Be ca Be car Be caref Be carefu Be careful, b Be careful, be Be careful, be Be careful, be Be careful, be Be careful, be c Be careful, be ca Be careful, be car Be careful, be caref Be careful, be carefu Be careful, be careful, b Be careful, be careful, be Be careful, be careful, be Be careful, be careful, be Be careful, be careful, be Be careful, be careful, be c Be careful, be careful, be ca Be careful, be careful, be car Be careful, be careful, be care Be careful, be careful, be caref Be careful, be careful, be carefu Be careful, be careful, be careful! Be careful, be careful, be careful! Oh Oh Oh Oh Oh Oh, Oh, we Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh, we got Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh, we got him. Oh my god! Wait Oh my god! Wait Oh my god! Wait Oh my god! Wait Oh my god! Wait Oh my god! Wait Oh my god! Wait Oh my god! Wait why why why why why why does why does why does why does why does why does why does why does why does why does Ooh Ooh Ooh Ooh Ooh Ooh Ooh Ooh Careful. why does that why does that why does that why does that why does that why does that why does that why does that why does that why does that why does that thing why does that thing why does that thing why does that thing why does that thing why does that thing why does that thing why does that thing why does that thing why does that thing Ooh my Ooh my Ooh my Ooh my Ooh my Ooh my Ooh my Ooh my why does that thing do why does that thing do why does that thing do why does that thing do why does that thing do why does that thing do why does that thing do why does that thing do why does that thing do why does that thing do why does that thing do so why does that thing do so why does that thing do so why does that thing do so why does that thing do so why does that thing do so why does that thing do so why does that thing do so why does that thing do so why does that thing do so Ooh my god! Ooh my god! Ooh my god! Ooh my god! Ooh my god! Ooh my god! Ooh my god! Ooh my god! Ooh my god! Ooh my god! why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! why does that thing do so much damage?! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Come What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! What?! Come on! Come on! Oh, Oh, he's Oh, he's like Oh, he's like one Oh, he's like one hit, Oh, he's like one hit, come Oh, he's like one hit, come on. Oh, he's like one hit, come on. There's There's no There's no way! There's no way! He's He's so He's so cooked. He's so cooked. Your Your little- your your friend your friend Baablu your friend Baablu just your friend Baablu just wanted your friend Baablu just wanted to- your friend Baablu just wanted to- Uh, Uh, kill Uh, kill us! Uh, kill us! Yeah, Yeah, we Yeah, we just Yeah, we just wanted Yeah, we just wanted to Yeah, we just wanted to hang That's Yeah, we just wanted to hang out That's it! Yeah, we just wanted to hang out and Yeah, we just wanted to hang out and have Yeah, we just wanted to hang out and have a Yeah, we just wanted to hang out and have a talk Yeah, we just wanted to hang out and have a talk and Yeah, we just wanted to hang out and have a talk and. Yeah, we just wanted to hang out and have a talk and.. Yeah, we just wanted to hang out and have a talk and... Yeah, Yeah, I Yeah, I mean Ooh, he Ooh, a he just he just like Ooh, a shipwreck. he just like. he just like.. he just like... he just like... Attacked! Attacked! Oh Oh no, Oh no, you're Oh no, you're not Oh no, you're not getting Oh no, you're not getting that. Oh no, you're not getting that. Oh, Oh, bye Oh, bye boat! No, No, No, No, No, No, No, you're No, you're No, you're No, you're No, you're No, you're No, you're No, you're No, you're really No, you're really No, you're really No, you're really No, you're really No, you're really No, you're really No, you're really No, you're really going No, you're really going No, you're really going No, you're really going No, you're really going No, you're really going No, you're really going No, you're really going No, you're really going for No, you're really going for No, you're really going for No, you're really going for No, you're really going for No, you're really going for No, you're really going for No, you're really going for No, you're really going for it. No, you're really going for it. No, you're really going for it. No, you're really going for it. No, you're really going for it. No, you're really going for it. No, you're really going for it. No, you're really going for it. This This is This is crazy, This is crazy, okay. This is crazy, okay. Let's Let's just, Let's just, uh Let's just, uh. Let's just, uh.. Let's just, uh... Let's just, uh... He's He's got He's got to He's got to come He's got to come up. He's got to come up. What What is What is he What is he doing? What is he doing? He's What is he doing? He's gonna What is he doing? He's gonna drown! Hey, Hey, there's Hey, there's a Hey, there's a ruin How How How did How did How did How did Hey, there's a ruin portal How did he How did he How did he How did he How did he get How did he get How did he get How did he get Hey, there's a ruin portal over How did he get a How did he get a How did he get a How did he get a How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? Hey, there's a ruin portal over to How How How How How How How Hey, there's a ruin portal over to our How did How did How did How did How did How did How did How did Hey, there's a ruin portal over to our right. How did he How did he How did he How did he How did he How did he How did he How did he How did he get How did he get How did he get How did he get How did he get How did he get How did he get How did he get How did he get a How did he get a How did he get a How did he get a How did he get a How did he get a How did he get a How did he get a How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? How did he get a boat? Hmm Hmm. Hmm.. Hmm... Hmm... [high pitched] Where [high pitched] Where did H H He He Her Here, Here, [high pitched] Where did he Here, h Here, he Here, her Here, here, Here, here, Here, here, Here, here, Here, here, [high pitched] Where did he get [high pitched] Where did he get a Here, here, h Here, here, he Here, here, her Here, here, here Here, here, here Here, here, here Here, here, here Here, here, here [high pitched] Where did he get a boat [high pitched] Where did he get a boat from? g g go t go to go to go to go to t go to the go to the go to the go to the r go to the ri go to the rig go to the righ go to the right go to the right g go t go to go to go to t go to the go to the go to the r go to the ri go to the rig go to the right. go to the right. go to the right. He He didn't He didn't have He didn't have a He didn't have a boat, He didn't have a boat, right? He didn't have a boat, right? Oh, Let's Oh, oh, Let's get Oh, oh, yeah Let's get this yeah Let's get this ruin let's Let's get this ruin portal. let's get let's get it let's get it first. Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Because Because they're Because they're kind Because they're kind of Because they're kind of stranded Because they're kind of stranded if Because they're kind of stranded if they Because they're kind of stranded if they don't Because they're kind of stranded if they don't get Because they're kind of stranded if they don't get a Because they're kind of stranded if they don't get a dolphin. True, We- We We might True, yeah, We might be We might be able True, yeah, yeah, We might be able to We might be able to get True, yeah, yeah, yeah. We might be able to get something We might be able to get something good. We might be able to get something good. Okay. Let's Let's see Let's see what Let's see what we Let's see what we got. Let's see what we got. Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, take- Oh, take- Oh, take- Oh, take- Oh, take- Oh, take- Oh, take- Oh, take- Oh, take- Oh, take- Oh, take- Ooh! Ooh! Ooo, take take take that take that take that take that take that take that chest take that chest take that chest take that chest take that chest Oooo, take that chest plate! take that chest plate! take that chest plate! take that chest plate! take that chest plate! take that chest plate! take that chest plate! Oooo, oo, Oooo, ooo, Oooo, oooo, Oooo, ooooo, Oooo, ooooo, oo Um Oooo, ooooo, ooo Um. Oooo, ooooo, oooo Um.. Oooo, ooooo, ooooo Um... Oooo, ooooo, ooooo oh oh wait this We'll this is We'll take this is actually We'll take this. this is actually good this is actually good loot! this is actually good loot! Wait, Wait, this Wait, this is O O Ok Ok Oka Okay, Okay, Okay, Wait, this is actually Okay, o Okay, ok Okay, oka Okay, okay! Okay, okay! Okay, okay! Okay, okay! Okay, okay! Okay, okay! Wait, this is actually so Wait, this is actually so good! Wait, this is actually so good! Oh Oh my Oh my god that's that's actually that's actually so that's actually so good that's actually so good that that's actually so good that we that's actually so good that we got that's actually so good that we got that. that's actually so good that we got that. You You can You can uh You can uh. You can uh.. You can uh... You can uh... Go Go to Go to that Go to that Mooshroom Go to that Mooshroom Island. I I hear I hear there's I hear there's stuff I hear there's stuff there. I hear there's stuff there. [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] I'm Oh, Oh, [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Oh, my Oh, my Oh, my Oh, my I'm gonna Oh, my god. Oh, my god. Oh, my god. Oh, my god. Oh, my god. Oh, my god. Oh, my god. I'm gonna try- I'm I'm gonna I'm gonna try I'm gonna try and I'm gonna try and get I'm gonna try and get in I'm gonna try and get in his I'm gonna try and get in his boat. I'm gonna try and get in his boat. Oh, Oh, yes. Oh, yes. Come Well Well. Come here. Well.. Well... Well... Well... [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Yes! Yes! Oh, Oh, Oh, Oh, Oh, Oh, Wait, Wait, what? Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! I Oh, fudge! I Oh, fudge! I Oh, fudge! I Oh, fudge! I Oh, fudge! I Oh, fudge! I Oh, fudge! I Oh, fudge! I did Oh, fudge! I did Oh, fudge! I did Oh, fudge! I did Oh, fudge! I did Oh, fudge! I did Oh, fudge! I did Oh, fudge! I did Um- Oh, fudge! I did not Oh, fudge! I did not Oh, fudge! I did not Oh, fudge! I did not Oh, fudge! I did not Oh, fudge! I did not Oh, fudge! I did not Oh, fudge! I did not Oh, fudge! I did not think Oh, fudge! I did not think Oh, fudge! I did not think Oh, fudge! I did not think Oh, fudge! I did not think Oh, fudge! I did not think Oh, fudge! I did not think Oh, fudge! I did not think Oh, fudge! I did not think he Oh, fudge! I did not think he Oh, fudge! I did not think he Oh, fudge! I did not think he Oh, fudge! I did not think he Oh, fudge! I did not think he Oh, fudge! I did not think he Oh, fudge! I did not think he Oh, fudge! I did not think he would Oh, fudge! I did not think he would Oh, fudge! I did not think he would Oh, fudge! I did not think he would Oh, fudge! I did not think he would Oh, fudge! I did not think he would Oh, fudge! I did not think he would Oh, fudge! I did not think he would Are- are are you Oh, fudge! I did not think he would do Oh, fudge! I did not think he would do Oh, fudge! I did not think he would do Oh, fudge! I did not think he would do Oh, fudge! I did not think he would do Oh, fudge! I did not think he would do Oh, fudge! I did not think he would do Oh, fudge! I did not think he would do are you good? Are Oh, fudge! I did not think he would do that! Oh, fudge! I did not think he would do that! Oh, fudge! I did not think he would do that! Oh, fudge! I did not think he would do that! Oh, fudge! I did not think he would do that! Oh, fudge! I did not think he would do that! Oh, fudge! I did not think he would do that! Oh, fudge! I did not think he would do that! Are you Are you good? Are you good? Y Y Ye Yea Yeah, Yeah, y Yeah, ye Yeah, yea Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, y Yeah, yeah, ye Yeah, yeah, yea Yeah, yeah, yeah, Yeah, yeah, yeah, Yeah, yeah, yeah, Yeah, yeah, yeah, Yeah, yeah, yeah, y Yeah, yeah, yeah, ye Yeah, yeah, yeah, yea Yeah, yeah, yeah, yeah, Yeah, yeah, yeah, yeah, Yeah, yeah, yeah, yeah, Yeah, yeah, yeah, yeah, Yeah, yeah, yeah, yeah, y Yeah, yeah, yeah, yeah, ye Yeah, yeah, yeah, yeah, yea Yeah, yeah, yeah, yeah, yeah. Yeah, yeah, yeah, yeah, yeah. Yeah, yeah, yeah, yeah, yeah. Yeah, yeah, yeah, yeah, yeah. Yeah, yeah, yeah, yeah, yeah. Yeah, yeah, yeah, yeah, yeah. I I didn't I didn't think I didn't think he I didn't think he would I didn't think he would hit I didn't think he would hit me I didn't think he would hit me immediately. You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both You're both Oh Oh Oh Oh Oh Oh Oh Oh Oh [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna You're both gonna Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, Oh fudge, You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! You're both gonna die! Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Oh fudge, he's below Ow! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! Oh fudge, he's below us! What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What the What Oh Oh Oh Oh Oh Oh Oh Oh What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the fudge?! What the What the. Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my What the.. What the... Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! What the... What the... [[[confused]] [[confused]] Muffin? Run, Run, Run, Run, Run, Run, Run, Run, Come I'm I'm I'm I'm I'm I'm Run, just Run, just Run, just Run, just Run, just Run, just Run, just Run, just Run, just Run, just I'm holding I'm holding I'm holding I'm holding I'm holding I'm holding I'm holding I'm holding Come here! I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my Run, just run Run, just run Run, just run Run, just run Run, just run Run, just run Run, just run Run, just run Run, just run Run, just run Run, just run I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! just just just just go, just go, just go, just go, just go, I'm I'm I'm I'm I'm I'm I'm I'm just go, go, just go, go, just go, go, just go, go, just go, go, just go, go, go! just go, go, go! just go, go, go! just go, go, go! just go, go, go! just go, go, go! just go, go, go! I'm holding I'm holding I'm holding I'm holding I'm holding I'm holding I'm holding I'm holding I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my I'm holding my Just Just run! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! I'm holding my shield! [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Go Go straight Go straight up! Go straight up! Get Get Get Get Get Get You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're You're Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! Get in, Get in, Get in, Get in, Get in, Get in, Get in, Get in, You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too You're too Get in, get Get in, get Get in, get Get in, get Get in, get Get in, get Get in, get Get in, get Get in, get in! Get in, get in! Get in, get in! Get in, get in! Get in, get in! Get in, get in! Get in, get in! Get in, get in! Go! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! You're too slow! Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, What What What What What What What What What What What What What What What What What What What What What What What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are What are Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Bye What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you What are you Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Bye bye! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! What are you doing?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! Oh, what the fudge?! Run! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Just Oh Oh my Just swim! Oh my god! Just Just go! N N N No, No, No, No, No, No, No, n No, no, No, no, No, no, No, no, No, no, No, no, No, no, No, no, No, no, I'm I'm going! A Al Alr Alri Alrig Alrigh Alright, I'm I No, no, n No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no I'm going! I have Alright, I'm Alright, I'm Alright, I'm Alright, I'm Alright, I'm Alright, I'm Alright, I'm Alright, I'm I have a Alright, I'm c Alright, I'm co Alright, I'm com Alright, I'm comi Alright, I'm comin Alright, I'm coming Alright, I'm coming Alright, I'm coming I have a dolphin! Alright, I'm coming b Alright, I'm coming ba Alright, I'm coming bac Alright, I'm coming back Alright, I'm coming back Alright, I'm coming back Alright, I'm coming back Alright, I'm coming back [[[quickly]] [[quickly]] no, no, no! I I have I'm c I'm coming b I'm coming ba I'm coming back! I'm coming back! I have a I have a dolphin! Oh I I have I have a Oh no! I have a dolphin! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] N Ni Nic Nice, Nice, n Nice, ni Nice, nic Nice, nice, Nice, nice, Nice, nice, Nice, nice, [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Nice, nice, n Nice, nice, ni Nice, nice, nic Nice, nice, nice! Nice, nice, nice! Nice, nice, nice! Nice, nice, nice! Nice, nice, nice! Okay, Okay, just Okay, just swim Okay, just swim away just just swim just swim away. Ohh Ohh Ohh Ohh Ohh Ohh Ohh Ohh Ohhh Ohhh Ohhh Ohhh Ohhh Ohhh Ohhh Ohhh Ohhhh Ohhhh Ohhhh Ohhhh Ohhhh Ohhhh Ohhhh Ohhhh Let's Ohhhh Ohhhh myy Ohhhh myy Ohhhh myy Ohhhh myy Ohhhh myy Ohhhh myy Ohhhh myy Ohhhh myy Let's just Let's just get Ohhhh myyy Ohhhh myyy Ohhhh myyy Ohhhh myyy Ohhhh myyy Ohhhh myyy Ohhhh myyy Ohhhh myyy Let's just get away. Ohhhh myyyy Ohhhh myyyy Ohhhh myyyy Ohhhh myyyy Ohhhh myyyy Ohhhh myyyy Ohhhh myyyy Ohhhh myyyy Ohhhh myyyy godd! Ohhhh myyyy godd! Ohhhh myyyy godd! Ohhhh myyyy godd! Ohhhh myyyy godd! Ohhhh myyyy godd! Ohhhh myyyy godd! Ohhhh myyyy godd! Ohhhh myyyy goddd! Ohhhh myyyy goddd! Ohhhh myyyy goddd! Ohhhh myyyy goddd! Ohhhh myyyy goddd! Ohhhh myyyy goddd! Ohhhh myyyy goddd! Ohhhh myyyy goddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Ohhhh myyyy godddd! Oh Oh my Oh my gosh. Oh my gosh. That That was That was vicious. I I was I was so I was so low! I was so low! He He didn't He didn't even He didn't even wanna He didn't even wanna hang He didn't even wanna hang out He didn't even wanna hang out or He didn't even wanna hang out or anything. That No! That was That was crazy. That That was- that that was that was so that was so rude! that was so rude! Ooh, Ooh, I Ooh, I found Ooh, I found a Ooh, I found a shipwreck. Ooh, I found a shipwreck. I'm I'm gonna- Oh, I'll Oh, yeah, I'll loot Oh, yeah, yeah, I'll loot it. Oh, yeah, yeah, yeah. Oh, yeah, yeah, yeah. Where Hey Hey. Hey.. Where are Hey... Hey... Where are you? Where are you? Your Your worst Your worst enemies Your worst enemies are Your worst enemies are coming Your worst enemies are coming over! Your worst enemies are coming over! Well, Well, we're Well, we're at Well, we're at a Well, we're at a mooshroom Well, we're at a mooshroom biome Well, we're at a mooshroom biome like thousands thousands of thousands of blocks thousands of blocks from thousands of blocks from spawn. That's That's kind That's kind of That's kind of stupid. That's kind of stupid. Uh, Uh, should Uh, should we Uh, should we make Uh, should we make leather Uh, should we make leather armor? I I guess I guess we I guess we could. I guess we could. I I just I just need I just need a I just need a helmet. I just need a helmet. [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Oh Oh god. What's What's up, What's up, Dream? What's up, Dream? Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! Ahh! [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] T T T Th Th Thi Thi Hello! This i This is This is This is This is This is This is This is This is u This is un This is unfo This is unfor This is unfortu This is unfortunate! This is unfortunate! This is unfortunate! Oh, Oh, come Oh, come on. Oh, come on. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Okay, Oh, Okay, yo, Oh, you're Hey, Oh, you're having Okay, yo, what's Oh, you're having a Hey, Baablu! Oh, you're having a. Oh, you're having a.. Okay, yo, what's up Oh, you're having a... Oh, you're having a... [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Hello! Hello! Hello! Hello! Hello! Hello! Hello! Hello! Okay, yo, what's up guys? Yo! Hello, Hello, hey! Hello, hey! [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [high pitched] What's [high pitched] What's up, What's [high pitched] What's up, Baablu? What's going What's going on? What's going on? You You don't You don't want You don't want to You don't want to slow You don't want to slow down You don't want to slow down or You don't want to slow down or anything? You don't want to slow down or anything? Whoa! Whoa! Whoa! Whoa! Whoa! Whoa! Whoa! Whoa! Whoa! Oh, Oh, be Oh, be careful, Oh, be careful, be Oh, be careful, be careful. Oh, Oh, wow, Oh, wow, that's Oh, wow, that's. Oh, wow, that's.. Oh, wow, that's... Oh, wow, that's... I I just I just realized I just realized that's I just realized that's. I just realized that's.. I just realized that's... I just realized that's... I just realized that's... Oh Oh my Oh my god wait yeah rod rod him rod rod him, rod him, rod rod him, rod him. rod him, rod him. [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Nice. Nice. I Come I don't Come here! I don't wanna I don't wanna. I don't wanna.. I don't wanna... I don't wanna... I I don't I don't wanna I don't wanna die. I don't wanna die. I- yeah, yeah, I yeah, I do yeah, I do not yeah, I do not have yeah, I do not have a yeah, I do not have a shield yeah, I do not have a shield to yeah, I do not have a shield to stay yeah, I do not have a shield to stay on yeah, I do not have a shield to stay on him. yeah, I do not have a shield to stay on him. Uh, Uh, I Uh, I can Uh, I can make Uh, I can make you Uh, I can make you a Uh, I can make you a shield Uh, I can make you a shield real Uh, I can make you a shield real quick. Wait, Wait, I'm Wait, I'm gonna Wait, I'm gonna make Wait, I'm gonna make you Wait, I'm gonna make you a Wait, I'm gonna make you a shield. Wait, I'm gonna make you a shield. H Her Here, h Here, he Here, here, Here, here, Here, here, Here, here, h Here, here, he Here, here, her Here, here, here. Here, here, here. Here, here, here. Here, here, here. Here, here, here. Thank Thank you, Thank you, thank Thank you, thank you. Thank you, thank you. Why Why hello. Why hello. Oh, Oh, Oh, hello, Oh, hey Oh, hey guys. Oh, hello, Baablu! Oh, hello, Baablu! It It was It was nice It was nice seeing It was nice seeing you. [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Oh Okay. Oh my Oh my god, Oh my god, be Oh my god, be careful. Oh my god, be careful. Trying Trying to Trying to lava Trying to lava us Trying to lava us that Trying to lava us that quickly? [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] What's What's Oh, What's wrong What's wrong What's wrong What's wrong What's wrong What's wrong with What's wrong with What's wrong with What's wrong with What's wrong with What's wrong with that? What's wrong with that? What's wrong with that? What's wrong with that? What's wrong with that? What's wrong with that? What's wrong with that? Oh, that's Oh, that's devious. Oh, Oh, you Oh, you know Oh, you know what Oh, you know what he's Oh, you know what he's doing? He's He's waiting He's waiting for He's waiting for his He's waiting for his good He's waiting for his good friend, He's waiting for his good friend, Dream! Oh, Oh, look There Oh, look who There he Oh, look who it There he is! Oh, look who it is. Uh, Uh, let's Uh, let's see. Uh, let's see. No No way No way the No way the only No way the only thing No way the only thing they No way the only thing they have No way the only thing they have is No way the only thing they have is a No way the only thing they have is a. No way the only thing they have is a.. No way the only thing they have is a... No way the only thing they have is a... A A gold A gold sword. Yeah, Yeah, they're- they're they're cooked. Well. Well. [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! I Oh my god! I Oh my god! I Oh my god! I Oh my god! I Oh my god! I Oh my god! I Oh my god! I Oh. Oh my god! I did Oh my god! I did Oh my god! I did Oh my god! I did Oh my god! I did Oh my god! I did Oh my god! I did Oh my god! I did Oh my god! I did not Oh my god! I did not Oh my god! I did not Oh my god! I did not Oh my god! I did not Oh my god! I did not Oh my god! I did not Oh my god! I did not Oh my god! I did not see Oh my god! I did not see Oh my god! I did not see Oh my god! I did not see Oh my god! I did not see Oh my god! I did not see Oh my god! I did not see Oh my god! I did not see Oh my god! I did not see that Oh my god! I did not see that Oh my god! I did not see that Oh my god! I did not see that Oh my god! I did not see that Oh my god! I did not see that Oh my god! I did not see that Oh my god! I did not see that Oh my god! I did not see that cliff! Oh my god! I did not see that cliff! Oh my god! I did not see that cliff! Oh my god! I did not see that cliff! Oh my god! I did not see that cliff! Oh my god! I did not see that cliff! Oh my god! I did not see that cliff! Oh my god! I did not see that cliff! No No way. No way. Seriously Seriously. Seriously.. Seriously... Seriously... Seriously... Is Is the Is the portal Is the portal complete? I I can't I can't tell. Um Um. Um.. Um... Um... I I hope I hope it's I hope it's not I hope it's not complete I hope it's not complete. I hope it's not complete.. I hope it's not complete... I hope it's not complete... Mmm Mmm. Mmm.. Mmm... Mmm... Mmm... Oh, Oh, Oh, come Oh, come on. Oh, it's Oh, it's not. No, No, it No, it is [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] No, it is not. No, it is not. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. Oh, look at that. No, No, you No, you don't. No, No, you No, you don't. No, you don't. You You know You know what Bad? Bad? Should Bad? Should I- [sighs] Should [sighs] Should I [sighs] Should I do [sighs] Should I do it [sighs] Should I do it to [sighs] Should I do it to him [sighs] Should I do it to him and [sighs] Should I do it to him and place [sighs] Should I do it to him and place an [sighs] Should I do it to him and place an obsidian [sighs] Should I do it to him and place an obsidian in [sighs] Should I do it to him and place an obsidian in the [sighs] Should I do it to him and place an obsidian in the middle? [sighs] Should I do it to him and place an obsidian in the middle? [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] Y Y Ye Ye Yes, Yes, Yes, Yes, Yes, Yes, Yes, Yes, Yes, Yes, y Yes, ye Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Yes, yes, Okay, W Wh Whe Wher Yes, yes, y Yes, yes, ye Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Yes, yes, yes, Okay, I'm Where a Where am Where am Where am Where am Where am Okay, I'm uh- Where am I? Where am I? Where am I? Where am I? Where am I? Where am I? Where am I? Where am I? okay Oh! I'll Yes, yes, yes, y Yes, yes, yes, ye Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! Yes, yes, yes, yes! I'll go I'll go back I'll go back and I'll go back and do I'll go back and do that I'll go back and do that real I'll go back and do that real quick. I'll go back and do that real quick. Yeah, Yeah, pretty Yeah, pretty much. Yeah, pretty much. Hey, Hey, you Hey, you should Hey, you should go Hey, you should go back Hey, you should go back and Hey, you should go back and complete Hey, you should go back and complete the Hey, you should go back and complete the portal. Hey, you should go back and complete the portal. Should Should I? Should I? I I think I think I I think I might I think I might actually. I think I might actually. We'll We'll leave We'll leave you We'll leave you alone. We'll leave you alone. No, No, no, No, no, no here like we'll we'll just we'll just go we'll just go over we'll just go over here. we'll just go over here. Come Come on, Come on, Baablu we're we're being we're being so we're being so generous we're being so generous right we're being so generous right now. I'm I'm like, I'm like, this I'm like, this is I'm like, this is the I'm like, this is the best I'm like, this is the best opportunity I'm like, this is the best opportunity for I'm like, this is the best opportunity for you. You're- you're you're not you're not going you're not going to you're not going to get you're not going to get another you're not going to get another opportunity you're not going to get another opportunity like you're not going to get another opportunity like this. you're not going to get another opportunity like this. Hello. Hello. Oh, Oh, Oh, Oh, Oh, Oh, Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what was Oh, what was Oh, what was Oh, what was Oh, what was Oh, what was Oh, what was Oh, what was Oh, what was I Oh, what was I Oh, what was I Oh, what was I Oh, what was I Oh, what was I Oh, what was I Oh, what was I Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh, what was I doing? Oh Oh, Oh, Oh, Oh my Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh my gosh Oh, what are Oh, what are Oh, what are Oh, what are Oh, what are Oh, what are that Oh, what are you Oh, what are you Oh, what are you Oh, what are you Oh, what are you Oh, what are you that was Oh, what are you doing? Oh, what are you doing? Oh, what are you doing? Oh, what are you doing? Oh, what are you doing? Oh, what are you doing? Oh, what are you doing? Oh, what are you doing? that was a O O O O O O Oh Oh that was a terrible Oh m Oh m Oh my Oh my Oh my Oh my Oh my Oh my that was a terrible idea. Oh my g Oh my go Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god o oh m oh my oh my oh my g oh my go oh my god oh my god oh my god [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [[[quickly]] [[panicked]] [[quickly]] oh my god! [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. Oh my gosh. We We have We have to We have to try We have to try to We have to try to like not not like I I feel I feel like I feel like if I feel like if we I feel like if we like I feel like if we like go I feel like if we like go one-on-one like like we like we just like we just like we're we're destined we're destined to we're destined to just we're destined to just die. we're destined to just die. No, No, I- I I agree. I agree. Oh, Oh, okay. Oh Oh my Oh my god. Yeah, Yeah, Yeah, Yeah, Yeah, we're Yeah, we're Yeah, we're Yeah, we're Yeah, we're Yeah, we're Yeah, we're Yeah, we're back Yeah, we're back Yeah, we're back Yeah, we're back Yeah, we're back Yeah, we're back Yeah, we're back Yeah, we're back on Yeah, we're back on Yeah, we're back on Yeah, we're back on Yeah, we're back on Yeah, we're back on Yeah, we're back on Yeah, we're back on the Yeah, we're back on the Yeah, we're back on the Yeah, we're back on the Yeah, we're back on the Yeah, we're back on the Yeah, we're back on the Yeah, we're back on the Mooshroom Yeah, we're back on the Mooshroom Yeah, we're back on the Mooshroom Yeah, we're back on the Mooshroom Yeah, we're back on the Mooshroom Yeah, we're back on the Mooshroom Yeah, we're back on the Mooshroom Yeah, we're back on the Mooshroom biome. Yeah, we're back on the Mooshroom biome. Yeah, we're back on the Mooshroom biome. Yeah, we're back on the Mooshroom biome. Yeah, we're back on the Mooshroom biome. Yeah, we're back on the Mooshroom biome. Yeah, we're back on the Mooshroom biome. Yeah, we're back on the Mooshroom biome. [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] Yeah, Yeah, I Yeah, I guess. Yeah, I guess. This This is This is kind This is kind of This is kind of stupid. This is kind of stupid. No No. No.. No... No... Where'd Where'd it Where'd it go? Where'd it go? Oh, Oh, Oh, Oh, Oh, I Oh, I Oh, I Oh, I Oh, I Oh, I Oh, I was Oh, I was Oh, I was Oh, I was Oh, I was Oh, I was Oh, I was not Oh, I was not Oh, I was not Oh, I was not Oh, I was not Oh, I was not Oh, I was not expecting Oh, I was not expecting Oh, I was not expecting Oh, I was not expecting Oh, I was not expecting Oh, I was not expecting Oh, I was not expecting that. Oh, I was not expecting that. Oh, I was not expecting that. Oh, I was not expecting that. Oh, I was not expecting that. Oh, I was not expecting that. Oh, I was not expecting that. Oh, I was not expecting that. Oh, I was not expecting that. I I was I was not I was not expecting Oh, I was not expecting that Oh, back Oh, back up. but I but I need but I need help. I I I need I need I need I need I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! I need help! [[frustrated] Oh- Oh Oh my Oh my god. Oh my god. Come Okay, Okay, I'm Come here, Okay, I'm coming Come here, Bad. Okay, I'm coming to Okay, I'm coming to help. Don't- don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. don't die. Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Come I'll- Come here. I'll I'll pop I'll pop his I'll pop his shield. I'll pop his shield. [groans] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] You You You You You You cannot You cannot You cannot You cannot You cannot You cannot You cannot You cannot You cannot fight You cannot fight You cannot fight You cannot fight You cannot fight You cannot fight You cannot fight You cannot fight You cannot fight us. You cannot fight us. You cannot fight us. You cannot fight us. You cannot fight us. You cannot fight us. You cannot fight us. You cannot fight us. You You have You have literally You have literally gold You have literally gold boots. You have literally gold boots. Oh, Oh, this Oh, this is Oh, this is going Oh, this is going to Oh, this is going to be Oh, this is going to be perfect. Oh, this is going to be perfect. Come Come on. Come on. [hisses] [hisses] [laughing] Come [laughing] Come [laughing] Come [laughing] Come [laughing] Come [laughing] Come [laughing] Come [laughing] Come [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. [laughing] Come here. You're You're mine. You're mine. Oh, Oh, what? Oh, what? Nice. Nice. Stay Stay on Stay on him. We We got We got this. We got this. [sighs] If Come Come here, [sighs] If he Come here, dolphin. [sighs] If he gets [sighs] If he gets another [sighs] If he gets another dolphin I I swear I swear if I swear if he I swear if he gets I swear if he gets another I swear if he gets another dolphin. I swear if he gets another dolphin. No No. No.. No... No... There's There's no There's no way. What? How How would How would I How would I not How would I not hit How would I not hit him? How would I not hit him? Oh! Whoa. Whoa. Hey, Hey, Baablu! Hey, Baablu! [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Hello! Ooh! I I need I need to I need to go I need to go up I need to go up right I need to go up right here. I need to go up right here. Of Of course Of course he Of course he got how how did how did he how did he get how did he get the You've how did he get the dolphin? You've gotta You've gotta be You've gotta be joking. Yo, Yo, we're Yo, we're actually Yo, we're actually doing Yo, we're actually doing circles Yo, we're actually doing circles around Yo, we're actually doing circles around this Yo, we're actually doing circles around this mushroom Yo, we're actually doing circles around this mushroom island! Yo, we're actually doing circles around this mushroom island! Isn't Isn't it Isn't it lovely? Isn't it lovely? No, No, it's No, it's not No, it's not lovely! We We just We just need We just need you We just need you guys We just need you guys dead. Oh Oh Oh Oh Oh Oh Oh Oh Oh fudge! Oh fudge! Oh fudge! Oh fudge! Oh fudge! Oh fudge! Oh fudge! Oh fudge! Oh fudge! Oh fudge! Oh fudge! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Be Be Be Be Be careful, Be careful, Be careful, Be careful, Be careful, Be careful, Be careful, be Be careful, be Be careful, be Be careful, be Be careful, be Be careful, be Be careful, be careful Be careful, be careful Be careful, be careful Be careful, be careful Be careful, be careful Be careful, be careful Be careful, be careful Be careful, be careful be be be careful, be careful, be careful, be careful, be careful, be be careful, be be careful, be be careful, be be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! be careful, be careful! Oh Oh Oh Oh Oh Oh Oh Oh Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. Oh fudge. I I I gotta I gotta I gotta I gotta I gotta I gotta back I gotta back I gotta back I gotta back I gotta back I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I gotta back up. I I gotta I gotta heal. I gotta heal. [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? What? Oh, Oh, Oh, Oh, Oh, Oh, Oh, YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! Oh, fudge! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! Are Are Are Are Are Are Are Are Are Are Are Are Are Are Are Are Are Are Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Are you Oh, Oh, I! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Are you serious?! Hey Hey Faanst, Hey Faanst, you're Hey Faanst, you're next. Oh, Oh, I Oh, I. Oh, I.. Oh, I... Oh, I... Get Get back Get back here, Get back here, bro. Get back here, bro. You You can You can take- you you have you have better you have better armor. you have better armor. I I thought I thought you- aren't aren't you aren't you better? Uh Come Uh. Come on, Come on, fight. Uh.. Uh... Fight, Uh... Uh... Fight, coward, Fight, coward, fight. Fight, coward, fight. Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Fire aspect?! Yeah, Yeah, why Yeah, why aren't Yeah, why aren't you Yeah, why aren't you fighting Yeah, why aren't you fighting then? Yeah, why aren't you fighting then? Oh, Oh, Oh, Oh, Oh, Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. Oh, god. [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] [screams] Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! Please! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! [hyperventilating] [hyperventilating] Please, Please, I Please, I beg! Please, I beg! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Yes! Yes! Oh, Oh, thank Oh, thank you Oh, thank you for Oh, thank you for swapping. He He was He was about He was about to He was about to kill He was about to kill me. He was about to kill me. Oh, Oh, now Oh, now you're Oh, now you're next. Oh, now you're next. [[mockingly] Good [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [[mockingly] Good luck. [[mockingly] Good luck. [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Ohh! Ohhh! Ohhhh! Ohhhhh! Wait, Wait, why Ohhhhhh! Wait, why am Ohhhhhhh! Wait, why am I Ohhhhhhhh! Wait, why am I not Wait, why am I not fully Wait, why am I not fully healed? Ohh! Ohhh! Ohhhh! Why Why am Ohhhhh! Why am I Ohhhhhh! Ohhhhhhh! Why am I not Ohhhhhhhh! Why am I not fully Ohhhhhhhhh! Why am I not fully healed? Ohhhhhhhhh! Ohhhhhhhhh! Hello? Hello? Oh, Oh, you're Oh, you're dead! Oh, you're dead! [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] [inhales sharply] Oh Oh god. Oh god. Are Bye Are you- Bye bye. Oh Oh. Oh.. Oh... Oh Oh... My Oh my Oh my gosh. My god My god. My god.. My god... My god... My god... Wait, Wait, is Wait, is Bad Wait, is Bad dead Wait, is Bad dead too? Wait, is Bad dead too? [tsks] [tsks] Yep. Yep. Yes. Yes. You You died? Ah, Ah, yep, Ah, yep, I [laughing] You [laughing] You [laughing] You [laughing] You [laughing] You [laughing] You [laughing] You [laughing] You [laughing] You Ah, yep, I died. [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. [laughing] You suck, dude. Oh, Oh, you Oh, you needed- you you needed you needed your you needed your best you needed your best friend you needed your best friend Dream you needed your best friend Dream to you needed your best friend Dream to do you needed your best friend Dream to do that you needed your best friend Dream to do that for you needed your best friend Dream to do that for you. I I got I got you I got you to I got you to like one one heart one heart because one heart because I one heart because I didn't one heart because I didn't have one heart because I didn't have time one heart because I didn't have time to one heart because I didn't have time to kill one heart because I didn't have time to kill you. No, No, you No, you couldn't No, you couldn't kill Uh, Uh, I No, you couldn't kill me, Uh, I would Uh, I would have No, you couldn't kill me, okay? Uh, I would have killed Uh, I would have killed you Uh, I would have killed you if Uh, I would have killed you if you Uh, I would have killed you if you didn't Uh, I would have killed you if you didn't run Uh, I would have killed you if you didn't run like Uh, I would have killed you if you didn't run like a Uh, I would have killed you if you didn't run like a coward. I I don't I don't want I don't want to I don't want to hear I don't want to hear it. I don't want to hear it. [mocking noises] [mocking noises] You You should You should go You should go back You should go back to You should go back to the- the the one the one you the one you were the one you were originally the one you were originally making. the one you were originally making. Oh Oh my Oh my god. Oh my god. Oh Oh no, Oh no, it's Oh no, it's gonna Oh no, it's gonna. Oh no, it's gonna.. Oh no, it's gonna... Oh no, it's gonna... Oh no, it's gonna... Yes! I I made I made it I made it and I made it and got I made it and got it! I made it and got it! [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Come Come on, Come on, no! I I better I better not I better not be I better not be dead. I better not be dead. O O Oh m Oh my Oh my Oh my Oh my g Oh my go Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Dude, Dude, he's Dude, he's not Dude, he's not actually Dude, he's not actually doing Dude, he's not actually doing this. Dude, he's not actually doing this. Oh Oh my Oh my god. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Okay. Okay. What What is What is he What is he doing? What is he doing? Go Go Go back Go back Go back Go back Go back to Go back to Go back to Go back to Go back to the Go back to the Go back to the Go back to the Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. He's He's breaking He's breaking the He's breaking the obsidian. Go Go Go Go Go No, Go back Go back Go back Go back Go back Go back Go back No, are Go back to Go back to Go back to Go back to Go back to Go back to Go back to Go back to the Go back to the Go back to the Go back to the Go back to the Go back to the Go back to the No, are you Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. Go back to the portal. No, are you serious? No, are you serious? No No way No way you No way you guys No way you guys are No way you guys are already No way you guys are already going No way you guys are already going to No way you guys are already going to break No way you guys are already going to break it. No way you guys are already going to break it. And And it's And it's broken. And it's broken. Nice. Nice. Come Come Come Come Come Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Alright. Alright. Let's Let's see Let's see what Let's see what this Let's see what this looks Let's see what this looks like. Let's see what this looks like. Ah. Oh, Oh, Oh, Oh, Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's actually Oh, he's actually Oh, he's actually Oh, he's actually Oh, he's actually Oh, he's actually Oh, he's actually Oh, he's actually through. Oh, he's actually through. Oh, he's actually through. Oh, he's actually through. Oh, he's actually through. Oh, he's actually through. Oh, he's actually through. Oh, he's actually through. Oh, he's actually through. Nooo Nooo. Nooo.. Nooo... Nooo... Nooo... We- we we have we have to we have to be we have to be quick, we have to be quick, cause we have to be quick, cause like- we have to be quick, cause like- I- I I feel I feel like I feel like they're I feel like they're just I feel like they're just gonna I feel like they're just gonna like speedrun speedrun this, speedrun this, like speedrun this, like. speedrun this, like.. speedrun this, like... speedrun this, like... speedrun this, like... Like Like they're Like they're just Like they're just gonna Like they're just gonna go Like they're just gonna go as Like they're just gonna go as quick Like they're just gonna go as quick as Like they're just gonna go as quick as possible Like they're just gonna go as quick as possible or Like they're just gonna go as quick as possible or something, Like they're just gonna go as quick as possible or something, like Like they're just gonna go as quick as possible or something, like. Like they're just gonna go as quick as possible or something, like.. Like they're just gonna go as quick as possible or something, like... Like they're just gonna go as quick as possible or something, like... Like they're just gonna go as quick as possible or something, like... Okay. We We gotta- we we gotta we gotta do we gotta do this we gotta do this quick. we gotta do this quick. This I I mean, This is I mean, if- This is so [[sighs]] [sighs] This is so annoying. To To be To be fair also also it's also it's like if if we if we go if we go far if we go far. if we go far.. if we go far... if we go far... We're We're not We're not gonna, We're not gonna, like We're not gonna, like. We're not gonna, like.. We're not gonna, like... We're not gonna, like... We're not gonna, like... Like, Like, it's Like, it's gonna Like, it's gonna be Like, it's gonna be like awhile awhile until awhile until we awhile until we get awhile until we get back awhile until we get back too, Yeah. awhile until we get back too, so awhile until we get back too, so like awhile until we get back too, so like. awhile until we get back too, so like.. awhile until we get back too, so like... awhile until we get back too, so like... No, No, I No, I think No, I think you're No, I think you're right. No, I think you're right. We We just We just gotta We just gotta find We just gotta find a We just gotta find a cave We just gotta find a cave or We just gotta find a cave or something. [tsks] [tsks] Ugh, Ugh, they're Ugh, they're in Ugh, they're in a Ugh, they're in a bastion Ugh, they're in a bastion already! Ugh, they're in a bastion already! Like they they just they just went they just went through they just went through the they just went through the Nether! they just went through the Nether! You You having You having fun? You having fun? Yeah, Yeah, having Yeah, having a Yeah, having a lot Yeah, having a lot of Yeah, having a lot of fun. Yeah, having a lot of fun. Well, Well, that's Well, that's great! Well, that's great! I Well, that's great! I love uh- I I love I love hearing I love hearing that! I love hearing that! I I don't. I don't. Okay, Okay, I'm Okay, I'm back Okay, I'm back at Okay, I'm back at the Okay, I'm back at the uh Okay, I'm back at the uh. Okay, I'm back at the uh.. Okay, I'm back at the uh... Okay, I'm back at the uh... The The portal. Oh, Oh, I Oh, I see Oh, I see you. Oh, I see you. Nice Nice. Nice.. Nice... Nice... Nice... What's What's the What's the circumference What's the circumference of What's the circumference of a What's the circumference of a circle What's the circumference of a circle if What's the circumference of a circle if a What's the circumference of a circle if a circle What's the circumference of a circle if a circle is What's the circumference of a circle if a circle is made What's the circumference of a circle if a circle is made up What's the circumference of a circle if a circle is made up of What's the circumference of a circle if a circle is made up of triangles? What's the circumference of a circle if a circle is made up of triangles? Anyone Anyone thought Anyone thought about Anyone thought about that? Anyone thought about that? [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] Okay. Okay. I I feel I feel like I feel like every I feel like every time I feel like every time you I feel like every time you swap Baablu like you're you're always you're always like, you're always like, disappointed. you're always like, disappointed. I'm [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] I'm. I'm.. I'm... I'm... not not disappointed. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] You're No, No, we You're like, No, we need You're like, uh No, we need to No, we need to keep Anyways, like No, we need to keep that oh Anyways, like, No, we need to keep that there. how how did Anyways, like, man, how did he Anyways, like, man, this how did he miss Anyways, like, man, this sucks. how did he miss this? how did he miss this? Oh, No, No, we Oh, this No, we didn't The Oh, this is- No, we didn't do The worst The worst day No, we didn't do anything oh The worst day of oh my No, we didn't do anything wrong. The worst day of my oh my god. The worst day of my life. Worst Worst Worst Worst Worst Worst Worst Worst Worst day Worst day Worst day Worst day Worst day Worst day Worst day Worst day Worst day [laughing] He [laughing] He [laughing] He [laughing] He [laughing] He [laughing] He [laughing] He [laughing] He didn't [laughing] He didn't [laughing] He didn't [laughing] He didn't [laughing] He didn't [laughing] He didn't [laughing] He didn't [laughing] He didn't Worst day of Worst day of Worst day of Worst day of Worst day of Worst day of Worst day of Worst day of Worst day of [laughing] He didn't do [laughing] He didn't do [laughing] He didn't do [laughing] He didn't do [laughing] He didn't do [laughing] He didn't do [laughing] He didn't do [laughing] He didn't do Worst day of my Worst day of my Worst day of my Worst day of my Worst day of my Worst day of my Worst day of my Worst day of my Worst day of my [laughing] He didn't do anything [laughing] He didn't do anything [laughing] He didn't do anything [laughing] He didn't do anything [laughing] He didn't do anything [laughing] He didn't do anything [laughing] He didn't do anything [laughing] He didn't do anything Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. Worst day of my life. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. [laughing] He didn't do anything wrong. Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, hey. Oh, hey. Oh, hey. Oh, hey. Oh, hey. Oh, hey. Oh, hey. Oh, hey. Oh, hey. Oh, hey. What Dude, What was Dude, you're What was that? Dude, you're awesome. Like, Like, you're Like, you're doing Yeah, Like, you're doing a Yeah, you're Like, you're doing a great Like, you're doing a great job. Yeah, you're really Yeah, you're really good. Yeah, you're really good. Me? Um, Yeah, Yeah, Baablu Um, yeah. Yeah, Baablu just Yeah, Baablu just keeps Yeah, Baablu just keeps complimenting Yeah, Baablu just keeps complimenting you. Yeah, Baablu just keeps complimenting you. Saying, Saying, like Saying, like. Saying, like.. Saying, like... Saying, like... everything everything you're everything you're doing everything you're doing is everything you're doing is awesome. everything you're doing is awesome. That's Like, That's. Like, he That's.. Like, he swaps That's... That's... Great Great. he's Great.. he's like Great... Great... wow like we're we're in we're in a we're in a great Yeah. we're in a great part we're in a great part of we're in a great part of the we're in a great part of the bastion. we're in a great part of the bastion. Like, Like, wow, Like, wow, we Like, wow, we have Like, wow, we have so Mhm. Like, wow, we have so many Like, wow, we have so many pearls. Like, Like, this Like, this is Like, this is going Like, this is going so Mhm. Like, this is going so good. Like, this is going so good. Let's Let's go Let's go ahead Let's go ahead and Let's go ahead and. Let's go ahead and.. Let's go ahead and... Take Take. Take.. Take... Take... This This. This.. This... This... I I am I am stacked and and let's and let's go and let's go kill and let's go kill him! Let's- Yes! let's let's go! let's go! Uhh Uhh. Uhh.. Uhh... Uhh... Uhh... Oh, Oh, hello! Hello. Hello. [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Oh. Oh. Dude, Dude, I'm Dude, I'm doing Dude, I'm doing all Dude, I'm doing all the Dude, I'm doing all the hard Dude, I'm doing all the hard work bro. bro. I'm bro. I'm setting bro. I'm setting you bro. I'm setting you up bro. I'm setting you up for bro. I'm setting you up for success. bro. I'm setting you up for success. Say- like, like, like, like, like, like, like, like, like, wow! like, wow! like, wow! like, wow! like, wow! like, wow! like, wow! like, wow! like, wow! like, wow! like, wow! Wow! Wow! I Wow! I gotta Wow! I gotta tell Wow! I gotta tell him Wow! I gotta tell him that Wow! I gotta tell him that now! Wow! I gotta tell him that now! Yo- [laughs] [laughs] [laughs] [laughs] [laughs] [laughs] [laughs] [laughs] [laughs] Your Your teammate's Your teammate's talking Your teammate's talking a Your teammate's talking a lot Your teammate's talking a lot of Your teammate's talking a lot of smack Your teammate's talking a lot of smack to Your teammate's talking a lot of smack to you Your teammate's talking a lot of smack to you right Your teammate's talking a lot of smack to you right now. Your teammate's talking a lot of smack to you right now. Is Is he? Is he? I Is he? I don't- I I don't- I don't- Yes. I I mean, I mean, the I mean, the communication I mean, the communication barrier I mean, the communication barrier is I mean, the communication barrier is. I mean, the communication barrier is.. I mean, the communication barrier is... I mean, the communication barrier is... A A little A little difficult. A little difficult. He He did He did say He did say though keep keep your keep your pickaxe keep your pickaxe on keep your pickaxe on two keep your pickaxe on two by keep your pickaxe on two by the keep your pickaxe on two by the way. keep your pickaxe on two by the way. He He said He said please He said please do He said please do that He said please do that. He said please do that.. He said please do that... He said please do that... He said please do that... Wait, Wait, is Wait, is that- Wait, is that- Is Is that Is that him Is that him right Is that him right there? Y Ye Yea Yeah, Yeah, n Yeah, no, Yeah, no, Yeah, no, Yeah, no, Yeah, no, Yeah, no, n Yeah, no, no Yeah, no, no Yeah, no, no Yeah, no, no Yeah, no, no Yeah, no, no Yeah, no, no it i it is it is it is i it i it is, it is, it is, i it is, it it is, it it is, it i it is, it is. it is, it is. it is, it is. it is, it is. O O O Oh, Oh, Oh, I Oh, I Oh, I Oh, I Oh, I Oh, I Oh, I Oh, I s Oh, I se Oh, I see Oh, I see Oh, I see Oh, I see Oh, I see Oh, I see h Oh, I see hi Oh, I see him Oh, I see him Oh, I see him Oh, I see him Oh, I see him Oh, I see him [[[quickly]] [[quickly]] I see him. Behind Behind Behind Behind Behind him, Behind him, Behind him, Behind him, Behind him, Behind him, Behind him, behind Behind him, behind Behind him, behind Behind him, behind Behind him, behind Behind him, behind Behind him, behind you Behind him, behind you Behind him, behind you Behind him, behind you Behind him, behind you Behind him, behind you Behind him, behind you Behind him, behind you behind behind behind you, behind you, behind you, behind you, behind you, behind behind you, behind behind you, behind behind you, behind behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! behind you, behind you! You're You're a You're a little You're a little liar. You're a little liar. Am Am I? Am I? Oh. Oh. Am Am I? [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] Baablu! Baablu! Where Where are Where are you? Where are you? We Where are you? We just Where are you? We just want Where are you? We just want to Where are you? We just want to say Where are you? We just want to say hello! Where are you? We just want to say hello! Oh- I I see I see uh- I I see I see a I see a path. I see a path. I I don't I don't know. I don't know. You You hear You hear that? You hear that? Yeah, Yeah, we're Yeah, we're ready Yeah, we're ready to Yeah, we're ready to go. Yeah, we're ready to go. I Well, Well, Well, Well, Well, Well, I don't Well, that's Well, that's Well, that's Well, that's Well, that's Well, that's Well, that's Well, that's I don't know. Well, that's not Well, that's not Well, that's not Well, that's not Well, that's not Well, that's not Well, that's not Well, that's not Well, that's not exactly Well, that's not exactly Well, that's not exactly Well, that's not exactly Well, that's not exactly Well, that's not exactly Well, that's not exactly Well, that's not exactly Oh, Oh, come Well, that's not exactly what Well, that's not exactly what Well, that's not exactly what Well, that's not exactly what Well, that's not exactly what Well, that's not exactly what Well, that's not exactly what Well, that's not exactly what Oh, come on Well, that's not exactly what I Well, that's not exactly what I Well, that's not exactly what I Well, that's not exactly what I Well, that's not exactly what I Well, that's not exactly what I Well, that's not exactly what I Well, that's not exactly what I you Well, that's not exactly what I meant Well, that's not exactly what I meant Well, that's not exactly what I meant Well, that's not exactly what I meant Well, that's not exactly what I meant Well, that's not exactly what I meant Well, that's not exactly what I meant Well, that's not exactly what I meant you think Well, that's not exactly what I meant to Well, that's not exactly what I meant to Well, that's not exactly what I meant to Well, that's not exactly what I meant to Well, that's not exactly what I meant to Well, that's not exactly what I meant to Well, that's not exactly what I meant to Well, that's not exactly what I meant to you think we're Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. Well, that's not exactly what I meant to do. you think we're going you think we're going to [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] you think we're going to fall you think we're going to fall for you think we're going to fall for that? you think we're going to fall for that? Like Like you're Like you're actually- Like you're actually- Ohh! Wait Wait let's- [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Oh, Oh, okay. [groans] Hey, Hey, Baablu. Oh, Oh, my Oh, my gosh, Oh, my gosh, okay. [sighs] That's [sighs] That's so [sighs] That's so annoying. Oh, Oh, and Oh, and he's Oh, and he's not Oh, and he's not in Oh, and he's not in a I'm Oh, and he's not in a soul I'm right Oh, and he's not in a soul s- I'm right behind I'm right behind you! I'm right behind you! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Hey! Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! I I knew I knew it. I knew it. They They were They were both They were both planning They were both planning it. They were both planning it. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] You You guys You guys are You guys are not You guys are not sneaky, You guys are not sneaky, bro. You guys are not sneaky, bro. Oh, Oh, thank Oh, thank god Oh, thank god shields Oh, thank god shields exist, Oh, thank god shields exist, Baablu. Oh, thank god shields exist, Baablu. You You like You like that? Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Wait, Wait, that Wait, that was Wait, that was actually Wait, that was actually cool. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] But But this But this is But this is gonna But this is gonna be But this is gonna be cooler. But this is gonna be cooler. [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Oh! Ooh! Ooh! Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! I I almost I almost just I almost just fell I almost just fell off. I almost just fell off. Careful. Careful. It's It's It's It's It's It's D It's Dr It's Dre It's Drea It's Dream It's Dream It's Dream It's Dream n It's Dream no It's Dream now It's Dream now It's Dream now It's Dream now It's Dream now It's Dream now it's it's it's D it's Dr it's Drea it's Dream it's Dream n it's Dream no it's Dream now. it's Dream now. it's Dream now. it's Dream now. it's Dream now. Dang Dang it. Dang it. He's He's in He's in the He's in the blaze He's in the blaze spawner. He's in the blaze spawner. He He just He just killed He just killed another He just killed another blaze. He just killed another blaze. Come Come here! Come here! Your Your bed Your bed trap Your bed trap did Your bed trap did not Your bed trap did not work! [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Oh, Oh, fudge! Oh, fudge! He's Oh, fudge! He's got Oh, fudge! He's got lava, Oh, fudge! He's got lava, careful! Oh Oh god. Oh god. Yeah, Yeah, Yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, I Yeah, yeah, I Yeah, yeah, I Yeah, yeah, I Yeah, yeah, I Yeah, yeah, I blocked Yeah, yeah, I blocked Yeah, yeah, I blocked Yeah, yeah, I blocked Yeah, yeah, I blocked Yeah, yeah, I blocked it Yeah, yeah, I blocked it Yeah, yeah, I blocked it Yeah, yeah, I blocked it Yeah, yeah, I blocked it Yeah, yeah, I blocked it off Yeah, yeah, I blocked it off Yeah, yeah, I blocked it off Yeah, yeah, I blocked it off Yeah, yeah, I blocked it off Yeah, yeah, I blocked it off Yeah, yeah, I blocked it off I I blocked I blocked I blocked I blocked it I blocked it I blocked it I blocked it off. I blocked it off. I blocked it off. I blocked it off. I blocked it off. Oh, Oh, hold Oh, hold on I I got I got lava I got lava too. I got lava too. I'm I'm uh- I'm I'm gonna I'm gonna try I'm gonna try and I'm gonna try and get I'm gonna try and get him. I'm gonna try and get him. Oh Oh yeah, Oh yeah, yeah, Oh yeah, yeah, yeah. Oh yeah, yeah, yeah. Okay. Okay. Come Come here! Come here! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] He He He He He He He He has He has He has He has He has He has He has He has He has more He has more He has more He has more He has more He has more He has more He has more He has more lava He has more lava He has more lava He has more lava He has more lava He has more lava He has more lava He has more lava he he he he has he has he has he has he has he has more he has more he has more he has more he has more he has more lava he has more lava he has more lava he has more lava he has more lava he has more lava he has more lava he has he has more he has more he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! he has more lava! Got Got him. Got him. Oh, Oh, Oh, Oh, Oh, Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's Oh, he's got Oh, he's got Oh, he's got Oh, he's got Oh, he's got Oh, he's got Oh, he's got Oh, he's got fire Oh, he's got fire Oh, he's got fire Oh, he's got fire Oh, he's got fire Oh, he's got fire Oh, he's got fire Oh, he's got fire res! Oh, he's got fire res! Oh, he's got fire res! Oh, he's got fire res! Oh, he's got fire res! Oh, he's got fire res! Oh, he's got fire res! Oh, he's got fire res! He's He's got He's got fire He's got fire res! What? Don't Don't bo- Don't bo- Yep. Yep. Ooh. [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] [inhales] Oh, Oh, I Oh, I blocked Oh, I blocked it Oh, I blocked it off. Oh, I blocked it off. Okay, Okay, he's Okay, he's good. Okay, he's good. Oh Oh my Oh my god. Wait, Wait, Wait, Wait, my Wait, my Wait, my Wait, my Wait, my Wait, my pickaxe Wait, my pickaxe Wait, my pickaxe Wait, my pickaxe Wait, my pickaxe Wait, my pickaxe about Wait, my pickaxe about Wait, my pickaxe about Wait, my pickaxe about Wait, my pickaxe about Wait, my pickaxe about to Wait, my pickaxe about to Wait, my pickaxe about to Wait, my pickaxe about to Wait, my pickaxe about to Wait, my pickaxe about to break. Wait, my pickaxe about to break. Wait, my pickaxe about to break. Wait, my pickaxe about to break. Wait, my pickaxe about to break. Wait, my pickaxe about to break. Wait, my pickaxe about to break. I- I I gotta I gotta make I gotta make another I gotta make another one I gotta make another one real I gotta make another one real quick. Oh, Oh, fudge. Oh, fudge. O O Ok Oka Okay, Sh- Okay, o Okay, ok Okay, oka Okay, okay. Okay, okay. Okay, okay. Okay, okay. Okay, okay. What What do What do you What do you need? What do you need? Uhh Uhh. Uhh.. Uhh... Uhh... Do Do you Do you need Do you need iron? O O Oh, Oh, n Oh, no, Oh, no, Oh, no, Oh, no, Oh, no, n Oh, no, no. Oh, no, no. Oh, no, no. Oh, no, no. Oh, no, no. Oh, no, no. I'm I'm good. I'm good. O O Ok Ok Oka Okay, Okay, Okay, o Okay, ok Okay, oka Okay, okay. Okay, okay. Okay, okay. Okay, okay. Okay, okay. Okay, okay. Is Is he- Is he- He's- he's he's in he's in the he's in the walls. he's in the walls. He's He's digging He's digging in He's digging in a He's digging in a wall. He's digging in a wall. He's He's up. He's He's up. He's up. I I saw I saw him I saw him first. I saw him first. He's He's He's He's He's He's He's down He's down He's down He's down He's down He's down He's down He's down He's down now? He's down now? He's down now? He's down now? He's down now? He's down now? He's down now? He's down now? He's down now? He's down now? He He He He He He He He He He He He He just He just He just He just He just He just He just He just He just He just He just He just He just He just He just He just He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He just juked us?! He's He's He's He's He's He's He's He's He's going He's going He's going He's going He's going He's going He's going He's going He's going back. He's going back. He's going back. He's going back. He's going back. He's going back. He's going back. He's going back. He's going back. He's going back. He's going back. Oh Oh my Oh my god. Come Come here. Come here. Oh, Oh, wait. Oh, wait. Okay. Okay. We We gotta We gotta be We gotta be careful. We gotta be careful. The The The The The The The The The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The The The The The The The The The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! The switch! [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Ooh, [smashes keyboard] Ooh, you Ooh, you are Ooh, you are in Ooh, you are in trouble. Ooh, you are in trouble. [hisses] [hisses] Oh Oh my Oh my god. Oh my god. Come Come on. Come on. Come Come here. Come here. We're- we're we're just we're just making we're just making circles we're just making circles this we're just making circles this whole we're just making circles this whole video, we're just making circles this whole video, aren't we're just making circles this whole video, aren't we? we're just making circles this whole video, aren't we? The The bridge The bridge of The bridge of doom. The bridge of doom. The The staircase The staircase of The staircase of doom. The staircase of doom. That That did That did a That did a lot That did a lot of That did a lot of damage. That did a lot of damage. Oh Oh Oh Oh Oh Oh Oh Oh Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh. Oh.. Oh.. Oh.. Oh.. Oh.. Oh.. Oh.. Oh.. Oh... Oh... Oh... Oh... Oh... Oh... Oh... Oh... Oh... my my my my my my my my gosh. my gosh. my gosh. my gosh. my gosh. my gosh. my gosh. my gosh. my gosh. W Wa Wat Watc Watch o Watch ou Watch out, Watch out, Watch out, Watch out, Watch out, w Watch out, wa Watch out, wat Watch out, watc Watch out, watch Watch out, watch Watch out, watch o Watch out, watch ou Watch out, watch out Watch out, watch out Watch out, watch out Watch out, watch out Watch out, watch out Watch out, watch out w watc watch o watch ou watch out, watch out, watch out, w watch out, wa watch out, watc watch out, watch watch out, watch o watch out, watch ou watch out, watch out. watch out, watch out. watch out, watch out. watch out, watch out. watch out, watch out. Oh, Oh, he's Oh, he's coming Oh, he's coming back. Coming Coming back. Coming back. Careful. Careful. Ooh! Ooh! Just Just Just Just Just hide, Just hide, Just hide, Just hide, Just hide, Just hide, Just hide, just Just hide, just Just hide, just Just hide, just Just hide, just Just hide, just Just hide, just hide Just hide, just hide Just hide, just hide Just hide, just hide Just hide, just hide Just hide, just hide Just hide, just hide Just hide, just hide just just just hide, just hide, just hide, just hide, just hide, just just hide, just just hide, just just hide, just just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. just hide, just hide. We We have We have to We have to be Hmm Hmm. Hmm.. Hmm... We have to be really We have to be really careful We have to be really careful about We have to be really careful about fighting We have to be really careful about fighting in I We have to be really careful about fighting in open I don't We have to be really careful about fighting in open areas. I don't know I don't know what Y Y Ye Ye Yea Yeah, Yeah, Yeah, y Yeah, ye Yeah, yea Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, I don't know what the Yeah, yeah, y Yeah, yeah, ye Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. I don't know what the muffin I don't know what the muffin to I don't know what the muffin to do I don't know what the muffin to do here. I don't know what the muffin to do here. Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god Oh my god [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! [[[shocked]] [[nervous laughing]] [[shocked]] oh my god! Watch Watch Watch out, Watch out, Watch out, Watch out, Watch out, watch Watch out, watch Watch out, watch Watch out, watch Watch out, watch out, Watch out, watch out, Watch out, watch out, Watch out, watch out, Watch out, watch out, watch Watch out, watch out, watch Watch out, watch out, watch Watch out, watch out, watch Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Watch out, watch out, watch out! Yep, Yep, just Yep, just stay Yep, just stay under. Yep, just stay under. If If he If he pokes If he pokes out we we can we can hit we can hit him. we can hit him. [hisses] [hisses] I I crit I crit him. I crit him. I I fell I fell though. I fell though. He's He's backing He's backing up. He's backing up. Oh, Oh, thank Oh, thank you, Oh, thank you, thank Oh, thank you, thank you. Oh Oh my Oh my god he's he's pulling he's pulling out he's pulling out the he's pulling out the crossbow he's pulling out the crossbow again. he's pulling out the crossbow again. Just- just just cover just cover up cover cover up, cover up, cover cover up, cover up. cover up, cover up. Oh, Oh, it's Oh, it's a Oh, it's a bait. Oh, it's a bait. It's It's It's It's a It's a It's a It's a It's a It's a b It's a ba It's a bai It's a bait. It's a bait. It's a bait. It's a bait. It's a bait. It's It's It's It's a It's a It's a It's a It's a It's a b It's a ba It's a bai It's a bait. It's a bait. It's a bait. It's a bait. It's a bait. Oh! Oh! The The The The The The The The The soul The soul The soul The soul The soul The soul The soul The soul The soul speed! The soul speed! The soul speed! The soul speed! The soul speed! The soul speed! The soul speed! The soul speed! The soul speed! The soul speed! I I would I would of I would of caught I would of caught up! I would of caught up! Careful. Careful. Careful. Careful. Oh, He's- Oh, what's Oh, what's he he's he's coming Oh, what's he doing? he's coming back. Come Come back. What What What What Careful. What is What is What is What is What is What is What is he What is he What is he What is he What is he What is he What is he doing What is he doing What is he doing What is he doing What is he doing What is he doing What is he doing What is he doing what what is what is what is what is what is he what is he what is he what is he what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? what is he doing? NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NO! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! NOO!!! Goodbye. Goodbye. NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! NOOO!!! Oh Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my NOOO!!! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. Oh my god. What? What? [sighs] No. No. I What? What? What? What? What? What? What? What? What? What? What? What? What? What? Yes! I couldn't I couldn't clutch. I couldn't clutch. Knock Knock back Knock back one Knock back one on Knock back one on the [sighs] Knock back one on the sword Are Knock back one on the sword from Are you Knock back one on the sword from the Are you flipping Knock back one on the sword from the very Knock back one on the sword from the very start, Are you flipping kidding? Knock back one on the sword from the very start, let's Oh, Knock back one on the sword from the very start, let's go! Oh, he Oh, he fell Oh, he fell in Oh, he fell in the Oh, he fell in the lava. Oh, he fell in the lava. [sighs] Are Are you Bro! Are you kidding? Are you kidding? You You You You You You You You both You both You both You both You both You both You both You both You both dead? You both dead? You both dead? You both dead? You both dead? You both dead? You both dead? You both dead? You both dead? Yes, Yes, me Yes, me and Yes, me and Bad Yes, me and Bad both Yes, me and Bad both died, Yes, me and Bad both died, bro. Uh. Uh. Yeah, Yeah, we Yeah, we both Yeah, we both died. Yeah, we both died. Uhhhh Uhhhh. Uhhhh.. Uhhhh... Uhhhh... Uhhhh... [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Hello. Hello. [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] [giggling] Hey Hey Bad. Not Not Not Not Not Not Not dead. Not dead. Not dead. Not dead. Not dead. Not dead. Not dead. Not dead. Yeah, Yeah, I Yeah, I wasn't Yeah, I wasn't sure. Hello. Hello. Oh, Oh, fudge. Oh Why- Oh Bad, Oh Bad, I Oh Bad, I have Oh Bad, I have soul why why did Oh Bad, I have soul speed- why did I why did I come why did I come down why did I come down here? why did I come down here? I I have I have soul I have soul speed I have soul speed and I have soul speed and fire I have soul speed and fire res. I have soul speed and fire res. Okay, Okay, bye Okay, bye Bad. Okay, bye Bad. Like Like. Like.. Like... Like... Like... [spam clicking mouse] Get Get away. Get away. Oh, Oh, there Oh, there you [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! No! Okay, Oh, there you go. Okay, you're Okay, you're dead, Okay, you're dead, alright. Okay, you're dead, alright. Oh, Oh, this Oh, this. Oh, this.. Oh, this... Oh, this... Oh, this... [hits desk] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Oh Oh my Bye, Oh my god. Bye, BadBoyHalo! And And of And of course And of course he And of course he switches And of course he switches right [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] And of course he switches right as And of course he switches right as you And of course he switches right as you die. And of course he switches right as you die. Oh I I got I got to Oh my I got to watch I got to watch it Oh my god. I got to watch it all I got to watch it all happen. That That was That was beautiful. That was beautiful. That That sucks. That sucks. Oh Oh my Oh my gosh. Oh my gosh. Well, Well, now Well, now they Well, now they have Well, now they have such Well, now they have such a Well, now they have such a big Well, now they have such a big advantage. Well, now they have such a big advantage. Looks Yeah Yeah. Yeah.. Looks like. Yeah... Yeah... we we do we do not we do not have we do not have food. We We are- we we are we are just we are just in we are just in a we are just in a. we are just in a.. we are just in a... [sighs] [sighs] Bit Bit of Bit of a Bit of a rough Bit of a rough spot. Bit of a rough spot. Yeah. Yeah. What What am [mashes keyboard] What am I What am I doing? What am I doing? Little Little message Little message there. Little message there. Yeah. Yeah. I'm I'm not I'm not a I'm not a bad I'm not a bad player. I'm I'm just I'm just awesome. I'm just awesome. And And I And I want And I want to And I want to do And I want to do this. And I want to do this. So So there So there you So there you go. So there you go. I I hate I hate our I hate our hotbar. I hate our hotbar. Yeah, Yeah, he Yeah, he said Yeah, he said you Yeah, he said you keep Yeah, he said you keep moving Yeah, he said you keep moving the [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Yeah, he said you keep moving the pick Yeah, he said you keep moving the pick out Yeah, he said you keep moving the pick out of Yeah, he said you keep moving the pick out of the Yeah, he said you keep moving the pick out of the one [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] Yeah, he said you keep moving the pick out of the one slot, Yeah, he said you keep moving the pick out of the one slot, and Yeah, he said you keep moving the pick out of the one slot, and it's- It's No, No, the It's driving No, the pick It's driving him No, the pick is No, the pick is in It's driving him nuts. No, the pick is in the No, the pick is in the two No, the pick is in the two slot and and I and I use and I use my and I use my pick and I use my pick in and I use my pick in my like, like, seven like, seven slot. like, seven slot. But But also, But also, why But also, why are But also, why are our But also, why are our blocks But also, why are our blocks always But also, why are our blocks always in But also, why are our blocks always in this But also, why are our blocks always in this slot? We We agreed We agreed before We agreed before the We agreed before the video We agreed before the video that We agreed before the video that our We agreed before the video that our blocks We agreed before the video that our blocks would We agreed before the video that our blocks would be We agreed before the video that our blocks would be in We agreed before the video that our blocks would be in this We agreed before the video that our blocks would be in this slot! We agreed before the video that our blocks would be in this slot! Trouble Trouble in Trouble in paradise? [sighs] Alright, Alright, um Alright, um. Alright, um.. Alright, um... Alright, um... [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Yo, Yo, Dream Yo, Dream is Yo, Dream is so Yo, Dream is so mad Yo, Dream is so mad at Yo, Dream is so mad at you Yo, Dream is so mad at you right Yo, Dream is so mad at you right now. I'm I'm not I'm not even I'm not even kidding, I'm not even kidding, like. What What did What did he What did he say? What did he say? He He said He said you He said you agreed He said you agreed to He said you agreed to keep He said you agreed to keep the He said you agreed to keep the uh He said you agreed to keep the uh. He said you agreed to keep the uh.. He said you agreed to keep the uh... He said you agreed to keep the uh... Blocks Blocks in Blocks in slot Blocks in slot one [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Blocks in slot one and Blocks in slot one and like the Uh, Uh, that's the pick Uh, that's not Uh, that's not even the pick in Uh, that's not even what the pick in slot, Uh, that's not even what we Uh, that's not even what we agreed the pick in slot, like Uh, that's not even what we agreed on. the pick in slot, like four. Now Now I Now I know Now I know you're Now I know you're lying Now I know you're lying because Now I know you're lying because we Now I know you're lying because we actually No, Now I know you're lying because we actually did No, he Now I know you're lying because we actually did it. No, he said- he he said he said something he said something like he said something like that. he said something like that. [mashes keyboard] [mashes keyboard] Yes, Yes, that Yes, that is, Yes, that is, I Yes, that is, I agree. Yes, that is, I agree. Wait, Wait, what? Wait, what? No Wait, what? No we Wait, what? No we. Wait, what? No we.. Wait, what? No we... Wait, what? No we... Wait, what? No we... What What the What the muffin What the muffin did What the muffin did he What the muffin did he do? What the muffin did he do? We We had We had a We had a looting We had a looting three We had a looting three sword! We had a looting three sword! H H H He must'v He must've He must've He must've He must've He must've t He must've th He must've thr He must've throw He must've thrown He must've thrown i He must've thrown it He must've thrown it He must've thrown it He must've thrown it He must've thrown it o He must've thrown it ou He must've thrown it out! He must've thrown it out! He must've thrown it out! He must've thrown it out! He must've thrown it out! He must've thrown it out! He must've thrown it out! [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Wait- Wait- Wait- Wait- Wait- Wait- Wait- Wait- Oh Oh my Oh my god. Oh my god. He He got He got really He got really mad He got really mad at He got really mad at you He got really mad at you for He got really mad at you for throwing He got really mad at you for throwing away He got really mad at you for throwing away the He got really mad at you for throwing away the looting He got really mad at you for throwing away the looting three He got really mad at you for throwing away the looting three sword. He got really mad at you for throwing away the looting three sword. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Now- you're you're actually you're actually not you're actually not lying. I I didn't I didn't even I didn't even know I didn't even know we I didn't even know we had I didn't even know we had that. I didn't even know we had that. I I had I had to I had to drop I had to drop it I had to drop it to I had to drop it to pick I had to drop it to pick up I had to drop it to pick up the I had to drop it to pick up the knockback I had to drop it to pick up the knockback sword I had to drop it to pick up the knockback sword to I had to drop it to pick up the knockback sword to kill I had to drop it to pick up the knockback sword to kill you I had to drop it to pick up the knockback sword to kill you earlier. So So. So.. So... So... I I think I think it I think it was I think it was worth I think it was worth it. I think it was worth it. We We will We will uh- we'll we'll let we'll let him we'll let him know we'll let him know that we'll let him know that so we'll let him know that so you we'll let him know that so you don't- you you have you have to you have to worry. I'll I'll just I'll just write I'll just write on I'll just write on a I'll just write on a sign. I I I I don't I don't I don't I don't I don't I don't I don't trust I don't trust I don't trust I don't trust I don't trust I don't trust I don't trust you I don't trust you I don't trust you I don't trust you I don't trust you I don't trust you I don't trust you to I don't trust you to I don't trust you to I don't trust you to I don't trust you to I don't trust you to I don't trust you to relay I don't trust you to relay I don't trust you to relay I don't trust you to relay I don't trust you to relay I don't trust you to relay I don't trust you to relay that I don't trust you to relay that I don't trust you to relay that I don't trust you to relay that I don't trust you to relay that I don't trust you to relay that I don't trust you to relay that information. I don't trust you to relay that information. I don't trust you to relay that information. I don't trust you to relay that information. I don't trust you to relay that information. I don't trust you to relay that information. I don't trust you to relay that information. I don't trust you to relay that information. I don't trust you to relay that information. Oh Oh my Oh my god. Oh my god. He He said He said he He said he swapped He said he swapped the- He He left He left a He left a sign He left a sign that He left a sign that said He left a sign that said that He left a sign that said that he He left a sign that said that he swapped He left a sign that said that he swapped the He left a sign that said that he swapped the looting He left a sign that said that he swapped the looting three He left a sign that said that he swapped the looting three sword. For For a For a knockback For a knockback sword For a knockback sword to For a knockback sword to kill For a knockback sword to kill you. For a knockback sword to kill you. I'm I'm going I'm going to I'm going to be I'm going to be honest you you guys you guys shouldn't you guys shouldn't be you guys shouldn't be able you guys shouldn't be able to you guys shouldn't be able to use you guys shouldn't be able to use signs. you guys shouldn't be able to use signs. We We should We should have We should have to We should have to relay We should have to relay all Yeah Yeah. We should have to relay all communication. Yeah.. Yeah... Yeah... Like, Like, that's Like, that's not Like, that's not fair Like, that's not fair. Like, that's not fair.. Like, that's not fair... Like, that's not fair... How How clear How clear is How clear is air? How clear is air? Like, Like, percentage Like, percentage wise? Like, percentage wise? [gulps] [gulps] Pretty Pretty clear? I I mean I mean. I mean.. I mean... I mean... I mean... I I mean, I mean, can I mean, can you I mean, can you see I mean, can you see through I mean, can you see through it? I mean, can you see through it? Like I mean, can you see through it? Like. I mean, can you see through it? Like.. I mean, can you see through it? Like... I mean, can you see through it? Like... I mean, can you see through it? Like... I- I- Feel Feel like Ah. Feel like you Feel like you can. Feel like you can. Wait! Wait! Wait! Wait! Wait! Wait! Wait, Wait! Wait, Wait! Wait, Wait! Wait, Wait! Wait, Wait! Wait, Wait! Wait, Wait! Wait, they're Wait! Wait, they're Wait! Wait, they're Wait! Wait, they're Wait! Wait, they're Wait! Wait, they're Wait! Wait, they're Wait! Wait, they're in Wait! Wait, they're in Wait! Wait, they're in Wait! Wait, they're in Wait! Wait, they're in Wait! Wait, they're in Wait! Wait, they're in Wait! Wait, they're in the Wait! Wait, they're in the Wait! Wait, they're in the Wait! Wait, they're in the Wait! Wait, they're in the Wait! Wait, they're in the Wait! Wait, they're in the Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Wait! Wait, they're in the overworld. Alright. Alright. Wait, Wait, Wait, Wait, Wait, Wait, what? Wait, what? Wait, what? Wait, what? Wait, what? Wait, what? Wait, what? Wait, what? Yeah, Yeah, Yeah, Yeah, Yeah, Yeah, Yeah, Yeah, How How do How do you How do you know? Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- Yeah, they're- they're they're they're they're they're they're in they're in they're in they're in they're in they're in they're in they're in the they're in the they're in the they're in the they're in the they're in the they're in the they're in the overworld. they're in the overworld. they're in the overworld. they're in the overworld. they're in the overworld. they're in the overworld. they're in the overworld. they're in the overworld. Press they're in the overworld. Press they're in the overworld. Press they're in the overworld. Press they're in the overworld. Press they're in the overworld. Press they're in the overworld. Press Oh, Oh, Oh, Oh, Oh, Oh, Oh, [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] they're in the overworld. Press your they're in the overworld. Press your they're in the overworld. Press your they're in the overworld. Press your they're in the overworld. Press your they're in the overworld. Press your they're in the overworld. Press your Oh, fudge, Oh, fudge, Oh, fudge, Oh, fudge, Oh, fudge, Oh, fudge, Oh, fudge, Oh, fudge, they're in the overworld. Press your compass. they're in the overworld. Press your compass. they're in the overworld. Press your compass. they're in the overworld. Press your compass. they're in the overworld. Press your compass. they're in the overworld. Press your compass. they're in the overworld. Press your compass. they're in the overworld. Press your compass. Oh, fudge, you're Oh, fudge, you're Oh, fudge, you're Oh, fudge, you're Oh, fudge, you're Oh, fudge, you're Oh, fudge, you're Oh, fudge, you're Oh, fudge, you're right! Oh, fudge, you're right! Oh, fudge, you're right! Oh, fudge, you're right! Oh, fudge, you're right! Oh, fudge, you're right! Oh, fudge, you're right! Oh, fudge, you're right! Oh, fudge, you're right! Okay, Okay, he's Okay, he's cutting Okay, he's cutting away Okay, he's cutting away from Okay, he's cutting away from where Okay, he's cutting away from where they Okay, he's cutting away from where they were. Okay, he's cutting away from where they were. Oh, Oh, these Oh, these guys Oh, these guys are Oh, these guys are cooked. Oh, these guys are cooked. Why Why are Why are you Why are you getting Why are you getting armor Why are you getting armor trims? Are Are you Are you like side side questing? side questing? What side questing? What are side questing? What are you side questing? What are you doing? side questing? What are you doing? [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] We We are We are decked We are decked out We are decked out for We are decked out for real! Let's Let's go! Let's go! Uhhhh Okay, Uhhhh. Okay, now Uhhhh.. Okay, now it's Uhhhh... Okay, now it's time Uhhhh... Uhhhh... Okay, now it's time to Okay, now it's time to kill Okay, now it's time to kill them. Okay, now it's time to kill them. Oh, Oh, yeah, Oh, yeah, he Oh, yeah, he wanted Oh, yeah, he wanted you Oh, yeah, he wanted you to Oh, yeah, he wanted you to go Oh, yeah, he wanted you to go back Oh, yeah, he wanted you to go back to Oh, yeah, he wanted you to go back to the Oh, yeah, he wanted you to go back to the Mooshy Oh, yeah, he wanted you to go back to the Mooshy Island. [scoffs] He He specifically He specifically said He specifically said it. He specifically said it. Understood. Understood. I I just I just remembered we we need we need to we need to uh we need to uh. we need to uh.. we need to uh... We We need We need to We need to get We need to get a We need to get a bed by by the Oh, by the way, Oh, oh by the way, so by the way, so. by the way, so.. by the way, so... Oh, oh yeah. by the way, so... by the way, so... I I mean, I mean, we're I mean, we're like I mean, we're like near I mean, we're like near a I mean, we're like near a plains I mean, we're like near a plains biome so so if so if we so if we see so if we see sheep so if we see sheep we so if we see sheep we can- Mhm. Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- Oh perfect- literally- literally- literally- literally- literally- literally- literally- literally- literally- Oh, Oh, you Oh, you see Oh, you see one? Oh, you see one? As As we're As we're talking I I see I see four. I see four. Okay, Okay, so Okay, so we Okay, so we should Okay, so we should be Okay, so we should be good Okay, so we should be good just Okay, so we should be good just before Okay, so we should be good just before we Okay, so we should be good just before we go Okay, so we should be good just before we go into Okay, so we should be good just before we go into combat. We We just We just got We just got to We just got to place We just got to place these. We just got to place these. Alright! Alright! You You have You have you're You have you're own You have you're own boat You have you're own boat I'm You have you're own boat I'm guessing so so I'm so I'm just so I'm just gonna so I'm just gonna go so I'm just gonna go. so I'm just gonna go.. so I'm just gonna go... so I'm just gonna go... so I'm just gonna go... Y Ye Yea Yeah, Yeah, y Yeah, ye Yeah, yea Yeah, yeah, Yeah, yeah, Yeah, yeah, Yeah, yeah, y Yeah, yeah, ye Yeah, yeah, yea Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. Yeah, yeah, yeah. Just Just go. Just go. Catching Catching up. Catching up. I I see I see a I see a village but but I but I don't but I don't think but I don't think they're but I don't think they're there. but I don't think they're there. Ohh Ohh. Ohh.. Ohh... Ohh... [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] I I mean I mean. I mean.. I mean... I mean... I mean... We We got We got enough We got enough food. We got enough food. Actually, Actually, you Actually, you think? Actually, you think? Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh, what? Oh Oh. Oh.. Oh... Oh... Okay. Okay. You You know You know what lemme- lemme lemme try lemme try something lemme try something real lemme try something real quick. lemme try something real quick. Mhm. Mhm. Wait, Wait, what? This This might This might be This might be a This might be a bad This might be a bad idea This might be a bad idea. This might be a bad idea.. This might be a bad idea... This might be a bad idea... Oh, Oh, I Oh, I see. Oh, Oh, there's Oh, there's water Oh, there's water down Oh, there's water down here. Oh, there's water down here. What? What? [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Yes! Bro! Bro! Are Are you Are you. Are you.. Are you... Are you... Like, Like, what? That's That's. That's.. That's... Crazy. Did Did he That's Did he set Did he set up That's so Did he set up water? That's so dumb. That's so dumb. Yeah, Yeah, it Yeah, it was Yeah, it was like Yeah, it was like a Yeah, it was like a fake Yeah, it was like a fake water. Yeah, it was like a fake water. Oh Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh, Oh, nice. Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! Oh my gosh! I'm I'm so I'm so glad I'm so glad you I'm so glad you tested I'm so glad you tested that. I'm so glad you tested that. That That would That would have That would have been That would have been so That would have been so annoying. That would have been so annoying. I I lost I lost literally I lost literally all I lost literally all my I lost literally all my stuff. I lost literally all my stuff. Bro, Bro, Bro, Bro, Bro, Bro, Bro, Bro, Bro, Bro, Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? Bro, and I'm at spawn?!? [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] [chuckles] Wait, Wait, what Wait, what happened? Are Are you Are you s- I I died I died to I died to your I died to your stupid I died to your stupid like water water trap water trap thing! [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] That That That That That That That That worked? That worked? That worked? That worked? That worked? That worked? That worked? That worked? That worked? [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Bro, Bro, what? I I saw I saw him I saw him trying I saw him trying to I saw him trying to set I saw him trying to set that I saw him trying to set that up I saw him trying to set that up and I saw him trying to set that up and I I saw him trying to set that up and I. I saw him trying to set that up and I.. I saw him trying to set that up and I... I saw him trying to set that up and I... I I had I had faith, I had faith, but I had faith, but. I had faith, but.. I had faith, but... I had faith, but... I had faith, but... So So annoying, So annoying, like- So annoying, like- What What a What a dumb What a dumb trap. What a dumb trap. So Alright, Alright, guys. So dumb. So dumb. And And And And And And And And And Oh And they're And they're And they're And they're And they're And they're And they're And they're And they're And they're And they're And they're And they're And they're And they're in And they're in And they're in And they're in And they're in And they're in And they're in And they're in And they're in And they're in And they're in And they're in And they're in And they're in Oh my And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! And they're in the End!! Oh my gosh. [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] Are Okay. Are we Are we serious? Are we serious? Good [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Good luck, Good luck, guys. I I mean, I mean, you I mean, you don't [snorts] I mean, you don't have I mean, you don't have much- I mean, you don't have much- [scoffs] No No way No way that No way that just No way that just worked No way that just worked on No way that just worked on you No way that just worked on you as No way that just worked on you as well. Oh Oh. Oh.. There's There's no Oh... There's no way. There's no way. Oh- My My. My.. My... N N No, No, No, n No, no, No, no, No, no, No, no, No, no, No, no, n No, no, no, No, no, no, No, no, no, No, no, no, No, no, no, No, no, no, n No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, no, no, no. No, No, and No, and I No, and I broke No, and I broke the No, and I broke the bed. Gosh Gosh. Gosh.. Gosh... Gosh... Do Why Do you Why did Do you think Why did we- Do you think you Do you think you can Oh we Do you think you can get we should Do you think you can get here Do you think you can get here quick? we should of- we should of- Why Why Why Why Why Why Why Why Why Why Why Why Why Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Why did I remove Ohh, Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Why did I remove the Ohh, that's Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Why did I remove the bed?!?! Ohh, that's so [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] Ohh, that's so frustrating. Ohh, that's so frustrating. Oh That That is Oh my That is actually Oh my god! That is actually hilarious. That That is We That is so We should That is so funny. We should have Oh We should have thought We should have thought about We should have thought about that, Oh my We should have thought about that, ugh. We should have thought about that, ugh. Why Why didn't Oh my god Why didn't we Why didn't we think Why didn't we think about Why didn't we think about that? oh oh my oh my god! oh my god! [groans] [groans] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] I- That's [sighs] That's so That's so annoying! I I broke I broke the I broke the water I broke the water and I broke the water and I I broke the water and I just I broke the water and I just didn't I broke the water and I just didn't let I broke the water and I just didn't let it I broke the water and I just didn't let it flow I broke the water and I just didn't let it flow down Oh I broke the water and I just didn't let it flow down enough. I broke the water and I just didn't let it flow down enough. Oh my Oh, Oh my. Oh my.. Oh, that Oh my... Oh my... God Oh, that is God. God.. God... Oh, that is so God... God... Oh, that is so annoying. Oh, that is so annoying. [tsks] [tsks] How How are How are you How are you guys How are you guys feeling? How are you guys feeling? Great! [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] [sarcastically laughs] Honestly, Honestly, could Honestly, could be Honestly, could be better. Honestly, could be better. You're You're actually- I I feel I feel like- like- You You probably You probably could You probably could make You probably could make it like there's there's no- like Yeah, I I feel Yeah, I'm I feel like- Yeah, I'm like Yeah, I'm like halfway Yeah, I'm like halfway there. Yeah, I'm like halfway there. Okay, Okay, okay. Okay, okay. So So I'm So I'm almost So I'm almost there. So I'm almost there. Oh Oh my Oh my god I'm I'm actually I'm actually getting I'm actually getting like, I'm actually getting like, frustrated! I'm actually getting like, frustrated! You You guys You guys found You guys found it You guys found it so You guys found it so quick. You guys found it so quick. Just Just mark, Just mark, um Just mark, um. Just mark, um.. Just mark, um... Just mark, um... Mark Mark down Mark down the Mark down the coordinates Mark down the coordinates before Mark down the coordinates before you Mark down the coordinates before you go Mark down the coordinates before you go in. Mark down the coordinates before you go in. Okay. Okay. Oh, Oh, this Oh, this is Oh, this is actually Oh, this is actually so Oh, this is actually so annoying. Oh, this is actually so annoying. We We came We came up We came up with We came up with that We came up with that fake We came up with that fake water We came up with that fake water play We came up with that fake water play. We came up with that fake water play.. We came up with that fake water play... Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- Before- before before. before.. before... before... That's That's such That's such a That's such a dumb That's such a dumb trap That's such a dumb trap and That's such a dumb trap and we That's such a dumb trap and we both [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] [laughing] That's such a dumb trap and we both kind That's such a dumb trap and we both kind of That's such a dumb trap and we both kind of fell That's such a dumb trap and we both kind of fell for Wait, Wait, Wait, Wait, Wait, Wait, Wait, Wait, That's such a dumb trap and we both kind of fell for it. Wait, you Wait, you Wait, you Wait, you Wait, you Wait, you Wait, you Wait, you Wait, you both- Wait, you both- Wait, you both- Wait, you both- Wait, you both- Wait, you both- Wait, you both- Wait, you both- Wait, you both- Wait, you both- Wait Wait Wait Wait Wait [sighs] Bad Bad fell Bad fell Bad fell Bad fell Bad fell for Bad fell for Bad fell for Bad fell for Bad fell for it Bad fell for it Bad fell for it Bad fell for it Bad fell for it too? Bad fell for it too? Bad fell for it too? Bad fell for it too? Bad fell for it too? Bad fell for it too? Bad fell for it too? The The dragon's The dragon's on The dragon's on like The dragon's on like no The dragon's on like no health. The dragon's on like no health. He's He's going He's going to He's going to kill He's going to kill it. He's going to kill it. Baablu's Come Come on. Baablu's going Baablu's going to Baablu's going to kill Baablu's going to kill it! No. No. Bye, Bye, guys! Bye, guys! G Go, Go, g Go, go, Go, go, Go, go, Go, go, Go, go, g Go, go, go, Go, go, go, Go, go, go, Go, go, go, Go, go, go, g Go, go, go, go, Go, go, go, go, Go, go, go, go, Go, go, go, go, Go, go, go, go, g Go, go, go, go, go. Go, go, go, go, go. Go, go, go, go, go. Go, go, go, go, go. Go, go, go, go, go. Go, go, go, go, go. O O Oh n Oh no, Oh no, Oh no, Oh no, n Oh no, no, Oh no, no, Oh no, no, Oh no, no, n Oh no, no, no. Oh no, no, no. Oh no, no, no. Oh no, no, no. Oh no, no, no. He's He's No. He's lying. He's lying. He's He's lying. He's lying. N N No, No, n No, no, No, no, No, no, No, no, No, no, n No, no, no. No, no, no. No, no, no. No, no, no. No, no, no. No, no, no. Come Come on. You've You've got You've got it. You've got it. Dude, Dude, Dude, Dude, Dude, Dude, Dude, Dude, I- Dude, I- Dude, I- Dude, I- Dude, I- Dude, I- Dude, I- Dude, I- Dude, I- I- I- I I I can't I can't I can't I can't I can't I can't find I can't find I can't find I can't find I can't find I can't find this I can't find this I can't find this I can't find this I can't find this I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. I can't find this room. Now Now you're Now you're in Now you're in the Now you're in the End I I saw I saw the I saw the achievement! I saw the achievement! It's It's over It's over for It's over for you, It's over for you, dude. It's over for you, dude. It's It's about It's about to It's about to die! It's about to die! No, No, it's No, it's not. Oh It's It's about It's about to Oh my- It's about to fly It's about to fly away. There There we There we go. There we go. Oh Oh my Oh my god! Oh my god! Hey, Hey, Baablu. Hey, Baablu. Here's Here's the Here's the 1v1 Here's the 1v1 we Here's the 1v1 we needed. Ooh, Ooh, that's Ooh, that's not Ooh, that's not good. From From the From the start! From the start! Yeah, Yeah, good Yeah, good pearl. Yeah, good pearl. [mashes keyboard] Ooh! You You got You got this. [hisses] [hisses] Okay, Okay, I Okay, I need- I I need- I I need I need to I need to kill I need to kill an I need to kill an Enderman I need to kill an Enderman real I need to kill an Enderman real quick. I need to kill an Enderman real quick. Come Come on Come on dragon- [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] You're You're g- need need your need your trusty need your trusty old need your trusty old friend need your trusty old friend to need your trusty old friend to do need your trusty old friend to do this need your trusty old friend to do this for need your trusty old friend to do this for you. need your trusty old friend to do this for you. I I don't I don't think I don't think so. I don't think so. Yeah, Yeah, good Yeah, good job. Yeah, good job. Oh, Oh, what? Oh, what? What's What's up, What's up, bro? How- How's How's it How's it not How's it not dead? How's it not dead? Oh, Oh, Oh, Oh, Oh, Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the Oh, what the heck? Oh, what the heck? Oh, what the heck? Oh, what the heck? Oh, what the heck? Oh, what the heck? Oh, what the heck? Oh, what the heck? Oh, what the heck? What's What's up? What's up? Bad, Bad, you Bad, you have Bad, you have enough Bad, you have enough time. I'm- I'm- I'm I'm stalling I'm stalling him. I'm stalling him. [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] [gasps] I'm I'm I'm I'm Why Why Why Why I'm hurrying, I'm hurrying, I'm hurrying, I'm hurrying, I'm hurrying, I'm hurrying, Why are Why are Why are Why are Why are Why are Why are I'm hurrying, I'm I'm hurrying, I'm I'm hurrying, I'm I'm hurrying, I'm I'm hurrying, I'm I'm hurrying, I'm Why are there Why are there Why are there Why are there Why are there Why are there Why are there [sighs] I'm hurrying, I'm hurrying. I'm hurrying, I'm hurrying. I'm hurrying, I'm hurrying. I'm hurrying, I'm hurrying. I'm hurrying, I'm hurrying. I'm hurrying, I'm hurrying. I'm hurrying, I'm hurrying. I'm hurrying, I'm hurrying. Why are there so Why are there so Why are there so Why are there so Why are there so Why are there so Why are there so Why are there so many Why are there so many Why are there so many Why are there so many Why are there so many Why are there so many Why are there so many I'm Why are there so many Endermen Why are there so many Endermen Why are there so many Endermen Why are there so many Endermen Why are there so many Endermen Why are there so many Endermen Why are there so many Endermen I'm like Why are there so many Endermen on Why are there so many Endermen on Why are there so many Endermen on Why are there so many Endermen on Why are there so many Endermen on Why are there so many Endermen on Why are there so many Endermen on I'm like 800 Why are there so many Endermen on me? Why are there so many Endermen on me? Why are there so many Endermen on me? Why are there so many Endermen on me? Why are there so many Endermen on me? Why are there so many Endermen on me? Why are there so many Endermen on me? Why are there so many Endermen on me? I'm like 800 blocks I'm like 800 blocks out give give or give or take. give or take. No No No No No No No No No No No No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! No way, you have another pearl?! What What is What is happening? Oh Oh my Oh my god you you guys you guys have you guys have so you guys have so many you guys have so many Endermen you guys have so many Endermen on you guys have so many Endermen on you. you guys have so many Endermen on you. Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! Oh my god!!! What's What's the What's the dragon What's the dragon health Good What's the dragon health at? Good luck Good luck getting It's Good luck getting up Good luck getting up here! It's like, Are Are we Are we good? It's like, like, It's like, like, two It's like, like, two twentieths. Bye, Bye, dragon! Bye, dragon! Why Why is Why is it Why is it so Why is it so far? Why is it so far? Like Like I'm- I'm- I'm I'm trying I'm trying to I'm trying to kill I'm trying to kill these I'm trying to kill these Endermen! I I can't I can't get I can't get a I can't get a pearl! I can't get a pearl! Yes! Yes! Oh Oh my Oh my god it's gonna it's gonna die. it's gonna die. YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! YES! No. No. No! No! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Oh! Are Are Are Are Are Are Are Are Are you Are you Are you Are you Are you Are you Are you Are you Are you Oh Oh my Are you serious? Are you serious? Are you serious? Are you serious? Are you serious? Are you serious? Are you serious? Are you serious? Are you serious? Are you serious? Are you serious? Oh my god! Wait, Wait, wait, No! Wait, wait, did Oh Oh my Wait, wait, did that Oh my god Wait, wait, did that count? Oh! I I killed I killed it! It's Wait, Wait, does It's dead! Wait, does that It's dead! It's- Wait, does that count? Wait, We- We- No, No, No, No, No, Wait, what? No, no, No, no, No, no, No, no, No, no, No, no, No, no, No, no, we No, no, we No, no, we No, no, we No, no, we No, no, we No, no, we No, no, we killed No, no, we killed No, no, we killed No, no, we killed No, no, we killed No, no, we killed No, no, we killed No, no, we killed it! No, no, we killed it! No, no, we killed it! No, no, we killed it! No, no, we killed it! No, no, we killed it! No, no, we killed it! No, no, we killed it! The The The The The The The [grunts] Wait, Wait, what? The dragon The dragon died, N N N No, No, No, The dragon died, we No, n No, n No, no, No, no, No, no, No, no, No, no, No, no, No, no, n No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no No, no, no The dragon died, we won! n n no, The no, n no, no, no, no, no, no, no, no, no, no, w no, no, wa no, no, wai no, no, wait. no, no, wait. no, no, wait. no, no, wait. The dragon The dragon died, The dragon died, we The dragon died, we won! That's That's not- Does Does Does Does Does Does Does Does Does Does Does Does Does Does Does Does Does That's That's not Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that Does that That's not true. There's Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! Does that count?! There's no There's no way. There's no way. Oh Oh Oh Oh Oh Oh Oh Oh Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my Oh my There's Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! Oh my god! There's no There's no way. There's no way. No. What? What?",
    "start_time": 0.209,
    "end_time": 1723.339
}