{
    "video_id": "25FWYaA2ilk",
    "channel_url": "@dream",
    "transcript": "What is up? What is up? Hello. Welcome to the live. We're chilling. How are you guys doing? We're here to speedun. Hello from Australia. Hello Um, well, that's not quite enough loot. Good thing there's a shipwreck. Um, which way do I need to go? This way. Welcome back, sway Oblivion. Thank you for the dono. W. There's a village over there. Um. Uh. Well, you know what? We're going to get more iron anyway. Let's just grab our flint while we're here. Come on. Really? No flint. This is how we're going to start the day. Really? Um, thank you. Go ahead. Well, get this for food. We have extra wood now. So, we can make uh an axe and get I mean extra iron, not extra wood, and get wood. A crafting table. I don't need my crafting table. All right. Um now, let's go ahead and make this. Uh we got to make this. And why not make this and this? Now we got our food. Boom. And I can get shears. And what I like about this is that we can power up really quickly. [Applause] And maybe, just maybe, with cower strats, we can see a lava pool. Let's see. Is my stream thumbnail like updating? Like it's like an updated like kind of what I'm doing, right? I'm doing that this time, which is different than usual. All right. Surely a little higher. Okay. Um, this seems like prime real estate and there's no lava pool. Um, unless this has on the map. No, because it's the opposite way. Um, well, oh, I can't MLG on a on a tree. What am I doing? I can't I'll just water log the tree. I realized in midair it's too late. It was too late. Going to miss these streams when you get wrist surgery. Thank you for the dono. Yeah, I know. Me, too. Honestly, me too. I'm just like worried. I don't know how long I'm going to be out of commission. Like, it could be as long as two months. Um because at least if I can't play when I'm in the splint, then that will suck. If I can play when I'm in my splint, then it could only be a couple weeks. If you crouch, you can water clutch. Wait, is that actually true? Wait, am I am I stupid? I'm I'm testing that. I don't know why I've never thought about the fact that if you're crouching, you can probably place water on top of water instead of water logging. Let me see. No, it's not true. Okay. Yeah. So, I'm not stupid. Got a lava pool, but nothing else we can see. Um, we could enter pretty quickly if this cave has some iron. I mean, we won't have food, but we can maybe hope we get some in the Nether. Um, I don't I really don't know where Uh, let's see. If there's not iron down here, then we're just wasting our time. But I guess we'll see. Happy birthday, Bella. Late happy birthday. I guess a decently late happy birthday. All right, let's see. Do we got any iron in here? We'll grab a coal. [Music] Um, let's see. Come on. Give me more than two. Really? Just two iron. Maybe there's one more. No. And a mob. And a skeleton spawned. Got a bow. Yes, there's iron here. All right, we'll grab this. We'll head to the surface and then we can go. We won't have an iron pick, but we don't really need it. Um because we can just get it in the Nether. How are you, Dream? I'm great, Jordan. Thank you so much for the dono. Help Lacy and Marlin beat the game. They've been trying for 55 hours. I follow them on Twitter. If they reach out, I will help them. All right, let's um I don't have any food. I don't know where water is and gravel. Let me see. Um, where the honk is gravel and water. Um, okay. There's nothing really close, which is not great, I guess. I mean, we can just see if this seed's any good, cuz it could be. It might just be crap. But if we spawn in a bastion and there's, you know, golden carrots in the chest, then we're good. There should be water in this swamp. Surely, there's mud. The heck? Where is the water? Jesus. Um, well, this became kind of bad because we have no food and also we don't have gravel. Hey, but it's good to get the day started by doing our best to just get in the Nether, see what's up with the Nether, figure out, you know, Um well Uh, make a boat. Um, hey, let's just Yeah, let's just see. This nether could be epic. Wait, do I don't want to eat the other the rotten flesh cuz I got lucky. I'll eat it. No. Come on. Light portal. Light. Well, it's 720 with no food. This is really bad. And we're in a bassalt delta. We spawn next to the fortress, but not the bastion. So, we're in a bassalt delta. It's just bad. Getting a new one. Check out a new one. Dripstone cave there. Let's get a W seed. manifesting a WC. Thank you. Keep it up. [Music] Well, it's an L village. I don't see a lava pool. So, we can try though. gold nuggets. That's odd. All right, let's get this. >> Get away from me, you disgusting villager. You don't even have a job. All right, got enough for that. Hey, move. Um, then we go ahead and do this. All right. Now we get this and then we kill the pesky golem and then we just run. Guess we get food. Hello. Oh well. Here we go. Boom. All right, let's get a boat. Oh, well, we don't have enough. All right, let's just grab some food and run. Uh, I wish we could tower. I don't have iron, so there's no point in getting um flint. All right, I'm going use a little bit of wood. I love how Mo Jang made sure to pick the ugliest poss for its grass color and all later biomes. Like, yes, I love chopped swamp green. Yeah, exactly. Um, Um, well, I don't think there is a good bastion. Oh, well, there's a fortress there as well. Um. Oh, well that's stupid. Don't hit me in the lava. Um, can I make it here? Uh, I didn't want to use all my wood. Okay, at least I have enough to make sticks. We need an iron pick. We also need a bow. So, I need more wood. Um, two fortresses is bad for us because it means there's no bastion and and also I didn't there's no bastion on. Um, so my question is what is the best play? Um, this fortress is further, which I guess progresses our movement away from spawn. So, if if we do end up playing this seed, it's probably better because we get closer to outside the spawn quadrants. Um, okay. Well, let's do this here. What's the logic behind that? Okay. So, basically, um, there's, uh, quadrants. There's four quadrants around spawn. Pause. Pause. Uh, neg neg negative positive positive negative. And um, one fortress and bastion can spawn in each one. There's a 90% chance that there's either a fortress or a bastion. Um, it's a 40% chance of a bastion and a 50% chance of a fortress. Now, when we are at spawn, when I raid, there's no bastion, right? So, that means that there's no bastion. At least realistically, there's no bastion in any of the close quad the clo close four quadrants. So, we're going to have to go outside of uh the close four quadrants to like a further quadrant. So, it's about every 350 blocks or something like that. So, in this specific case, uh this fortress was a little was like further. And so, my thought process is that uh like going to this one instead of the other one, we're saving a little bit of travel time because we're already like we're already closer to leaving the quadrant cuz now we're only 150 blocks from leaving the quadrant. Um, but the odds are it doesn't increase the odds at all. All it does is just save us like 50 blocks or 100 blocks of travel time or something. But um if that if there is a bastion, which I don't even see a bastion this way either. So seems like we're probably muffin. [Music] Well, I need to eat. Um, okay. Well, [Music] We have low drops. Kind of annoying. We're actually our our axe is almost broken. [Music] Still bad drops. Our axe is actually going to break. Um Wow. I'm going to die. Jeez, the drops are just abysmal. Um, Okay. Well, crap. Okay. Uh, what do we want to do? Okay. Well, there's just no bastion. Uh, there might be. Oh, there's a bastion this way. It's probably far though. I only have a wood axe. Kind of annoying. Also don't have gold, but we can grab it. We also don't have We don't have an iron pick either. There's a bastion. Uh what is our strategy here? Oh well there's terrible terrain t for the streams. Thank you anonymous. I'm saying a good run is dependent on the seed. very dependent on the seed, but it's also very dependent on your your own skill. Um, Um, okay. Uh, well, we got a lot of food in the ruin portal, which is good. We're in a stupid biome, though. I don't think I've ever chopped down one of these trees. I was like confused for a second. Like I thought there was no wood here. All right, let's roll with that. Let's see. Let's check out this cave right here. See if there's anything useful. Surely there's iron. Think there's a lava pool here as well. Unless it's just a uh no iron. There's never any iron. There's just never any iron. and just see if there's iron right here. And if there's not, then I'll reset. Um, there's iron here. Technically, that's all we need. We don't have an iron pick. So, um I think that the ruin portal has a uh lava pool, but there was also I think a lava pool in here. Unless it's just a singular piece of lava. I think I'll go to the rune portal. I don't want to actually No, I don't have water anyway. All right. Uh I don't see water. All right, there's water over there. Okay, there's actually a lava pool down there. I might actually Act actually I prefer this. It might be easier to build it at the bottom. Uh, um, is it easier to just jump down there and build the portal or is it easier to build it up here? I think it's easier to jump down. Um. Oh, I thought that was a lava pool. It's not a lava pool. Oh no, I got baited. Surely there's a lava pool. Oh, I just got baited so hard. Oh, well. Um, what am I looking for? This uh uh I mean, this ended up being kind of mid, but 6 minutes isn't it's not terrible. Got a little bit of carrots. Bastion this way surely. Actually, maybe not. Yeah, I don't think I don't think so. Fortress over there. And we only have 30 here. I think probably uh it's a fortress. Yeah, it's a fortress. Um, we can still can still run it. We have blocks and food. Might be a bastion close. Uh, well, this is a little more complicated. Um, maybe I should have just gone over there and bridged to be honest, but I was thinking there might be a walkable path up here. Maybe there is. Oh, what the muffin crap. This bad seat anyway. Why would speedrunning help for the 600 video? You're trying to survive, not beat the game as fast as possible. We're kind of trying to do both, but the biggest reason it helps is because when you're speedrunning, you're uh you have like no armor, you know? Like you have no armor and you're going really quickly. And going really quickly make puts you in like precarious situations. So like being able to, you know, uh be put into precarious situations and live is really helpful. Yeah, boat clutches are annoying now. Hopefully that guy just dies. Um, what I want to do. Um, all right. Uh, let's see. Any more houses? There's a ruin portal up there. All right. Um, no more cuz one more lava Maybe. No. One more piece of lava. prep. Um Um. All right. Oh, well. Uh Yeah, sorry I didn't take the fire charge. That's stupid. All right. Well, there is a bastion this way, surely. Oh well, that flowed so quickly. I kind of need to go pee. Um, why'd you put it easy? Well, it's it's already it's always on easy. I put it on hard to speed up the uh wood light of the portal because the fire spreads quicker. You have Four iron right there by Dresa. Oh, you mean like on the ground or something? Like iron ore? I believe it. Um I think this is Oh, it's a good side. Um, let's get a tree. Um, well, this shipwreck is northwest. I mean this uh buried treasure which we could use for food potentially if it's close. I have no idea. There's a lava pool. Okay. Well, let's actually not go for the shipwreck and let's just go to the Nether. Or I mean not shipwreck ruin port I mean not ruin portal. What the heck am I saying? Uh god damn it. Uh, bury treasure there. I don't know why I made a stone shovel when I have an iron shovel. We don't have food. Um, uh, Well, we don't have food, but it's okay. Um, we can't really do the fortress first cuz we don't have food. Bastion's over there. Okay. Question is, what's the best way to get there? Um, I'm actually thinking it's this way. Could be wrong. We get to this island and we go across. Um, do I go up or just across? I think I go up here. Holy cow, I hit the side of that block. I really don't want to use soul sand to uh tower because it's less than one block and that screws me up sometimes with like mobs. So, let's just have more of that in our inventory ready to go. [Music] Where's the bastion? should be like right here. I think it's below here. Um, am I past it? There it is. Well, that is not what I meant to do. Uh, I left this left the boat. Minecraft change how boats work and it's kind of annoying, but it's okay. I'm learning. I'm doing better today on boat clutches than yesterday, but it is annoying that they changed the boats. That was a good seed. I mean, well, it was a bad seed, but it was the Nether was good. Um, all right. Well, yeah, Mojang changed how boats work in like 1.20 or something. I don't know. And actually, I think it was 1.21 21 cuz I haven't noticed it until recently. But also I it doesn't it's not it's not really changed on servers. It's changed on um it's changed on single player pretty much. [Applause] So it doesn't affect me in like videos, but it does in specifically speedrunning. Um, let's grab some of this. Want a bed? Um, okay. Let's grab water and gravel. Um, and then Why is there no gravel? Um, there's gravel. Uh, all right. Let's go ahead and do this. Uh, I guess I'll make this. Um, okay. Now, um, [Music] what is our best bet? I don't want to tower up, but Oh, what the heck? There's a lava pool in the village. I like ran all the way around it. How did we not see that? Oh my god. Hey, it's all right. We get we get one of those every once in a while. That was our first mess up in a long time. Uh, there's no close bastion, but there's one this way, which is not close, but it's okay. Noob tower. Well, hey, look, the tower in offline has worked pretty decently for me by tower pretty quickly cuz there are I think there's more lava pools than I realize and I just never end up seeing them because the terrain in this version I I don't think they changed the frequency of the surface lava pools. I think what they I think it's just that the the um uh the terrain is so much like steeper. Like there's mountains and hills, so it's so much harder to see the lava pools. So towering up like allows you to see them better. So and I think that having a surface level makes a huge difference in my enter time. So like I think it's worth it and I and I can just reset if if there's not a service level to be honest. Where are we? Um, Whatever. Uh feel free. [Music] Um, the only problem is this goes down the hole that I wanted to go. Um, okay. Well, okay. Well, I was dead if I mined one more block. All right. Oh, well shoot. That's not what I meant to do. [Music] Uh, well, that's annoying. This is a bad thing cuz I killed the piglins above, honestly. And the piglands below. Uh there's like lava everywhere. So like I don't think I'm going be able to trade very quickly. Still good practice, but it's just annoying. Um I think I'm done with all the gold blocks. Um, all right. Well, this is the problem. Where do I do these trades? Um, cuz there's piglin brute here. Um, okay. Where the heck do I do the trades? Uh, there's just no piglins. I think I killed most of the guys at the top, which was an accident. Um, so question is, can we just go back up to the top? And are there enough piglins? I hear some. Okay, there's one there. Yeah, I think I screwed up by killing the ones at the top to be honest cuz they didn't spawn at the bottom. I thought there'd be a lot more at the bottom, but there's just not. Um, guess I could There's probably a brute down here. There might be other pig ones. Uh, hey guys. There's definitely a brute here. I don't see a brute. Oh, well sir, just follow me real quickly. Bro, my foot's asleep cuz I'm sitting on it. Let me just readjust real quickly. I mean, this seed's cooked because we don't have piglins. Um, we only have one in here. Surely there's more. I hear more. >> Guys, look at this. You ready? >> Okay. Well, I mean, it went from I went from terrible to uh not as not as bad. Um, pearls. Um, we didn't see a fortress either. So, I mean, this is I think it's this run's kind of cooked, but I'll I'll I'll humor it by continuing to play. [Music] Um, let's see. I mean, if we can get a little bit more pearls, one more pearl trade and I think we It's not bad. Actually, got 20 obsidian. [Music] Come on. One more pearl trade. unlucky. Come on. One more pearl trade. I think they're done. No. Unlucky. Um, well, we can still go, but there's no uh [Music] go to spawn for a fortress. Which way was spawn? Spawn was 00 towards 00. Um, I guess I I I just don't I just don't have pearls. Like, I just can't pearl, which will make this so much slower. Oh, and I picked a bad spot to pearl to. I mean, I could pearl and then hope that there's pearls like we find pearls in the fortress and stuff. I mean, in the stronghold, that could be a play if we if we're going for like a good time actually. Or or hope that there's like eyes as well. That could be worth it. I'll throw one or two pearls, which otherwise it's this time is just gonna be bad. I mean, if we don't pearl, the time's just going to be bad. I feel like maybe we save it for I'll save it. I I'll throw a couple pearls because the odds of it being Are we underground? No, we're above ground. I don't remember where the fortress is, though. Uh There it is. I mean, yeah, we just it's so far. Unless we use some pearls, it ain't going to be good. We just kind of have to hope that there's one or two eye in the stronghold or we find pearls in the chest. And we have to hope the stronghold's close as well. And we have to hope Blazes are quick if we want to PB. We need a lot of luck here. This weather skeleton being here is annoying. [Music] There's some strays. Um, all right. Well, crap. Where did my eye go? Where's my other eye? Did it break? Uh, I don't see it. Feel like it broke. That's really unfortunate. Either I lost track of it or it broke. All right. Um, we got to go to 672 2352. Uh, it's really far. We don't have pearls. 672 2352. Yeah, it's pretty cooked cuz it's really far and it's already 21 minutes like and we and we only have eyes. I I don't need to I'm not going to run it. We got a village. I actually really like the villages in this uh got a lava pool. I really like the villages in this biome. I've been so accustomed to watching these streams or catching up on the VODs. Don't know what's going to happen when you're on break. Seriously though, thanks for all the streams. Much love and appreciate you. Thank you, Jojo. I appreciate it. Yeah. Hopefully you guys don't miss me too much. H. We'll check out this rune portal. See if it's any good. A savannah village. Um, well, it's kind of a crappy chest, but There is a village right here. And we do have a hoe and one iron and a flint. So if we get from the golem five, then it would be good. And there's a lava pool. We also could get a bucket from one of the chests. It's about a 18% chance. I think I saw somebody say before [Applause] you a robot. No. Previous desert seed had a village. Yeah, I saw there's just no wood. Well, we need the iron golem. He's right there, thankfully. Um, well, I guess we might not need. [Applause] Only three. Guess we don't need an iron pick. >> Um, it's annoying cuz I avoided making stone one. Um, I don't know why I made that first. Slows us down a little bit. Whatever. All right, let's grab water here. I guess we can just go to the lava pool, get some extra wood. Need a boat, but other than that should be good. Uh all righty. We have no iron pick, but other than that, we're decent. Actually, I'll save that. Okay, so no close Bastion. Oh, there's Bastion right there. I guess it's farther than it looks probably because the entities took a bit to load in. Yeah, it is farther. [Music] >> Um All right, we got our blocks. I thought the edge was like right here. There you go. treasure. Um, you have fruits. Hey, Oh god. Can like climb up my lava. Oops. I didn't mean to fall. Hopefully, it's fine. Please don't jump down and kill me. Um, all right. Uh, that's funny. It doesn't really help us very much. I mean, it does, but it doesn't. Um, see, let's make a gold helmet. Uh, where was the most piglins? Okay. Um, let's see. Nobody over here. Oh, what the heck? Hello friend. Okay. [Music] [Music] Oops. [Music] Oh, I didn't mean to hit you. Oops. Sorry, sir. You're not going to get in this hole, are you? Oh, you're too mad at me. Get in the hole. Get in the hole. Um, please get in the hole. Thank you. Where are you guys? Are you guys up? It's kind of annoying. Okay. [Music] >> Um [Music] [Music] The only problem is that uh as well I need obsidian. Uh, okay. They're done. Um, well, we can maybe home portal. Um, or we can check these chests up here and see. Oh, what the heck? God damn it. There's probably going to be brutes here. So, need to be careful. Am I being stupid? Oh, I went above, I think. [Music] Huh? Hey. Um, okay. Well, Where? [Music] Um, did we see a fortress? I don't think we did. Um, crap. The only problem is we need a home portal. We don't have enough obsidian. So, we do like need there to be a fortress. There's a 90% chance of a fortress in Bassalt Deltas. I don't see one, but Oh, it's not even a bassalt delta. this way. Or maybe it is more this way, though. There's a fortress. Um, let's just do that. [Music] Really? Uh, what the muffin? I only got two. That's so lame. I don't have that many pearls. Oops. Thought I had more. Um, question is, do I just blind I have six. Do I just blind? I don't have pearls, I guess. Is my home portal underground or is it surface lava pool? I can go back. Oh crap. [Music] We have the obsidian. This could have been PB, but we don't. [Music] forget where my portal is. I don't want to pearl to the wrong direction. It's like below here or something. Yeah, it's below Um, well, I'm We need it to be a whatever in the thing anyway. It broke. Oh, and it went to two different strongholds as well. And it broke. Oh my god. Oops. Bad luck. Unlucky. Two eyes broke and it went to uh and it went to a different stronghold. So it was just it was cooked. I throw another one. I'm going to go pee real quick. Speedrun timer. Time me. Be right back. Let's see if I can break my record. All right, I'm back. I'm back. All right. All right. All right. Nothing there. Like my computer's struggling a little [Music] I wish that my world would load. be a lava pool right up on that hill. Probably not, but could be. It'd be beautiful. It's close. So, it's northeast. That seems kind of odd. I guess it's mostly east because Um, actually have enough to do this. Um, let's go ahead and make that All right. Uh, well, the shipwrecks I mean the buried treasure is probably like right here. We can use it for food. Could check the land for lava pool. Another shipwreck. Well, I don't see any lava pools on this map, unfortunately. Should imply maybe we just go straight down. Let's see if we can get some lava. Slower. Enter. I hear a cave. those lava pops. But it would take me forever to mine around and find it. When you're at lava level, then you know that you know what it's at. So it's a lot easier to find We have lava right down here. We're at a reasonably good Y. Well, it's annoying that there's no lava. All right. New seed. This is big and open. Lava right here. How is there no lava? We're like at good lava height. Right down this cave, maybe. Um, surely right here. Otherwise, I'll just reset. Surely, surely. Well, that's a bummer. I mean, it's just a slow enter. I think there's a relatively close bastion. [Music] Um, well, Um, speech. Um, okay. Let's just go here for a quick second. Um, I'm Oh crap. He can like do that parkour jump. I didn't know that. Oh well, that that makes sense. He came around that corner. Speedy. That could have been good if we had a good enter, but we The problem is we didn't. It was such a slow enter. Thank you for the dono. Hi, llama. Llama the cod bro. It's annoying that the brute could go up that like corner jump. I didn't know that. I thought they couldn't. We would have been fine if they couldn't. Uh, okay. Got a lava pool and a ruined portal. But it's no food or village. Um, I don't think this is going to be good enough. No, still not. Probably reset, but we'll aura farm by making this jump real quickly. And then Oh, it's still probably not. I just need two more blocks. Good enough. Then we'll check. That's actually enough to go to the Nether. We can wood light, but Um, let's do this. We can wood light enter with like basically no food. We can kill the sheep though. As long as we have a boat, we should be fine. Um, let's just All right. Um, I want to just grab this real quickly. Oh, oops. I didn't complete the side. Uh um I Need [Applause] [Music] Well, it ain't wood lighting. This is odd. It's definitely not a close bastion. Okay. Well, there's one Not close, but probably far. Just straight south. Um, well, Uh, well, I guess we're hoping we have pathing. It's more left. We need an iron pick. Mhm. Mhm. Um W chest. test. [Music] Um, okay. Well, where do I want to go now? Uh, let's see. I want to go back up. I don't know what bastion this is. Oops. That's not what I meant to do. Hey guys. Um, okay. I'm trying to go here. >> Um, perfect. [Music] Oh god, this guy didn't follow me. Um, okay. What do I want to do? That was stupid. Hello, sir. Um, now I know they can make that damn jump. Oh god. Oops. Crap. Not mean to hit him. Hello guys. Um, let's just give you gold. [Music] Um, careful about up there. God damn it. I do that more frequently than I should. Um, heavy. Well, got a little unlucky. Pick up the gold. Um, Um, um, well, That's unfortunate cuz we do not have enough obsidian. We have a diamond pick though. So, we should just go. Uh, we didn't see a fortress though. Or did we? I don't think we did. Uh, I guess we're actually closest to going out the other direction. This is annoying cuz we're inside the wall. Uh, is any of this good? I don't I really don't know. It opens up fortress. I don't have food. Bad luck on the spawn being out here. Oh no. [Music] That was clutch. Um, I don't have enough to go, but what I'm going to do is Okay, I just got to go. I got to get one more blaze. 3 936 3208 no fire res. Uh and 32 320. Oh, gas. Leave me alone. [Music] Jesus, sinking so slow. Um, I don't want to pearl. I didn't grab obsidian. I always do that. I always do that. It wasn't going to be PB anyway, even with if I had to stop if I had to stop and grab the obsidian. Man, I need to remember to do that. I always forget. I just like always forget my cup over. It was just All right. What's your opinion on the cactus block in Minecraft? I mean, I guess I think the cactus block is cool. That wasn't PB if I grabbed the obby. It's 20 more seconds. And also, I'm like low on health. Like, it's not even I don't even think I don't even know if I was going to be able to finish. I didn't have food. I could have grabbed some food in the stronghold. Maybe it would have been fine. I don't know. Yeah, I did forget the obsidian. I've done that a lot. It's annoying. Well, I've done that like half the time whenever I need to mine obsidian cuz it's just like, why do I need to mine obsidian? Why can't I just get the stupid obsidian trades? Yeah, I was behind my PB and had no food and etc. So, it's unlikely that would have been PB, but unlikely does not mean impossible. eBay means personal best. Nice, bro. I don't really like cactus. I had bad experiences. Have you now? Interesting. What are you looking for in the beginning? Iron, lava, food. Lava pool. Let's get a water bucket. or not. We can get a barrel trade. [Applause] Um, Um, well, that's kind of annoying, but Um, uh, I guess we can just go. We don't have enough for a flint and steel, though. Maybe it's worth it to make the flint and steel and then hope we get enough for the iron pick and the bastion. Still have two actually. We already have a two iron head start. [Applause] I don't know what the best strategy is. Guess I don't have a flint anyway. Um what? Oh god. I had my water bucket on a different slot. Um um I don't have a pick. Uh, all right. Let's make more bread. Put that there. Let's go ahead and make uh axe and shovel. Did you ever finish a 10-minute run yesterday? No, we didn't. The seed was kind of cooked. Well, there's no close bastion. [Laughter] I would have landed it. There's just no terrain. I placed it. I mean, there's no Bastion, so it's just an L. Was an L. I'm clipped. Come on. It's a lava pool. Um, I'm hoping for like ocean ruins. There's a ship back over here. It's probably a reset, but It's a lava pool. So, we still get like a 5m minute enter. Oh, there's a room portal. I just left my crafting bench. This is just a reset. It's a run portal. It's the bad side. There was a lava pool in the ruin portal. I didn't miss it. I saw the lava pool. I ran right by the lava pool, but the ruin portal just was so far and I didn't have iron. And the and the ruin portal can't really make can give you iron, but like not enough. I don't know why Minecraft is struggling. Um man Uh, I can restart my game cuz maybe it'll fix this. What game is this? It's Minecraft. Um, All right. Well, that's not bad. All right. Do we want to go to this ruin portal? I guess we might as well. We're going the wrong way for the buried treasure. So, we won't go to the buried treasure. How many chests are in a shipwreck? Three chests in a shipwreck. Um, okay. Let's use this to make that. Put these on. Um, let's put this here. Okay. Um, how are we going to do this? Uh, uh, let's do that. Let's do that. Um uh what a clever mission is lad. One last question though. Tacos or cookies? Tacos. Got to go for got to go with the tacos. Okay. Well, Bastion is this way. Oh, there it is. It's across this annoying to navigate area, but it is there. Um, this actually isn't that bad. fortress behind me. Okay, that's good to know. The only thing is this is rather annoying. All right, there we go. So fortress the opposite direction like back towards my portal past my portal I assume. Uh what is this bastion? >> Okay. So Oh, there's a brute. Let's just leave this guy. Food. That is something that we need. Chest here. Nothing. Um, bold block there. All right, let's see. Okay, this is good. Still want to get this, though. Oh god, it's annoying that I'm low on blocks. Okay. Please tell me there's a whole bunch up there. Yes. Get in the hole. Get him. Hey guys. Um, all right. Let's give these guys this. Why are you hitting me? >> Oh my god, I do that so much. I do that so much. I don't even know how that I did it that time. Jesus. like get in the hole, buddy. All right. Um Uh, okay. While they trade, I'm going to go and check if this is good. It is. Hey friends. Why not left with pearls? Because I need obsidian. Um, I could check the chests upstairs. Uh, eight obsidian. There guys here? Nope. It's just this guy, which I don't need. Um, should I go up? Uh actually I have 10 a home portal cuz the if the fortress is right here. Uh well crap. Where is fortress? It's probably behind this way since you guys saw it. How do you guys see it? I don't see it. Oh god. Oh my god. It's a mess. Unlucky. No blaze rod. If we didn't have to home portal, this would be pretty epic. But we do. Um, already have a bow. Uh, let's do that. Uh, heck am I doing? Building like a weird bed. Uh, let's take that. Um, Okay. Well, bad luck. Low drops. I still need a decent amount more. Hell dropped and L spawns. L drops and L spawns. Get four and drop three. And I'll go cuz we're on the surface. I'll go with six. Well, we got five. W. Well, drop two. Drop two. Drop two. Nope. All right. Well, I'll go with I'll kill this one. Please drop. Please drop. Please drop. Yes. Yes. Yes. Is this the way around? Yeah, it is. There's a wither skeleton, though. It was not there before. God damn it. Oh, well, everything wants to kill me. [Music] [Music] Where's my portal? Still this way. Portal's far. Wait, what? No, no, no, it's the other way. Where the heck is my portal? It's annoying that we had to home portal. This would be a really good time if we didn't have to home portal. Because we have to home portal, it's probably not PB or anything. Uh negative 1360 896 I have no more food. 1360 896 Um, Um, library stronghold room. That was good. Quick nav. Oh god. Okay. Um, Jesus Christ. I don't have any food. I guess we can throw one pearl. Um. Oh, that's kind of annoying. [Music] I can pearl once. Jesus, it's so high. [Music] Heat. Heat. [Music] [Music] I don't know if I can pearl. No crap. Bad luck. We weren't going to PB, though. And I had to bet otherwise we weren't going to get PB. I had to. I That was the best play that I could have done, but unfortunately could have done anything. If I was up like.5 health, then I could have pearled. But unfortunately, the dragon did half heart to me. Should have grabbed water. Where's water? Where could I have grabbed water? You need lava in the Nether. That wasn't PB. That wasn't going to be PB. The only way it was PB is if that bet if that was PB. If I had half a heart more. If I had half a heart more, then that was PB. But the problem is is I didn't have half a heart more. So, I'm going to restart my Minecraft. Try and fix the uh lag and it's annoying. I had to home portal. Like let's say I had 10 more obsidian. That would have been a PP by like minutes probably. Could have even been a sub 20 potentially. Like I had to I had to I had to go all the way back to the home portal. So dumb. Oh, when I was at the home portal, I could have grabbed water. That's what you're saying. Yeah, I guess I actually I could have. I was there was water around me. I should have. That would have been better. Still slow, but it's better. I don't know. I don't know why it's Minecraft being dumb. Yeah, if we had better blaze drops. Like the thing is also is like I wouldn't have had to risk doing the bed. Like the only reason I had to do the this is the problem is like stuff that happens and it's like oh damn like you threw it. It's like well no because the problem was I had to take risks there. Like there's a chance the dragon the the dragon or the bed doesn't do half of damage and then I can pearl. There's a chance the dragon doesn't hit me and throw me up in the air and then you know I just beat my PB. But the only way that I don't I guarantee don't beat my PB there is if I don't do the bed. If I don't do the bed, then I do not beat my PB no matter what. And so, um, I had to take the risk of doing the bed, which then of course, you know, if the dragon if I get unlucky and the dragon hits me, then I'm just I'm me. So, it's just, you know, just those decisions you make. And then when I was in midair, like like it's so funny. This is really stupid. Like the only thought that crossed my mind of like how I could live is by crafting a boat midair. Like I could have gone by that pillar, you know, like when I was on the way up placed like I but I had to the only problem was I had to craft a crafting bench. And of course I I probably there's just I like nine out of 10 times I or more than that probably I would just die anyway. But like that's literally the only way I would have lived there is if I go to followed by the pillar, place a craft bench on the pillar, craft a boat in the crafting bench and it just I would have just died anyway. There's no way. It's just like impossible. So hard especially on this version. Yeah, if I had some food then W. But no food. We did great there again in in the dragon. Like that would have been a really quick dragon. Like if the bed if we had full health, like the dragon would have been dead in what, like two and a half minutes or something. That was a quick dragon. If even if I had a boat, I would have died there because you just cannot boat. I'm telling you, I don't think you can boat on single player from that high anymore. Like, it's like basically impossible. Like, if I I could only way I would have lived if I boated onto the pillar. Like, I I cuz I could fall by the pillar. So, I had like you have more time to boat before you hit the ground. It's the only way. I just need a water bucket. You could lava clutch with fire res uh on the side of the pillar, but it only reduces your fall damage. I think it reduces it by like half or a third or something. It's close. All right. Uh, we have a lava pool. So, let's go ahead and make all of this Let's grab this really quickly. [Applause] [Applause] All right. So, I need gravel, but Um, I didn't get gravel cuz I'm stupid even after I just said it. I was just like thinking about something. Um, all right. Let's go ahead and do this. I can't even do that. Um um let's go ahead and do this. I saw somebody say make a an extra bucket for water. And you know what? That's actually not a bad idea for me cuz if we get to the end, we it'd be useful to have um Okay. Uh let's see. This way. Yes. This way. Bastion's right there. Uh, we don't need blocks. Fortress is right here. Question is, that's treasure as well, honestly. Let's do the fortress. Blaze spawner is right here. Oh god, there's guys here. Oh god. Okay. I think uh I'm not saying it's always the best play to do the breaking water bucket, but I have a lot of extra iron. Um so I think it's fine. Um, let me just uh should have crafted. golden boots instead of golden carrots. I disagree. I think there's a lot of other places to get golden boots, but the carrots right now are more useful to me. Definitely know there's a fortress. [Music] Oh, how'd that hit me? [Music] That's enough. Oh, that's eight. Especially cuz this is treasure. Like this should be with treasure. I I can just get the gold right away and then make a gold helmet. I just need food that won't be able to like pearl very much. I do have a water bucket though if we make it to the end. So that reliance on food is a little bit less. Um, all right. What do I need to do? I want to come over here. All right. I feel like we haven't gotten a bridge in so long. All right. Let's see. There's a guy down there, but there's also brutes there. There's a guy there. There's a brute there. Um, the only problem is this guy's annoying. Oh, he's annoying. Thank god he died quickly. Would have been annoying if not. Okay, guys. Let me put you in here. Yes, there's enough of you. Let's just drop that there. Um, let's go ahead and get this. Okay, it's a triple. There's brutes there. Surely you guys want to come up here. [Music] Um, okay. We solved our Uh problem. Um, do I just home portal? Or do I wait? Cuz I could wait. [Music] All right, I'm just going to home portal. [Music] Negative 1232424. So it's Oh, it's bad terrain. That's annoying. [Music] 123 2 -14 24. Uh Overthrew [Applause] a little bit. Perfect. Could have gotten water from here as well. Anyway, [Music] What's the All right. Are you Heat. Heat. [Music] It's pretty far. Jeez, it's so far up. [Music] Heat. Heat. [Music] Yay. Wow. That ain't bad for an old man. 1916. That ain't bad for an old man. 1916. I said wow sub said sub wow sub 20 with cheats with the with the clown emojis. Yes, the cheats of using the same pearl rates from the version everyone speedruns and eye calculation that speed runners also use. The biggest cheats probably uh would have been render distance, but I also saw the fortress like on the way to the bastion that I located through entities. So, that's pretty good. That was a good time. I like that. No, one cycle as well. With a one cycle, that's like couple minutes quicker. Two minutes quicker or something. Um, all right. Thank you, cowboy. Thanks for the dono. That's going to be such a hard PvP. Yes, I do think that'll be hard to beat for Well, I mean, we had to home portal. We had to home portal. If we had obsidian, we would have saved a couple minutes. Yeah. And the dragon went so far as well, which cost sometimes. Nice job from one old man to another. Thank you, Sam. Exactly. I'm an old man now, but I still got it. I could have made the decision to home portal quicker. Like we're if we're that close to the home portal, we should just always home portal it as soon as we get 10. If we don't get a bunch from the chest, but if we're like at 18 or something, then we can wait. But home portaling, I think, adds probably, you know, I don't know, couple minutes or something. It took 30 seconds like 30 seconds home portal though. No, it took longer because also like that we had to run uh we we had to go to the fortress as well. Like I think it probably took I don't know 40 seconds to get to the home portal like travel to it. I think I probably added a minute about I think the interesting thing is that that could have been similar without uh the pearl rates um possibly because we could have waited a little bit and we would have had the like let's say we're on 1.6 16 would have had the higher we would have had higher obsidian as well. So we could have we would have lost a little time sitting at the trades. We would have gotten the obsidian. So we like it might have evened out. I don't really know. Obviously it's hard to know but but still I think I don't think it would have added that much time unless we just got really unlucky which we could have. I don't know how many pearls we used. cuz we used cuz we used like what a couple pearls going back. I don't know. Yeah. And I went to the fortress first again. All my best PBs I think I've gone to the fortress first. Maybe maybe not the 23minute one, but Oh, I didn't get the seed. We should go back and get grab the seed before I get too far from it to know which one it is. I don't know which one it was. Do we know? 1259. It's probably this one. No, this one. Crap. Which one is it? This one. All right. Here you go. I'll paste that. I'll put it in the chat. You guys want to run it yourself or something? Oh, I can't even I can't put it in Twitch chat. Oops. All right. blacksmith. What was our enter on that? Do we have a quick enter? I think we did. I think we did the fort. We were done with the fortress in like 8 n minutes. So, we must have entered at like five or something or four. Have you seen this sky crab? speedrun choke I have. It's so sad. That's so sad. [Applause] [Applause] That's pretty good. And it's not the best blacksmith, but it's good for us. It's one of the best blacksmiths we we've ever gotten because we get so unlucky with these Um, all right. Well, [Applause] fortunately doesn't seem to be a lava pool that I could see at least. We need to kill the iron golem a bucket. Hopefully enough for a flint. How's your new record? Yep. We just beat in 1916. It's pretty good. Um, do we want to run around for a lava pool or dig down? Kind of mountainous. I don't think I'm going to see one from tiring up. Think I'll just stick down. I didn't get flint. Um, surely there's lava in here. Yes, there's lava. Surely. Yes. Um, um, let's see. [Music] There's a bastion. Unlucky. Um, I want to do that again. I thought there was right a way right up. Am I wrong? Um, crap. I screwed up. Oh, I screwed up. I mean, I guess I didn't screw up. There's not really anywhere to go. Well, that's rather annoying. I'm really low. That's a blaze. Okay. So, there's a fortress. Well, jeez. [Music] No, of course I got sniped from across the way. Damn it. Why' I get sniped from across the way? If I wish I had better food, would have healed quicker. I just was getting like destroyed from everything. There was there skele there's like so many things that could have happened there that I just would have died. The skeleton wasn't there if the magma cues weren't there. If the stray blade the stray blaze wasn't like up on a hill. So many things. They have been good. [Music] [Music] Blazes have a 50/50 drop, I think. Do you eat ice? Well, usually I drink drink that has ice in drink and then the drink runs out and then I have the ice as my dessert. When was the 1916 run? It was like 30 minutes ago or something. It's fairly recently. Yeah, the chunks are still loading like crap. Do not know why. Lava pool. rune portal up the hill. I think I want to grab that first because we could have an axe. That would make things a lot quicker. Oh, there's blacksmith. Okay, this could be a good seed. Well, just got a little bit worse cuz I just wasted time coming over here when really this this ain't going to help me very much. We don't have an iron pick. All [Music] right. Get some food. All right, let's kill the golem. All right, let's do this. Throw that. We don't need that. If we run into gravel, we'll grab it. But we have a fire charge. So, we don't technically need it. Oh well. Um, okay. Uh, I didn't make a boat. Uh, okay. Well, this is kind of crap. Also at 95. I'm a little high. Maybe I hear people. I don't know what what's making you guys mad, but I do hear you. Where the muffin are you now? You're behind me and below me. Okay. >> Okay. You guys are all my friends. I was scared for a second. I forgot I was wearing gold. I was like, \"Jesus, there's a lot of people here.\" But then I realized that it's okay that there's a lot of people because I'm wearing my cloak. Well, I don't know why I can't. I thought it was a brute. Wait, is that a brute? No, it's not. But where the muffin do I go? Jesus, this terrain is not fun. Um uh okay, Sebastian's still more left. Oh, this is just probably cooked. Well, I didn't see anything this way, so probably have to reset. Oh. Um, yeah, I'm just going to reset. Maybe there's a village. Have you noticed a significant improvement in your skill since you started streaming again? Yes, definitely. For speedr running, I guess specifically Oh, what? I thought it was one down. I'm going to drown, but I will get this chest. Just before I drown, I will retrieve the items and then I will die a glorious death. No. Are you kidding me? I was one pixel off. Today's my today's my birthday. All right. Rate my man on thumbnail on a scale of 1 to 10. Honestly, um, I appreciate the donation, but I'm not sure that I want to set the precedent that I will do that for donations because then people will donate, ask me to do that, and then I have to like tab out of my game and go to people's channels. But thank you for the donation. There's a blacksmith over there. Happy birthday. Okay, there's a lava pool and there's a blacksmith. Maybe I should have killed the iron golem here. Nah, it's too long. Okay. Well, this is good because then we can get iron pick. All right. The iron golem. Get an iron pick. I didn't get a bucket. Another blacksmith. Uh, okay. Let's go ahead and make that. Do we have We do have enough. Let's make that. All right. I grab food. No, it's like a diamond hoe. I'm just kidding. Thank you, Sora. Thank you, Sora. Appreciate the dono. Lava pool is right over here, right? Where was it? Over there. I don't know what I'm doing. Oops. Um, okay. Uh, this is a deep lava pool. Um, Okay, so there's a bastion this way and the fortress is the other way. I thought that was like andesite or something, not gravel, but also I have no blocks, so I was cooked. If only the Nether wasn't cooked. Um, L village. You reading chats right now, bro? Yeah, bro. I am. Another L village. Everything's so spread out. No blacksmith. We're getting a whole bunch of village seeds. But there's a rune portal, but no lava pool. No good blacksmith. You got a lava pool and two blacksmiths. Then you graveled yourself into lava. Well, sir, I spawned above a lava lake. Okay, I shouldn't have graveled myself into lava, but the nether was cooked. That was not a good seed. Uh huh. Uh, all right. Uh, [Applause] Let's get this iron golem. What? Um, okay. Fortress there. There's a bastion. So, it's right here. I guess it's probably close. Uh, well, it's kind of annoying that there's There we go. treasure. Um, I don't have lava. [Music] Are you um All right, let's see. Um, oops, I didn't break the spawner. I mean, I was is going to get cooked there. There's I forgot to break the spawner too too quickly. There's three massive magmas. It was going to waste so much of my time. It's not cope. It's the truth. Fumble of the perfect seed. Yeah, it was such a perfect seed. You're right. You're right, guys. There was no lava pool. I had to be creative. Go rescue a lava from somewhere. Bring it all the way back to the ruin portal like at spawn. Use lava underwater to build it. That was just me being epic. That seed sucked until I made it epic because I'm the goat. There's a good Nether though. Well, guys, don't gang up on me. I'm drowning anyway. All right, let's try that again. Oh my god, he has a trident again. Why? Why does he have to have a trident? Oh no, I picked the wrong stupid block. didn't have anything I need. There's fire in there. Could very well see that being a lava pool. I think it's a bad side, but it's annoying. It's the good side. Damn it. Uh question is where is the shipwreck? Damn it. Oh my god. Uh, all right. Well, um, let's put this here. [Applause] [Applause] Um, I didn't get a flint. Which that was my bad. Uh, well, I mean, there's nothing, but the only way that's really good to go is this way. There's some entities. If there's a bastion, it's definitely far. It's right there. Well, by right there, I mean way over there. Oh, there's two gas. Really? No, don't hit me. [Music] Uh, well, we're going to have to hope that the gas doesn't Um, this bridge Huh? Huh? Huh? I am. [Music] Uh, uh, where the muffin did these guys go? Hey guys, why are they there's so little of them? Guys, come on. Are you blind? Are you too blind? [Music] Get in there. Come on. You're an idiot. Get in there. Get in. Oops. I made that string there. Uh, that's so annoying. Uh, [Music] The problem is there's going to be brutes. I hear one. I'm going to go over here. It's a single though. Still could have good loot like obsidian. I mean, primarily. Hey buddy. Guys, don't get too mad at me. Oh god. All right. You guys are done. >> Well, I didn't see a fortress that spawn. I don't know if there's a triple here. There's a There's a stupid brute though. Hey Guys, [Music] Um, for that spawn someone says that. Oh, yeah, there was. It was across the way. I remember. Oh, screw off skeleton. Really? You need to do damage to me. I just have no good food. Melon does like nothing. Um, well, I don't I don't actually know where best place to go is. We don't have the ability to throw many pearls. I would throw one right now, but I just can't because I I don't have enough health. Come on. Heal. Heal. Heal. throwing it as soon as I heal. I don't even care. I could still die, but No, I was drinking it. I was drinking it. I was drinking it. I was drinking it. I took You take two hearts for every like lava. Oh my god. You take two hearts for every lava damage. That's crazy. Cuz I had no armor. It wasn't going to be PB anyway, though. We were too I mean, it could have been if I had food. If I had food, it could have been PB because we had enough obsidian. We finally got enough obsidian, but I didn't have food, so I couldn't just spam pearls. What is with my game? That was a PB easy. No, it was not. That was an easy PV. We weren't even at the fortress yet. And it was 5 minutes until or five and a half minutes until PB. If we had food, that could have been PV. Any world saved? Maybe. All right, we get the shipwreck. We get the buried treasure map. Maybe we get the buried treasure. We're going to need the buried treasure. Oh my god, it's empty. Of course it is. Um, Nope. Uh, let's get another good seed. How do you not get failed frustrated from failed runs during these streams? Sometimes I do. It depends on like how it's a failed run, you know? Like I rage if it's something like uh I don't know like super stupid or or like I I did something super stupid or it was like a glitch or super stupid by itself. Oh, you stupid rage baiter. Now what? Sub 15. No, sub 19. Sub 19. Um. Um, all right. Let's go ahead and do this. Okay. Hey, we got flint right away. [Applause] [Applause] Uh well, this is probably not great, but we'll do it anyway. Wow, this is a beach. There's a ruined portal. Maybe there's lava. It doesn't look like it, but could be. Well, if this has a way to enter, then we're good. If it doesn't, then we're cooked. Um, yeah, we're cooked. Maybe just be a slow enter. Unless there's like a massive cave to drop down right here just in case. I mean, it's probably reset, but like could get a seven minute enter if it's if there's one. Well, there's this big mountain blocking our view anyway. Oh, what was that? There was something through there. Oh, I feel it coming. You guys feel it? Oh no. Every time I doubt this dude, he surprises me. I thought I'd never beat his 23 time with that man. These jumps are insane. From 30 to 26 to 23 to 20. Actually nuts. Yeah, I know. No, I'm just kidding. You should never doubt me. You never bet against me. Never bet against dream is I will outwork anybody, out train anybody, out practice anybody, outsmart anybody. out humble anybody. Bad luck. Um, I guess it's worth it to check. There's enough iron for a bucket and a flint and steel. Then we could enter pretty quickly. Could be golden carrots, too. It's pretty unlikely to have everything we need, but good. Uh well, no. Oh man, we need more. We need more. It's just how are you actually into the manhunt if you always restart for a new seed? What if the seed for the manhunt is bad? Uh well, one, the seeds are prepicked to make sure they're, you know, decent seeds that actually have like, you know, cool stuff around spawn and stuff. Um, and you know, decent like there it's not just like a cooked cooked seed. Um, so that's the first answer. Secondary answer is that uh you can still like I can still play out any of these seeds and like it'd be fine. It would just the only thing is it adds the the beginning time and like so like right now like okay I'm in the middle of the desert like I could still play this out but there's nothing nearby right like right now okay look there's a shipwreck way over there like I could go get that but there's no iron it's a bad one but I can go there and get food that gives me food then I run around the desert eventually there'll be a desert village and then wood and then I get wood and then I just and then and then once I have stuff finally I just do the exact same thing I'm doing now right but the problem is is we don't want to we want to beat our time so we're just restarting the beginnings like the beginnings are really the only things that like are affected by what I'm doing. Like it's not we're just trying to get the the most practice the quickest, you know, and like you can't in order to get the best practice, you need uh stuff. Surely there's a shipwreck. It's an outpost. Callahan picks the seeds typically with help from others sometimes like um Ken or other people that work with us. Uh, there's no iron golem, which means there's got to be iron here, otherwise we're cooked. Nope. And there's a village, but it's going to take forever to get over there. Well, there's a village over there, but I already ran this way. I want a desert temple. The village here Blacksmith. Uh, okay. Well, we don't have um I think what we'll do actually is this, right? Yes. Because then we can easily kill the golem. Is there food here? Um, okay. Well, question is, is there enough food here? Some hay? It's not very much hay, though. Um, I really don't know. We can get some jungle wood and maybe hope for a lava pool. There's going to be a lava pool right over this hill. [Applause] Oh no, there's water. That's annoying. Um, I feel like I don't even know what a lava pool looks like in the um bad lands. Oh well, I landed on the corner. Oh well, don't kill me, please. Bad luck. Let's just reset. What if it's a goated nether? Oh, This is an L. Yeah, I was going to say I mean unless we like spawn in the bastion, which we didn't. I don't even see a bastion, but there could be one this way. There's fortress. [Music] Don't have much food either. Pog. Okay. Well, we just got like three things that we need. If there's a bastion near here, this could be decently good. Except for one of Those dropped only. I was about to say I'm kind of afraid to go step in. [Music] Get this last block. Cool. Plenty of blocks for travel as well. I think there's a bastion this way. Just all the entities. I think it's farther though. Maybe not that far though. I seen this food to last me. That's it. It's five. [Music] I could go with six. Got to wait for one more spawn. Unless there's a place. Nope. Come on. I have obsidian though. I'm just going I'm not going to build a home portal anyway because I don't have much food and I have obsidian. So, I can bet on the fact Oh, the train's bad though. Going this way. This is just bad terrain. Hopefully it goes around. I mean, we we had to go like way far back as well. If this doesn't open up, then it's Oh, this is just my portal. There's just no way to go towards the bastion. And there's definitely not a bastion this way. No, there's just there's nowhere to go. Yeah, man. This is an L L nether. Unfortunately, I did my best. Yeah, it was good. Nether nav practice wasn't bad at all. Do you think you can finish in under 19 minutes? Yeah, I think so. Honestly, I don't think I'd be playing right now if I didn't think that I could. All right, we got a lava pool. Uh-huh. Um, there's no chest. [Music] Um, I guess I'll be pretty annoyed if I check one of these chests and there's a bucket, but I don't think there can be. I didn't get flint again, but Um, I wish I got a flint. Um, well, it's not close, but it's this way. Uh well, We go this way, but well, there's not a good place to place the boat. Oh, this is unfortunate. Just bad terrain. Another bad nether. Um, problem is we don't have an iron pick. Uh, I mean, there's just not We're still only at seven minutes. Oh, is surely right here. But now I'm like in a bad position. Damn it. I spawned so far because of the ocean. Negative. Look, I'm at X600. [Music] Oh no, I'm getting shot. Shots fired. Um, it's not iron. I think there was a lava pool. Not certain, but I thought that I saw a lava pool. There's a village, but not near the lava pool. Um, I guess it's not that long. We could probably still get us like a fivem minute enter. We very quickly grab this. We got four obby too, which makes it like we don't have to home portal. I think we need obby in the in these chests like in in like a ruin portal chest at spawn or like a you know nether fortress chest or something um to PB because going to the home portal just sucks and the rates are so bad. Give us a bucket. Nope. I think if we don't get a bucket in one of these chests, it's going to be a little harder. Trade for a bucket. It's going to take too long. I'm just going to get a bucket from the golem cuz like with four extra obby, like I think it makes it a lot more likely that we'll we'll get enough obby. Oh, well that's not what to do. Um, all right. I think what I'll do is I will make a boat. make a pick. Um, oh, I didn't realize I had Oh. Have to wood light again. That is damn annoying. [Music] [Applause] Like I said, we'll probably get about five minutes or maybe five and a half. Actually, I guess I don't have iron, so not going to be able to. We're going have to wood light. So, if we get lucky with wood light, though, could be quick enter. Not not super quick, but quick enough to be worth playing. Oops. Okay. So, it's decently far this way. I think there's a fortress that way, though. So, if we can remember that, then could end up being good for us. There's the bastion. Oh, this is annoying nav though. [Music] Huh? Uh, okay. This bastion was so far. Oh god. And it's not even a good bastion. We have a lot of like obsidian though. Oh, there's a brute there. Usually means that there's a chest somewhere. Okay. Uh, do I want to just grab middle and then go? Don't have an iron pick. Really? They're mad? Why are they mad? Was afraid of there being brutes. Okay. Um, [Music] oh No. What the heck? I thought I changed blocks. Thought I changed blocks. Okay, it's fine. We have a lot of obsidian anyway. Should be fine. Should be fine. All right. Surely they're all coming in here. Run in here. I hear you guys. Come on. Surely you're all running in here. That's why you're mad, right? [Music] Hey man. Is there any more chest at the top? Don't really need anything from chest though. We just need the trades. Come on. Uh uh. Oh my god. I'm one obsidian short. I'm one obsidian short and I placed the damn obsidian. Okay, I got it. Do we see a fortress? No, but I said there was one. I think I think there was one though. Is this the right way? Yeah, it is. Oh, that was kind of a short pearl. Entity count is decent. Oh, it's far though. If it is here cuz I don't see it. I overthrow it. Come on. I'm going to swim up and see a fortress. Nope. I just happened to land in like a stupid hole. I think that is a fortress, though. I think I see one right there. Yep. Not a single drop. [Music] Not a single drop in five. Not a single drop in six. [Music] Of course it goes in that tree. negative uh or 1334 negative 2240. We're not we're not that far. >> We are far though. And they didn't even drop. Kind of want to just say yolo with one because we can get a a sub 25. Is it this way? No. I guess we can just wait one more. Come on. Drop. Oh my god, these drops are so bad. The drops weren't terrible. Then we could have had a PB maybe [Music] We can still finish it out for practice. Maybe get another good time. You know, kind of annoying that there's guys here. Uh, Um, one, three, four, Four. 4 Z. Uh well, Surely the stronghold's right here. Surely. Uh, is it up? There's no way. If it if it was here, I'm going up. That's it. That's a stair a staircase in the stronghold. or it's Wait, that could be in the mine shaft. I mean, it doesn't matter. I'm I'm literally on the coordinates of starter staircase anyway. There's no way it's down. That was such a huge cave. I would have seen it. Yeah, there it is. Well, I could have used some uh pearl or something. Where is the starter? Is this a starter? No, this is towards the starter. Okay, this is the starter. Uh, well, this is an awkward nav. Uh, damn it. It's not going to be a sub25 either, probably. Crap. Could be if I use the the crystals as explosives. on dragon. No, I missed. No, what' I miss? Would have been perfect. [Music] Hey, This dragon's annoying. It's not perching either. Jesus, it's like making me dizzy. Most aggro dragon I've ever seen spamming fireballs. Heat. Heat. [Music] Uh, not bad. [Music] Not bad. It was still a It was good practice. Um, I might be able to enter through that. The only problem is I need two extra lava, three lavas, and I think there's only two. I could look and see. Uh, not the best. empty. Um, I guess I'll try because there might be lava underneath the side. Um, let's make two golden carrots because why not? Uh well, we only we don't have enough for an iron pick, which is rather unfortunate. How much lava do we have here? Um Is that the exposed one? I think so. I think that's it. That's just not enough. Maybe we could come do one lava and then we still There's two crying obsidian still. This is an L shipwreck, but it's fine. Uh, there's a village. Another thing that's annoying is there's a blacksmith. It's going to tempt me to go to it even though I don't need it. Okay. Well, the shipwreck's right on the edge of the village, so we have to go here anyway. Huh? Uh, well, >> nothing we really need. Um, well, Let's find lava. Guess we can look out over this hill actually. Oh I mean, shoot. [Music] This like was clo looked closer than it than it was. Um, all right. I think this is the initial one that I saw. I think there is another bastion that way, but or maybe it's just blue biome, but it loaded in later. So, I think I just rode on the piglin's head. [Music] Oh, what the muffin. [Music] This is stupid bastion. Um, what do I want to do though? Oh well, that's not what I want to do. Unlucky. I mean, that was stupid on my part, but also unlucky. I just did not assume there was going to be a drop all the way to lava from there. I was just I thought there was the gold block was below there. Um, what do I want to do? Yeah. I mean, it's souththeast. It's that way. It's probably far. Uh, it's not that far. It's probably that island over there. [Applause] All right. Uh Um, I want to load this on the map. Lava. Huh? Thank you. It's a wide open Nether, but there's just nothing. And this way has the most entities, which I guess this way is a little bit as well, but I feel like it's Well, Okay, I think there is a bastion this way. you muffin. This is terrible nether. Uh, even if there's a Bastion, it's far as hell. I mean, we're already out toative 200 and it looks like it's this way. I mean, if it's even a bastion, it could just be ton of Enderman. Well, that's not um I think it might have just been Enderman. Oh, well. >> Um, well, Um, okay. Was a bit of a problem. Mhm. Um, baby. [Music] moving for you. Oh crap. You're not a guy. Whatever. Uh, well, that sucks. There's no triple, right? Cuz I this side. Yeah. Oh, oops. Uh well, I don't even have enough to do. I don't even have enough to home portal. Our home portal is far anyway. And then we can blind if we get three more. Well, I got two more than I can blind. Well, I mean, don't even know where a fortress is. Yeah. Fortunately, we ran out of gold, so we can't even blind. We could get it at the fortress, but we also don't know where the fortress is. I'm just running out into this positive negative quadrant. Maybe it'll open up. Okay. Well, there's nothing that way. There's absolutely nothing that way. Well, can't even go that way. It's just cooked. Oops. I'm going to die. It was cooked anyway. It was so cooked. Thank you for the donut. Um, all right. So, Huh? Huh? Um, okay. Well, I need a villager that can get a job. Can you get a job? >> All right. I have flints. All right. I mean, it is so cooked. There's no bastion close. It's just cooked. Um, yeah, there's just no bastion. Um, well, what the Well, I thought we were just Okay, there's just no bastion. Well, there's no bastion in this damn Nether. There's none. when you're eating a lot of food for content. Again, I have a video that I recorded that will be out soonish hopefully. Um, there might be a bastion here now, but it's so far. There's a fortress. But actually, that could be good. I mean, we're already we're pretty far in, but damn it. [Music] God dang, this fortress is big. There is a bastion over here, so if we're quick, this could be good. There any stupid wither skeletons everywhere? Oops. I thought this is blocked. Stupid. Holding blaze rods. [Music] There's not a clear pathing to where the bastion is, though, which is annoying. No drops really. Okay. Now, how the heck That was convenient. This is not as convenient. Do I have any more blocks? H. If I had any blocks, if I had any damn blocks, I was fine. If I had any freaking blocks, I was fine. Ah, that would have been epic. I was doing so good. I didn't use all like if that that Nether was so bad, but I did so well. I was somehow at the bastion like 700 blocks away at 13 minutes with all the blaze rods like What happen? That's annoying. Well, what? How'd that happen? I don't think I did anything to do that, but like Um, only problem is I have no food. could we could enter and be like right in the bastion though. I could get the shipwreck. I mean the run buried treasure but it's too far. Um, we'll come back to this fortress. Don't shoot me. This is annoying terrain, but the bastion is over here. Probably relatively close cuz it loaded in. There it is. treasure. I hate when that happens. Like I actually like slipped. Like I did not let go of shift and you could s see that it caught me for a second but then like my momentum carried me off or something. If you're shifting and you hit the edge of the block like it should just let you shift and not fall. Um okay. Well, [Music] okay. So, I'm by the front. Um, this is a little bit of chaos. What do I want to do here? Um, come here, buddy. Guys, got to break the damn spawner. Hey friends, I died to D magma cubes again. I I just know it. Not when I eat this. Get over here. I hate you. I hate all of you. I've never liked you. Where are you over here, [Music] guys? Come on. [Music] [Music] Oops, >> bro. Come on. Well, I don't want you in that hole. Um, [Music] [Music] Um, I could home portal, but I want more pearls. I'm being a little greedy. I'm not being that greedy, though. Like, it seems reasonable. I'll leave at enough obsidian or enough uh pearls. Okay. Where did I come in? Over here. Crap. Our portal is like negative X this way. [Music] Thread the needle. I didn't get that many arrows. But I got enough to break all the crystals and then do some damage to the dragon. I just need to be a little more accurate. I need to make beds. Otherwise, I don't think I'm going to kill the dragon with diamond arrows. I don't have wood though. Um, we're in a red forest, but is it worth it to stop? I think it'll speed it up a good amount. I can do it when I go back to my portal. [Music] Oh, they didn't drop much. Come on. No, they're not dropping much. They really did not drop much. negative 1872 432 Yeah. Uh, bad terrain. Oh, don't hit the ceiling. Okay, perfect. That's what I meant to do. Wait, what am I doing? I went the wrong way. Oh no. What? It's this way. [Music] I pearled the complete opposite way. I did. Oh my god. Jesus. Um Jesus. this. Why is it off by so much? Got bad RNG on uh blaze drops and then portal room here. Portal location. Okay. Well, this is good for us. Oh, well, that's also good for us. Yeah. Literally. Wait, that's the small Is that Is that the end of the I think that's the smallest stronghold. Unless I missed a secret room. I literally think we we just I think we went to the whole stronghold. I don't have any arrows. So, and Oh, I didn't get wood. We don't have beds. Um, I don't have any pearls either. That made extra eyes. H I think I need to get really strategic about when I break the things. Oh, no, no, no, no, no, no. My blocks weren't on my crap and I just almost killed myself because of it. My blocks were on the wrong key. Jeez, I'm getting like I'm in between like tons of this. Oh my god. [Music] I don't have many arrows. [Music] Heat. Heat. [Music] Hi, hey. [Music] Yeah, Another sub 23. [Music] Um, not bad. I guess that beat our PB from yesterday again, which is good. But it ain't 19 minutes, but it's good. We'll check it out. [Music] There's a lava pool. Um, I guess if we kill the golem here could be good. The golem might be gone. He might be taking uh host. Ooh, I didn't even know this was like a chest that could have iron actually in this village. That feels odd to me. I guess I should have made sure there was a golem before making that into a pick. I guess if there's no golem, then that chest was not. Oh, there's a golem. Um, Uh, all right. Let's just get going. Well, unfortunately there's not Not much food. Uh there's no close bastion. Uh well uh this is kind of annoying. I think there it's probably a bastion this way, but it's probably far. Maybe not. Oh well, that was a crappy seed. average dream moment. True. That was promising. No, it goddamn wasn't. Don't lie. That was not promising. We had five bread and we're in a bassalt delta with no bastion within like 300 blocks of us. That was not promising. It's promising maybe before the Nether Deja vu. Surely we won't get iron in that chest, though. Seems unlikely. Um, well, kill the iron golem. Uh, let's see. H uh there's no chest with food either, which is annoying. There's a lava pool. Um, well, we don't have any food, so this run's kind of scuffed, but, you know, But like if we spawn like in the bastion then cool. Uh, no. Bastion's really close. The bastion is northwest fortress though. Hey buddy, come here. Um, hello baby. Uh, okay. It's treasure, I think. Um, okay. I hear a brute. We're low. [Music] Surely all the brutes down there will die. Surely I need iron. I need to break this stupid crap though. Okay. Um, need this chest. That's a really good chest for us. Uh, I really hate these magmas, but he can't really fit where I am right now, which I guess is good. He can jump over maybe. Is that what he's doing right now? Surely he's not smart. Okay. Um, surely we have pigs around here. [Music] that way. [Music] Uh, well, this bird is annoying. [Music] Is there more guys? And there was a brute, but I'll go kill him real quickly. [Music] [Music] Um, Get one more pearl trade. I don't have food. I need food, but I can grab it from the chest up top, maybe. Or the other chest might have some over there. Okay. I'm going now. Uh, I want to check this other chest. I want to pearl up to where they were, but I forget. Was it up here? I don't even remember. It was over here. Hey, get down. Get down. Get down. Get down. Get down. Uh, okay. Well, this is annoying that it's in the wall. I forgot I'm not wearing gold. Oops. That's not good. Damn it. Please food. Uh uh well uh not really but it's the best we can do. Um what's the closest we can get into? Do we see a fortress? I don't remember. We can go into negative positive cuz this is negative. Negative fortress fortress. Oh Jesus. This is better spawner. He's going be good. [Music] All [Music] right. Uhhuh. Oh, that's unfortunate. I have to get two extra 2640. I also can't get food. I was hoping I got was able to get food. What do I need? I need three. Spawn a bunch of blades at this spawner that I haven't activated. No, only one more. Maybe this stray. No, no drop. Uh uh only problem is bad terrain. Like I think this is bad terrain. I can throw one pearl. Uh, I can throw another one and risk it. I think I need to. Otherwise, I'm just going to The time's going to be really bad. I throw another one. Uh, it's still bad. I need to throw another one. I just have to. Otherwise, it's just it's cooked. Just have to hope that there's negative. Oh, it's the opposite way. Damn it. I could have saved myself decent amount of time there. 352. 6 4 Z. I need uh this is the starter staircase. I need chests and Okay, there's a library. There's no button on that. I can't lose track of where I am, though. Um, I need chests as well. Crap. I don't know where I came from up here. This definitely the starter. Yeah. Which way did I go? Secret room here. No. Secret room here. No. What the heck? It's the way I went. It's here. Uh, but I need Actually, maybe I don't. I do. I need at least one pearl. This is the only way we can go. Two libraries. I feel like I'm far, but like Yeah. No pearl. Uh, I can go up here and get this. Um, I still need a pearl from one of the chests. This is kind of cooked, but Um, okay. And I remember where I came from. [Music] I didn't make a I didn't bring get wood for a bow. Oops. All right. Well, that's cooked. I guess in this situation, what do I what would I do? Um, it's a great question. What would I do? I guess I would just break the crystals, but I can reset [Music] That didn't work. I had no water either. Became an L run at some point. I don't remember. I don't remember when it's cooked anyway. Exactly. And people say that I'm coping when I say that, but I'm not. The run was cooked. An ordinary Joe would have reset, but I decided I don't care if I die in a in a lame or a losing fashion. It's still practice. Would you like to learn how to break the boat? What do you mean? You can break the boat and get like wood, but can you get enough to make a crafting table and sticks? That seems unlikely to me. You need at least six wood and you make use makes it cost five to make a boat. Um, okay. It'd still be useful to know how to break a boat, though. I don't know how to break a boat. It's pumpkins. Well, we're cooked. Um, so I guess we can go for the uh shipwreck, but that's basically it. because maybe it'll show lava on the map, guys. We can still get a good enter. We have a lot of stuff. Like if there's a We've gotten a couple a good successful ones where there's uh Oh, ruin portal. Look at that. Is there a lava pool though? No. Uh, unfortunately not. But one, two pieces of lava. We need three. Is it only one? Two. Uh, is there more than just these two? No. Damn it. Just so you know, boat breaking was a glitch only at 1.21.4. Okay, that makes sense. I was just trying to see if that was possible. Dream, what's your real name? George Okay, we got to go southeast. I could have been so much more efficient about that, but that's all All right. Let's see. Oh, it's going to be like over here. really. This is far Think that's a lava pit. We still need it for food. I'm It should be right here. Come on. There's no way it's really this far. Uh, I'm just going to go We're not going to have food, but like We just don't have any food, so it's kind of an L, But well, Bastion is this way. Ashley donated $10 to super chat. I'm getting married 24 hours now. I'm so excited. Congratulations. That's awesome. Congrats. [Music] Uh well, I kind of hoped that took me somewhere useful, but nope. You want fortress that way. Looks like there's two triples here. So, oh well, sir, leave me alone. It's likely I get food as long as I don't perish. [Music] You guys aren't distracted by gold nuggets. Okay, let's escape. I need this for sprint. No, he was already locked and loaded. I didn't hear him load. Must have loaded over there. Damn it. I forgot I was on like half hard or something. I'm the goat. I'm actually the goat. I'm actually the goat. I don't even need it. Um, [Applause] [Applause] That's hilarious. [Applause] I noticed the suspiciously placed gravel and then I looked at my coordinates and I saw I was like near the middle of the chunk and I was like there's no way gravel Oh, heat. Oh, what the heck? Hey, it happens. We've done that twice today, though. So, we're out of our We're officially out of our excuses. Of course, we got a terrible spawn. Well, there is a bastion this way, but the problem is Yeah, we just can't get out. So, how do we do anything? Does it open up over here? We're going the opposite way, but I'm just hoping it like changes biome or opens up. It opens up a little bit. That's annoying. Oh well. Um, this got a little better. Still not good. All right. No, it closes up or like past Sebastian as well at least on one axis. Thought I saw an opening down here. Um, Such an LE. That was such a W overworld. Also, it wasn't like the the best ever, but that was cool. That could have been really good. We just got a good nether, but we didn't. See, is there any more suspiciously placed gravel? Not that I can see. That stone's kind of suspiciously placed, but I don't think that can be. Oh no. Get away. Um, This isn't the best, but I just need the wood really quickly. Make a boat. We need to go west and north, which is this way. We hope that we see a lava pool. Uh-huh. Which suspicious gravel is it down here? One of these bunches. Yeah, it's going to be this one. That's quite a lot of Uh, TNT. All right, let's see if we can get a lava pool. See bees. I'll go to the top of this hill. [Applause] [Music] [Applause] Um, all right. Let's see. Oh, we're in portal lava. Um, okay. Well, um, crap. Um, well, we didn't get flint. Well, there's not a bastion close, but I think there is one that way, maybe. It's not close though. Kind of an L. We're already entering 6:30 and then there's no uh bastion close. But hey, we will we will investigate. Oh, there's a fortress there, which is good because there's a bastion this way. So, if the bastion's good, then we can get it do a quick fortress over here. Um, crap. Why do I have to speed bridge across the freaking Nether every time we get like the most terrible Nethers in the history? I just slipped there. Oh, I was hoping there was a bucket. That would have been so cool. I grab the bucket. I go in the cave. I grab water. I find a lava pool. Boom. And then I go right down there and I enter the Nether with nothing in two minutes. That would have been so cool. God damn it. I checked both chests. There's two chests in the dungeons. I checked them both. [Music] I heard a doggo. Why is the ruin portal under the water? It like implies that like the water level is different. It's like higher now. Like there's like global warming in Minecraft. All right. There's a play here. There's going to be a shipwreck right off this beach and then straight in this lava pool. Um, all right. Oh, it's the opposite way. Um, let's just go to the Nether. like a three minute enter. We'd add too much time correcting our direction. We don't have any food or anything, but like it's fine. Jesus. Come on. I made plant. fortress over there. Bastion this way. I think [Music] >> there's two bastions. [Music] Um, unless it's a Nah, it's definitely a bastion over here. There's a bastion over there, though, too. I know that's not one, but the entity count's really high. Reveal yourself, Bastion. Oh, no. I don't see it yet. We need it here quick cuz we do not have much food. Is that it? Oh, that's already it. Yeah, it's right here, I think. No, it's not it. I need to get blocks. Oh. I really need to find the bastion sooner rather than later. There it is. >> No. Ah, I don't know how I made that jump. Ah. I don't have a pick. Make one. I hear brutes or I hear normal piglins, not brutes, but I don't have gold, so they're all the same to me right now. Um, I need chests. Um, I need Okay, there's a chest over there. Okay, there's a guy there as well. Another chest over here. I don't think so. What an idiot. Jesus with a woodpick. It's atrocious. Um, let's see. Come here. I don't I only hear one of you burning. Come here. There you go. Wait, what? Die. Okay, you're dead. All right. Please have iron. Yes. All right, buddy. You're not gonna You're really going to take me on? You want to see what happens? People who take me on, they die. All right, perfect. Guys, do not come here. Please, just wait. Just chill. Just chill. I have gold for you guys. I actually really want you guys to stay right where you are. Hey, right in there, guys. There's a party over here. Come on. Get in the hole. Get in the hole. There more of you. It's fine. I'll get you guys started. Beautiful. [Music] Um, are there more guys here? [Music] Sir, are you stupid? Are you blind? [Music] [Music] Um can maybe home portal. I don't know. I could check the chest, but I think it will take too long. Um, I kind of want something other than a wood axe, but I think I'll go one more. Okay, this many pearls. We don't have much food either. Um, I mean, they're trading so quickly. I think we got to wait. Uh, we almost have enough. Uh, craft a bow before I forget. [Music] Um, Well, you they just like ruined my health completely. This actually ruined my health. Um, problem is now I need those chests. It's annoying. It's not going to be a PB. primarily because of my health because I can't pearl right now. I'd be pearling up. Uh if I shouldn't have I took off my gold. Which way do I need to go over here? It probably wasn't going to be a PB anyway, but it could have been. But now it can't be. Um [Music] Uh, okay. Well, okay. Uh, I really want more food. [Music] Well, that's not worth it. >> Nope. That's definitely not worth it. Wait, is there two? Yeah, there's two. I didn't get the other one. Oh. Well, you idiots are in my way. Please have a ton of golden carrots. No, it's just not good enough. I can still just go though. There was a fortress at spawn, right? Or towards spawn at least. [Music] Yeah, I do not have food. [Music] [Music] So, I'm trying to limit my pearls. I can if I can get to the fortress, then I can get food from the overworld. Maybe. Please just be right over here and I can pearl down. [Music] Oh no. It's like the worst thing that could have happened. What was there? Another blaze or did the blaze kill me after I killed it? I think the blaze killed me after I killed it. I didn't hear a spawn or anything. That's odd. I just watched it back as well. Looks It looks like the blaze killed me after after I killed it. Guess they there could have been another blaze, but I I didn't hear I didn't hear it spawn or anything. Wasn't going to be a PB anyway, so unfortunately Can you please know the seat of that run? Claire, I'll do it just for you. I don't know why you want to know the seat of that run, but I'll give you the seat of that run. This one. This one. There you go, Claire. You're welcome. Did I die to the weather? I didn't think I died to the weather. All right, let's let's see if there's a beach here. See if we can Oh, never mind. Why not kill hoglins? Because I was still hoping that I could get like a sub 20 or something. And in order to do that, it would take a lot of time if I like went to the red biome and etc. Yeah, the death message said blaze. So if it was wither, then that's odd. But I also didn't know I was that low. I don't think I was on half a heart. Oh, come on. Two obsidian. And the bottom right is not crying obsidian. It's beautiful. It's beautiful. And a flint and steel in the chest. Two obsidian and a fire charger. A flint flint and steel in the chest. Maybe some carrots. I'm not greedy. Yes, two obsidian. No. Why don't you ever want to give me what I want? You never want to give me what I want. I'm not even greedy. Damn it. [Applause] Is this just manhunt practice or you going for PV? Both. Uh, I just realized something. Wait, let me just confirm something. I just confirm something. I think that that time today is the fastest I've ever beaten Minecraft. Even the even like the uh 1.16 like cheated like pearl run from before. I'm just like confirming. I didn't think I was just thinking. I was like, \"Wait, what's my what's my time?\" I think my I think my thing was 1920 or something. Unless I'm being stupid, but it's I don't I don't think so. Yeah. No. Yeah. 1925. That's the So, you guys saw me beat Minecraft the quickest I've ever beaten Minecraft in my life. today. That's funny. I didn't know that. I thought maybe. I thought maybe. I Well, I didn't I didn't think about it. I thought I for some reason I was thinking my old time was like 17 minutes or something, but then but then I thought of it just now. I was like, wait, no, there's no way. That's funny. just um Okay, let's fast I've beaten Minecraft ever on any version. Probably even counting like challenges and well definitely counting challenges and stuff but I mean like even like Minecraft but items are multiplied or whatever like it's still faster Must be mods again. Well, I do have mods. I don't have anything crazy. The only thing that's different than the pretty much the the only thing that's actually different is um uh my render distance. like my no fog. Like everything else is like simulating real, you know? It was also without one cycle as well, which is cool. I'm in my prime, baby. There's a blacksmith. That's a W blacksmith. Well, I don't need anything really. I just want to find a lava pool. I'm going to kill the golem cuz I can get shears. There's not even many trees around. [Applause] [Applause] Give me a flint. [Applause] [Music] Oh no. It's all because that damn block became a cobblestone. You know what? It's worth it. Just get like slightly more blocks. [Applause] That could be the difference. Oh, what? Maybe more attentive at spawn. Oh my god. Uh just in case there are uh there's like a a fortress or something, so I need to pay more attention. I don't want to go the wrong way. I have gold. kind of far. It's not a good bastion. At least not for me. I'll start at the top. Um, I don't know where the brutes are, but I really do not care. Okay. Mhm. Huh? Wait. [Music] Um, crap. There's like a guy blocking them from coming in. Whatever. I think there's probably enough here. I think we got unlucky. Um, I don't want this guy to fall in here. Come here. A crap. Okay. Get up here. Up here. Get up here, bro. Get in the hole. [Music] Um [Music] Come on. No, you're kidding. One obsidian short. >> Surely there's a chest out here with one obsidian. I didn't get the middle chest. Is there one? No, there's not. Where are the chests? One obsidian. Come on. One obsidian. Oh my god. Nope. Um, unlucky. I don't think there's any more chest. Well, there might be one on the side, actually. We got a fortress. I forget. I don't have many fires. though. Um, I do not remember if we got a fortress or not. Uh, We have a lot of pearls that I can spam, but looks like we are unluckily Not by a fortress. I don't have many fire reses though, so I'm I'm trying to save them. Well, I feel like there probably would have been a fortress the opposite direction, so I probably took a wrong bet. this place. This area just looks so open. So, but I don't see anything. Damn it. Um, bad luck. Yeah, there's just nothing. There was nothing. Unfortunate. A pretty good start. If we had a fortress there, we could have had a really good time was promising. Yeah, I didn't reach 20 obby even though I had 11 from chest. It's just crazy. But then I got more from a chest and I reached 20 on the final chest. But I got more I got think so I think I totally got like I don't remember a lot from chess. Ruin portal. This feels like a reset, but we don't judge a book by its cover for a reason. So, what if it's crazy? This is a desert as well. Can look and see if there's a desert temple. Um, there's a lava pool as well. There's a cave here. Um, wait. What is this? A desert temple? Wait. Oh my god. I'm being stupid. How the heck do I get in? Am I being stupid? Oh, what? It's like buried in the in Well, um, we can go to the Nether. I don't know how to get out, though. Where did I get come in from? I don't even know how those temples are like structured. Uh there's no water though. I think this will be a kind of slow enter. I have no food. Ah, it's just a reset. That was cool though. I need a lava pool and like iron and food if I want to get my time. They're kind of right all right next to each other. Uh Well, we didn't get the emeralds we need and we didn't get a bucket, so I don't care about that seed. This looks like prime buried treasure territory. Let's see. 99. No. That would have been cool though. I don't know if it would have been cool. I don't know if it would have been worth it. I would just been getting accusations. He's a cheater. He's using a set seed. Got a lava pool. Come on. There's going to be It's going to be in the ice. It's always in the ice. Come on. Give us a shipwreck right here in the middle of this ice. Yes. All right. Get this. Hurry up. It's empty. Oh, yeah. I can go here. Um well, unfortunately, I want This food really. All right. We totally could have seen uh this from our spawn. Our spawn was like here. If we just turned to our right. Oh, I think this hill was blocking it. I think we spawned like here. That's so tragic. Would have saved us like a minute, maybe more. Bro, I said w food. Bro is delusional. It's delulu. Um I don't have a flint steel. jump boost. Yes. Okay. Oh, that's not meant to do. Bridge. It's bridge. Rejoice. Finally. The only bastion we never get ever because we like it actually. question is how do we get there? All right. Um, Surely this is like a top. Yes. Yes, it's the top. Yes, we're doing it. All right, here we go. We need to be quick about this. I don't got gold. Where the muffin is the bridge? There he is. Don't shoot me. Crap. Oh well, you got the gold block. It's fine. I I didn't need them all anyway. [Music] All right, guys. Watch. I'm going I'll drop you a couple pieces. Oh, there's so many. Get in the hole. Get in the hole. Get in the hole. Get in the hole. Get in the hole. Get in the hole. Is there more of you? Okay, now we need to hope that we can loot these chests and that there are actual food that is not potatoes. Actually, can I just kill you? Perfect. Come here. Oh, well. Hey, let me burn you. Yes. No. No. No. No. No. What? What? I didn't know he could hit me from that far. Ah, I thought I'd healed as well, but I hadn't healed as much as I thought. God damn it. God damn it. Ah, I threw. I had all the food I needed. Why did I not just keep running a little bit? Like, just run a little bit more. I thought I thought I could get a crit on him. Ah, he hit me from so far. No, I threw I threw. That was my I think honestly that was like my first true throw today, which is good. I feel like the other days I've thrown a lot more. I feel like that was my first like actual throw. Like I just threw, right? That was my first throw. I'm pretty sure I feel like in the other streams like in the other streams I threw a lot more, but in that run I actually threw today. I don't think I've thrown. So that's what I'll take away from that. And look, it's nine hours into the stream. It's okay. You can forgive me. Once again, if we had food, that wouldn't have happened cuz I just wouldn't have bothered killing them. So, LCD for not having any food. Damn. That was a good seed. That's a lava pool over there. Um, I mean it's still kind of dumb, but [Applause] I guess we'll go in with the wood axe. Well, I don't want to use that. Um, All right. I didn't grab lava. Um, well, hopefully I can grab lava. Be kind of annoying without it, but It happens. My bad. Still need to get an iron pick. But this is good that we're at the top. Hopefully we can Oh well. Okay, cool. I can't knock him back. It's so much damage. All right. Oh, idiot. You're such an idiot. I hate you. I am a clutch god. That's why it did so much damage because of hard mode. I was like, why did it do so much damage? Um, I really want these chests. All right, whatever. I'm just going to go in because you guys are idiots. Okay, I guess I can't just tank it. No. Jesus Christ. I'm not a clutch god. Never mind. I take it back. I take it all back. Just It was in hard mode, though. If it wasn't in hard mode, then that would have been easy. Then I put it in easy mode, but it was too late. The damage was already done. I feel juiced out. I think I'm juiced out, guys. Unless we get like a god seed right now. I think I'm juiced out. We see any suspicious gravel? No, we're not even in a beach. We're in a stony shore. How come you never get desert temple seeds? I don't know. I just don't get desert temple seeds. I think it's rare. I think Mojang doesn't want you spawning in a desert probably, but I don't know. It is rare. All right, guys. I'm going to call it. We got nine hours. It was fun. Thank you guys for coming. See you guys probably tomorrow, but we will see. What the muffin? I make it. No, maybe I could have. I go far enough. Look, we get a mob spawner that has a bucket in it, then I'll run this. We need specifically a mob spawner with a bucket. Seems rather unlikely. Or I'll accept three iron in a chest. I'll accept three iron in a chest, but neither are here. So, it does seem like we're gonna have to call it a night because the Minecraft gods have decided they don't want us continuing by not giving us three iron. Yep. All right. GG guys. See you later. See you tomorrow. Probably got a new PB. Fastest time I've ever beaten Minecraft ever, actually. So that's cool.",
    "start_time": 4.16,
    "end_time": 31860.478
}