{
    "video_id": "MGUlBQ2Jogg",
    "channel_url": "@dream",
    "transcript": "Let me see. Welcome vlog viewers. Hello. Hi. I can't really that well. >> Hello. >> This is your secret message. >> Of course. >> Of course. >> I'm trying to pull up the chat. >> Hello. Secret message. Subscribe. >> Oh, what? What? Okay. Okay. >> Is everything everything double? Oh, that's why. Okay, it's muted. All guys, you got the double. You got the double secret message right now. You got the single secret message. Subscribe. All right, let's see. Can I click this here? Is that going to work? There we go. All right. All right. Let's see. Um I'm trying to see if the Okay, the camera isn't really delayed. I was trying to see if it was like delayed or something, but it wasn't. Hello. All right, I'm ready to speedun. You guys ready? All right, here we go. Bad seed, guys. This is kind of hard to play. What about surgery, bro? What do you mean? Do you not see my cast literally right now? physically on. I had my surgery. It's It's on. I'm in a cast. I've been recovering for weeks. There's a lava pool here. I took a lot of unnecessary damage for no reason. Turn down my volume. When will it heal? That's a great question. I don't know. Um, it's I'm in this for at least a month, but we will see what happens. Um, take take care of your arm gang. I am think I'm going to be like slamming it on the desk or something. I'm not going to be slamming it on the desk. I'm going to be as careful as possible. You can still play with it on. I don't know. I'm trying. This is my first time, guys. My first time trying to play it. Trying to play Minecraft with my cast. I'm not I don't I don't think I can play that well. I think I can I think I can probably do decent. Like right now, I'm doing decent. I think I can move pretty good, but probably not uh probably not like crafting and stuff I imagine will be pretty hard and like fighting. [Music] And that wasn't bad, but also like um bad seed. Can I sign your cast? Yep. Go for it. Sign it right there. So, how are you guys doing? What's up? Yeah, I get to sympathy farm, guys. I need the donations. Come on, donate for my arm. Can you drop any hints on the six hunter? No. Oh, look. There's a shipwreck. I can't because I don't know. Oh, there's a village and there's some flowers next to the village and it's the good half of the shipwreck. Is there a lava pool? That is the question. Might as well go right in here. Um, okay. Do I just break this? I guess I might as well. Were you jerking it too much? No, I wasn't. Stop trying to spread that. It's not true. Oh, well. Um, there's a village right there. Yeah, I'm a little slow on the whole chest thing. I think my parkour is fine because it doesn't rely that much on Oh, dolphin. Come on, dolphin. Take me to the village. All right. I also have a lot of emeralds now. And there's an iron golem. It was a crappy shipwreck, but we got so many emeralds. We can get so much. Come on. God, I can't craft. I just cannot craft. It's just not It's just not possible. God, come on. Craft. Get those sticks. There we go. All right. Um I do need to kill this guy. Oh god. Come on. Craft. No. Ah, God. All right. Okay. Um, do I kill this guy? I guess I need to, please. No. Crap. Okay, there we go. Boom. Pop. Boom. Um, okay. Sweet. Uh, I want to make a bucket. I guess I want a flint. Uh, do I want anything else? Guess I don't need anything else right now. I need some food. Oh, I need a hoe. Crap. Need a hoe. God, this is not the easiest thing in the world, I will say. All right, let's see. Um, I guess I could have traded with some emerald guys. Oh, wait. Does this guy have good food? Um, no. What about you? You got food for me? >> Yeah, sure. Here, I'll take some bread. All right. Um, I guess I need a lava pool, but don't really need much else. I'm going to get I'll check this chest. I'll get the bed. All right. I do need flint still. Give me a flint. There it is. All right. Uh, let's see. That's so slow. Everything is just slower. What happened to your arm? I broke my wrist and then I had to have surgery on it. Um, well, this shipwreck is right here, so I guess I might as well get it. Or not shipwreck, I mean buried treasure. But I do need a lava pool. And I don't see any lava pool. Maybe on the map I'll have a lava pool. Um, I guess I don't really need most of this, but okay. I get a diamond pick. Um, I don't know. See, it's already We're already pretty slow. I guess we're not that slow, but we're also not very fast. And it's really slow crafting and stuff. I need a lava pool though. I have a lava pool. Then this could be decent. There's no lava pool. Then I guess I could dig down. But is even worth see I don't even need my mouse. Like I can just do parkour with with just my keyboard and then we're all good. Boom. No mouse necessary. Um there's no lava pool. I guess maybe I should change Maybe I should change my U seed. Maybe I should just reset. What do you guys think? Should I reset? >> Guys, look. I did. I I healed. I healed. I'm not Okay, I didn't heal, but I I did. I literally I was gone for 3 weeks completely doing nothing. And my surgery was 3 weeks ago, guys. It was well, not quite 3 weeks. It was almost 3 weeks ago. I've been healing. I still have more resting to I still have more resting to uh to do, but I can still play. Um I can still play some Minecraft, right? How long will physical therapy take? I don't know. Surely there's just going to be a lava over there. I don't know if I can even MLG probably. You should learn to do underwater portals. Well, they don't exist on this version. So, I could learn to do them, but it would be utterly useless. And it seems pretty simple how to do them. I'm sure I could learn in I don't know, an hour or something or less. I have zero need for it because I never ever play on the version that it's doable on. got severe carpal tunnel. I did not. I did not. Oh, there's a room portal. Okay. Um, guess I'll just take this one. Um, oh, I can use this lava pool. Perfect. Let's Monk still got it. Crap. All right. It's a little, you know, a little a little uh mid, but Oh, hello. Oh god. [Music] All right, let's get these blocks. Put this here. Put this here. And then we get we get to go. Is that a fortress or no? That's just [Music] kill this guy real quickly. Um, okay. Let's see. I want to see entities. There's quite a bit that way. So, we go that way. [Music] Someone said even the cast is green. Exactly. It has to be green. Why would it not be? Um, I do not think I'll be able to boat clutch, so I'm not that inclined to try. and you lower your FOV for more precise pyre. Um, you see the entity count that is there is a more precise pyate. It is the equivalent of if my FOV was 30 for your viewing pleasure. Um, all right. Well, that's not good. At least when I die, I have like a really good excuse. Like whenever I die to something stupid. I'll have a really good excuse. Um, okay. I need to go backwards. Leave me alone. Leave me alone, please. Oh, here we go. This is going to be a little difficult. I don't like that guy there. I don't like this bastion really. What is this? Okay, we're on bridge. Nothing good. Um, I want this guy to see me. I guess I don't need him to if I can just come grab this. I'll take the mending pickaxe. Why not? Uh, I don't need the pork chops. Okay. Block of iron. I guess I'll take. Why not? Um, I don't need to go in there. There's going to be a brute somewhere along here, but I don't even care. I'm wearing gold. >> All right, here we go. Got our gold. If I fall down there, I might die. So, let me go ahead and get this. I want to put this gold there. Um, um, I want to drop some gold over here for you guys. I want to kill you cuz I don't like you. I don't need to go that ridiculously quick. Like, I can just go in here and drop some gold here. There's enough guys here probably for me to >> Hey, come on. Get in the hole. Um Get in the hole. [Music] Um, okay. I don't have that anymore. Get over here, buddy. Ro miss pearls. I saw them. Don't you worry. I'll grab them. I was just I was just trying to get these guys in the hole first. Crap. Um there might be more chests up there. I don't need a hoe anymore. All right. Whatever. I don't need that. I don't need that. Don't need that. Don't need that. Okay. Um, more pearls, soul sand. I need a little bit more obsidian. There might be some up there. Um, fire res. I could use use the fire res if I can grab it. Um, need the string. I don't need that. I don't know what I need to not have. Uh, sticks. I want I guess I don't need the gold. Fire res is useful. I can take that. I can throw that out. Is there more fire res? Ah, I don't I'm being indecisive. What do I What do I need? I need that another fire. Don't need that flint. Yes. Okay, cool. Well, we're good. All right, let's just go. I don't need the hay bells either. All right, I don't know where a fortress was there fortress near spawn. I feel like there was a fortress near spawn. I'm going to act like there is one because that's what I feel like is the case. Um, I guess I can put that there. I need anything else? Not really. Uh, where is spawn? Spawn is 00 which Oh, is there brutes after me? That um Okay, let's see. I think I came in this way. Um, hello sir. I don't know where I'm going exactly, but somewhere. Here we go. Perfect. This is where I came in. But this guy's kind of annoying. Let's ignore him. We didn't make a bow. Let's just go over there. Don't hit the roof, please. Oh, I don't know how that got all the way down here, but hey, should be fine. We got a minute and 30 left on our uh thing. Let's just go over here. Really? That's the right direction. Almost back towards spawn. We're positive. Negative. That's a fortress. Guess maybe I should have eaten like pork or something. Uh, well, I'm at bedrock. That's like so stupid. Unlucky pearl. 49 seconds. Can I just pearl up? Oh my god. I don't like pearling into the unknown. I'm just going to wait. What happened to Forum? I broke my wrist. I broke it. Perfect. Let's go right up there. Oh god, there's so many weather skeletons. Oh god. Um, well, maybe there's blaze spawners this way because I do not want to go the other way. Yes, do hear a wither skeleton, but don't particularly care. Bel donated $20 through super chat. Oh, I can't see it cuz it's over the random question. Oh, well, one second to your random question. I am killing some blaze. Okay. Uh, what? Don't know if you'll see it, but you guys call each other by your real names when you aren't streaming. Um, sometimes. [Music] Just depends. I mean, George obviously we call George. I call Side out Nick most of the time. They both call me Dream. Pretty much everyone calls me Dream. Let me move this that way you guys can the alert boxes. Oh well, let's not do that in the middle of the blaze. [Music] What the muffin? Okay. Oh my god. Okay, let's eat this. That way we heal quicker. And let me put the donation alert box over top of that. That way next time it pops up on top. I guess I can just move this down a little bit. Maybe like that. There we go. All right. Perfect. Oh my god, I hate you. [Music] All right. What does my blaze rod count at? I got four. Um, let's go ahead and build one, two. This is kind of annoying, but Hello, Blaze. All right, let's see. Um 177.6 1440 736. Reasonably close. Not too bad. One more blaze. I don't have fire Nice. [Music] [Music] Kind of want these blocks. All right. Uh, negative 1 1440. 736. Can I go this way or is it going to close off? It's going to close off. So, I need to run a little bit this way. It's not the ideal direction. Oh, wait. Maybe. Is it right? Am I stupid? It's this way. I believe so. Yes. Okay. Let's go ahead and take one of these. Believe there was a thing over there. Oh, I went over it or something. Throw another one. Why am I going I don't want to go this way. I want to go this way. I'll wait until I'm at the top. I'm slow. Yes, I am slow, but it's okay. You can forgive me for being slow. I want to go this way and this way. So, over there. Damn it. off by a couple blocks. Maybe I can just crawl here to be quicker. Um, I need to eat something. Some cooked cod. How did you break your wrist? We were boxing sapnap. I was boxing sapnap and I broke my wrist. All right, screw off gas. Really? Well, okay. We're pretty close. -73 1440. It's like over here. It's like right here. I don't need to go down that far, but I'll go down. We're in a good spot, so might as well get down. Hello. I don't remember. 1440736. I care. Basically. Um. Perfect. Let's see where. Oh, where this is it. All right. Um, going down is good. Library. I could have maybe taken a peek, but this is this way. interesting library again. Is there any more? Oh, it's going to be here. Totally. Yes. Um, let's see. [Music] God, I'm slow. Need to make a Oh my god, it's not going to make it. Ah, Jesus. I just was not ready for that not to make it. Um, okay. Let's go ahead and do this. Oh my god. I just like everything is so slow. I can make a bow here. Can make an axe. I make I'll make an iron sword because that would be good for the dragon. All right, let's just pearl over there because why not? Surely we can still aim. Oh no. Well, that did not work. I don't have water. I didn't bring a water bucket. Um, I'm dead. No. No. Why? Why did I die? [Music] That sucked. But hey, look, we started the stream 32 minutes ago and we almost beat Minecraft. So, you know, that's a good that is a good sign. Wait, that's my foot, guys. You see how I'm sitting? I'm sitting weird, but it's okay. I had a fire. Oh, I did. Wait, I'm stupid. Guys, look. I'm in a cast. Okay, I'm in a cast. Shut up. Doesn't count. Um Okay. Are is your cast actually making a difference or able to power through? My cast is definitely making a difference. I cannot like I don't know like I just can't I cannot hold the mouse how I usually hold the mouse. I'm also using a different mouse right now than usual because my other mouse is too tall for the cast. Will you be recording six hunters in the cast to prove your dominance? No. That's just not That is just not a thing. I broke my wrist and it was boxing sapnap. Let's not give away our health. Go down. Okay. Accept that. It's a decent amount. Um, where do we want to go? I think we'll go over here because there's probably higher chance of lava. We don't need to go to this treasure map. But if we did, we'd be going south west, which would be this way. It's probably over there. Actually, I guess we might as well. Already heading this way anyway. Lock in. You should be in the Nether by now. Oh, shut your mouth. Look, I'd beat you up in a cast. That's all I know. In real life and in Minecraft. From one to six, how many hunters you think you could beat in a cast? Well, I think with some practice, I could definitely beat at least one hunter. I think it would take practice and it is pretty annoying, but like crap. Um, but I could do it. Why are you playing with your injured hand? I I have to. I have to. This is my job. What else do I do otherwise? Um Okay. All right. Well, I need to Oh, that was convenient. Um, well, the buried treasure is probably like right here. Uh, maybe we can use this to find lava. It's map. And then the very treasure can give us food. Ah, right through the river. Okay. Um, do I just dig down in the lush cave? That feels like that would be good. I don't see any lava on this map. Let's see. Oh, heck off. Um, come on. Lead me to a lava pool. Crap. Oh, it's a dead end. No. No. How'd you double hit me? How did he double hit me? How the heck did he double hit me? That was unlucky. That was unlucky. Dang, Nabbit. We need a better seed. We need a good seed. Should I ate the fish? Yeah, I should have. I thought I was fine though. And I was just looking for lava. Dream, can you write my name Nightmare on your cast? You said I could sign it earlier. You missed my other two donations. Okay. I'm sorry, Nightmare. Thank you for the 50. I can't I can't do that yet. And I also I'd be writing it left-handed, so I'd have to have somebody help me. I might do another stream where I let people write on like donate to write on my cast. And if I do that, then I'll I'll I'll write you down. Okay. But I'm doing uh I'm I need some I need I think two other people I'm having sign it first for like a little picture and a Tik Tok, so I can't unfortunately. write you on it. But if I do a stream, like I said, if I do a stream where people can sign up my cast, which I think I I might do it, then I will I'll put you on it for sure. Going to need a bigger cast for that. No. Come on. There's plenty of room. I'll have someone here that signs my cast with me. There's a shipwreck right here. Oh, I think it's a full shipwreck. See the little tail of it poking out over there. Did you learn how to go in with your left hand? Not yet. Not yet. I will master it though eventually. What the heck? Oh my god. Oh, come on. This is like This is a whole bunch of baloney. No. What is the most difficult thing to do with the cast? Probably craft and open chests. That feels like the most difficult. Uh, and then I can make an axe as well, but I need to make this first. Crap. Yeah, crafting is really annoying. I don't actually know exactly why, but um that goes there. Um, okay. Surely that's okay. Wait, food chest somewhere around here. I think it's a full ship. It is a full ship. Well, that didn't have any food, but Wait, am I being stupid? I don't think so. I think this is where the shipwreck buried treasure. I mean, not shipwreck. Okay, what am I doing? I'm tiring up with leaf litter. I mean, this is kind of an L, but we have most of the stuff we need. We just need a lava pool. If there was a lava pool, this could be good. But I don't see anything. Let me tie her up here. See if I see anything. There's some wood. When are you planning to release your next video? It should probably be in like 10 days hopefully. Could be a little longer or a little shorter maybe. But if it's shorter, it's probably only shorter by a day or two. Who even plays Bug Rock anymore? I mean, this isn't even Bug Rock. Um, okay. I don't see anything useful here. Um, pill drop post. Um, let's see. Can I scoot forward? Yes, I got a flint. Give me a flint. They really didn't give me a single flint in this entire gravel patch. That's kind of ludicrous. You're kidding me. [Applause] What did I do to you? What the muffin did I do to you? Oh my god, this became a mining gravel stream for like two minutes. All right, there's just no lava. There's no lava. I just heard lava house. Yeah. Well, it wasn't enough, I don't think. I think it was just like a singular source block in a cave or something. Why do you keep leaving? Cuz they're bad worlds. They don't have anything like near like around me that are that are useful that I see off of spawn. I don't see anything here. Looks kind of useless. Crap. Lava pool. But is there anything else? an ocean. There's a shipwreck. What are those written on your cast? It says Drisa 404 and Sapnap. They all signed my cast. I don't know why I'm getting so many trees. Um, whatever. I'll say it. I don't care you broke your elbow. I'll say it. I don't care that you don't care that I didn't break my elbow. That was a very fruitful fruitful chest. Don't take damage. Come on, get in here. No, I don't like that. I think this guy's coming for me. Um, okay. Let's put that there. That there. Don't poison me. Yes. Break. All right. Now, I'm going to go on up here. There's a lot of war back there. Wait, what? Oh, he triden into me. No, I'm a crippled man. Leave me alone. Stop. You wouldn't You shouldn't attack a [ __ ] Do they not teach you that? I got a flint, but um sure my gravel luck has got to be better this time. That's not that much better. Um, let's go ahead and do this. went. We can get the world record in a cast. I don't know if that's I don't know if maybe someone's done a fast run. This is going to poison me though. No, it didn't. Yes, I'm the goat. Ain't really nothing here. I don't know why. Oh, is it like low or something or high? counter is being weird. Or it's just one of the bastions that doesn't have many uh things. I don't have gold. Guess I could mine this. Um Crap. It's not enough. Well, um, what is that? That's a bastion. All right, let's see. I don't like this bastion, but I guess. Well, that's really not good. Oh no. Okay, I lived. That's all that matters. No. Crap. That was my cast. That's so annoying. Ah, A singular lava pool. Dog, what happened? Well, you see my wrist. I I got into a I got into an altercation with a um with a uh dragon. The dragon bit me and then I stuck my hand in its claws and opened its jaws to be free and my wrist got all messed up so they had to do surgery on it. doesn't know the meaning of rest. Oh, I do. I've been doing nothing. This is my first time even at my house, guys. This is my first time at my house since the surgery. I've just been doing nothing other than watching TV, sitting around doing nothing, but I wanted to do this. I feel good enough to do this for a little bit. You know, like this is not going to be a 20our stream, but Whoa. Boost. Dogs killing sheep. Gave me some meat and some mutton, too. Oh, that was the mutton. and some wool filled with Oh, a ruined portal. I don't mind if I do and it's lava. [Music] There's surely no lava. Surely no iron anywhere that I can get a lava ball right there as well. I don't see any iron sources though. There was a skeleton. There's a cave or a spawner. Okay, that's convenient. I don't really want that. Oh, well, it's not that convenient because it's not enough iron. I don't want to go in this cave, though. But I don't really want to I guess they're going to shoot each other. That works for me. Um, I guess I need one more iron. Of course, there's not a singular piece of iron. There's none. Oh, wait. I can make one. Wait. Oh my god. What are the odds? All right, let's make this Go and already make the bow because we already have the string we need. We don't need any string. We don't need that. But we'll keep it just in case. I'll make a bucket. Oh, it's so annoying. So annoying to craft. Like that. That. All right. Um, kind of like that one better, actually. We need to wood light. It's kind of annoying. That's fine. We got plenty of time. Hasn't been that long. Uh, let's see. Can I do this with a broken wrist? Um, seems crap. Seems like I can again. Boom. No. Boom. Um, I don't got any food. I do want to get more wood while it lights. All right, we made it. Oh, we don't really have much of anything anywhere, which is unfortunate. Um, I do want to make that. Um, there's not really anything anywhere. No, no, no, no. Why? guys. I mean, that was definitely my wrist. I couldn't even like aim into the boat, but it's fine. Why'd you break your arm on purpose? Oh, I I didn't break my arm on purpose. Obviously, I didn't break my Why Why is there just this conveniently placed log right next to this conveniently placed cave? Let's go and take it. Let's take this conveniently placed log. There's some iron conveniently placed right down there. A stupid zombie conveniently inconveniently placed right here. Well, now that water is inconveniently placed right here. Crap. Crap. Um, I want the axe, but I don't want to do that. No god muffin. Ah, maybe we can get a conveniently placed bastion next to a conveniently placed fortress. Someone says that would be pretty good. I actually do quite like the idea of that. I don't don't know for sure that I would be able to take advantage of it given my given the circumstances. given the circumstances. I don't know why I'm coughing, but I am your biggest fan. I also play Minecraft. Please, let's play together. All right, bro. Hop on. Hey, Dream. Tips for bastion routing with brutes. Yes, I'm being asked for tips now. Holy, I'm not washed anymore. Yeah, I had to learn how to route with the brutes as well. Brutes are really annoying. But the biggest thing ever is just that you can you can kill them with lava and tower up couple blocks and kill them with lava. Kill them with kindness. Kill the brutes with kindness. Just ignore them and just continue through the bastion routing. Yeah, unfortunately I have this cast on for a month. Um, which I didn't know it was that long and I just got it put on. Um, because I had a I guess I had like a surgical wrap on for like two weeks and then now I have this on for a month and then they have to assess I think with like an X-ray and stuff and see how it's doing and then if it's doing good enough. I guess maybe I have a I have I think I have another cast no matter what. But maybe it's a different cast. It's like splint or something. It's like better, easier to like use stuff and you can take it on and off. I don't know. You have mouse keybinds that are hard to use with the case. Yes, my middle button is on the mouse or I have not middle button, but like um uh this button I use for my well, this is F5 and then this is um my five like middle slot. The slot that I'm holding right now in game is that button. So, it's kind of hard to press, but if I want to go to my middle slot, then I have to press that, which can be annoying. Hey, pigs. Why'd you get surgery? I just I I don't know. I want kind of wanted to. I've never had a surgery before. What do you mean? Why'd I get surgery? Because my wrist was broken and I had to get surgery. Say happy birthday to my friend Maxwell Reese Bobbit. Happy birthday. Happy birthday, Maxwell. He also broke his arm so we could stream it. Exactly. Guys, you got to get the sympathy like viewers and the sympathy donations. There's a village there. Can you tell us about your arm story? Yeah, I was in um Taiwan and there was a dragon that uh I was at like a museum and um unfortunately one of the dragons that they they had in the museum, it like came back to life somehow and then it bit me, but it was like tiny still. So I I I was able to stick my hand like under the jaw and try and like get it out, but then like it didn't work and it broke my wrist. But I but I saved myself and I lived. And then I um I had to have surgery to fix it. How did you break your wrist? Well, you see, there was three big burly men and they cornered me in a dark alleyway. I was walking. I was trying to get some muffins for Baba Halo and three big burly men. Uh they were at least like six foot each came out from behind the the dark alleyway and they started beating me up. But I had the technique of just spinning around and like slamming my arm like around. And so I was hitting them with my arm over and over and over again as I spun around like in a helicopter circle. But it broke as I was doing that. I didn't think it was going to break, but it broke. And I had to use my other arm to grab it and start like using it to to beat them to finish and get away. And I got away, but then it was still broken. So now I'm unfortunately in a cast. But you don't you do not want to see them. How'd you break your wrist? Um well, unfortunately I was skiing and I was with George and um George thought it'd be really funny to try and do a backflip, but he doesn't know how to do a backflip. So when he tried to do the back flip, he was like halfway through the backflip and landed right on top of my arm and unfortunately it broke. So I had to have surgery right there and a lockable there too. It's the sword. Looting one. It's not that good. That bad to be honest. Dragon story is better. That's true. How'd you break your arm? Well, you see, I would tell you the real story, but I can't wonder NDA, but I'll break it anyway and tell you. I was at Skppy's house and he broke my arm and told me not to tell anybody. I don't know why I'm continuing on this. Actually, I'm just going to leave. There's not any food. I don't think Dream understands the word rest. I do. Do you understand the word grind? Why is all this leaf litter on the ground? How did you break your arm? It's a long story how I broke it. I was speedr runninging and I got really mad because Dr. Donut was somehow in my in my world and he griefed the ender dragon before I could even kill it. And so I started slamming my hand and I broke it unfortunately and I had to go to the doctor. There's a village over there. There's a pillager outpost right here. We're going to go ahead and we're going to get it. Come on. Leave me alone. Leave me alone. I just want to take your loot. Leave me alone. There's so many of you. [Music] Um, hell. You get to pick the color of the cast or you just get lucky with being green. I got to pick the color. They said, \"What color do you want?\" I said, \"Green.\" I said, \"I want me a green cast.\" Dream, how'd you break your arm? Well, you see, I was uh trying to pick the six hunter and um I picked somebody and I had to talk to them in person about it. And so they like flew to me and then when I met up with them, they said that they would only be the six hunter if they could break my arm. And so then I had to say yes because they needed time to train for the six hunters and they needed me to be like crippled and I that was the only way they would agree. So I had to agree to their demands sooner. Hey Dream, this is Maxwell. You wish me a happy birthday. Can you wish Elijah, my best, happy birthday too? He's a epic guy. Like gas from Minecraft. Yep. Happy birthday, Elijah. Thank you for the dono. How'd you break your leg? Well, after my arm was broken, it became really hard to like move around and I I fell and I couldn't protect my fall and so I fell on my leg unfortunately and I broke my leg. I need another world. This world sucks. How'd you break your back? I broke well I mean after I had a broken leg and a broken arm I was I really didn't want to try I really didn't want to be in a wheelchair so instead I was trying to hop around on the on my left foot and I'm not very good just hopping on my left foot and so I fell and I I really couldn't I couldn't protect myself so I just fell flat on my back and it broke unfortunately I'm really trying to my back's in a cast right now but hopefully I get I get out of that cast in a couple weeks. been in a lot of unfortunate situations. I know. I know it is. It is kind of it does kind of suck. You know, recovery kind of sucks. The recovery for the arm is actually pretty bad as well. Like it's just like it was so numb and I couldn't like I couldn't I had to keep it above my heart. Like I had to keep it I like hold it up. It was pretty annoying. Dream say Technoblade never dies. Technoblade never dies. Give my friend Anthony a shout out. He's a fan. Happy happy friend shout out Anthony. Oh, there's a village over here. How are you always sicker in pain? I'm actually I feel like I'm not sick that often. Like I've gotten more I've gotten less sick and I only recently been in pain because I I broke my wrist. All right. I might need this. Hey, Mr. Iron Golem. Here to see if this village is anything good. >> Hello, friends. Um, is there anything over here? There's no house. There's no blacksmith. I feel like this could be good, though. I could get the bucket from the trading villager. More houses over here. Oh, there's a blacksmith guy there. Yes. Yes. Yes. Nope. Ah, it's cuz of the stupid grindstoneone that's there. There's nothing good. I need the iron golem. I also need to trade with this guy. Oh, but I already have the stuff actually. Go ahead and make this. >> Um, he gets the bucket right away. Boom. Um, the caster true warrior. I know. I'm trying my best. I'm trying my best. I'm not very good with the caston, but actually that's not true. I'm pretty good with caston. I could still I could still beat some people. I need to find iron. Uh, thank you for the donut. I can't see what it says. That's your keybind setup. It's still the same as it was before. R is one, F is two, three is three, four is four. Middle mouse button or mouse button is middle X TGC and tab for offh hand. Ah, I'm laughing. This is a bad seed. What happened to you? A lot of things. A lot of things happened. Dream, we want patches. We want patches. We want patches. How did Skppy break his arm? He didn't break his arm. He broke my arm. All right, let me see if I can [Music] [Music] Ro is doing everything but letting his hand heal. What am I doing? Am I like bashing my hand on the ground or something? Like I'm my my hand is sitting on a mouse moving like a couple millimeters. [Music] Movement is medicine. I don't know what that means, but Oh, you guys want to see something cool? Wait, wait, there's lava here. Let me jump in here. Um, hey, look. This is my foot. [ __ ] I mean, oops. Yeah, you do want to see something cool. You want to see my foot? I can put my foot behind my like shoulders, but I'm not trying to do that right now. I'm just trying to put my foot in like a weird position that you guys can see. There it is. There's my foot. All right. It smells bad. No, it doesn't. It doesn't smell bad. It smells good. Hope your doctor isn't watching this stream. If he is, he'd be very disappointed. He'd say, \"I said limited use of the mouse.\" Limited. That's what he'd say. or the sooner is your favorite. I'm from Norman, by the way. Lived here my whole life. I have a lot of family from Oklahoma and I grew up watching the games and going to U games. Not a way to light it, but it is complete. Um, okay. So, let's find a way to light this portal. Not at the mushroom island. What bone did you break in your wrist? I forgot what it's called, but it's the hardest bone. It's one of the hardest bones on the body to heal. Um, I forgot what it's called, but yeah, that's why I have the cast on. It's also why I have the little um uh like nozzle here. It's a thing that I take off and it opens up into the cast. And it's because I'm doing like a I have to do like a ultrasound treatment to the bone like once a day to help it heal. Uh because otherwise it might not heal because it's a really hard bone to heal. Um crap. I guess I should have done that. I'm not going to get iron, but I don't know the wood light either. I don't know what the muffin I'm meant to do here. I have a fully built portal, but of course I didn't get a flint and steel or a fire charge from that that portal. How do you give it ultrasound treatment? Is there some little gadget that plugs in there? Yeah. I open it up. This runs like dead. But I open it up. This little like thing. It pops open. I pull out the thing that's in here. It's like a little plug. And then it has my like I can like access the skin now. And then I have like a little machine that like I plug in. It like puts a thing in there. And then um yeah, basically. And then I do it for like 20 minutes. Scaffo. Yeah, I broke that too. Wait, I think it is the scaffoid. I think it is the scaffoid. I don't remember though. Next video. Banning Dquavvis for good. Please say yes. I mean, Dquavus did break my arm, so I guess he should be banned. Dream, why didn't you amputate the arm to save time? Well, they did say they could amputate it if I wanted and I said I didn't really want that and they said, \"Okay, well then we can try and put it in a cast.\" And I said, \"Sure. Hey, good seeds. How did it break? I was trying to take a cool photo on the top of the Eiffel Tower and I fell and I fell and I broke my follow but I broke my wrist too. I also broke my back and my legs, but I didn't break my left arm. I can still play Minecraft in my wheelchair. Wish you the best. Thank you. Oh, there's a temple. I guess I should grab some wood while I'm over here probably. I guess really quickly. Well, I guess I'll get wood at the bottom. I mean, I guess I'll get a TNT, which will make it a lot easier to do this, but meow meow meow meow meow meow meow meow meow meow meow meow meow meow meow. Mow. [Music] Um, let's see. I got a whole bunch of nothing. What is this garbage? Density, luck of the sea, blast protection, dune armor trim. Like, what is that muffin muffin? How did your wrist actually break the truth, please? Okay, look. I really I didn't want to talk about it too much, but I can talk about it. Okay, I had a world record for arm wrestling and I got challenged. There's this big guy, this big massive guy. He challenged me to to for the world record. Unfortunately, I lost and he snapped my arm in half. They said I might have to lose it unless I can put it in a cast for a couple months. LA. [Music] Does the wrist hurt? Not really anymore. I mean, like, it's not comfortable. It's like uncomfortable, but like it doesn't hurt anymore. I stopped taking pain meds like a while ago and it kind of stopped hurting, you know? But I still have to take pain meds uh five times a day for all my other injuries. Once my spine heals, then I should be I should be good. Thank you. I really owe you for saving my fish from drowning. Sorry your wrist got stuck in the bowl. I swear I thought smashing it with a hammer would set you free. It didn't. But hey, you're still my hero. Don't worry. I've only told four people. Thank you. Thank you. I'm a hatchet. I appreciate it. Yeah. I'm sorry. Oh, PewDiePie wants to play Minecraft with you. I don't. He does. I'm always down. You can hit me up on Instagram or something. We messaged once before, but my wrist is kind of broken, you know. I don't know if the timing is perfect, but you call George and give him fake info to help him with his advancements. I'm going to call him and tell him he needs to get the he needs to remember just that he's never going to get the all get collect all blocks advancement unless he's collecting all the blocks he sees as he goes along. One v oneing PewDiePie with a broken arm. Wait, is it a fracture or a complete break? It broke pretty badly and it actually broke and then did not heal. And so they had to do a screw through it. And they also had to take a bone graft. They took a bone graft from up here on my like forearm. They scooped some bone. They cut a hole and scooped some bone. And then they took the bone and they put it into my bone. Like it's right it's right about here where this thing is. It's like the bone in there. They put it in there and they put a screw through the bone connecting it to the other bone. And now it's healing. That was a couple weeks ago. Stop lying. Tell the truth. That That's literally the truth. What I said there was literally the truth. That is 100% like actually the truth. Any complications with the surgery? Um, I peed myself a couple times during it, but I don't know how complications that is. They said it was they said it was normal, but I don't know if they were just trying to make me feel better or not. When I woke up, there was just pee everywhere. The doctors were the nurses were cleaning it up. Come on. Give me a good seed. [Music] What happened to your arm? Well, I was on a roller coaster and I put my hands up and unfortunately there was a malfunction and it smacked I smacked it into like an iron bar on the roller coaster as I was going by. Um, and it was broken and I was at the Disney doctor. The doctor's like in Disney and they tried to fix it. They said they they might have to put me down, but fortunately they didn't have to. And um they were able to fix they were able to put a cast on it and make it good. Okay, ain't nothing here. Dream, what happened to your hand? I had to get a hand transplant um because I couldn't I couldn't beat Minecraft fast enough and um they I just didn't have the like genetics and so I had a hand transplant. Put music in the background. No. Why is your name foot frenzy? >> You weirdo. You weirdo freak. All right. What happened to your spine? I broke my spine when I was uh recovering from my broken leg and arm because I fell on my back. It was really stupid, but it is what it is. Sometimes you just have to be more careful, I guess. Heck am I doing? actually like this if there's a cave nearby. Yes. Oh well, I didn't mean to do that, but that works. I can mine this with gold, right? No crap. I knew I couldn't. I knew that I couldn't and I still did it. I guess I didn't know that I couldn't, but I was I was pretty sure. Oh, I already have the flint steel, so I don't even need all this. This is all This is all gravy. Dream, how did you break your arm? You don't even want to know. You don't want to know. Um, you don't want to know. All right. Get a pickaxe. I guess we can get some of this. Have a god apple. Why not? Um, I guess I can make a pickaxe first. Get it anywhere. Give me a bucket. Here comes the bucket. Boom. I don't know why I made two boats, but I did make two boats. All right, swim up to the surface. Get this. Put this in here. Put this here. Go here. Um, okay. Let's go ahead and put this here. No. Crap. That is not what I meant to do. Crap. Let's put that there. Let's put that there. All right, now we're good. Yes, we made it to the Nether. I don't have gold armor. Can we get a face cam stream sometime? We'll see. Maybe. Not Not now. Ah, no. Why did I do such a thing? No. Wait. No. I could aim the god apple, too. Crap. Why do you have a cast? Because I broke my wrist. I broke it. I was trying to milk a cow in real life and unfortunately the cow didn't like that I was milking it. So, it bit me. My hand was stuck in the cow's mouth while my other hand was milking its udder and it did not let go of me. And so, I didn't let go of it. I kept squeezing and then it kept biting down until eventually I stopped and then I went to the doctor and my bone was broken and they had to try and fix it. Check something quick. Uh, okay. I need to reset. Or did I've heard you explain what happened to your arrest. Apparently, no one listens. Yeah, no one listens. I've said I've said I've said a hundred times what happened. How do you avoid the keyboard noise in your vids despite blue switches? Do I have blues? I think I do have blues, actually. Um, well, like right now, you see hear how it's like loud because I'm being loud. But when I'm being quiet, which right now I'm kind of being quiet, you don't hear it. So, like I just don't like I don't know. I just don't use my keyboard that loudly. And then my mic is pointing away from my keyboard. It's kind of quiet. How How long is your arm going to heal? I don't know. I'm in a I'm in this cast for another month. I'm in this cast for another month. Well, I guess now it's less than a month, but it's almost a month. Like probably another like 25 days or something. 26 days. I don't know. And then I think I get another cast, but I don't know if it's like a better one or not. I don't know. The recovery is a long time. Basically, Um, this didn't really work out. Two, I guess. No, that's not enough anyway. think this video is really good. Thank you. I appreciate it. I appreciate you. Thank you for the kind words. Dream is the most handsome. Uh crap, I lost the message. Wait, did I just make this message up? Why is it gone? What? Wait, it's actually gone. What? Okay, I didn't make that message up. Someone Someone was saying that. But all right, I guess I look crazy now cuz I couldn't even finish reading it cuz it disappeared before I could even read it. Why do you keep restarting? Because it's this crappy world. You know, you found no shot, brother. Me, too. Boomer Sooner. Boomer Sooner, baby. What are you looking for when you spawn into a world? I'm looking for lava. I'm looking for chests with loot. I'm looking for food. Lava, iron, and food. Pretty much a way to enter the Nether. A way to get food. Those two things. He showers by putting a bag over. Yes. When I shower, I put a bag over it. I have a little like cast thing. I put it. [Music] Oh, Jordan didn't tell him he's being dumb. He's always being dumb. I don't need to tell him that. Can I sign your cast? I might do a stream where you guys can sign my cast, but like I don't know. We'll have to see. Not right now. You ever go to OU games? Yes, sir. I was going to go to the Michigan game and then unfortunately, you know, this happened. What happened? My arm broke. My wrist broke. I don't know why I said my arm broke. My wrist broke. Oh, my arm broke. And my back broke as well. How did it break? Oh my god. I have to tell this story for like the 20th time. So, Callahan, he's a coder that we have work on some of our stuff. Um, he wasn't like doing his job and I yelled at him and apparently I was a little bit too loud with my voice because he beat the crap out of me and broke my arm. And then I had to fire him cuz he broke my arm. There's a shipwreck there. Know if there's lava or anything. How did you break your back? Well, after I broke my arm, I was very vulnerable and then Gumball came back for a round two and took advantage of it and broke snapped me over his knee. So, then I ended up with a broken back and I ended up with a broken um arm. Why for 480p? I don't know. Maybe because your internet sucks. Cuz I'm streaming at 1440. Really? Five iron? It's not even enough for a pickaxe. Feel like there's got to be a follow here about the motorcycle accent. How's your arm? It's pretty good. I did like it was fun learning how to ride a motorcycle, but I didn't know that you can't uh go however fast you want. Like I thought that when you had a motorcycle that was like the whole point. you could just go as fast as you want. And so I didn't realize that um that you had to follow the speed limit still. Otherwise, I wouldn't have been pulled over. And then when I was pulled over, of course, I had to run cuz I I was going like 100 something miles an hour and I didn't realize that you you weren't allowed to do that. Um and so there's a lava pool. Thanks, Shirley. So, I had to run from the police and when I was running, I did get away. But I tried to stow away at Skppy's house. And when I was climbing through his window, it broke my arm. Unfortunately, Is Bad Boy Halo gay? Yes, he is. He said he wanted me to answer your question and come out for him on my stream without him being here. So congratulations. Crap. Um, I don't need food or anything. This is kind of a crappy run, but it's okay because I will use this to make this um We didn't light it. There we go. We did. Maybe I'll get food right inside here. Have you heard about Mr. Beast's car accident? No, I didn't. At the same time as my car accident. That's crazy. Did it is there actually like is that like a joke or something? Hopefully there's not like breaking news or something. That'd be terrible timing. Um, I need food. No, it burned. Crap. Um, Jesus. [Music] Okay, there we go. Um, I need to figure out which way I need to go. Actually, really don't know. Ah, hey buddy. Guys, just leave me alone. Leave me alone. It's not this way. I don't know. I don't know what I'm doing, guys. Thought I was supposed to be good at this. That fortress. No. God dang it. Dang. Nabbit, stupid. Oh well. Hey Clay, isn't gaming like this a good part of occupational therapy? I'm sure you're paying for it. I had my right thumb nearly sever severed at work and it took me three surgeries and 10 months of overtime to have it fixed. That sucks. I don't know what you mean by saying is this a good part of occupational therapy for me. I don't know what that means, but sucks for you. Yeah. Hopefully it doesn't take more than one surgery. That would be really bad. If it takes more than one surgery, then that would be very annoying and bad, you know. to the gym guy now. He was jacked. He's been jacked. He's hot as hell. He's jacked up. He moss us all. We I I've known this the lava. How expensive was the surgery? It wasn't that expensive because Bab Halo had to pay for it since he broke my arm. I'm sure it was like expensive for them shipwreck over there half I think. What's your main source of entertainment while resting with no Minecraft? I don't know. That's a good question. And I did a lot of like watching shows with my mother. I watched a lot of football. I usually don't get to watch as much football. So I got to watch I had two Saturdays worth of college football. And then today I watched some of the NFL actually. Yeah. What happened with the Chiefs? Did the Chiefs win? That'd be really funny if they didn't. Okay. Well, they're Oh, well they could lose only by a touchdown. It's still possible. Oh, nine to 16. Still possible. Lost the fight with an avocado on Thursday. Now I have five stitches in my fingers. Ah, I hate that. I hate I hate be careful. You got to be careful with knives. Uh, got to pee, but I don't want to go pee right now. Oh, there's tons of sheep. Wait, there's four different colors of sheep right here. That's kind of immaculate. Which mod do you use for the latest video? Um, the swap mod. Is it bad to finish season one of House in two days? Now I'm starting season two now. It's not bad. I I don't remember when I I don't remember how many days it took me. I I binged I binged it and then I watched it multiple times. How did bad break Dream's arm? Well, he didn't. We were I was trying to show him something and we were sitting on I was sitting on the couch and unfortunately he his big voluumptuous butt sat right on my arm and broke it. Um Okay, so that's crying obsidian. So we need three. What's your mouse pad? It's the Oklahoma Sooners. It's a college football team. Well, it's just a college, but it's a college football team. Sports. Go sports. Well, not really. Load. Hello. Hello. Hello. Is it night there? It's 1000 p.m. when do you take the cast off? In a month. BT better than you. Horns down, baby. We'll see you in a couple weeks. How did you break your arm? Please explain for the Brazilian time because I just drive. Well, I broke my wrist and unfortunately I was tunneling. Um I was tunneling. It was in California. We were trying to build a tunnel and um there was a car poolool that like was going through the tunnel as we were digging it because they thought it was a finished tunnel. And I got I got out of the way, but then I tried to grab Skppy like his leg to pull him out of the way of the carpool, but uh he didn't I didn't get him out of the way and I it was his wrist and Skppy got ran over and I my wrist got ran over and Skppy had a Skppy transplant surgery and was he's fine now because he's all he's all like new and good. But my wrist unfortunately is broken. So I had to have it in a cast. >> I see you back and on the mend. Are you guys going to finish the video where Quavvis drowned you? I don't know. That's up to Safnap. We'll see. It's up to Sapnap. Thanks for the dono. [Music] I don't know what I'm doing. Stop restarting. Well, I need a seed that's decent at least. I need to pee. I don't want to. All right. I need to pee. Be right back. You guys can judge my speedrun time. BRB Guys, really? I lost like 500 viewers. Really? You guys decided to leave? All right, I'm back. Okay. All right. I am back. Get pranked. Oh, shut up, guys. I'm sorry. I had to. Don't further injure your hand or have it healing properly. That is true. I don't want to do that. I'm trying not to. I'm doing best I can. There's lava right here. And I think that was a like ocean to behind us. Why are you a Sooners fan? Asking from Oklahoma. A lot of my family is from Oklahoma. I grew up watching the games with my dad who was a big Sooners fan. My grandpa was a huge Sooners fan, season ticket holder. Um, yeah. And so I became I was a Sooners fan my whole life. All right, there we go. Let's see. Is there shipwreck somewhere? Hopefully. I don't see anything. [Music] It's a coral reef that way. How do you decide so quickly if a seed is good or if you should quit it and start a new run? Well, you're looking for you're looking for iron. You're looking for food. You're looking for a way to enter the Nether. Um, and you can usually tell pretty quickly you know what's around you because the biomes, you know, they can have certain things and you know how likely those things are. And so you can kind of just glance around, know what biome you're in, know what biomes are around you. And once you know those things, you can kind of make a decision like is it, you know, are you is the seed potentially good? And a lot of times you can know really quickly. The answer is no. Um well I don't like thorns but guess I don't want any of that then. Um I'll go ahead and make bit of everything I guess. Come on. Got some bread. Um, I guess I might as well do this. Make a sword. We got so much stuff. Might as well make a sword and an extra bucket and shears. Um, I need a way to light the portal. But for now, I need to go back to the lava pool. How did you break your arm? Well, I did break my wrist, not my arm. and uh I can't really share the story because there was some people involved that made me sign NDAs to not like talk about how it happened. So, I was in a Mr. beast challenge and it was who could jort it for 24 hours straight and unfortunately I won and it really I don't know they didn't like it because it didn't the footage didn't turn out good enough I guess I don't know what what their standards are and so they had us all sign NDAs to not talk about it so I can't even talk about it but I did break my rest. Where was the lava pool? Um All right. Well, unfortunately I didn't get Well, get to Y about 70. There's not even any entities anywhere. I also broke my wrist and had a pen. Yeah, I had a I have a screw in it. village here. A lava pool. This is looking quite promising, guys. Guys, lock in. What is happening here? I don't know where the iron golem is hiding out. Got to go to the top. llamas. [Music] There ain't nothing here. Another lava pool way up here. only there was an iron golem and also some chests with like some stuff in it. But there's not. You never get everything that you need. You only ever get some of the things that you need. Yeah. Who Who did I whose chest did I open? I guess I should just reset. I couldn't find anything useful. I mean, I could find some stuff useful, but not that useful, you know? You know what I mean, guys? There's some ice, guys. You like that? ASMR chewing ice. thing is even if there's a shipwreck this way, which there could be. It's so far that it's right here on the edge. Where's the ship? I guess it's not that far. Far enough that it's annoying that it's this far because it could be so much faster. But it's not far enough that it it's not worth it. It is worth it. Hey, dolphins. All right. Don't drown me. Yes, it's right here. It's a little further. It doesn't matter because I can get it. Do I even need it? Yeah, I kind of need it. I can use TNT to blow up the blocks around it and maybe get it. I'm drowning. Why am I drowning? Get me to land. Get me to land. All right. Um I kind of want to Well, this is kind of annoying. Let's go ahead and get one of these wood blocks. And then let's go ahead and do this. Let's put in a place where we get the maximum of everything. Get some wood and everything. Now I need to find this chest. Oo. Look at that. All right, we can get another one over here. Um, while that blows up, let's do this. Um, let's do this. Oh, it's like desert sounds. I was like, what the heck is that? Sounds something's coming to get me. All right, let's put this in here. Um, we have a bucket already. We already have tons of blocks. We don't even need anything there. Uh, all right. Let's go. Let's head back to the future. Um, I guess I can kill this guy. This is kind of stupid, but whatever. Get it. Get it. Get it. Get it. Get it. Well, I don't remember exactly where it was. It was somewhere over here. I think it was pretty far this way. Of course, there's like a big cave separating it. It's further though. Right here. Surely. All right. All right, guys. We made it to the Nether. Oh crap. What? How'd it flow into the Oh, it flew to the other side. Oh my god. I thought it flew into the portal. Ah, I was screwed. I was screwed. Why was I screwed? That's so annoying. That was pretty annoying, I will say. really one bread. Eat potato. No. Woo! Woo! [Music] [Music] How did you change? How did you break your arm? I broke my wrist, unfortunately. And it's cuz we were It was the dream team was trying to see who could hit a hammer on their hand the most times in a row without like saying ow. And George could do zero. But then Sav and I were on like 252 or something. I forgot the exact number. And then my wrist broke unfortunately. That's why you probably shouldn't do that, I guess. Let me check something real quick. There we go. Okay. You play 1.16. No. You know why not? You know why not? Because I don't play that damn version. It's old. I want the happy ghast. I want the caves and the cliffs. I want it all. I want the brutes. How did you break your arm? I just joined. Well, I was at a gay club and I had a wig on and there was a man there that I guess was married. I didn't know. They took me out back and they broke my arm and my legs. That's a fake story. No, it's not. Why would Why would I make up a story like that? All right, here we go. Here we go. Okay, got everything we need. Just need to grab some water real quickly, then get a flint. So, I guess we didn't get everything we need, but you know what I mean. You know what I mean? Pre-recorded. You are an idiot. Official goozy. You're actually an idiot. You should feel ashamed for the fact that you are so stupid. Yes, I got flint. All right, I'm back. We need lava. Surely in the jungle there's some lava Well, that's mighty convenient. I actually like that. Well, well, well. We don't have a cave. I don't even need those diamonds. I'm just going down here. Yes, there's more diamonds. Yes, diamonds at last. Well, we got all the way down here and there's not lava pool. Surely this should have been a lava pool. Uh Well, that is not I don't think there's anything around here. No. Why am I not getting anything? Why are you not giving me what I want? I don't ask for much. Is that a cast? Yes, it does say that in the title. Twice. Twice, I tell you. All right, guys. Well, I think I'm going to end the stream. I'm going to go ahead and raid George because George is live right now. I'm go and give him a little raid. I might do another stream later. I just wanted to see if I could actually play. And I think I can play. It's not It's not great, but it's not terrible either. I can do some stuff. So, I am going to raid George. He's doing a cool challenge. You guys should check it check it out. Boomer Sooner and see you guys later. Thank you guys. Thank you for coming. Bye-bye. Um, let me go on Twitch and do this slash read. Oh, he's not even on. Never mind. All right, guys. You're on Twitch. He's on YouTube. You can check them out.",
    "start_time": 7.6,
    "end_time": 10016.72
}