{
    "video_id": "nYNORAqxeCc",
    "channel_url": "@dream",
    "transcript": "Why hello there. Welcome to another day of speedrunning. I know we're doing it every day for so long because we have no life except for speedrunning and getting better because this is our life. Thank you for watching. Make sure to subscribe. Click the subscribe button. It's free. You can always change your mind. All right. Now chat's going to be coming in. I need to be back on my best behavior. Um, there we go. Hello guys. What is up now? People are coming in on Twitch. Look at this. Like a nice village. kind of cool. Um, let's see. This is an intriguing village. Hello, chat. Um, I don't see anything good here. I'm just going to reset. Did you already go into surgery? No, it's next week. You got We got a week. dreams, you even read the chat. Well, there it goes. Hi from Russia. Hello. The heck the muffin is this seed. Wait, look where the goat. There's a lava tool. So, a lava tool. A lava pool. It's a lava pool. So, we will investigate this seed. Only problem is I I don't remember where the lava pool was. I think it was like right over here. You can see everything from up on that mountain. There it is. It's a little cave right here as well. Um um let's see. Is there anything here? Nope. Uh hopefully there's a different cave cuz that cave stunk. Well, that pig just had an escape route. Not every lava pool seed works out. Um, well, this actually could be fine. some copper. There's just never any iron. Minecraft really nerfed their iron spawn rate by a lot. Will you stream with Oni? Hell yeah, 100%. Let's do it. I don't know if he wants to do it before my surgery or after my surgery. Probably after my surgery, so it might be a month or two, but I'm down. Crunchy ice. True. Why do you play with rules? Well, it's for practice. It's like Manhunt has rules as well, you know? I'm sure on is down too. Yeah, I I I talked to Oni in uh private and he seemed down. We just had to work something out, figure out what we're doing. We had different ideas, which is cool. Are the hunters actually also practicing? Hopefully not, but unfortunately I do think that they are or at least a little bit. Not together, but I saw a bad recently doing like speedrunning practice, which is kind of funny. Not that that's, you know, that it's just helpful because speedrunning is a really good way of just getting your mechanics better. So, the fact that bad is practicing speedrunning makes me a little worried, you know. His dad said he was excited for six hunters and was asking me about it. [Music] What is your surgery? Something you didn't want to share? I've shared it a couple times, but but to be fair, a lot of people obviously don't see everything that I do. So, I broke my wrist and I have to get a surgery to fix it. They have to get a bone graft from my forearm. And uh cuz the bone that I broke isn't healing and they need to make it heal. So they need to they're going to put a screw in it and they're going to put a bone graft in in it. And I'll be in a cast for two weeks and a splint for six weeks after that on my right hand. How are you playing with a broken hand? Cuz it it's not uh it's been a while since I broke it and um uh I don't I'm not in like active I'm not in that much pain. Like it's just a little hurtful. Hurts just a little bit right now, but not like not much. Um okay. Well, what do I want to do? Uh, I think I guess that Look at my gravel right here or flint hopefully. [Applause] [Applause] All right. I have some I I have a lot of notes. I've done a lot of uh a lot of practice offline um because uh I obviously want to get better and that takes more more than just being on stream. So even though I have been streaming I've streamed like 60 hours in the last week. Uh I've also been not practicing offline believe it or not. Uh, and one of those things I was practicing was like I need to take less damage in the Nether because then I then it can be I can be fine with uh no food. And so I need to do I think I need to boat clutch more and so I was messing with the new like boat mechanics and trying to boat clutch. And um it's a lot harder but I'm I've got I did I did pretty well offline so I think I will try that. today. Um do need lava though. It's my birthday cuz happy birthday to me. Happy birthday. your love, Charl. Um, I guess I could just dig down, but it's just kind of annoying. I kind of wanted to do mostly surface lava pools today, but it can be annoying. Um, all right. Well, I guess I'll just What is one cycle? One cycle is when you kill the dragon like instantly. Like you just you you kill him on the first cycle when it when it's landing. You bet it over and over and over again before it lands and then it dies. Um, okay. Hopefully there's lava here. Oh, there's diamonds, huh? I kind of want them, but I don't want to take all that damage cuz I don't have that much food. Uh, well, Um, it's kind of annoying. There ain't no lava. Oh, wait. I hear lava. Oh, it's right here. Come on. Come on. There we go. Um. Uh well, all right. All right. Southwest. Um, that's so stupid. Um, all right. Okay. Well, Um, well, we are hitting a dead end. Is it all a dead end? Seems like it. We go through the wall or do we go around? This is a good question. Crap. The crappy seat anyway. All right. What is pie chart? Pie chart is an F3 menu debug thing where you can basically see a pie chart of all like what your game is running. And so you can use it to find like fortresses and chests, spawners. It's kind of like an X-ray type thing. People use People use it to find the stronghold portal room. They used to find the fortress. They used to find buried treasure. Why you not following your first rule? Oh, shut up. Um, okay. Well, this could be good if this cave right next to us has iron. This could be good. No respawn. Yeah, I could do no I could put no respawn. I don't mind putting no respawn. That is effectively what it is. Every day there's like a warm-up period, guys. It takes probably at least 20 minutes or so to warm up. There's another lava pool here. That's actually not useful in this instance because I need iron, not lava because we have lava. Damn it. There is just never iron. All right. Whole crap. A whole bunch of nothing burger caves really. There's just nothing here. This is kind of shocking. Could go down there, but I want to investigate over here. There's nothing. L's in the chat. What the muffin? There's nothing here. Hell. Damn it. It's just copper. It's just copper. Bro, reset. I did what you wanted. You're happy, aren't you? Dream for me. Pie chart doesn't work. It's stuck on unspecified. Do you use any mods to make it work? I don't use pie chart. Go bias. So, I don't know. Um, I don't have a mod for it, but I I don't know how it really honestly I don't even know how I mean I know how it works, but I don't know how to like effectively use it. I don't know what the seed was of my current best time. I didn't like get it. I don't think I don't think I type SL seed either. I need to make sure I do that in the future. I need to give the seed out to all the seeds I complete. Who is the six hunter? It's not decided. It's not decided. 600 is going to be Skppy. That's He's on the list for sure. He's in consideration. Is there anything good about ice biome and speedrun? I don't know. I don't know. One thing that I want to do soon is I kind of want to go and like look at the Minecraft code for some things. Like as an example, I bet you there's a bunch of undiscovered things on this version because no one plays this version. So, no one even like cares to like look. Um, like one of those things being like I don't know like lava pool generation. Like there's probably a a a magic to it. You know, there's there is randomness, but there there's some reason to all randomness and there's probably certain ways to find lava. And I want to like look into it and see like if there's certain things that generate in certain ways or if there's way, you know, it's it's more typically on these these places, you know, whatever. Um, and and I want to look at the same thing for like other generations because I don't know. I don't know the answer. I feel like the answer is yeah, but I don't know. Um, well, these dolphins me'd Yeah. Got some dolphins. Um. Uh. Well, this is kind of annoying cuz there's not really um Why am I getting flint? I don't even need it. Um, all right. I guess I'll just go straight down. Um, I'm gonna go over here because it looks fruitful. Cool. Uh, there's just no lava. Hey, did you turn off your dream data pack, buddy? No, I didn't. I actually turned it on. It's in the description. Okay. Uh, we're at Y level. We're at lava level. The odds of us finding lava here are really high cuz we are literally at at lava level in this cave. So, surely, yes. As expected. Oh, well, it's not what I meant to do, but it's all right. Um Carlos says, \"Here we go. Another midnight together.\" Yes, exactly. Um I mean, there's just not much of an entity spike at all. I don't think there's a close bastion. Nah, I mean this is this isn't a bastion, but I don't know if there is one. We can still head this way. [Music] Not bad luck. What's the fastest speed on time? Not dreams, but in general. Uh, it depends which what you're asking about because there's a lot of caveats for that. Like, do you mean on a set seed? Do you mean on a random seed? Do you mean this version? Do you mean any version? Do you mean the oldest? You know, 1.16 specifically or 1 point, you know, 8, whatever. There's like different there's tons of different caveats. But the answer is generally that it very much varies on 1.21 or 1.28 because 1.2 1.21 it's 13 minutes or something like that. And um 1.21.8 eight tech technically the highest submitted one is like 57 minutes or something like this spec this exact version um 1.16 it's like 6 minutes 7 minutes a different version again they already knew the seed or something do in 78 minutes. No, there's runs that people have done it on random seeds just in 7 to 8 minutes, but it's on a different version. Um and and and I guess the the real answer is just like you need really good luck to do that. You need to basically like spawn next to a lava pool um and like a either a you know shipwreck or like a buried treasure. Grab the iron instantly go to the Nether. Spawn in a bastion next to a fortress. Get the bastion. Literally like the fortress is one step away. Um and then the stronghold is not far or like exposed in the water so you can see it. Um etc. Like you just get really really good luck. You play in you play in a a lot of different you play a lot and then you're really good. That's the better you are, the better chance you have because when you get that luck, you'll take advantage of it. That's a terrible. And you can get really good seeds and then get bad luck on like blaze or bad luck on trades or bad luck on mob spawns or bad luck on the dragon or anything really. And then even if you get good luck on all that, you could just like screw up and die or screw up and do something. So you need to get like that many times. why like best runners play all the time, speedrun like thousands of times, you know, hundreds of times a day and then uh also practice and just get really good. Literally, what happened to this guy? Crab 605 speed run. Yeah, got bad luck. Unlucky with the enderman. He just happened to look at an end. Happened to me yesterday. Similar kind of similar to his. I mean, not not like his, but I was like killing a dragon. I just looked at an enderman and died. It's just bad luck. Um, map is too far. Um well Uh, okay. Well, I guess I can just go down. I'm kind of just assuming there's no lava pool here. So, I haven't seen one, but like I waste time being indecisive. I think I'm just going to run down this cave. There's not really a cave there. Um [Applause] I'll go down that cave that's right there. [Applause] [Applause] Um, well, Um, uh, Um, Surely. Really? [Music] Uh, I need gold. Um, okay. Uh, what am I looking for? Um, which bastion is this? Oh, I assume. Uh, okay. Well, I genuinely do not know where the best place to go is. I don't like this brute being here, though. Um, well, I kind of created my own problem for me here. Um, is there a way? Uh, really don't know my way around these bastions. Hey guys. Um, oh my god. All right, whatever. Um, [Music] let's see. [Music] [Music] [Music] Uh, there's like nobody here. Holy cow. It's like nobody. [Music] Uh Uh, Uh, um, What the muffin do I want? Um, if there's a fortress close, I could home portal. So, I just need a little bit more. [Music] Uh, let's make a bow. Let's also make a sword. Let's also make an axe. Um, and then why not renew our iron axe? I mean, pickaxe. I see more pearls. Come on. Give me more pearls. Why not? Okay. Can I get just like a little bit more pearls so I don't have only one extra? Okay. Well, we can go with that. And we can home portal. I'm assuming there'll be a fortress close, at least relatively. What are we in? We're in negative. Negative. All right. Let's head back to our portal. which I think was uh which way? Yeah, it was up here. Let's do that. That portals here. Um, what's a good way to check up here? Uh, what do we want to do here? So, luckily we can home portal, which is good. Uh, is there anything else I need to do? Guess I might as well just Okay, let's just be careful here. Um, I don't like that there's this here, but I can't really place more to fix it because Uh, so hopefully I don't need to place more to fix it. I don't think I do cuz the problem is if I start fixing it, I need to fix all of it. They're still spawning so I think that it's fine. I don't know. [Music] Okay, we can hopefully go with just this Where's my pearl? >> My portal. Here it is. Um, well, we have a mod to autocal, so we're actually going to need one more blaze probably, which is kind of annoying, admittedly, but uh, yeah, it's going to go straight in the wall. 58.7. So, we're going to lose both of these. 58.0203 22 24 2. We have to go one more blaze. I don't know if this is towards the blaze or away from it. I hope it's towards it. It's away from it. Do we just risk it and hope it's a two eye? It's not that unlikely. It's not that Okay, you know what? It's not that unlikely. We're just going to do it. We have to We have to. We have to. So, the odds of us completing this run, I think, are are not high, but they're also not low because one eye is the most likely. Two eye is slightly unlikely, but we have to if we want to get a like a PB, we have to risk it. Um, what I want to do could throw another pearl. Uh, let's just go over there. God, it's a long pearl. Perfect, though. Oh, well, that was 240. Um, we're really high. It's got to be lower. Which am I on in the chunks? We got to hope it's two eye. Be a two eye. Come on. Be a two eye. Pray for quick stronghold nav and two I otherwise Um, one eye. Okay. Hey, it was worth a try. Worth a try. It would have been good. It would have been 20. I don't know. I don't know what it would have been. If id remember we were in a cave, then uh it would have been fine. Like I I would have stayed for an extra blaze, but I forgot we were in a cave whenever we entered. had to go for it. Had to have been a new record. Yeah, probably. Almost definitely. Unless I died in the end, but I also had like gapples and armor. Like there was no way I died there. That would have been a new record if it was a two eye. I I don't know what the odds are of a two. It's pretty high though. That was a good seed. That was actually a good seed. We had a bastion close, a fortress close. Um the only thing that was bad about it was the enter time because we had to dig down and find lava or we had to run down the cave and find lava. Like it was not close. Dream, how do you warm up or prepare before recording a manhunt? I mean, you're kind of watching it. I like I practice the things I think I need practice. This is what I used to do. It was like literally it's been four years since the last manh hunt, but um I practice the things that uh I practice the things I think I need practice. I research into the strategies I want to try. I test the traps and tricks and stuff that I want to try, usually like with my brother or something. um just to see if they like work um and make sure like there's nothing like weird about them and that I try some different you know things offline. Um and then I uh yeah I re-record Oh well, I hit I hit the top part. Oops. This is not a good seat. Anyway, I just wanted to try it. No, it happened because I didn't jump. I meant to jump, but I slipped off the block before and then I hit the hit had to get a closer route. Hit the hit the top. Give me a good seed. Okay, this isn't I like the lava pool and the plains biome for food. We can get iron in that cave. It'd be pretty decent. Dream, why aren't you reading chat? What do you even mean? I've been reading chat the whole time. What are you even talking about? [Music] Oh. Um, hey friend. Um, that's kind of annoying. [Music] Um, so the only thought is I got a bucket now. So, let's just go to the Nether. See what it's like. I need water. I don't want to go down the mountain to get water. That would be annoying. Can there just be like water right here? I really have to go all the way down there to get water and then all the way back up. I guess I could have done it by now. Um, okay. Uh-huh. Um, Oh, well it lit. [Applause] [Music] [Applause] [Applause] Um, Crap. Well, not exactly what I intended to do. Oh crap. Um, I don't have much food. I don't have an iron pick. So, this is a little bit Unfortunate. I'm gonna get shot by the stupid uh uh archer guys. [Music] It's always chaos in this stupid bastion. It's even worse when I have no armor, though. Um Oh, I saw you. I just didn't know why you weren't coming to me. Okay. Hey, some better food. Even though we need the iron more importantly. Um, I think I just want to go down. Are you freaking [Music] Oh no, it was a bad gap, which means that the way I went was wrong was like bad. There's no gold blocks cuz the the cracked block in the wall. [Music] Maybe the other way was good though. I don't know. I didn't find out cuz I died. I should have ate my carrots. I should have eaten a little bit earlier. I think I think I had I think I could eat. I need pretty much I need to if I'm going to event I'm going to have to eventually eat anyway. So I think I should eat as early. I should eat as early as possible. That way I can surv I can tank more hits. James, do you know how to use chunk debug to find the fortress and stronghold? That's why it says no pie chart. Like that's the pie chart and that's not allowed. Brood can still two hit you. Oh, I didn't know that. Well, I probably did know that, but I didn't process that. Let me get some tree before it burns. Uh, okay. Um. Um. All right. Heck. Um, any water? I can grab it from that cave. [Music] Is this the cave? I don't remember. I think it is. Well, that was just like a waste of time. Uh, I don't want to go all the way back over there. Um, let's see. Okay. So, it's left here. [Applause] Might be best. God, I keep taking so much damage for no reason. Got to go around here. Actually, I don't know. I'm getting great spikes. Um, I think we got unlucky. I mean, southwest, but that would mean it's very far, which is probably the case. It's just I don't want it to be true, therefore it's not true. [Music] Okay, >> that opens up. Well, that was a crappy seed. There was nowhere. I could have gone to the right and place my boat, but I didn't want to. I didn't want to. I wonder if it would save me. I wonder if it would save me aura to just anytime I'm like unconfident in a run, I just quit instead of just like yolo running and crap cuz then I die and I look like a noob. Do you know the ocean ravine tech? It doesn't exist on this version. There's no ocean ravines on this version. Well, no flint for me. Um, Surely there's iron. Um, let's just go right here. Oh, well, where did the rest of my iron go? I do not know. I can grab these and be fine. Wait, no, I can't. I need this. I don't know the way out of here. I think I was like way up here. I drowned last time. Crap. Where do I go? Uh, I really do not know. Um, There any animals around here? Bad luck with the spawns. Well, I'm like traveling more than the food I'm getting. No animals. Well, that really sucks. Um, uh, But okay, that's that might not be enough. I know that there's more, but that will make me feel better. No food though, which is annoying. And we spawned in the crappiest biome that we can spawn in. So there's probably not a bastion anywhere. And there's just not. Unfortunate. Uh, this is kind of useless. There's no good houses. Yeah. Um, it's kind of an L, that. Yeah, there's a lava pool, but we could have gotten different stuff. And the subsidian could come in handy if we go through everything else, you know. That's good. But we need like a cave with iron. I guess I could kill animals. But see, there's just no cave here. There are animals though, which is good for if we can work out a cave. Um, I mean, this is just Minecraft's a game of no caves anymore. They got rid of them. They got rid of surface caves and replace them with underground caves, which I guess makes sense, you know. All this time we're running around that could be spent progressing. I mean, this is the best thing we have, I think. Um, we just got to hope for iron. It's still not going to be that quick, but it's not going to be bad. And I have four obsidian, which makes it more likely I'll be able to I don't have to home portal. So, I think this is it's good to attempt. [Music] Um, let's do that. [Music] No iron. That's the worst blacksmith ever. still a bad blacksmith. It does make us that if we kill the iron golem and he drops five, then we have enough for a bucket and a pick, so it's worth continuing. It's already been two minutes though, which is a lot more annoying. [Applause] He drops five. If we continue, if he drops anything less, we stop. He dropped five. [Applause] Maybe we can get a lava There's no hay bells. It's odd. This blacksmith was so I mean this village was so odd. Two blacksmiths, no hay bell. Iron golem drops five iron. Well, that's a ruined portal with lava. Maybe there's a flint and steel in it as well. He dropped five, not six, guys. I had one iron because I got one iron from the blacksmith, which was which was enough to have six. Sweet. That's actually really good. Um, for two fortresses, and there's a bastion. The question is, do I go to the fortress that's right here first? I do have food and armor. It's right here. The bastion's that way. I'm just going to go to it. The seed is such an odd seed. [Music] Need to stay and get one more. Crap. I fell off the edge. I got it anyway. It doesn't even matter. Okay. Um, well, I don't know what the train is like to the bastion or how close it is. It's a red biome though, which seems good. My helmet does have thorns, which is not good because if the piglins hit me, then they will get mad because it'll be like I hit them back. My FPS is lagging. Really don't know why. Um, let's just do that. Um, uh, okay. Guess that for food in case I need it. I don't know why I'm standing for so long. Uh, okay. Uh, hello friend. Um, I need to be weary. I really don't like these guys. Okay, they they ran. Okay. Oh god, let's calm down. I'm going to tower up here. I don't have many blocks. All right, I just need to get in there and start trading. I'm going to ignore the chest out here, even though I I can get obby. There's too many guys there. All right, let me just tower up here for a second. Why is he mad at me? Cuz I broke a chest. I want these carrots. All right. Um, what am I looking for? Uh, where the heck is the other chest? Is it over here? Yeah, it's over here. Okay. Um, let's see. I really need to get guys started in here. Only problem is I don't know where they are. Oh, this is so annoying. My inventory is so scuffed right now. Uh, okay. I need to put this here. Hey guys. Oh god. Oh, there's so many of them. No, I'm Oh my god. Oh my god. Oh my god. I threw. I threw so hard. That would have been perfect. I just threw so hard. There's nowhere to place my boat. Oh my god. And it's cuz I was using wood. The only reason that happened is cuz I was using wood and I just wasn't like I'm used to every time I've ever practiced that I'm I'm never using wood as my block. So I just I just was slow. God damn it. That would have been so good. That wasn't even a good seed. I mean like it was a good nether. It was a terrible overworld but I actually was it No, it was way actually good. It was a good overall world. Never mind. What the heck am I talking about? It was a good seed. That was a great seed. That was a great seed. Dropped the gold. Yeah, I know. But it doesn't matter because I would have picked it back up. I was dead. I was dead there. Like I was just dead. It was my fault because I got in the hole with the piglin, but I was just I was dead. Like I just needed to so annoying. I need to I I don't know. I honestly I don't even know really what I need to do there. I just needed to not do that, honestly. Like I just feel like I just needed to not do that. Don't do that. And it's good. Just need more practice. That's it. I would have been perfect if I had just not done that. Uh I don't like this because there's no there's no uh um there's no lava pool. Maybe not mine single block. Yeah, that's that's what that's what screwed it. Yeah, I shouldn't have mined that second gold block block. I thought I had a little more time. Honestly, that was just that's just inexperience. Like I don't have experience enough experience looting the um like running those routes. Um okay. Well, two obsidian. There's like a lava pool. I don't know if this is worth it, but I have a golden pick and there's a stone. Oh, there's a cave. All right. Yeah, that was just that was just a fumble, honestly. Unlucky. No, it wasn't that wasn't unlucky. Honestly, that's I think that's one of the first times where I can just be like that that just was 100% me. Like it's okay, but that was 100% me. I don't know what I need. I don't know what that says, but thank you for the dono. I appreciate it. Um, can we please get a chunk of iron right here? Oh, I will be so Wait, I have to go down, right? There's no Yeah, there's no way I can light that portal. And we don't have lava. I don't have food either. Um, so we're going to have to go down anyway. Do I have enough Do I have enough wood to just go down now? Think so. Okay, we'll just go down. Hopefully, we've run into iron and lava. We have a gold pick, so it makes it a little quicker. And it's unbreaking, too, so it'll That's unfortunate given we don't have healing. Uh, yeah. I don't know what we're going to do about healing. Um, let's think. We can grab water from over here. There's a mob spawner. Oh, that's annoying. It's not even a skeleton spawner. And yes, there's a skeleton. doesn't solve our food. It doesn't solve our food problem. And we don't we don't have an iron problem anymore, though. Um, okay. Um, let's uh I guess we just go grab this water and we can go down. We need lava and food. Lava solved. I guess foods have to be solved in the Nether. We get some fish maybe. H can't be asked. Okay, I have no food. Um, there's definitely a bastion that way. The only problem is um there's nothing I can go that way. So you probably have to go through the fortress anyway. Um so the question is uh I have no food. If I had food, then I I would be okay with this because I have no food. Uh, Bassalt Delta Fortress is really hard because there's a lot of mobs because there's there's no mobs. This mob cap's like higher because there's no mobs in the biome other than like magma cues basically. So then there's just mobs all over over it. There's weather skeleton, skeletons. Yeah. Um the heck is this spawn? I mean, there's just no way. Like, if I'm spawning with no no food, no armor in a a bassel delta, even if I live, the amount of time that it would take me um the amount of time that it would take me to to like survive, like the amount of extra time would just make it so slow. That's something else I want to pay attention to is the um like I can pause the game so I can like take advantage of that. I see other speedrun owners where they like like I see Cory Way do it a lot where he like pauses his game to think like if he gets like hit off or something he'll he'll pause and he'll like look around you know or something and then he'll decide what to do like look at his inventory look at his hot bar or whatever and like I can't do that in a mana hunt obviously but I can maybe do I can maybe like learn to do that here and I'll die less because I I'll have more time to like react you know pickle penguin I'm here welcome Welcome, Pickle Penguin. I'm so glad you're here. Welcome to the party. What kind of internet internet do you use? Uh, very fast internet. That is the kind of internet that I use. I don't really want to like advertise the internet company. It's just an internet company. I I got to see you during VidCon. Awesome. Meow. Meow. Um, okay. I don't know. I'm stmming. I'm stmming. This is what This is what happens when I don't take my normal pills. You know, I meow at Um, I taught like Milo Naomi, which are my roommates's cats, Sabouse's cats. Um, to meow back when you meow at them, cuz I would I would meow at them and they wouldn't meow back. But then every once in a while they would meow back and then I and then I would give them a treat. And then now if you meow at them, they meow back and they they do it over and over and over and over again. Um uh south There's a ruined portal over there. Uh, but the buried treasure is across the way here. How many cats do you have? I have one and Nick Sapnap has two. Um, so jeez. Uh, um, okay. Question is, do I go to the ruin portal or the shipwreck or both? And if I'm greedy, I'll go to both. I don't think the rune portal is that out of the way. Nah, it's it's out of the way. Actually, it's not that out of the way. I kind of need to go around this to go to the other thing. We'll stop at it. It's right here. If there's two obsidian, it's completable. Oh, we are so glad we went here. The question is, do we even want to go to the shipwreck now? Um, and I don't know what the answer is, honestly. I mean, the buried treasure. Um, I mean, it's right here. We need We need I guess we have 11 carats. I don't think we need to go. Uh, I don't think we need to go. I don't have lava, but um doesn't really matter. Um Okay. Okay. So, it's kind of the Bastion's kind of far this way, which is annoying cuz we don't really have a means to get there. Wait. Oh, that's Bassel Delta. I was like, wait, is there a Bastion behind the fortress? Um Um, all right. I don't have gold. Um, well, Um, it's a treasure, I think. Wait. Yeah. Okay. Um, and I'm not wearing gold. Um, so this is a lot harder. I don't have a lava bucket. Here's what we're going to do. We're going to go here. I'm going to grab this. Oh god. Oh my. Ah. Why should I have gotten gold? That's the question. Should I have gotten gold? I don't know. I just need to be more aware. Like I I just was Oh my god. Surely a piglin doesn't jump down, take fall damage, and ram us into the like off the cliff into the lava. Surely. Surely. Like I have leather pants. All I have is leather pants. I had gold at the ruin portal. Did I? You're kidding me. Oh, a block of gold. I didn't grab it. Oh my god. Yeah, that's my throw. Ah, that's so stupid. My god. Like, what? Why am I not like Oh my god. I think that that I kind of blame that on you guys. I'm not locked in. I'm reading chat. How do I How do I forget to grab the gold block from the rune portal? How do I forget that? How? It's all your fault. Why is it hot in my room? Why is this not updating? There we go. Where is now? Yeah, it's your fault. Take accountability. People are saying lava pool. I'm going to trust you guys. There's enough iron. Um if this is close. Yes, we need to grab it. But also, it's further from where we came from, I think, which means that further from the supposed lava pool. Yeah, I said supposed. These leather pants are just useless. Um, actually, it's closer, right? That's not where we spawned. We spawned over here. I mean, it's it's it's not close, but it's closer. Um, so we grab this and we go to the lava pool hopefully. Um, okay. Uh, let's go ahead and do this. Uh, okay. Okay. Uh, let's go ahead and do this. Um, I don't know why I made sure. Actually, I'll keep this TNT. Let's go back. Please tell me that there is a lava pool over here cuz that'd be pretty cool. We enter like four and a half, 5 minutes with a good with all the blocks we need. I'm like in a weird position in my chair. There we go. We need a flint. Oh, there's Lool. I don't know if this is what you guys saw, but seems like it. Um, okay. Uh, okay. That's what we'll do. Um, uh, we don't we still don't have a flint. Uh, Uh, okay. Do we have gravel around here? Surely gravel is faster than wood lighting. Unless there's just literally no gravel. Gravel's right here. I mean, okay. Still was like ridiculous, but it's okay. It's a little less ridiculous. All right, let's go ahead and take that. that. Um, no. Bastion's close. At least I think this is the Wait. Okay. Well, there is a wall. Um, I need to make I need a boat. Well, that's not what I meant to do. Jesus. I just waste all my food. Get gold armor. Yeah, I need one more gold, which I can hopefully get. Um, let's see. Uh, okay. Well, of course I don't like their change they made to the boats. Well, it's a treasure. Um, good enough. Yeah, I learned from my mistakes. There you go. But why is it so far across the lava? Like, what the muffin is this terrain? Um, I could have went across to the lava, but I actually think this is a quicker way. Well, we actually didn't get that much closer. Uh, this is annoying. I feel like it's just a reset, but um no, I don't want to play that seed. So, I tried to do something cool and it worked. Um, okay. There's a lava pool. Is there There's a village. He slammed the door in my face. >> Jesus. Everything's getting in my way. Oh my god. Stop. Um, maybe we have a blacksmith. What the heck is that guy doing? All right. Well, this village is so mid. We got food. We can kill the iron golem and get a bucket. We're not going to have an iron pick, but it's fine. All right. I don't like how there can be that like grindstoneone that means a blacksmith without there being a blacksmith. It's just kind of annoying. It's like such a tease. Um Jesus. Yes. What's happening? Why can't I hold it down? Okay. Um I don't know the best place here. Uh, I'll read the dono in a second when I'm going in the Nether portal. Thank you for the dono. Uh, took your advice. Feeling much better. Thank you, Sway, for the dono. Um, okay. Well, fortress. Okay. And there's a bastion this way, so could be good. Um, I think I want to go up here, actually. Uh, damn it. I do need gold. Jesus. [Music] I don't want to use more of my wood. I don't have much more. I didn't make a boat. I didn't grab a lava either. Why am I so scuffed? Why am I so bad? That is the question. Oh, I forgot I don't have. >> Oh my god. Hey guys. Okay, cool. Yes, that is epic. Um, I didn't I need to save this. if I want a boat. Um, but I guess I don't need a boat. Um, so I need to make a crafting bench. Um, I want to make booties. Let's check here again. I guess I could have just grabbed the leggings instead of making boots. All right. The problem is I want to go down here to this guy. I didn't want the lava to spread that far. Problem is, it probably did. I hate how slow it is. [Music] Uh it's annoying because uh I don't know exactly where to go on this bastion from the top when it's covered. I need to practice the buried bastions more cuz I just don't know where the heck is the rest of the bastion. Is it behind this or I thought it's always in front. Is it in front? I mean, this doesn't feel right. Uh I'm I'm like I'm stmming out again. I'm stingming out cuz my office is hot. Why is it hot? Somebody messed with the temperature again. Um all right. All right, I'm just going to go on the other side of this. I need to practice buried bastions cuz I don't know where the heck I'm meant to go. Okay. Hello, friends. Oh, well. Hey. Hey. I found my way in. Okay. Um, sweet. I know where the muffin I am. Uh, all right. Cool. Let's not do what we did before. Um, all right. Let's just put that there. [Music] Okay. Well, let me just see if I Uh, I just put gold right down there. And then I Where are all my friends? Hey guys, can you work your way up here? [Music] It's kind of annoying they didn't come. Where are you guys? Guys, where the heck are you going? Oh, it's cuz they're scared of the stupid guys. [Music] [Music] Um, okay. Feel like I didn't get all the gold. Where? Um, I guess nobody else was mad. It's just too slow. Oops. Oh my god. They're going to pick up the stupid gold block. [Music] Let me just make sure I got all these Yeah. Uh, why do I split Flip the pearls. I guys, my room is hot as hell. I'm going to go turn it down here. Okay. The AC might just be like broken. Like I have it set to 60 um 8 and it's 73. I'm going to send a text real quick. Where the heck is my phone? Leave my phone somewhere. Where? Oh, where my phone? Actually, I put my phone somewhere that I do not recall because I want to send a text to somebody to ask them to look into that. That way, fix if it is broken. I don't know where my phone is. Whatever. I'll deal with it later. I guess. One second. Oh, I don't know where my phone is, but I guess I will find it later because I don't see it in my room. I don't know where my phone is. Yeah, it's cooking in my room. It's annoying. Hot. I really like thinking where my phone could be. Where could it be? like stupid. I'm really distracted because I'm just thinking where my phone is. I lost it. Did you get an AC event fan? I should, but like it's really not this hot in my room. The AC is actually just like not working because it should be cooler, but it's not. I usually wear a blanket. Like right now it's so hot. I just can't wear a blanket. And now I'm just thinking like where is my phone? I mean, I could do a find phone speedrun, but the problem is that I already looked for it. I left my room to go look for it and I didn't find it. I'm going to look for my phone cuz I need to find it to text somebody to fix the damn AC. Give me a minute. Sorry, guys. First, I'm checking my room. Phone not look like it's on my floor. Is it on bed? Oh, it does not look like it's on It's blanket. No, it's not under the blanket. Okay. So, it's not in the room the office unless I'm being stupid, which I am known to be stupid sometimes. I do not know where it is. All right, I'll be right back. Found it. We found it. It was in the kitchen. Now I can text them and say, \"Hey, fix the AC.\" All right, let's see. House AC to working. All right, now we can get back to the speedruns. Jesus, it's hot in here. It's cooking. I grabbed a drink while I was out there. [Music] >> How long ago has your phone been in the kitchen, bro? I don't know. I guess since before I started streaming. Let's get a good seed. [Music] I hopped in and AI pop-up is telling me you lost your phone. I did and then I found it, but it was out in the kitchen cuz I guess I left it there cuz the AC isn't working and it's so hot in my room. It's so hot that I'm sweating and it's affecting my performance. The Dream changes MC settings. Depends what settings you mean. changed my controls, but that wasn't like right now. So, they've been the same for a couple like two months now or something or a month and a half. I am still learning them completely. First world problems true. All right, give us two. Oh, no. I guess three obsidian and a gold pick. No, one obsidian. Um, well, actually, I don't need this. Got one iron. So, if the iron golem drops five, then we're goated. Let's go by this. Let's just quickly kill the iron golem. And if the iron golem drops five, we continue. And if the iron golem does not drop five, we quit. Like that seems reasonable. Seems like a reasonable uh rule for this specific scenario. No. Should I just continue anyway? I don't know. I guess I can trade for the bucket. Actually, I don't even have a lava pool. We have to do the extra trades and find a lava pool. Nah. H. H. Um, How [Applause] [Applause] ow. H. Um. H. Ha. All right, we have everything we need. Oh, run portal over here. Uh oh god. Rune portal over here. We got food. Tell me there's lava at this ruin portal. I don't think so. Could be completable. Nope. But maybe. Okay. Yes. Sweet. Um, Um, I already got the chest. Uh, This could be good. Oh my god, I almost just killed myself. I I need to slow down. This could be good. There's a bastion this way. Fortress is right here. Only problem is I don't know how to nav the terrain to go this way. Maybe here. Okay. Uh, okay. Oh, no. What? It's a little to the left. There it is. It's not one of my favorite bastions, but that's all right. Um, okay. Well, not in a great spot, but we're in pretty early. Um, the annoying terrain. It did take us. >> Hey guys. Hey friends. Um, I want to loot this, but I don't want you to see me. Um, okay. That was good. Now the answer is this. need to be careful of brutes. Um It's actually pretty quick. Um, what I want to do is uh I don't have many blocks. Okay, I have this one. Hey guys, is there more of you out here? Um, okay. Uh see more pearls and a little bit more obby. Um, we got to just go. We didn't get everything. We can check these chests out here. Nope. Oh, it's a brute. That's not good. What? What hit me? Okay, let's eat the golden carrots instead of what we were eating before. Um, and the only problem is we still need one. We can we can home portal, but it's kind of annoying having to home portal when we're one obsidian away, but we can do it. That's what we'll do. Uh, which way was Oh, it was here. Um, okay. Thread the needle. It's fine. Surely that's a good pearl. Nope. I mean, not bad, but I know, guys. I could get I could get the other chests, but um crap. What am I doing? Ready to go up there. Perfect. All right. I could get one obsidian from these chests. [Music] Yes. Oh god, that's annoying. Oh god, you are such an idiot. I hate you so much. Oh, what? Oh, wait. I was low. Oh, I was low. I didn't know I was low. I couldn't see my health because of the wither effect. I thought I was still had like another hit. That's annoying. That would have been good. That was a good run. I didn't know I was gonna have a heart. That was a throw. And that's there's just so many wither skeletons. That's just crazy. I sold There was just like a hundred wither skeletons. What do I do in that situation? I'm trying to think. I mean, I should have ate and I would have lived. It would have been fine. But I'm trying to think like what do I do? I'm trying to nav the fortress and I have no armor and there's like a million wither skeletons. What do I do? Do I just try and go on top? No, cuz it was like enclosed. I couldn't have gone on top. I don't know. I I genuely don't actually don't know what I do in that situation. Any suggestions? That was a sub 20. Definitely wasn't a sub 20. Maybe I mean it could be sub20 if I um I'm doing uh like one cycle, you know, but I'm not. So therefore, it's not a sub 20. But it it could have been like a just above 20 probably. Yeah, I just made a mistake. What do I do? I if id there, I would have lived. But still, like if I got I got lucky with not getting hit one of those times as well. So that means that there was one time where I I probably just could have I probably should have I probably would have died either way, if that makes sense. Like I died because I didn't eat when I was on half hard. But in reality, I should have gotten one extra hit during the running through the fortress. Like I somehow got lucky and then with I ran right by the wither and he didn't hit me. which means I would have died anyway. So then my question becomes what do I do Maybe there's a lava pool. Doesn't seem like it. Why didn't you use the manhunt housing route? It's super easy. Literally just break the center chest and go to get go to the gold, get a ton of pegs, and doesn't have issues with brutes. I I mean, I pretty much did. Um but also it does have issues with brutes. 95% of the time there's a brute on top of that chest that I went to. There just happened to be no no like brute there. At least that's what I I think from my practice. But also like my problem wasn't the bastion. I literally the b I routed the bastion pretty uh fairly quickly. I could have routed it a little bit quicker doing what you're saying. Maybe like 20 seconds quicker or something, which is like good, but for me it's like I'm not I'm not trying to save 20 seconds here and there, you know, or 10 seconds here and there. It's like it's more about the the big time saves that would save a minute or a couple minutes. Yeah. No, the full iron one was a cell. That one was less of a cell. There was just like a million. Like literally, there was like a million weather skeletons. I think we ran by like 10 and we were only on the fortress for 5 seconds. And it was just unfortunate. I guess we were on that side of the fortress. What is this? What is this? Like actually what is this? I never seen this. Like a structure. It's a ruin. I don't understand. What the heck is that? Can I like break it? Thank you for the donation, Emma. What is this? I don't I really don't get it. It's an old civilization ruin. Oh, it's just like stupid. What is this block? Mud brick slab. I didn't even know that you could do that. archaeology. Oh, they like never did anything with archaeology, right? Like they added it and then like they didn't really do anything with it. Like you get the sniffer or whatever from it, but that's like pretty much it. Can someone explain why Dream is playing with mods enabled? It makes this run invalid if he gets a good one. Um, because I'm not submitting runs. Like, this is just for practice. I I'm not I'm not going for like a world record or anything. Like, if I was, obviously, I wouldn't wouldn't use mods or I guess maybe that's not obvious, but but that's it should be. Yo, what's good? What's up, Uppercut? But also I actually think it's good to practice. Let's say I wanted to submit runs. Like not I'm I'm not but I'm saying let's say somebody somebody wanted to submit runs. I actually think it's good to practice uh with optimal circumstances or like you know increased rates and you know whatever else uh because that you get you get like quicker practice and more consistent practice and then whenever and then you could you know whenever you do a real run you're less likely to like throw it you know like I think if I played this for you know a while practiced up whatever and then I decided to turn off everything that like it would obviously be a lot better I would do a lot I would perform a lot better because I have the experience with like what happens whenever I get good drops and what happens whenever I can find the fortress quickly and so on and so forth or find the bastion quickly etc etc actually that's not a mod I mean I am using a mod for it but yeah in in vanilla Minecraft you can use the entity counter But on this version, it's like the pearl rates are so Thank for the donuts. Well, actually, let me do this. Um, was there an iron golem in any of these? I don't think so. >> They're all empty. It's not in the Minecraft settings actually. It's just in the F3 menu. It's in the default F3 menu. It's just an entity count. But my mod just makes it that it's it's as if I had my FOV on 30. So I don't have to change my FOV down to check the entity count. Just makes it like it doesn't change anything except for it's more visually appealing for you guys. It's the exact same function, but visually for the viewer is better. Um, well, oh, this is just an ocean ruins. I thought it was like a ruin portal or something. I don't think I'm going to break this before I drown. This is useless anyway. I'm sweating. It's hot in my room. Um, I can't open the four though cuz then the stupid the cats will come in here. Yeah, that would fix my problem opening the door, but I cannot do that. Oh my god. I don't like how it does that. And when you like drag your mouse off after holding, if you're still holding when it reaches the border of the crafting table, then it like assumes you want to drop them and so it takes them out of the crafting grid. Like what? Why? It doesn't make any sense. Why would I want to drop them? I put them in the crafting bench. Are cats cats not allowed in the stream room? No, because Nick's cats piss everywhere whenever they're allowed in a room with a bed. So, I have to close my door 100% of the time, and I have to close my office door 100% of the time because they have beds. Um, Adrian, I spent half my summer evacuated due to wildfires. You really helped me through. Much love from Canada. Good luck with your stream. Thank you. Maybe train your cats. My cats doesn't piss. Oh, I missed. Hell, I jumped too early. I thought it was closer. I thought it'd be cool, you know, just to jump. It would have been a if it was closer because I would have I would have made it 100%. See, you have to realize you have to go for the aura moments. just have to cuz that's cuz the that doesn't decrease my aura really since it was at the beginning. But if I had if I No, that's not negative aura. Stop. Stop chat. That's not negative aura. If id made it, it's positive aura. But me missing it at the beginning when I have nothing, that's not negative aura. Like it doesn't matter. Who cares? It was a crappy seed anyway. Clip farming mindset. Exactly. You got to go for the clip farm. Um, What? What? I don't think I've ever seen that. Like actually ever. How rare is that? How rare is that? I spawn on spawn on top of the mansion. What? That's odd. I wonder I wonder how rare that is. It's a lush cave down there. So, I'm going to do this. A village and lava pool will get you a new PB. I believe it. I actually believe it. Reset. No, I'm going to play this. There's It's a lush cave, so we could go pretty quickly. We could get lucky and go pretty quickly. We'll see, though. I mean, there's iron right there. If it's not quick, then I'll reset. But like sometimes it's pretty quick. Um. Uh. [Applause] Um, all right. Let's go. We need to get this gravel real quick. Why does he need a lot of blocks? Because uh traveling in like the Nether and stuff and the overworld in the end, you need a lot of blocks like navigate quickly. Um, all right. Why can't I do the spam block thing? Oh my god. Finally. Like the slowest. I don't know why that was so like uh I thought it was a bastion. Um okay. Yeah, I think it's this way. But that's kind of unfortunate. All right. Can we boat clutch at all? Yes, we can. Um, okay. So it's further south. [Music] I want to go up to the top first here. Uh, did the brutes get back up? Uh, they might have. I think that they did. Okay. Um, I think that the brute is up. So, the question is, what's the best thing to do here? I think the best thing is just to book it, honestly. Okay. Um, let's make a diamond pick since we have the diamonds for it. I'm going to just [Music] Okay. Um, all right. Um, All right. Well, actually, is this a bastion that has uh No, it's not. Okay, cool. Um, [Music] this is cool. The problem is doing this quickly. Is there a brute here? There is a brute here. Let's actually let him out. Come here, sir. Cool. Come here. Keep following me. Keep following me. Hey, keep following me. That's why you can't do manhunt usually, but now I'm going to try it. So, the problem is they didn't follow me all the way in, which is annoying. Um, so I need to uh get them in, which is annoying cuz I think there's probably a brute out here. Yeah. And he can get me. Oh my god, this is so annoying. This is why brutes make it so freaking annoying. I'm sorry for cursing, guys. All right, I'm just doing this. Uh crap. Wait, let me do this and then let me do this. [Music] Oh, [Music] that's why you can't freaking do the same pathing. Ah, I hate brutes. I hate them so much. Like it was the only reason he was able to hit me is cuz the he's climbed up the lava and pu and the lava pushed him against the corner. Like the brute that that brute. Oh my god. They also just so you guys know they increased the reach of piglins in this version as well. Piglin brutes. So, not only are there piglin brutes, and there's not piglin brutes in the earlier versions, but they also uh increase the reach of the piglins for God knows why. I mean, no one knows why. God doesn't even know why. God is like, \"What the hell happened? It's a bad ship, of Of course, it's a bad ship. And there's not going to be another ship. [Music] have like a party over there. This is kind of cool. I kind of like this seed. The seed's kind of stupid, but I kind of like it. I like that tree over there. I like these ruins being above. That's all there was. Are you hearing me? Yes. Oops. It's not what I meant to drop. I don't know what I'm doing. I have a flint steel. I thought I had a wood light for some reason. Well, we have a bastion and a fortress decently close. I don't have food, though, so we need to get to the bastion really quickly. And it's not the best terrain, but I actually think it's not going to be that bad once we get over here, cuz the bastion's Um, or is that a fortress? No, surely not. Whatever. I hope not. Um, okay. Well, I don't think there was a bastion. Maybe I'm coping, but I'm pretty sure I'm pretty sure there's not there wasn't a bastion. There was fortresses on every side. Why is it so hot in my room? It's making me mold. I'm dripping in sweat. Like I almost do want to open my door. Oh my god. Let me see if I can open my door. hats are definitely going to come come in. But I cracked it. Our ancestors didn't have AC. Well, our ancestors didn't play Minecraft for 12 hours a day. Oh, that is the like worst luck ever. As I walk by it, it catches fire to the tree behind me and sets me on fire. It's a meme. Um, and this is kind of crappy seed. It's feeling a little bit better now that I cracked the door. But also, I wish I could open it all the way. It' probably feel so nice. It's the crappy chest. Yeah, give me some freaking carrots for my travels. Um Is your room humid? Yeah, it's Florida. It's so humid. Um, [Applause] Wait, wait, wait. Um, Uh, do I want any of this? No. I guess we just wait. I don't have any to collect blocks. Look like there's some stuff. There's a cave down here, which is good. I don't know if it's good, but don't have that much food either. So, um uh well um Well, thank you for the gifted. Uh, Damn it. Oh, I wish it was better nav. We don't have much food though. We need to get food in the bastion. [Applause] What's the best? I think actually just going up here. I don't have gold. Is there a fort? There's actually very likely to be a fortress uh that way because it's in a biome that the uh bastion can't spawn in. So, there's a 90% chance there's a fortress there. Like, that's the actual percentage, 90%. which would be good. So the question is, do we farm and go for a boat clutch? Nah. We've been messing too many up on the new way it works. But if I spam click, I think I get it. Fine. Um, okay. Okay. We got the sword, which is I mean uh gold, which is necessary. Okay. Um, what do we want to do? Uh, okay. Well, that's literally not anything that I meant to do. All right. Okay. Uh, screw it. Let's just go straight in here cuz there's a brute down there. Okay. That That's a bad gap. We'll get the chest anyway. Um, hey guys. Nope. It's another It's a bad gap as well. Double bad gap. And we got no triple. This is the worst Bastion luck. Like actually, that is the worst you can get. This is the worst bastion you can get, I think. Like out of all the bastions, cuz there's no there's no triple for me to get gold. So, I just literally have to yellow it down these and hope I get like really lucky as well. Um, what I can do is I can go down here. There's going to be some brutes, though. [Music] There's another brute there. [Music] Okay. Uh, well, I mean, it's just like, um, what do I what am I trying to do? I need to place more, I guess. There's no one here to get mad. Hey, sir, come here. Yeah, get over here. [Music] Um, yeah. I mean, it's there's no there's not even any point. I can go look at other chests while they continue trading. But maybe there's another gold block uh somewhere. [Music] >> I think there's side chests. Um, well, it's actually that's not that bad. Okay, that's actually that makes it doable if we got pearls. Surely we got pearls. [Music] Nope. >> Uh, I have more gold for you guys. The pick being so good means we don't we technically don't we can break some obby and have it still be good. Six pearls. It's just not enough. It's just not enough. Yeah. >> Uh, it's it's just not enough. There's another chest down here, I think. Uh, or I'm stupid. I don't know where it is. Oh, I already got it. It's in It's in the other one. Um, I don't know. Is there any more chests? >> I mean, it's just an L. Yeah, there's chest on the side here. Um, okay. Well, I mean, that could be. I should just reset, but [Music] [Music] We don't get any many arrows either, which makes it really hard. Nah, it's a reset. Huh? Oh crap. [Applause] Um, What's the play here? I think it's probably digging straight down. You miss someone who donated $200. No, I didn't. Unless my list is like bugged, but I'm sitting cross-legged right now. Cross-legged. You have to learn underwater portal. It's so easy. There's no underwater portals on this version. There's no magma ravines. Got 200 bucks from pickle again. Or was that earlier? It doesn't pop up in my thing. Well, I'm lucky not hitting a cave, but lava pops is good. Um Oh. All right. Well, that should be good enough. Um, okay. There's a fortress. Bastion is east. I think I will come back to the fortress. Just know it's by my portal, which is like 50/50. Okay. What is this? I don't have gold. It's fine as long as they don't have crossbows. Uh uh okay. I can do that later. All right. Uh, okay. Where are we going? That's a problem here. Um, only problem is where are we going? Okay, so this isn't that bastion. I really wish I knew the buried bastions more because I really do not know buried bastions. I mean, I might fall here. Pretty confident. Okay, cool. Okay. Um, what do we want to do here? I want to worried about this lava up here. Let's work this out here. Um uh let's see any guys in here. Okay, the lava is clearing up here. [Applause] Hey friends. Um, uh, I'm one lower than I usually am and so I'm worried I'm like missing gold. I don't think I am. I'm just making sure I'm not being stupid. Um, um, okay. Let's use this time to make our bow. Um, and make a new pickaxe. Make a new axe. Um, remember we can home portal. Okay, so unfortunately they did not give us that many pearls, but it's okay. Uh, okay. This was buried though, so I need to go up. Oh, but there's going to be a guy here. Oh, this is annoying. If this wasn't buried, this would be so much quicker. I don't know where I came down at. 13 ain't enough. 13 is good. 13 is not great cuz I I can't pearl. I can't use pearls to travel, but the fortress is right here. So, um, we just got to go to opposite way. Um, Uh, this is where having more pearls would be great cuz I'd be pearling right now. But we don't have more pearls. We also don't have that many. I think it's worth it to throw this pearl. Well, is it? Cuz we're going to need a we're going to need a path back anyway. Um, okay. Oh, this is annoying. Oh my god. Crap. We're on the bad side of the fortress. [Music] Um, I don't know the I need to learn the bed strat for this when it's open like not enclosed. [Music] Someone said looting sword. I did not get a looting sword. I wish I got a looting sword. Um, I already have three beds. What am I doing? I don't even need I don't even need all the beds. I'll grab this just in case I need it. But uh bad luck with spawns. If this was faster spawns, it would be good. You're in a cave. Make sure to get extra blazes. Okay, I will do that. But also, I don't have extra pearls. That's bad. We're going to rely on it to be lucky anyway. Unless we could get one extra pearl in the stronghold, though. It's like it's likely we would. So, we're we're still going to probably rely on a little bit of luck, though, since I'm in a cave. [Music] Jesus. Slow spawns and not that many. We still need two more blaze rods. Okay, we got everything we need. Uh, but if I throw a pearl here to get back, then I lose a uh we have to rely on even more luck. So, unfortunately, I just can't pearl. Yeah. The only issue is that to be fair, what we're about to do isn't really uh I guess I need all of them. Uh like this. This isn't really how it should work, but Oh, 19.0. So, I imagine I have to go a little bit this way. Uh, usually I'd have to go more cuz then also I can't see it. So, this is kind of like cheesed, but 18.7. Uh, we don't care. Okay, I'm going to need one eye 32. Um, oh god. Oh, is it this way? It's back towards the fortress. Just slightly lucky and unlucky. Well, it's lucky because we have this here. Actually, we'll go down here. Um. Uh. I passed it. Oh, wait. No, I didn't. I didn't. 1632. Only problem is that we're we this could have been so much faster if we had uh Okay. Well, there's only two ways we can go. This is good cuz it's down. Uh, bad luck. Oh my god. Hopefully there's one eye. Oh my god. That's scuffed. There's no chest. Uh I actually don't know where to look. Um I guess I have to go further. It just feels like I'm going far. Chests are they generate closer to the Well, that's unlucky. We got like a really big stronghold. I'm shocked. I feel like the chest should I'm missing a whole like way to go. Maybe I have to go back to the beginning cuz there's no chest this way. There's three chests. Yeah, I mean the run's scuffed, but still still we got so unlucky. Unless this isn't the starter staircase, which I I'm pretty sure it is. Yeah. Is there a secret room? Like these two shouldn't be. But what the heck? Did no second chest just generate or is like another direction this way? Where are the other chests? There's no other chests. Oh my god, it's so far. So many rooms away. Where's the other one? Way over here. Wow. Wow. That is so far. Oh, see if it has it. Yeah, I could have checked if it had a pearl. I don't care. Damn. It's more likely that it had one eye than not. I think it's what what is it 10? It's 90% it has one eye or something like that. Maybe it's less actually. That was a good run though. If we had extra pearls, I think that would have been a like I don't even know. That would have been really good. We definitely would have beaten our time because like if we had extra pearls, we would have we would have pearled to the fortress. We would have pearled from the fortress to the portal and then we would have had the pearls to enter instantly would have been like I don't know 85% that it has one eye. Damn, we hit the 15% chance. Unlucky. And then we hit the bad luck in the chest. It definitely would have been sub 25. Like it actually could have been sub 20 cuz I don't remember when we were heading to the fortress. It was already pretty like quick, right? like that feels like that could have been potentially. Um I don't think this is worth like pursuing. We've had some really good like really fast times today. Um yeah, we had a great Nether. That was a great Nether. Um if it was unburied as well, it would have been really quick. Like I I think we we're taking advantage more of those seeds. Like whenever we get really good seed or like you know, not really good seeds. I don't remember how we entered. Okay, we entered in a cave. It wasn't that good. We mined down. We mined down for like a couple minutes to find lava. So, the overworld was kind of meh. No way you got there at 20 minutes. Well, yeah, I got there 20 minutes, but I'm saying if I had pearls in the Nether. Like, I got there in 20 minutes because in the Nether I I couldn't pearl to the fortress. So, I had to speed bridge to the fortress and I couldn't pearl from the fortress back to the portal. Um, Yeah. Why do you play random seeds? Because it it's just the best way to play. That's Minecraft is random. This guy should start doing Minecraft full time. I'll I'll consider it. I'll consider it. Three obsidian. Give us three obsidian and a flint and steel. Four obsidian. A flint and steel. Four obsidian. Not a flight and steel, but we can make one. Um, let's do this. And we hope and pray we spawn in like a crimson forest or something. The only problem is we need we do need wood. Uh crap. That could have been a really quick enter. We do need wood cuz we need to craft. That's annoying. That would have been a really quick enter. We're still going to enter in though uh quickly, but we're not going to have everything we need. If I had wood, it would have been good. Or if that had a flint and steel would because I can craft one ingot. I can't I can't I can't light the portal, guys. How am I going to light the portal? If there was a flint and steel, then that would be good. But we can't light the portal. Yeah, we need a we need a flint and steel. We can get it with hopefully flint. There we go. Um I can get a little bit more wood and I can make a boat and stuff. Still a quick enter, but we have very little food and not iron, but now it's not as quick because we've had enters with three minutes or something with stuff. So now we're entering like 3 minutes with no stuff. We're entering at like 3:45 with no stuff or 3:30, I guess. I'm going to grab this flint. I'm going to go grab this pig, though. Eight pork chops is pretty good actually. Uh, okay. Well, I'm glad that we have wood. Um, okay. I think there is a bastion south. It's just far south. The question is what is the what is the play here? Um, I actually think the play is to go over there. Um, this is not a good have unless this this opens up. Of course it does. The problem is we don't know where a fortress is. We should try and look a little bit more. Like when we were by spawn, we should have like looked around some more, I guess, once we were like down. I don't I don't think I really looked behind. I think this is probably the way to go. That could have been bad. That happened as if our sprint ran out as we were like going over that gap or something. Uh, treasure. This is a treasure. Um, do I have a shovel? Okay. We don't have Oh, we do have gold. Sweet. Um, hello sir. I wanted to make sure you were not a brute. Um, we have healing. Uh, okay. Uh, there's another brute over here, which means there's probably another chest over here. >> Um, I guess I don't see it. I don't like that the other brute didn't come here. [Music] Um, let's see. [Music] I don't I don't have a lava bucket. These guys. Oh god. [Music] Um, it's kind of annoying. I was trying to knock him in the lava. Uh, hey guys. You're in the hole. [Music] Um, um, Wait, I should make a pack. Uh um we don't have I don't think we're going to get the things that we need exactly cuz we don't have I can go check the chest though. Um, uh, I want to check him on the way out. I just need to wait a little bit longer. Uh, it's kind of annoying. Obsidian. We need a lot We need a lot more obsidian. Um uh I'll go when we have one more cuz we can home portal and then I think we'll run back. Well, we can't home portal. Our portal is like so screwed. I guess we have a lot of pearls. You know what? We can take a bet on that. I bet that there's a fortress across that like lava lake. We can also we might get the obsidian. I mean, there's a chance. Uh, which way do I need to go up to? Up here. Uh, we also don't have that much food. Hey buddy, come here. Might fall off. Come here. I'm going to check these chests. Um, hey buddy, come here. Uh, Um, I don't care about any of that. This is slow. I don't have any arrows. I'm stupid. I guess I'm glad I got this chest. Um, >> uh, I don't think this is going to be that good. We didn't get obsidian from those chests. Um, yeah, no obsidian. Well, uh, we really are going to have to There's a fortress here. Okay. Well, we can't home portal. There's just no way. I guess we can try. What the heck is that pearl? So, so like so short. I don't know where that's going to land. In the lava below. I mean, like we're going to have to go all the way back. It's not a WC. We're going to have to go all the way back to the home portal that's like in the, you know, middle of nowhere. I hear a stupid wither skeleton. It's a normal skeleton. Oh, no. There's both. You guys fight. There you go. Huh. That was kind of clutch. like not from me, but just, you know, from the skeleton. I see both the blaze spawners. Um, let's go. Let's go to this one. No drop. At least we got one. We have to home portal. There's just no way. We have to go so far. I don't even know if I can get back up there. Remember where our portal was, guys? Guys, I have 10 obsidian yet, but I don't have I don't have 20 obsidian. And it takes so long to mine all of the obsidian. It's like 30 seconds per obsidian block or something with a diamond pick. I don't know. This spawn behind me. What is that? Is that a different blaze? I have 14. Yeah, but guys, no, I have 10. I have 14 crying obsidian. We need really good drops. We need one. We need to get it on the next spawn. Uh, are we in a cave? We're not in a cave. So, we can go at six. Hope and then hope we don't we don't have one break. We'll still be hoping, I guess, though. Come on. I guess I could go down to the other spawner. Oh, no. This one's I mined out already. [Music] Both dropped. One for one. Nope. Now I go to the other spawner though cuz all I need is one. Oh, there's wither skeletons. I forgot. Okay. Okay. Well, now we leave. Our portal was like50gative50 in the wall. [Music] Um, oh my god. I also don't have enough food to spam pearls, which is bad because we really need to spam pearls. I'm going the wrong way. Yeah, I mean this is just cooked. We have to go all the way back to the portal. I mean, this is cooked. The portal's so far and I don't have food to spam pearls. Um, I also don't even know what the best way to go is. Like, I think it's probably down and around. I hear cats like pushing in or something. My room. I mean, I can throw one more pearl maybe. Oh, well. Uh, I have my door cracked cuz my room is really hot. I hear the cats. Um, [Music] I actually need to not get hit because I need to steal the pearl. Um. Uh. Oh god. Yeah. I mean it's scuffed. I don't know where our portal exactly was. Um, where was our portal exactly? Across there. Oh, it's over there. All right, we're probably going to die, but maybe not. I don't have fire as well. I was going to die anyway. It didn't matter if I missed that pearl. I just There's no way I got up to the portal in time. So, why didn't Bro just remake the portal? Because you don't have 20. We need 20. Guys, listen. It didn't matter if I died there because if my pearl missed, we like the run was over anyway. So, either my pearl makes it and I live or my pearl doesn't. And I need the fire. I don't know how many fire res I had, but I need the fire res to Nether travel. Should have tried your luck with trades for more obvious since you have more gold. I could have, but it would have taken a while and I was going I'm going for like, you know, beating my time. With a non-efficiency pick, how long does it take to break a piece of obsidian with diamond? It's 10 seconds. 10 seconds. Maybe that would have been worth it. 2 minutes still. I could have done it with the blaze spawning. Go back to ruin portal. Were you saying like one of the previous seats had a ruin portal? Did I just like am I stupid? You can see which one. This one. Uh, we need Epic Tobias, thanks for Come on. Uh question is that shipwreck looks like it has Oh, this could have food. Oh, there is hay bells there. Also, I could take damage. I can make a hoe. I think it's worth it to I think we make the portal first and then grab that because uh there's pillagers all around it and I don't want the pillagers to stop me from making the portal if that makes sense. Um what I want to do is make a bucket. Um I can make shears. So, I don't need a shovel. Um, um, let's go ahead and do We need to be careful cuz there's not a lot of lava here. Um uh let's just Okay. Uh let's go ahead and Um, Damn it. I'm like off the edge of it and still Oh my god. Oh my god. I just did like so much of my health. Uh, I'm just going to eat this. Uh, okay. We don't have blocks. It's kind of annoying me. Jesus, I hate this. Uh, okay. I mean, we could go get the food, but I think I just want to enter. I mean the most entities are this way but like if there is one it's definitely far which actually is not good for us cuz we don't have food. I didn't grab my crafting bench. Mhm. Uh well, unlucky terrain. Why did you make sure if you dug dirt? Oh, I should have made I should have gotten leave. So, that was stupid. Yeah, I've done a couple things stupid this run. I'm just not like locked into it. I could have gotten dirt with the shovel. I'm just like wasting so much time that I don't have to getting blocks that I didn't have to get. But hey, it's okay. Let's make this. Surely we'll get uh Okay. Yeah, it's definitely a bastion this way, but it's far. Is that it? That's it. It's like 300 blocks away. Oh, that's so dumb. I've done that quite a few times recently where like I don't I I I think I'm making the jump easily, so I place a block that way I'm like higher and can do the next one quicker and then I just kill myself. Okay, so it's treasure. Like it's not worth the extra like 02 seconds I'd saved by placing that block to even risk it. It's just stupid. Um, okay. So, we're up here. This is good. There was one guy up here that I saw that I didn't like. Is he going to come kill me? How about I just kill this guy? Um, now I can mine this gold safely. I'll I'll I could trade up here, but the gold blocks are probably not enough. Um, but I can uh I really don't like you. Don't go in there with them, please. No. Or whatever. Uh with these chests up here. It might be enough doing this. There's like four of them in there or something, which is more than usual up here. So, in this version, the piglins don't uh uh All right, I want to grab this chest. Um, where are the chests? Where's the chest? being stupid. [Music] >> What? It's cuz I fell. I just like lost orientation of where I am. Okay. Hey, brute. Uh, this is annoying. Let me go over here. >> Hey, friends. Why is there a hole this side? So, there's two brutes in there, which means there's one brute down there. Um [Music] Oh, no. I placed it behind him. God damn it, I messed up. It's okay. It was kind of mid anyway. We had We had nothing at that point. was going to be a trash run. Come on, blacksmith. How long do you plan on streaming for? I'm not sure. Probably a couple more hours at least. I'd say probably like three more hours. Maybe be a shorter stream today. Probably. Maybe. Maybe. It's a Monday. So, as it gets like more like early later for people in like Asia and earlier and like school time for people in the US, the a lot of you guys will the views viewers will drop off. Why not run the village? Constructs are still good. It just takes too long and without a lava pool. It's like it just guarantees the enter is going to be like 7 to n minutes like maybe longer and like I can just find a seed where it's the enter is going to be like 5 6 minutes. Like with a like an enter I'm in a better position with a lava pool and no village. Like actually that's how dumb the lava pools are on this version cuz it's just so hard to find a lava pool. Like you won't find a surface one unless you see one off spawn like rarely. and I'll just waste my time like looking for one and then it just makes it worse. So, oh, there's a ocean here. Maybe there's a shipwreck. That would be good. Uh, and come back for This could be good. There's a ruined portal over there. Question is, is it worth it to grab? I don't know. Might be. It's not that far out of the way. Um, let's actually get a tree here. Actually, let's do this. Um pick bucket. Um shears. Um, [Applause] [Applause] um, There two iron two gold blocks at the top. Also could be completable. Nope. Um, what I'll do is I can just mine it here. I don't even need a door. What the heck? Um, Uh, let's just go here. Um, oh, I didn't mean to do that. We don't have any food. Okay, we spawn in a good bomb for food. Okay, Bastion's that way. Guys, come here. I need to get some food. Why are they running? Oh, there's a blue mushroom over here. Oh, it burned. Oh, nice. [Music] All right, that's good enough. Whatever. Actually, these guys are so low. Probably. All right, perfect. Now, let's get the muffin out of here. Which way was it? It was this way. Mhm. Uh, bad luck terrain. Yeah, bad luck terrain. It's all right, though. Oh my god. treasure. There's a skeleton here. Um, going to kill this guy. So, I want to go up. Do I want to just grab the chest? No, I want to just go get started on gold. [Music] Where's the other brute? Oh my god. All right. Well, my ear really itches. Okay. I itched my ear. uh to eat. Uh that guy's very annoyingly positioned. >> Um Get off the edge. Come on. Come on. Get off the edge. There you go. Um, okay. Well, I can start trading the gold now, basically. There's a brute over there. There's brutes everywhere. I think there's brutes on every single side because there's a chest on every side. Well, that's unfortunate. Uh, that's going to slow me down and also mean there's less piglin spawns. Um, what I can do is um, oh my god, there's no piglins over here. No, there's none. Ah, it's so unlucky. Hey, come here. Um, okay. I'll start you. I guess [Music] there's just nobody. No pigs. Anybody up here? Oh, you're here. [Music] You're over here. Um uh come here. Oh my god. Hey guys, you see this? [Music] I mean, there's just there's only three of them still. Uh, uh, just they're not going to follow me because this guy's here. Even if I find more over here. There's a brute It's still just like so slow. No, whatever. Army's going back. Oh crap. Go in the hole, buddy. [Music] [Music] [Music] Aw, it's annoying. We have like no obsidian. >> I didn't loot any of the chests up top, but we just have no time. It's already 15 minutes. Like, we got 10 minutes to do everything else. And they're slow cuz we don't have many of the pigs. [Music] I mean, the only chance this is a good run is if I take a bet right now and run to the chest and I loot the chest really quickly, which I don't know that I can I can do that. Um, I mean, I just have to otherwise it's just an L. Um, let's see. I mean, this is not what I think I should do, but I I feel like in order to be in effort of being quick, I'm just going to say yolo. I don't know where the heck the guys are, but that worked out. There's going to be two more in here. [Music] No obsidian and home portal. Um, problem is, do we see a fortress? I don't remember. Oh god. Got to head back to towards our portal though. Fortress there. It's just not fast enough. It's just not even close to fast enough. Mostly because we have to home portal to be fair. But I just missed I mean, I don't have any pearls as well. Yeah, I can blind. Oh, this is so annoying, though, cuz this is so slow. Cuz I missed This is my fault. I missed my pro. I'll play it out just in case. I could get really quick. I could get a lucky blind and really quick blaze rods and beat my time. I think it's very unlikely, but I think it's really unlikely, but Oops. Uh, where oh where blaze. Um, Well, first part didn't happen cuz we did not get lucky drops. Yeah, it's 20 minutes already. I got to reset. unfortunate. I delete the worlds after my stream. God, I wish I I wish it was like cool in my room. Then it would be so much easier if I wasn't sweating, you know? Go to the fortress first. That worked a couple times. I think if I spawn right by a fortress, I'll go to the fortress first. It does make it better cuz I know like exactly what I need. Like I can just wait at the bastion. But like it is worse is you have to I haven't beaten the game yet today, but only because I'm resetting. If we're not going to beat our PB, like we could have easen the game on that last run definitely and multiple runs today that we reset. Um, what? There's a ruined portal. [Music] [Applause] [Applause] Oops. My inventory is pretty unorganized. Okay, Bastion's northwest. Um, [Music] all right. Such an L spawn. Uh I don't know how it can be here. It's a best though. It must be really far. Uh blue biome. Um, it's probably just it's probably out of like we're probably just random crap now. I think we just need to get out of this. I don't even know what to do anymore. I don't know how to get there. Decent nether practice, I guess, but we probably got to just reset. Um. All right. Well, that's not what I meant to do. [Music] I don't even see it. I mean, it is here, but it's so far. God, I'm like dripping in sweat. Yeah, they changed how boat emojing works in the new versions. It is hard, but you can usually do it. And this village is really far, but there's a blacksmith, so I'll check it out. But like I might I might just end up resetting even though there's a village. W Oh, that's our I think that is actually like legitimately our first good blacksmith chest since we started streaming speedrunning. Like actually like I I think that's our first good one since we started streaming speedrunning. That's how crappy the blacksmith loot is. Um like we've had one other one that was like you could argue was decent and that's it. And it was like the blacksmith where we got all the we got full like full armor. Um, we don't need anything else other than gravel. So, we don't need to kill the iron golem. We need lava. There's a water bucket in here, too. Uh, do we just dig down? I say we just dig down. We have a diamond pick, so it'll make it quicker. Yeah. And that blacksmith, that full iron one was two blacksmiths and we only got full iron and that was like pretty much it. And we had to get a ruined portal to like actually do anything. It's really rare that water buckets are in that chest, I think. I don't know for sure. Well, it's it's still too no matter even if we end up getting lava, which I think it's not that unlikely, but um it's uh it's just slow. Like we literally dig down for 2 minutes. I mean it'll end up being a fast enter if we find lava quickly cuz we have diamond pick, but still it's like we take a minute away from our time if there's a surface lava pool. Who miss? Um, uh, we didn't get a flint. which was a bit of an oversight. Guess we can just wood light. Um, we need one more. Hey, we got an extra I need to grab the crafting bench. Actually, no, I don't. I can get wood here. We don't have a boat, though. Uh, east. There's a bastion, which is good. It's just it's not that close, but it's also not far. I need lava. I mean, gold still. I don't have a boat. It'll probably make this a little harder, but it's all right. Of course, it's like across a lava lake. Uh, is there some good nav? There's a fortress there. Uh, is there good nav? I don't think so. That that sideway over there. Wish I had a boat. Um, okay. Well, just tank some damage. You can't make a boat with netherwood. Actually, I need more blocks. Um, I think that the chests are one layer higher than this, but so are the brutes. We don't have a boat, which again makes this a little bit. I think there's a brute here. Oh god. All right, calm down. You can't get over here. Come on, brute. See me. Get over here. You as well. Um, all right. Come on. Die. All right. Perfect. Um, all right. Well, oops, that burnt in the lava. Uh, I don't have many blocks. [Music] Uh, I want to do is this. >> Hey guys, get over here. [Music] Okay, I think I have a good enough amount. Obviously, make it quicker, which I'll try and do, but for now Check this side. >> There's a couple guys. Um, um, let me [Music] Get in the hole, idiot. Okay. [Music] Um, can we home portal or should we wait is the question. I'll wait while I get at least my inventory sorted. Um, I can check the chests as well. They still have a good amount of gold left though. Oops. I didn't mean to throw that out. 15. Okay, they're out. 16. Surely there's four obsidian in one of the chests. Crap. Um, okay. Uh, Oh, why are you Oh, I have no gold. Uh crap. That's not what I meant to do. Walk off the edge. I hate these guys so much. Uh All right. Crap. Okay, there's wither bunch of wither skeletons, but there's a blaze spawner that way. Cool. That actually worked out. [Music] We got really good drops. What are you doing? [Music] What? I have fire charge. Oh my god, I forgot I wood lit. Okay, we're in a cave. That's unlucky, but it's okay. Uh, okay. 47 2004. Negative 720 or 7. Yeah. 1504. 154. Negative 720. Might be too far. Um, This is good. It's down. Okay, we're getting far. You could go back there, but um Oh. [Music] [Music] Jesus. You cannot tell. I practiced offline to refine my end where I have to kill it with arrows. [Music] [Music] [Music] Well, it's dead if it perches. [Music] Oh, what? Oh no, I placed crying obsidian. Oh my god, I'm so stupid. Crying obsidian traps it there. That's actually good to know for like manhunt. I didn't know that. I because I didn't even go I wasn't even like high. I was I was low. Maybe it's low enough to where it thinks it's the ground. [Music] GG. [Music] Cool. 2320. Hey, our our end game was a lot quicker. And now I know as well not to do crying obsidian. We would have probably shaved off 10 seconds, 15 maybe maybe 20. There might have been 23. GG's. That was pretty good. What was slow there? I think the Bastion was a little I was a little slow. I don't remember how we entered. I think we we d we had to dig down for a minute or two, right? Didn't we? Thank you, cowboy. That's good though. We keep going down. We keep moving it down and down and down and down. That was like almost three minutes lower than our previous 23 minutes. That was good. Let's do it again. Right here. Another blacksmith right here. Back to back. You ready for this? We got a good blacksmith. See, all it takes is us getting like good stuff. Like we got good stuff that time. We had a a you know the Nether. Wait, wait, wait, wait. We bridged to the bastion. We sped bridge across a huge lava lake to the bastion. That was great. Of course, it's a crappy blacksmith. I think we can do I think we can get a sub 20. I think with a good seed, we can get a sub 20 with no uh what's it called? Um, what was I going to say? No one cycle. Like obviously we have no one cycle. I think we could even get a sub 20. I think it's possible. It's very doable. It just takes us getting quicker. And also uh Oh, that was stupid. I should have gotten this, I guess. Um, okay. Well, you're back one second, guys. It's closing my door. You dug all the way to negative 55 last round. Yeah, I know. I did dig to 55. That's crazy. We still had a PB. Um, okay. We need to kill the iron golem. [Applause] Wait, that's the same blacksmith, right? Surely. Yeah. >> Yeah. Right. Yeah. Um, where's the wrong You're right. I didn't grab my crafting bench. Um, we don't have a lava pool, which kind of makes this mid. Um, well, the only thing we can really do is dig down again. We do need to grab a flint before we do that. We also don't have an iron pick, which makes digging down way more annoying. So, I kind of want to go in a a water ravine or something. There is one over there. Is there an underwater cave? hit it. Stop. All right, we don't have to dig that far probably. Now, cuz we have a stone picks, it does make this more grueling, but because we got all the way down through the water, that was quicker for sure. What are these goofy ass starts? It's this version, man. This version has goofy starts. Like actually, there's no magmaine, so you can't go in the ocean. There's lava. I'm worried about falling into it. And you have to go super far down to find lava. Oh. Okay. Well, this isn't even like in a cave. Uh, this is slow, but hey, we got in the last seat as well pretty late. We had a lot more stuff, which probably makes this one dead. um I mean [Music] it's probably bad we don't have an iron pick or anything and we're also whatever but I think if we can get to the bastion. You guys know, can you guys like figure out my splits from the last run and tell me? And by that I mean like when did I get to the bastion? When did I leave the bastion? When did I get to the fortress? When did I leave the fortress? Um there's a fortress there. Uh there's a blaze spawner right there. We can just go do this real quick cuz the bastion looked like it was further. [Music] Um, [Music] We don't have iron either. Oh god. [Music] [Music] Heat. [Music] Heat. Heat. Heat. [Music] Um okay. Well, I don't know where the best place to go is. Hopefully, it's just there's open terrain through here. There's not. Crap. It's going to be like in the wall. Uh, I'll just get in the bastion. It's bridge. Uh, okay. How do I What do I do here? Um, I don't have an iron pick, so I do need to loot. Is this a triple? I think it is. Um, okay. What I need to do is make this. Um, okay, guys. I'm just going to kill you cuz I don't need you. Oh my god, you shot me through the fire. Really? Um, okay. That's good. Problem is, no, I don't think there's a triple, which I think means we're boned. We don't have enough for iron. Um, unless I'm just wrong. I really hope I am. Actually, I think I am. Yes, please have iron. Okay. Um, please have iron. Yes. Oh god. I don't know. Are you hurt? Um, Uh um okay. Uh I we can home portal, but we're not going to be at our best time if we home portal. But to be honest, if we get 10, maybe we maybe we do just uh I guess we need fire res still. And we need more arrows still preferably. We need a fire res. Give us one or two fire reses and we'll go. Uh, I mean we have we're almost enough. We can blind. We just blind. Oh god. Oh, and maybe they trade for enough while we do this. Uh, okay. God, did it break? No, it didn't. I have enough. I don't even need to worry about it. Um, negative 160 01568. Uh, we're pretty far. I mean, we can go to it, but it's gonna it would take a bit. I can spam pearls, I guess. 1,500 1566. Uh, It's this way. Um, I'll reset in a minute, but guys, it might be a water a water stronghold. We can still get a good time. Like, we're not going to beat our personal best, but we could still get a good time. And I I don't I don't feel like resetting when we're going to get like potentially we could get like a sub 20 sub. We can still beat our previous uh personal best. Yeah. Um, okay. So, it's not exposed. I guess the odds of being exposed are pretty rare. Uh, and we could still get another. And again, remember our original goal, guys. Our original goal was to be able to try and consistently beat it in 30ish minutes, you know. And like if we're getting like if we're getting getting there like that's that's really good, you know. Uh I just want another shot at practice with the dragon as well. There's no way I'm below it. It's just lower, man. I'm one block. Okay, here we go. Yeah, it's just so low. See how low strongholds are now? Okay, well, there's two secret rooms, so Um, I don't know. I think we're too far. Well, there's nothing there. Um. Oh, what the muffin. Oh, library. It is the way I went. Damn it. Um, hello. No, it's going to be here. That's too far. [Music] Let's go. [Music] [Music] Um, so high. Oh, it does it to any blocks. Okay, it does it to any blocks. I didn't I was not I was not aware of that. Like I was killing it before it perched earlier. Um or does it just not destroy these blocks? Um, that's rather annoying. Or at least I did that now and not in uh a good like a a run that was going to beat my PB. That would have annoyed me. [Music] Let's just get rid of these. Or is it because they're it's black stone and it doesn't destroy black stone? No, it destroys black stone. It just messes with it being like that. Um, so we get the pillars down like that and then we go down. Seems like the best strategy. [Music] Come over here. Come over here, dragon. No, I did what I wanted. I learned that the dragon tries to turn to where the player is, so we can use that to our advantage. Um, if we if like the dragon's in a bad spot and you want it to move its head. I should have done it earlier though cuz it turned its head but it was right after it was the dragon was it was already um too late like the dragon was going to fly off. Oh, it's over. Another sub 30. [Music] [Applause] and it was also back to back. I should tower up with like soul sand or something that I can break with a shovel. get the pillars and then shovel down. Um, that would be ideal probably, but then I can't shoot the dragon over and over again. If I'm going to shoot the dragon over and over again, I guess that the the thing is I can I can maybe explode the crystals at better timings like to do even more damage to it potentially. So, I I I break the two in the cages, tower up instantly, and then just like wait until the dragons buy a buy a crystal and break it then. like I strategically break them instead of breaking them like right away. I don't know. Leaves and shears that could work, but I need iron for that and shears, which I don't guarantee that I have everyone. Soul sand I can just get from the uh you know piglin trades Um, Uh-huh. I guess uh maybe there's one more iron piece around here. Yes, it's all we really needed. We're going to have no food or anything, but like we can just yolo it and see cuz there's a bastion really close. We can get food from it. We can also get these mushrooms maybe, but like [Applause] [Applause] Um, Um crap, we're so close. Uh what is the Um, now my play is I'm going to go for that magma cube. I'm going to land on his head. No, it didn't work. No. All right, I'm going to sink in the lava and place a door. No, I can't sink fast enough. It's such a bad spawn. What the heck? I feel like there's like an identical spawn basically. I mean, like it's snowy, but like it feels like we just like progress to the seasons. Who said lava is rare? Lava is reasonably rare on this version. Like a surface lava pool, it's pretty rare. Under lava, water, underground lava is not rare, but it's at white. It's at like level 54. So, it's so deep. Like 54 for lava is ridiculous. There's a beach. We'll take a peek just in case and then we'll drop down this cave. It's also good. But I like I like I think that one thing is exploring this uh is good. Like exploring seas that have a massive cave right next to them because I feel like lava is likely and even if there's no lava you can get down quickly. Um so you can even without anything you can smelt iron really quickly. Um, and with stuff you can, um, there's a shipwreck. You can go even quicker. It's like right here. Oh, no. That was like the worst possible shipwreck chest. Um, but it's west and south. So, we got to go way over there if we want the shipwreck. So, um, I guess we could play that instead of playing the cave. I feel like that's probably smart. So, we'll have everything we need. We can just check it out. There might be a lava pool over there. We might see a lava pool on this map, which I think is a good play. The seed is mid, but we can see I think that the shipwreck is right over here around this corner. I mean, not the shipwreck. There is a shipwreck. But the um bur treasure still more south. It's like in this little crevice. Maybe we have a surface lava pool. Pretty please. Minecraft gods, give us a surface lava pool over there. I can smell it. Um, so perfect. There's a lava pool just right here. Too perfect. [Music] >> Um, should I just reset? Yeah, I was reset. Jesus, I'm dripping in sweat. Like, actually, I'm actually dripping in sweat. Sorry, I was just texting about the AC. I know the AC is broken or something. Jesus. Someone said, \"Do you regret revealing your race?\" But like they meant face. And I just was just started laughing like thinking about the the implications if they meant race like as if like I don't know. Do you regret revealing your race? I'm like yes actually I do regret revealing my race because I wish that I was black. I wish that I was Asian. I regret revealing my race. As soon as I revealed that I was white, everyone hated me. was just a black sheep and a gray sheep. I thought it was like obsidian. Why is Dr. Someone said Dr. Jon is mad? Why is Dr. Jon mad? You regret revealing your face though. I don't regret I don't regret revealing my face. I regret some things but not revealing my face. I think it doesn't. He keeps getting trapped. He's live right now or you mean like recently is actually Wait, I feel like it's starting to feel better in my office a little bit. Maybe it's like actually kicking in or something. Mr. Feast update. I have a video almost done. Maybe I could finish that today. I could end stream and then edit it probably. Guys, I do so much. I've worked so much this last like 10 days. I'm streaming. I've streamed like 60 hours this week or something. And then I also have been doing other stuff still. Like I'm still working. Like I'm not It's not like I just do this and then I leave and I'm like, \"Oh, that's it. Let's call it a day. Like I have other stuff. I record, I edit, I Yeah, I could go edit it or go finish editing it. Where's the chest? It's like here or something. I don't know where the chest is. What are you prepping for? I'm prepping for like intense manhunts. So, six hunters and then other ch other manhunt challenges that I want to make more intense. Like as example, the speedrunner swap we just did. Like I want to do that again but with like more hunters. I want to do it with more people. Do you want an editor? $2 per video. That's a steal. $2 per video. That's awesome. It's a bad chip. Can't tell if that's a ruined portal or a squid. I think it's a ruin portal. H. That's a ruin portal as well. could be completable. That would be nice. Well, that's kind of crappy. Um, all right. Well, we have four, which unfortunately means we don't have enough for an iron pick. Surely there's a surface lava pool. We're going to go right by it. Sure. We're going to go right by Where is the shipwreck? I mean this ruined bur treasure. I should just use my door. Um, might just be a reset, but we'll see. We actually we didn't get just many much stuff. Uh, let's make a this I hate Um, uh, I don't think that this is Uh [Music] hey. [Music] Um, it's pretty bad. Anyway, we weren't we weren't near trading. It was 10 minutes. Wasn't bad, but it wasn't good. [Music] Let's get another good seed. Let me do something real quick. Uh [Music] Uh, okay. Uh so quiet. Yeah, I'm being quiet. Actually, let me turn this on. We'll try this one because there's a big cave. I mean, it probably won't have food, but Um, all right. Uh, well, it's annoying that there's not Okay, there's more iron right there. Perfect. Um, what do I want to do? I want to go get this gravel. [Applause] Glow squid there. Glow squid there to say hello. Um, all right. Uh, Well, it doesn't seem that this is that good. I don't have food, so I don't want to take damage. I really don't need more diamonds, but Surely there's a lava pool over here. Oh god, what happened? I placed on the wrong block. Um, I don't have food. [Music] I'm not wearing gold. Um, well, it's close. Actually, we get there before I run out of sprint, then good. We can continue. Um, oh my god. [Music] Um, there it is. Oh my god, I almost just fell. >> Really? There's I have enough things coming after me. Skeleton, you don't need to come after me, too. Um, okay. We got that. Uh, I don't know where exactly we go from here. Um, no, no, no, no. Soul sand. We had like no blocks left. We were so lucky there. Okay. Um, which way is the way that we need to go? It's over there. Okay. I'll grab this chest now. Um, sweet. Looting three. All right, let's go. Go, go, go, go. Because this is good. Hopefully there's food in chest. Otherwise, we're probably cooked. Yes, at least enough to heal. That's really good as well. Um, only problem is there could be brutes in here. There's not. But the thing is, I didn't get any guys in here. The thing is, I think we go out of here because there's the brutes in here always. We can just take this gold and go out in the middle or something. I don't know. Is nine even enough. I think we got unlucky with the amount. I don't know. Or we just didn't get any out here. Um, let's just block that off. And then I'm curious, are there a bunch of piglins around here? Um, this is kind of scuffed. I don't have many blocks either. Uh [Music] That way. [Music] Um, I don't have food. If there's upper chests, I can maybe loot them on the way out. I just get one more pill pearl trade. Okay, I can loot them on the way out. I'll try that, I think. Um, do I need anything else? I got two two fire res. All right, I I'll try I'll try on the I'll try and loot the chest. H, but it's it's like we're engulfed. We're engulfed. I need food. Maybe I can get hoglins. Uh, is this this is the way? Crap. Crap. I actually didn't get many blocks. Um, hello sir. I need to go up against this and then all the way up. Oh, wait. Oh, there's going to be brutes here. Guys, get down. Oh my god, I fell down. I did not mean to do that. No, no, no. Crap. Okay. Oh my god. Oh my god. That was like the chest of the my lifetime. Um, okay. We need to go. I need blocks. Uh, I have no idea where we need to go. Uh, I don't know. I don't know. What is the closest? Um, I want to see what's up here. Oh, you're annoying. Okay, there's clear routing. I want to enter the positive Z quadrant. Can we see? [Music] Oh no, there's nothing. Oh, there's nothing. No, there's another bastion. Oh god. Have to go like the opposite direction. Damn it. I shouldn't ever blind throw pearls when I'm in the lava. It's just too risky. There was no fortress, so I'm not That wasn't going to be a PB, but it could have been because we had the looting sword if I just pearled around. Yeah, we need to I need to not ever throw a blind pearl. I just I just did it cuz I knew it's going to take like 15 seconds to swim up out of the lava and I didn't I didn't want to. So, I was just I just was being risky to go quick. I had a feeling that would happen. It was a WC. That was an L seed. What do you mean it was a W seed? That was W play by me. That was an L seed. What the muffin's wrong with you? I I did everything. There was no lava pool. I spawned next to a cave. I got wood. I got all the stuff. I entered with like no food. I nether nether navd. I naive the bastion with no food and did it all. It was an L seed and there's no fortress. It was an L seed and it was a W play. The only thing dubby about that seed was the looting three. The fact that we had that that if we had just played that out, it would have been sub 30 100%. So that makes me like way more confident that we're like approaching that that milestone of mine. Like I think There's two iron golems here and some hay. Yeah, I mean there's definitely a worse seed. It's not that it wasn't a terrible seed, but it was it wasn't a good seed. This was not a good seed. We had no shipwreck. We had no village. We had no lava pool. Um we had uh no food, I think. Unless I'm just Am I misremembering something? I might be misremembering. Might have had some stuff. Um, well, how annoying. H. [Applause] Help. [Applause] [Music] H. Ha. Um could go down. Um, Can we get lava right now or a big cave? Um, I don't think it's that close, but [Applause] Oh god, another one. [Music] Uh, we don't have gold, but It's a bridge. What? [Music] Um, hey What? Mhm. [Music] [Music] [Music] [Music] Get me. Um. [Music] [Music] Uh, huh? Uh uh it's kind of an L chest. Yes. [Music] Uh, it's a single. Well, we unlucky chest. Grab those gold blocks, though. fail. Uh two more down. Oh, they're done trading. Um, I think there's one more chest. I don't remember. Um, where was where is this chest exactly? Crap. No. Well, I could blind. Oh, wait. There's a ruined portal over here. [Music] You can't mine obby with iron. You can mine it, but it won't it won't give you one. Okay. Well, now we just need the fortress. Maybe we luck into finding one. I don't have much fire res. Um Crap. And this biome there's a 90% chance of a fortress. I have more gold. I can make golden carrots. Um Only problem is this thing is really annoying to navigate. [Music] Uh oh. Well, this is very bad nav. um fortress. Oh, what the heck? What the heck? The pig's after me. Oh no, it just looked like it was. [Music] This is an unfortunate spawner. Wonder if there is another spawner close. Maybe I just jenned in here. I don't have any food. I should have gotten food. Uh, I think it's best I leave this spawner. Um, I think that's probably a dead end. Oh god. No, Blaze spawned at the horrible time and also the worst position it possibly could have like the furthest back and but hey, wasn't going to beat our PB anyway. was pretty well played by me I think or generally fortress was far didn't have much food. I want to get one more good I want to get one more good run for ending. I think I'm going to have to PV, but I want one more good finish. Let's get this tree and crest crest. Ascend to this hill. We need more wood. There's a village. Actually, I hope I can kill him with this before it breaks. H. Huh? Huh? Um, okay. Do I go down? Do I hope for the lava pool? Um, come on. to a cave. Uh well, Be quiet after you either win or lose. Watch army of lost one win. Thank you. I don't know what that is. Thank you for the donut. Yeah, I'm quiet. I'm just chilling though. I'm assuming a lot of you guys are probably doing something else, you know, keeping me on in the background. It's okay. I don't got to be the star of the show. You'll be fully locked in when I'm on a good run. When was the 23 minute when? Uh, a couple hours ago, I think. Like two hours ago, maybe. Two, three hours ago. I don't know. couple hours ago. I'm dripping in sweats just cuz the AC is just not working. Um, flush cave mine shaft. This is just an interesting start. This is really interesting. So, I kind of want to try this. Don't you guys agree that this is interesting? There's some logs right here. We're in a mine shaft. We spawn in a cave. It's a lush cave, so we can get some food. It's interesting. It's intriguing. Um, now we definitely have some iron in here. I did kind of want to explore the mine shaft, but also I don't care that much about it. Damn it. How' I fall down? Um, I remember seeing enough iron. Can't remember if where I saw it. Probably this. Yeah. All right. Well, we have enough now. What the heck? I hit by a fire bow from a skeleton. Really? Um, okay. Sweet. This is where we'll make our base camp. Um, all right. I need enough for a bucket. Guess I could get some blocks. I don't really care about this food cuz it's it's just so bad. It might as well be nothing. But that's not true. It is something. Something is always better than nothing. Well, almost always. Oops. Not meant to do. Question is, do we go deeper down there or do we go deeper down here? And I think the answer is clear. My problem is there's already lava pops behind me. Wish there was way I could like glitch myself and see. I think when I do the boat thing might not that way. I don't know if this is valid. I think this is valid. Okay. Well, nope. That doesn't work. that way. I feel like that's valid. God damn it. Um, I think it's northwest. That sucks because this is the uh Well, this terrible spawn. It's weird. I have like specific sides that I'm facing that make it that I can speed bridge like really easily on and then other sides that I can't. I don't know why that is. I think it's just maybe the speed you go or something. I don't know. I know I keep saying it, but god I am like sweating bullets. Ow! [Music] We do another stream before my surgery. Yeah, definitely. Surgery is in like over a week. It's like a week actually. My surgery's in a week. I think it's Monday or Tuesday next week. It's Tuesday. I think it's Tuesday next week. There's a rune portal in the ocean, but I don't care. That's so You said it was today. No, I didn't. I never said that. Might have misunderstood something I said. I don't drink coffee, Angel. I do drink energy drinks, but usually not that often. I've been having more recently though during these streams. I just I've had like I today I had one like energy drink. I've never had more than one in a day. All right, shipwreck. So, there's 40 seconds to get to it, which it's not ideal, but it's a W shipwreck chest. Um, all right. All right. Well, uh All right. Do we just go straight down? I think we do. Uh, let's get a flint. Now, let's go down here. All right, we already got down decently far, so it's going to take us probably I don't know. 30 seconds to get to lava level. Probably a minute actually. parallel. I don't have that much food. fortress. Another fortress, which is not good. That means the bastion's probably really far, but we can Oh, well, don't own me. We can go to the fortress. Um, this could be a this could have been a bastion and that would have been epic. Like how generation works. This could have been a bastion. I would add to fortune next to each other, but we don't. I don't have that much food. Um, [Music] I want the blaze to come over here. All right. There's some guys down there mad at me. [Music] All [Music] right. reload. a bad luck. [Music] Great. Huh? What? What? [Music] I think I want to do is just go further. out of this quadrant this way because we already saw the fortress the opposite direction and a bassalt delta. Um um so that is what we shall do. Uh well, if there is one, it's far. Oh, I can't make it there. unlucky. There is a fortress way over here. Oh, I don't for a bastion. There's a bastion over there. Um, now it's kind of slow, especially because it's even further. This is so so far. Man, there might have been one closer to our home portal, but Jesus, I don't have any blocks. [Applause] It's a bridge, which is good, but it doesn't matter because I mean, we're not going to get 20. We have to be in 10 minutes go from here. Go from not even starting trades to being in the stronghold. I mean, sorry, not to being in the stronghold to being the game. I mean, if we get like really lucky and I'm really fast. [Music] [Music] [Music] Uh, well, I don't actually know how to get there. Oh, well. [Music] It's annoying that there's a hog there. Okay. Jesus Christ. [Music] Um, I do need like food and stuff though. Um, okay. What I need to do, I've been doing this whole run with like no blocks. I mean, they'll hopefully trade me blocks. Um, but they haven't yet. [Music] There's four brutes in here. I've only ever seen three. Um, well, uh, Okay. Well, [Music] Um, no. We didn't get enough obsidian. We didn't even get enough to blind once. Unlucky. They lowered obsidian rates in this version as well in the chest. He missed a chest. He doesn't do anything. That chest uh doesn't have obsidian odds. I had so much gold. Yeah, but there's no time. It was 18 minutes, guys. If I want to be my I had five minutes to be my time. I mean, I could have beaten the game, guys. I could have beaten the game, but I could have in the game quickly, but it was we had we had five minutes, guys. We're trying to beat 23. We're not going to if even if it was 25, we wouldn't have we wouldn't have beaten it. like what we had we would have had to trade get you know sit there trade another stack of gold and then go like we just if it was even if we were trying to like there's no way I feel like we still we I want one more good run. That was good. But I guess I want one more like I'll I'll accept one more like that. I don't care. One more once we get to the Nether and complete Bastion or Fortress without dying. Uh, it's a crappy village, I think. Well, there's a lava pool. There was like an Aelia tree right here, then I would do it. But there's not. Um yeah. Ah, it's the bad side. Intel. Huh? Um, Uh, Uh Jesus. Um, I have been pretty quiet the last couple hours. Um, all right. Well, >> it's treasure. I don't have gold, but I don't think it matters. [Music] Oh I mean, crap. Damn, I didn't know he could hit me from there. It's just his reach is high. Damn. I mean, shoot. Yeah, that was really good. And then I I I I killed it. To be fair, it wasn't that good. I mean, the We just got lucky with 20 lava, but yeah, that was a nice seed wasted. Um I just I just don't usually go for that. So I I guess literally I've never done that. You guys have seen me do like I don't know, probably 20 treasure bastions the last like five days. Have I ever done that? Like, have I ever gone for those gold blocks there? Nope. I only went for it because I didn't have gold. And I only didn't have gold because I didn't stop to mine gold. And I didn't stop to mine gold because I was trying to go too quickly. Ah. Um, I mean, if there was a lava pool right here, then it'd be I have three iron, but there's not really ever surface lava, is there? I mean this is what I can do. I can Oops. Get a little more wood. I did not mean to fall there. It's actually kind of annoying because I don't have healing for food unless there's a lush cave. We're at like almost prime level for lava. Um, we don't have food, so We'll have to hope that there's a way for us to get food. There's a bastion. Again, we're going to run out of hunger soon. And it's also into the wall. The question is, is there a way out of here? Then can I go back this way? All right, we got a bad Nether cuz I'm about to be out of hunger. I hear a hog one. Fortress and Bastion, of course, on a run where we have no food. Where is this hoglin? Uh, I don't know how I'm going to do this. No, he burned. Oh my god, that is like the greatest discovery since sliced bread. I don't even know what that means. cuz I'm just too happy. Okay, I think we might need to do the fortress first. Well, I guess I don't know. It just feels like we're going a long way there and then Okay, no, we can't. We can't. We don't have much food. We need to do the bastion. The only problem is though, we don't have a iron pick. Um, but there is iron in the fortress chest. Maybe we do do the fortress first. We don't have food. Um, is it worth it to go get that? No, we got to just head to the bastion. It's actually not that bad once we get over here. It was another hog on the way in. Oh, this skeleton's annoying. No, that was clutch. Um, no, I almost clutched as well. Frick, that's so annoying. How did that happen? I'm watching the clip back. How did that happen? How did that happen? This was such a good pace. I just slipped off the block. I literally just slipped off. Ah, how did I let that happen? I just I literally just slipped. I think I w I walked to the side and I thought there was a block there and there wasn't. That's just me not being sharp. Damn. I think that's where we call it cuz that that could have been really good and that was that was my fault. I think I'm my tiredness is showing. GG guys. We'll be back tomorrow. Um or I don't know about tomorrow, but probably. But we'll see. Thank you guys. Thanks for coming to the stream. Appreciate you guys. Uh yeah, see you guys. Bye. Thanks for watching.",
    "start_time": 1.839,
    "end_time": 30447.12
}