{
    "video_id": "8nejVcF-NPI",
    "channel_url": "@dream",
    "transcript": "What's up? I'm just going to be chill this VOD in this stream. So, I'm just I'm not going to say much. So, just make sure to subscribe. We're doing more speedrunning. Back at it again. Hundreds of hours of practice because we need the practice. Welcome to the VOD. All right. We're in. Let me pull up the uh chat on YouTube. There we go. W There's some What's up in Twitch chat? We got Nutty Mitchell. We got NWL. We got Krabby Sleet. We got Comic Boy TV. We got Turkey Not Turkey. We got Miss Z. We got Emerald. We got Blockified. We got Prince. We got Gorilla Monkey. We got uh uh Gabrielle, we got Panda X, we got Hudson, we got Sockbot, we got Raw, we got Yep, we got HP Roblox, we got Patricia, we got Aimless Raptor, we got Odin, we got Analogy, we got uh Wadd Watty, we got Deps, we got Gamer Husky up in here, we got Wafty up in here, we got Turkish bread up in here, we got Tooff says true up in here, we got just Leppy says, Please. I was already in here. We got Sora. We got uh Parallax. We got Landon up in here. Landon RB. We got Rob. We got 27 John. We got Gray Fox. We got Carrie. We got Aha. We got Dude Bro man88. We got Bob Herman. We got Lucy Folly. We got We got a whole bunch of people up in here. All right, we're back at it again. Again, again. Um, the AC is fixed. It's kind of cold. Actually, I turned uh I turned the AC up because I mean, yeah, I turned the Is it turning the AC up or down? If you make it warmer. I turned the AC down. I turned the temperature up. Surely that's how it works. You turn the AC up to make it warmer. Well, no. Come on. Cuz it's the heat. Guys, guys, look. This is a debate. If you turn it, if you turn the AC like crank, like let's say if you tell somebody like, \"Oh my god, it's so hot. Turn the AC up.\" That That makes sense. But also, it's too cold. Can you turn the AC? No. No. No. You You turn it up. No, no, no. If you want it colder, you turn it up. If you want it warmer, you turn it down. You turn the temperature up. But you turn the AC down. Come on. AC is cold. Heater is heat. Reacher says speedy speedy. Thanks for the dono. Guys, this isn't the this is the important question because you can have heater and you can have AC. Like they're they're they're different. Um All right. Um, all right. We got we got our warm-up period where we're crafting stupid crap. You mispronounced my name if there's no first R in the first turkey. Oh, sorry. Hey, I love your videos. Tell George I loved his trap in the X-ray video. I will tell him that. Kate, thank you, Kate. Um, all right. Fell asleep watching your stream and I woke up still watching your stream. Uh, that seems unlikely given it would have been a long a long time, but I mean, anything's possible. Uh, what do I want to do here? I don't really want to go in that ocean monument. Let's go here. Let's go ahead and place this down. Uh need to make doors. Uh, it pushed me out. There are skeletons. There's definitely a cave right here. That's good news for us. Um, we don't have flint, but we can we can get it down there surely. Oh, hello. I need this. Hey, leave me alone. Um, well, God, you're annoying. Oh, I missed. Um, okay. Oh, well, there ain't nothing here. I X-rayed as usual. I'm a hacker. Did you guys know this? So many diamonds. We got nine. Nine diamonds. Let's stop and craft. Why don't we? Um, let's Oh my god. If we were rich, make an axe. Wait. Oh, this is awesome. We got a shovel. Oh my god, we got a sword. This is amazing. Come on. We need to find lava, gang. the heck is that? Why no one cycle? Because it doesn't work on servers. Um, kind of. It's for two reasons. One, because it's harder on servers. Two, because I don't use hitboxes, which also makes it harder. Uh, and three because um, uh, it's hard when there's people chasing you. Like when there's people in Manhunt, there's people chasing you. You're you're kind of, you know, Tuki, not Turkey. That makes sense. And there's no lava. Wait, let's do this glitch we found. We need to find a quicker way to do it. Not that way. Not that way. Yes. I'm x-raying. Not that way. Did we just get unlucky? Is there just no lava? Oh, guys, I'm mining these diamonds, guys. It's a speedrun, but I still Oh my god, I just It's so tempting. Oh my god, there's so many. Why is there so many? Okay, so we got unlucky cuz there's no diamond there. I mean, there's no uh uh let's see if there's any this way. This is our only hope. Anakin, you're our only hope. All right, watch this. We need to figure out if there's no lava. There's just no lava anywhere. And maybe there's lava over here. No, there's just no lava. Yeah, we're unlucky. Look at that. There's no lava anywhere. You got to help Lacy and Marlin. I'm down. Let me make sure I'm following them on Twitter. I probably am. Lacy Marlin. Well, read YouTube comments also. I do. Of course I read them. Um, all right. There we go. With 21.8, it's more common to find diamonds now. W. I feel another new PB today. But now our time is a lot harder to beat. I guess that's generally what happens. It just gets harder and harder to beat your time. But like I feel like we haven't even like peaked. Like I think I feel like we haven't even gotten close to peaking. Like I generally feel like we still have a lot of room to to grow cuz we our biggest improvement during that run I think was the end fight. Like the end fight took a was a lot quicker was like a couple minutes quicker and then the the enter at the beginning was quicker. I think those were the two biggest differences to be honest. Do you ever use shields? Not in these right now because I I have a no shield rule. Love your videos, bro. Dreamqu fun to watch. Do you plan on doing man hunts where it switches between more than two people? Like three or four? Uh, I don't know about when it switches between more people, but uh, doing one with different people and with more hunters. Definitely. Both of those sound cool. Okay, this is promising actually cuz we can get the shipwreck and we can like run. We jump right down that cave. It is kind of far though. Guess I don't need a boat cuz it's right here. Uh there's no good there's no chest. We got teased. But maybe in these ocean ruins. Maybe in these ocean ruins there's a map to buried treasure and maybe the buried treasure is close. If so, we will continue. If not, it's over. Um, I don't think it's close. No, I have to go that way. Well, actually, I have to go over here. Actually, might be close. Reasonably close. Surely it's right over there. Oh, it's right over here. Cool. I like shipwrecks a lot. I mean, uh, buried treasure. Buried treasure is good. They give you like iron, diamond, and food. So, I think it's I honestly I think buried treasure is the ideal way to go. Like maybe we should just do a bunch of buried treasure runs because I feel like I'm pretty efficient even with uh not much food. It's like just a little bit of food is is enough to satisfy my urges. Oh crap. A shucks. Okay, I think we'll just go back to that cave. I actually like that cave. Like I feel like I feel like one of my biggest strengths is just making like crap work. Like just making like weird situations work, I guess. Um, and I want to learn to do that more. And I feel like I die a lot, but it's a lot of the time it's because I'm I'm putting myself in a position where uh it's not easy to not die, I guess. But like shipwrecks give you just enough food to like I can get to the bastion almost guaranteed with the food, unless I get no food. Like I can probably pretty much guaranteed get to the bastion um with like decent health and then I can you almost always find food in the bastion. Oh, that's annoying. Okay, what I wanted to do was There's just so many mobs. Um, okay. What I'll do is still I'll go here because I can [Music] um um uh Okay. [Music] Hey. Um, it's kind of annoying cuz I kind of wanted to grab that diamond, but there's just too many mobs here. I have like a little list of things that I'm trying to work on. One of those things is eating food earlier. because I always wait to eat my food and then it causes me to die a lot more. Read Twitch chat, please. Also, what beat time? I beat it yesterday. Eat the cooked salmon, bro. I'm saving that for when I might need it cuz it heals quicker. So, I'm saving it. I don't have a flint and steel. Maybe there's this lava pool. We'll have one if it's a lava pool. Um, is there some gravel? What? All right. Sweet. Oh, this is annoying. Get me over here. Um, I mean, this is kind of annoying. Jesus. But whatever. Um, let's just go here. Um, all right. Let's make this me a boat. All right. Uh, there's a whole bunch of entities this way. The only problem is there's nothing there. Um, this is probably just a reset. I'll go up here cuz I think I saw something. Surely this leads out. That didn't really work. Well, that's not working how I want it to. [Music] Uh I mean, it's cooked, but like it's the beginning of the day. I I want some warm up. So, if I can get out reasonably soon, then I will get out. Okay, there's a a cave right here. I don't know how that ghast is there. I thought gas can only spawn like out out. [Music] Well, it's odd because there's a bastion somewhere. It's down more. Again, this is kind of cooked, but I want to do it just because we don't have any practice and we'll do better later if we get a little bit of practice now. That's a little memed. I think there's a bastion. Um, I don't have an iron pick anymore. Be fair. That actually does kind of meme. I'm at Y 107. It's definitely down. Let's hope I don't fall. Use the seed Q mod. But I'm on a version that doesn't support it. I'll I'll look it up to make sure it's it's not updated now cuz it wasn't updated when I did it before, but maybe it's updated now. Oops. I probably should I know I know I know I should reset, guys, but but look, I I it's the beginning of the day. I just want practice. Are we down? I'm using the entity uh counter. It is like here. So, I'm just going to reset. It's just annoying. Damn it. I want to practice, but we literally just spawn in literally the worst place possible. Like, that's just I cannot I can't do anything about that. You won't practice mining? No, I won't practice uh in the Nether because we'll get like we'll get there later and then I'll just be annoyed cuz I won't I I'll have zero practice on the day, be rusty, die in like a good seed or something. So, get practice on a bad seed. Look at that. That's beautiful. That lava down there is beautiful. Um, I'm just going to grab this. Maybe I should kill this pig over here and sheep. Um anymore? No. Okay. Uh can we make that jump? I think so. Why not? Thread the needle. Oh, hey. Fight each other, not me. Um, all right. Oops. All right. Uh, let's get iron. Kind of annoying that there's no iron right here. Bunch of diamonds. Iron over there that I want. If you guys can blow up and give me um why is there no coal? God damn it. Ow, that's annoying. Um, okay. Well, there's no coal. I didn't get that much wood. I still need a boat. Um, I guess we can use this So annoying. These skeletons are annoying. Now there's another one. Just leave me alone. Oh my god, there's like literally 10 skeletons. This gives me like half a heart of healing or something, which is so annoying. I mean, I have no food, but I can try and get it in the Nether. It's just going to suck, but hey. Um, I'm going to need to go over there. I want to go get those diamonds, I think. Oh, I can. Okay, over there is fine. Oh, I thought I cooked enough iron. I didn't. Oh my god. Let me just go and eat the spider eye. All right. Um, okay. Oh, well. All right. Uh, I was hoping there's water right here. It does look like most these water go water spouts go all the way up which is kind of annoying. Um I mean it's already six minutes and we have no food. This is kind of scuffed. Maybe there's I'll just check right here for a mob. That would be worth it if there's a mob right here. Come on. Yes. [Music] Anything else? Okay, whatever. This is good enough. Um uh I actually don't have any blocks. Uh, this is so scuffed. Uh, all right. Well, 7 minutes kind of sucks. And again, we're in a wall again. Fortress there, but we don't have food. food. We also don't have gold. Bastion there. Okay, this is not bad. Um, it's just slow. I don't have sticks. I need nether wood. [Music] Oh crap, there's lava flowing. I can get netherwood for sticks and maybe kill a hoglin for food. Another bastion. Okay, I want a pickaxe, an axe, and a shovel. All right. It's annoying cuz if I had been faster or avoided more and avoided more damage, we this could be really good. But like I was slow treasure. Um well, we can just loot the chest here actually. Uh I don't remember think this level about >> Oh well that's really not what I meant to do. Don't have a crossbow. No, I knew that was going to happen. Okay. Um how do we clutch here? Let's see. I want to lure this brute off. No, I can't. The crossbow guy can't see me. Brute, come here. Get off. >> Hey, you get off. I need that to kill him. No. Yes. Yes. Yes. Yes. Yes. Yes. Okay. Then we go down here. Um, now the magma cubes I need to worry about, but we need this chest and we need to pray that has food. Oh god, even the baby magma cube is dangerous. Nope. No food. Okay. Um well, this is going to be really complicated. Okay. Um, all right. Let's uh do I have enough blocks? All right, let's go up here for a second. Um, okay. Uh, let's go ahead and take this. [Music] Uh, we don't need this. Uh, okay. Now, what do we need to do? Okay, there's a chest over there. I need blocks. I don't have many. Oh god, we're dead. Okay. Um, let's go here. Cool. Um, there's probably a brute here. Oh god. Uh, well, I really, really need food. You're not mad at me. Let's get you in a hole. >> Um, The problem is I need chest. >> Hey, come here. Uh, there's a brute over here, so there's probably chest. Sorry. I really didn't want to kill you, but There's no chest. Oh, oops. [Music] I I didn't want to burn him, but the brute's there and so Hey, sir. Okay. No food. I'm just getting unlucky. No food and no carrots. Oh my god. Okay. Um All right. So, can we do this without dying? Probably not. Um, can I Oh god. Okay. Um, well, damn it. We are just We're cooked. Uh hello friends. Um I want to trade with you guys. Not you. Okay. Uh can I just get you in a hole here? Is this going to work? [Music] Uh, problem is I can't get them angry. Come here. Come here. Over here in the hole. [Music] Nope. Now come here. >> One more over here. Now get in the hole. [Music] Um, okay. Now the question remains, how the muffin do I get out of this? Um, there's a hoglin over there. There's a chest at the top that I can loot. There's a chest right there. I don't know if I already looted this or not, though. Nope, I did not. I can finally not be on half a heart. Oh well. Hey guys. Come here. Get in the hole. In the hole. [Music] Um, Uh-oh. I need sticks for a bow. Okay. Uh, well, we can go. Can I Where do I want to go? Uh, let's just go straight up there. Hopefully I don't die. Yeah, cool. Hey, we landed right where I wanted to, actually. Um, I don't have many. I have blocks now. Sweet. Now, we get food from this chest. This won't be the fastest zombie. I want to again. I want practice, guys, cuz this is the beginning of the stream. We're just coming out. Um, there's a brute in there. I have a diamond uh axe. But I don't have guys. I think you guys are so stupid. I the [Music] Hey, come here. Um uh there's no food. Hey friends, come here you stupid idiot. Um, okay. There's a brute there. So much obsidian, but no food, which is all I really needed. Um, the fortress I think was at spawn, but I have no food. Uh, so I think fortress is that way. I think I'm going to pearl over here. There's going to be a hoglin on me almost instantly. Now I'm gonna have to kill the hoglins without burning their food. No. Okay, there we go. Sweet. Hello, you die, too. No, he's going to burn. Cool. All right. And then we're off. I need uh sticks for a bow. All right. Um we have fire res. We're fine, guys. It's just practice. It's practice. I'm not restarting. It's practice. [Music] Um All right. Perfect. Right where I wanted it. Um there's a blaze over there. Blaze spawner over there. Let's see if we can place a pearl. Boom. Where the goat? All right, sweet. We got a blaze rod. There's another blaze spawner. Surely I'm close enough to activate both of them, right? [Music] [Music] Oh, one more. Oh, what the muffin. Okay, well, luckily I had extra obsidian. Just spawn you stupid. [Music] Uh, again, it's kind of stupid cuz we're underground, but it's fine. Whatever. We have extra as well. that way 816 -2256 Six. and negative 22 56 Um, let's see. This is the starter. Okay. So it has to be library. Hey, what's the [Music] Um, kind of want the dragon to uh go by it so I can explode them when the dragon's attached. [Music] The heck? Dragon's so high. [Music] [Music] That is such bad like dragon luck. There's nothing I could have done there. This is bad dragon luck. Like it just it absolutely just like hits me three time. I I did nothing wrong. It just hits me three times. This is bad dragon RNG. Hey, good practice. Good practice. I'll take the practice. Yeah, I was in the bastion at half a heart for like a couple minutes. That's good. That's the biggest um that's the greatest practice. I lived in treasure bastion and actually did it reasonably quickly with half a heart. That is progress. Progress. I I had one bed, but um I I wasn't I wasn't using it yet. I was going to hit the dragon a couple times and then bet it, but I hit it like once and then it yeeded me. Well, this shipwreck is probably is like submerged, it seems. Potentially. Yeah. Um, so I don't know if this is even worth it to continue, but Um, Oh, I thought it was the Oh, it is. It is the good side. Um, Let's hope we get lava. We also don't have food, but Come on. Give me a cave. Um, all right. [Music] Uh, this is kind of annoying. There's a fortress there as well. God damn it. It barely clipped me. It's really bad cuz I don't have any food. It's just so annoying. It bar like the lava barely clipped me. Now I can die by being like tickled by a feather or a gas. Um, oh no, I think it's that way, not the way I'm going. Uh um okay. Well, actually Uh, I think there's one past this fortress's quadrant. Only problem is I don't have sprint for that much longer. I think it's far. Can we make it? If I'm not sprinting, it's a lot more annoying. I'm out of sprint. [Music] Oh no, it's a crossbow guy. That's convenient. Um, Um, well, at least we have sprint. Okay. And we can heal off of two hearts. Um, but we still don't have actual things we need. Uh, I can loot this chest, though. That's a better chest for us. All right. Uh, why is there a brute here? Uh, okay. Let's just ignore him and go down here. All right. This is an annoying Let's see. Oh crap. Hey. Um. Um. Where? Oh, where? You're so mad at me. Why are you so mad at me? Oh. Crap. Hey, friend. I really want your food, so don't burn to death, please. Um, I'll loot this chest, but it's a crappy side. Um, it's not a great chest either. Is there going to be a guy up here? Jesus. Oh, it's a double bad gap. Of course it is. Again, basically that means we're cooked and this run's cooked. Hey, we did good. It was good practice. We did good. But what can we do if you get unlucky? Basically, there's two sides to that bastion. And uh well, I guess I could have gotten the gold at the top below the triple, but it wouldn't have been enough. It's only four gold blocks. And it would have already it already wasn't like super quick anyway. So, you know, Um, I didn't know you could get up here, idiot. How ow. H. [Music] H. H. Um, well, maybe there's a lava pool. That would be my hope. Uh there probably won't be because there never is. A conveniently placed lava pool would be good. Um, well, That is just a shameless chest. >> All right. Where is the iron golem? There he is. Now, this run would be good if or pretty decent if there's a lava pool right around here. There's a shipwreck, but we don't need it. The thing is is there's never a lava pool on this version. There's just lava. There's a lava pool. Lava pools are so rare on this version that this is like the holy grail. Um, is there gravel by it or do we just gravel grab gravel here? Oh, it doesn't matter cuz I don't have enough. I didn't even look. I just assumed I I just assumed I'd have enough, but of course I don't. I don't have Oh, I have wood. Cool. But we can wood light. Uh, let's make that. Put that there. Get a drink real quick. All right. It's a housing I think. Um, okay. Hey guys. Well, cool. Um, what I want to do is make gold armor. [Music] [Music] Oh god, I should have just dropped gold. That was one of my notes. One of my notes was just throw throw gold when I'm breaking gold blocks, but I just didn't do it because I I don't know. Wasn't thinking about it. I need to remember to do that. When I'm breaking gold blocks, I can just drop gold and they'll all stop. That was a brute. That was not a brute. I mean, maybe I died at the very end to a brute. Like, I wouldn't have been getting attacked by like a million pigglins. I might have died to a brute, but I like I wouldn't have died to a brute because I would have not been getting killed by other things. Well, that's like a really bad chest. This is close. That's pretty good, actually. This feels good. If there's a lava pool, this could be great. But this feels good right now. It feels good. I'm going to take a bet because it will speed things up massively. And I think that we'll be fine. We will rely on uh getting more stuff, more a lot more iron from the shipwreck. And if we don't get it, then I guess uh I guess we're boned. All right, pay it off. Um, all right. Um, all right. Let's go ahead and do that. Um, let's make this cuz we'll go straight down. Uh uh. Well, I just want to go down. Um all right. Well, I don't think it's that close, but it's this way. Uh Um, okay. Well, did you fix the AC? Yes. Thank God. Need the tiniest bit more gold. Uh, well, that's annoying cuz I don't see any more gold right here. I don't want to go out of my way too much. It's treasure anyway. Um, okay. It's treasure. So, I think we're fine actually. Huh? Um, okay. Um, that's not what I meant to do. We're fine, though. All right. Uh, Um, where is the other brute? He's down already. Need to break the spawner. crap. Okay. Um, all right. Oh my god, it was just too It was too chaotic. It was too chaotic. I should have I Why did I kill Why did I hit the brute? Like, why did I do that? Why did I do that? I thought he was one hit. And so, which he probably was one crit. And so, I thought if if you kill him in one hit, they don't like the other piglins don't get mad. And then of course there lucky with the magma cube spawns there to be fair. There's so many of them. Okay. Well, the shipwreck's actually over by the lava pool. Well, I don't know if it's I don't know if it's over by the lava pool, but it's it's that direction generally. Um, let's do this. [Applause] [Applause] [Applause] No, there's no bastion super close, but there's a fortress. Just reasonably close. Northeast Well, I didn't get much from that, but might be enough. It's Oh, it's to the left. Well, I'm going to need to get food. Uh, which is a little annoying. But it's okay. I don't know which way to go. Sebastian, it's probably in this wall. Um, I'm afraid that if I go here, around here, then it's going to be in the wall. And I went around for nothing. Oh, there's another fortress here. That's so good. That's really good. Yes. And it's treasure. And I and I came up right by the freaking trellis. I mean, it's bridge, not treasure. [Music] Um, okay. Well, thing is there's Be careful here. I think I'll just trade with you guys because there's a lot of you here. [Music] [Music] Um, let's see. Can I Mhm. Mhm. [Music] [Music] No, no, no, no, no, no, no, no. I ran out of blocks. You're joking me. You're joking me. You're kidding. You're kidding. You're kidding. Why? Why did that happen? Why do pigglins have 100 blocks of reach? And why did I happen to run out of blocks at that moment? Why? Why? I sold. I sold so hard. Oh my god, I sold so hard. That was such a good run. I was doing so perfectly. Everything was perfect. Everything was perfect. Oh my god, why did I sell? Oh, I need to make sure I have more blocks. Oh my god. Like, why? What the hell? Why can brutes reach three and a half blocks or like four blocks or something ridiculous? Why do they have such far reach? Oh my god, that is Oh my god. And why why does it always happen on a like a cracked run? Like a cracked run, I'll always sell in the stupidest way. Like that just doesn't happen if it's not that fast. So, if I enter the treasure bastion, if I enter that bridge bastion and it's not that fast, that just won't that just would never happen. Oh my god. You just need to see them earlier. I saw four of them and I see just jump in. I didn't jump in. I didn't jump in. I knew where they were. I knew exactly how many brutes there were and I knew where they were. I purposely I was I The tactic is you bridge on the edge there and they all fall off the edge. I guess I was just one block too close. I was one block too close. Like what the Ah, why did I do that? That's so annoying. Like I actually Oh my god, that is so annoying. H I think that was the best seat I've gotten and and my best performance and then I just freaking throw it away. Oh, that is so annoying. Like oh my god, I'm so mad. I'm actually so mad right now. It's going to take me a bit to like get on mad. I know what I mean. I know what I did wrong. The the literally the only the only thing I did the only thing I did that was wrong was I I I instead of I I need to be one block to the left. I needed to be one block to the left. That was it. It was one block to the left. Then it was perfect. Everything was so good. H I'm so frustrated. Everything was so freaking good. Oh my god. could have gotten the seed number to practice that seed again. I'm not going to practice that seed again. That's not the point of this. Point is that I shouldn't squander it when I get it. Um, that's so annoying. I'm going to be mulling about that seed the entire time I'm playing this seed. Uh well, I don't see a lava pool on this map, which means we probably should just dig down, but it's annoying to dig down. Oh my god, that seed was so good. Why did I do that? Why did I do that? Ah, but it's also stupid because like the brutes are so inconsistent. Like I feel like I've done the re probably the re the reason that I'm so annoyed is that I feel like I feel like I've done exa I I actually feel like I've done exactly that. I feel like I've done exactly that and not died probably like six times. So it's just more annoying that it just happens to happen on it. I happen to die on the one run where it actually like matters. I feel like I've done ex literally exactly that and not died. Like the brute just didn't hit me. I just got unlucky that the brute like fell in a certain way where it could reach me when it was in midair. But I mean I can I can just be more cautious. Especially on a run like that. Like I I did not need to go that quickly to the chest. Like they were trading. I was going to be waiting anyway. Like why did I feel the need to be like Usain Bolt? I swear there's lava pops. Am I just like delusional? I guess I must be. Well, that's useless. I'm so annoyed. My god. What is What am I doing? [Music] It's the worst spawn. [Music] Um, well, okay. So, the bastion's far. Um, where Where the heck is the bastion? Okay. What? It's towards the Bassel Delta. That's unfortunate. Um, so unfortunate there's a gas as well. Oh, this bastion's so far. Surely it's right over this. Uh, all right. Well, [Music] what? It's back. Wait, it's in the Bassalt Delta. It can't be. What? Oh, it's below me. [Music] Uh, let's see. Okay, we got food here. [Music] Um. Oh, what? Am I being stupid? There's supposed to be a chest here. Oh, there is. Huh? [Music] [Music] Oh god, you guys didn't jump down. Why the heck did you not jump down? Um, I didn't get that gold block. Um, okay. Um, Uh um okay. Well, I'll be right back. [Music] What the heck? What happened? I bro Oh, I'm not wearing gold. Holy cow. Oh, well, I dropped gold all over the floor. I don't know why that happened. I need to wear gold. I had no food though. The run was cooked. Boy, I just need to remember to put gold on. I wasn't reading chat. You guys we told you I wasn't reading chat. Okay, maybe I should have read chat. There's gold helmet in the chest. Why didn't you wear? I don't know. I I think I thought I thought I was wearing gold. We know you don't have to stream your practice runs, but it's fun watching your methods W or L. Thanks. Thank you, Styro. I appreciate it for the dono. Um, well, there's a shipwreck over there, but it's kind of mid. There's no enter here. I might be able to use it. There's three lava and one obsidian. That's four. I might be able to fill in the portal. I have to break the whatever. But if I get enough gold for a gold pick, it could be worth it. I think that's probably the strat. It's an unbreaking sword, you idiots. I hate when somebody everyone says looting sword every time. It's so annoying. You guys make me happy for a second. I'm like, wait, this could be epic. And then it turns out, no, you're just you're just an idiot. J subs. I'll do one this weekend. I guess I should announce it in advance. This was the crappiest chest. Okay, well, we need a shipwreck. I'm going to bury treasure. Um, well, it's the opposite way from where we wanted to go. That is so unfortunate. It's so far. Yeah, we just got to we just got to go. Oh my god. What? That's the closest I've ever seen one. That's crazy. They bur while they were burying it, they like wrecked their ship. There's a ruined portal over there. I don't know if it's a lava pool or not, but this is a pretty good seed. Um, Yes, there's a lava pool. This is pretty good. All right, let's go ahead and uh let's see if we go ahead and we do this. Um that's not going to work actually. Guess we can just use this uh Oh god. I really don't I don't like this. There's There's not There's not a lot of lava here. Um. Oh god, I'm scaring myself. Uh Jesus, what am I doing? Okay. Put one there. Let's just do it like this. Nope. That really scared me. Okay. I just really didn't want to screw it up. So, I was I I we took extra time, but we didn't mess it up, and that's what matters. [Music] All right. There's a bastion. I think it's relatively close. Yeah, it's right there. How do we get to it? looked like it was like a stables or something or housing. Yeah, we're already up here. Uh, I don't know if there's all right. [Music] Okay. Um, let's see. Is there more? There's more. That's not what I meant to do. Friends, come over here. I hear a gas. I really don't like that. Perfect. [Music] Um um okay. We hope for more food. Uh I'm going to kill these guys. Oh, well, okay. That's not meant to do, but I can drop gold. Don't panic. Um Crap. Why am I doing something different than I always do? Why am I doing something different than I always do? Oh god, why am I doing something different now? I say that and then I just go do it again. Okay, I I need to I want to whatever. I'm just going down. Um I need the boat. [Music] [Music] Huh? [Music] Huh? [Music] Oh, bad luck. It's bad luck. It's probably probably a brute up here. Well, Um, all right. Well, problem is there's not many of them there. And the other one is a bad gap, which is annoying. And we got bad luck on the gold. Of course we did. Why would we not? There's no gold up here either. Oh my god, we've gotten such bad on the gold. Um, I mean these guys are slow. Uh, Uh cuz we we don't have many of them. It's annoying. I want more. I don't have much more gold though, to be honest. Makes it hard to get anybody. Yeah. I mean, there's more gold at the top, but like kind of just have to hope these guys get it probably. Um, well, can still be good. [Music] Um, okay, we have enough pearls. Three more. Three more obsidian. I didn't check any of the chests out in the thing, so there might be more. the middle chest as well. But I just can hope that we get it here though. That'd be ideal. Um, we kind of need more arrows. Uh, it's just slow now unless I leave like shortly. What's the closest that we're two? Okay, we can go to We can go to negative. Negative. [Music] Come on. Give us one more. Give us one more. Give us one more. Give us one more. I don't want to leave now. Okay, sweet. Let's go. I didn't get many arrows, though. I still want to grab a chest on the way out. Oh my god. I should have just came here. Uh, do we have enough arrows? I still want to grab this chest over here. All right, sweet. Good enough for me. Uh, we want to go this way. Uh, well, I don't know where we want to go. We want to go negative. Negative. I'm learning from my mistake. I'm waiting until I'm out of this to see. All right. Where do we want to go? Let's go in here. Okay. Uh well, this terrain sucks. Um, let's go over there. Can we land on that? No, cuz we suck. Jesus. Uh, well, I really want to go. Oh my god. I'm just like the worst pearler in existence right now. Um I want to go up here surely. Yeah. Okay. Uh well this terrain is booty cheeks [Music] cuz I can't go where I wanted to go which was negative negative. I mean, I'm going negative negative, but like not now. I'm like in a different quadrant. I think this is this is better. Terrain could be better. Um, we just can't get that way. We just cannot get that way. So annoying. Could have been a PB. I could have left a little bit earlier from the obby and then if there was good terrain, it could have been like a really good PB. But nope, this terrain is so bad. Um, this is more open, which allows me to pearl more, which is good. There's a fortress. If only we had good terrain. We This is the exact direction I was trying to go. We had good terrain. This would have been great. But we didn't. This is a spawner. Yes, I think it is. That's a spawner. Uh well, [Music] 672208. Surely I can just get an extra blaze quicker because there's already two here. [Music] All right. So, -2208. [Music] Oh, what? I'm stupid. Went past it. Um, where? Oh, where? That's a spider. Um, there we go. I was looking for the starter staircase. Um, um, Uh, what am I trying to do? What am I doing? Let's go. [Music] Um, I can also like grab one of those torches in the future and use it to get the gravel down quicker. I think that's probably good. What's the heat? [Music] Hey, what [Music] Okay. [Music] All right. [Music] Bye-bye, dragon. [Music] 2458. Another sub 25. Another sub 25. All right, we're locked in, guys. We're locked in. We got a sub 25 under our belt. Um, there's an ocean ruin. Guess there's no lava pool or anything. Play gorilla tag with Jman Curley. I'm down if Jan Curley wants to. He was cool. I met him uh at uh VidCon. He was a pretty cool guy. We talked for quite a while actually. Him and some of his friends seems like a cool dude. Seems like a good-hearted guy. He said he describ he was talking to me about uh I don't know being how he you know inspired by you my success and and then um he he referred to he was he was when he introduced me to some of his friends he was like this is my George, this is my Sapnap. I thought it was funny. Bro, I was still mad about that one run. Yeah, I am. I am. It was so annoying. Do you play 4K or 1440p? I play 1440p. My like setup is so weird. Like my I play windowed Minecraft and um I play windowed Minecraft and there's like just like stuff behind my Minecraft right now. There's like my downloads are like opened. I don't know. Like a bunch of stuff is just like opened. Like I have chats like the left side of my Minecraft and the right side. Why do you only stream at 720, not 1080? I stream at 1440, but on Twitch it's 720 because of the way that Twitch works right now. Yeah, if the fortress was in a better location, that run would have been really quick. Dream, my partner of three years just dumped me, but these streams always cheer me. I'll keep going, dog. Damn, that sucks. I'm glad you're enjoying the stream. We're in it together. We may not be able to uh I don't know. I was trying to think of a joke. Why do you have bastions so much now? I'm used to old spirits without those. Sorry. You need bastions because they that's how you trade for everything quickly. And you can find the bastions by using the entity counter because there's more entities at bastions, like a lot more. So if you just kind of look around and then be like, \"Oh, there's a lot of entities that way. Okay, I'll go that way. How do you reset the world so fast? It's a mod.\" And then just in case this is like goated, but if it's not goated, then we will just reset. I guess a shipwreck, too. But it's just so far we have to swim. Why don't you loot bastion chest while the pigglins are trading? Well, I I sometimes do, but the problem is like I'm just like I'm just kind of slow and scared. We got to remember use the torch to break gravel. tower and fighting dragon. Yeah, I like that. I like that strat. We use gravel instead of soul sand. Um, and then we use a torch to break the gravel down after towering up. I like that. We can also do it maybe, but I think the dragon determines where it's going to land its perch when it starts its perch. So, we need to break it. We can't wait until it's perching, which sucks because I like being up in the middle. But also is towering up like if we tower up one block offset to the side, I think. Wait, we can just do that. Wait, no. Okay, we're being stupid. Let's not use gravel or anything. Let's just tower one block to the side. Surely that's how the dragon works. I'm pretty sure that's how it works. We can just offset one block to the side and then tower up and stay in the middle the whole time until it perches and then go down. I should probably test that right now. I'm pretty confident. It just checks like 0 0 or whatever. It's like the dead center. I guess I could be wrong, but I think I'm pretty I'm pretty confident. Um, all right. Well, let's just not do this. Let's just go up here. Um, this is kind of annoying. Well, this is rather annoying. Let's just break this. Oh, come on. All right, then we make this into a crafting bench, which we can put there. You can stand here and break this and get this. Um, we can do that. All right. Whatever. Um, what am I doing? Let's go up here. Um, make a door. Make a boat. All right. Is there a good place to go? This looks pretty promising. deep area over here. Hopefully, we can swim down all the way to a cave. All right. Whatever. No. Oh no. Ah. No. I knew that was going to happen. I didn't hear it hiss. Why didn't it hiss? Why didn't it hiss? Why didn't it hiss? Why did it not hiss? [Music] The creeper did not hiss. Oh, I had a water bucket. I was waiting for the water to drain cuz I thought I needed to wait for the water to drain like to go down some so I could like jump into it, but I could have just jumped. Thought I had time cuz I didn't hear the creeper hissing. If the creeper hissed, I would have jumped. But I didn't hear the I didn't hear the creeper hiss. I was like, \"Okay, I have a second.\" But I guess it just didn't hiss or I just didn't hear it somehow. There was another lava pool across the way. I don't know if it was enough, but Can you tell how you're able to locate the end portal so fast? Um, well, last time I just got lucky, but there's a couple tricks. One, uh, if you find the starter staircase, which is basically a staircase that leads to nothing, um, you start there and then, uh, the stronghold room, like the portal room is close to that. It's generally I don't know the exact number of rooms like four or five I think it's five it's like five generally it's on average five rooms away or five to seven something like that so it's really close to it um it's almost always like exactly five six seven rooms away I forget the exact number but uh and so you just basically you just check the close rooms and if you don't spawn at the uh starter staircase then uh you can uh follow the doors backwards like if there's there's a way where basically look at the doors And if the doors are like towards you, then you're going you need to go uh the other way. And if the doors are if the if the door is like away from you, like you're going back towards the beginning, then you do it. But anyway, does seeing a library mean anything on stronghold? Um it it does kind of. There's only two libraries, I think. Um and uh basically uh if a li a library works similar to the portal room. So like if you're if you see a library then that means you could that could have been the portal room. Uh so you just turn around usually cuz libraries take up a lot of space and that means and this the portal room needs a lot of space. So, generally libraries are not not good, but it it's good because it can tell you how you turn around. Uh, I mean, this is mid. Just get better seed. I can I can show you guys. Fine. We'll do a little little tutorial here. Did I not? Thought I turned on cheats? Really? I didn't turn on cheats. Get a new world. Unless it's a good seed. See if it's a good seed. Nah, it ain't a good seed. All right. Watch this. Okay. Uh, game mode creative. Let's see. Locate structure stronghold. So, first and foremost, when you're at the stronghold, uh, when when you're going to the stronghold and you're throwing an eye, it's going to lead to a corner of four chunks. So, this block right here is uh there's four chunks. There's a chunk here, a chunk here, a chunk here, and a chunk here. But the chunk it's going to be in is the chunk where your chunk coordinates are 0 0. So I can tell that I'm in the stronghold chunk because when I go when I stand on this block I'm at 0 0. If I'm here it's 150. If I'm here it's 1515. If I'm here it's 015. So this chunk is the stronghold chunk. Then if you go to four five or you know 44 this is the center of the staircase but you want to go to the side of it. So you know 34 or I I usually go to 54. Um that way you don't fall. So then if you just dig down right here, then you'll find the staircase, which is the starter staircase. You can tell it's the starter staircase because it leads to stone, which is nothing. Basically, um, it's always the southwest chunk. I didn't know that. Or sou southeast. It's the southeast chunk. This one was the southeast chunks. Maybe it's not that. That's what someone said in chat. I don't know if it's true. Anyway, start staircase. Now you're at the start of staircase. And you can see there's there's going to be doors. So, when a door looks like this, meaning it's like it's flush with the blocks, that means you're going away from the starter staircase. But if it looks like this, where it's on the other side, it means you're going towards the starter staircase. So, like if I'm if I go find another door like out here, I'll just go find a random door. Oh, what the heck? Um, another cool trick because there's hidden rooms here is if you see this where it's like you see how here there's on both sides of this there's like a it's broken out like this is like uh like there's a stone that means that there's a secret room there. So if there's this is broken out like this, there's a secret room here. And because this is broken out like that, there's also a secret room here. Um, basically let's find a door. So again, this is flush with the walls. So you're going away from the starter staircase. And then now this is not flush with the doors. So, we're going towards the starter staircase. Anyway, whenever you're by the the starter staircase, the again the stronghold room is going to be close. So, we already checked this way and there's nothing. So, we know it's going to be either, you know, these way. So, we just count the rooms kind of. So, like with this, you know, we're kind of like a couple rooms now. And also, it needs space. So, going down is the library. This could have been the stronghold room, but it wasn't. So, now we know it's the other way. And if we go over here, uh, we're going down, which is usually a good sign because it just clears up space through here. here. And the strong room is going to be probably right here. So, not there. Maybe here. No, it's going to be up here to the right cuz cuz we start going too many rooms away then we come back and it'll be here. Yeah. And here we are. Yeah. And you can also use the the silverfish for finding it obviously. But yeah, that's kind of that's general tricks. You can also use the pie chart, but I don't like using the pie chart, so it's kind of stupid. Yeah, generally that's how you find it. And if you want to route all the way back to the starter staircase, like I'm going to put myself in a random place. It's kind of a small stronghold. I'm going to put myself way over here. Let's say I enter the stronghold. I'm over here, right? I found like Oh, the stronghold. Okay. I need to find the starter staircase to know where the portal room is. Okay. Okay. This door is not flush, so I can follow it. Okay, I'm running through here. This door is not flush, so I follow it. Not flush. Follow it. These are This one's flush. This one's not. So, I could And this one's not. So, I can go on either. So, I could go here. Okay. It's not flush. So, I can still follow it. Okay. Not flush. Keep following it. Not flush. Not flush. So, if I This way. Not flush. Cuz that one's flush. Portal room. But also, you can still keep following it because this doesn't lead to the portal. It leads to the staircase. But go back here. You can tell, okay, that's not flush, but this one is flush. So, you would take not flush, not flush. And then you'd go all the way back and you'd be at the starter staircase, which is right here. Yeah. Anyway, tips and tricks. [Music] And there's two libraries and one stronghold room. I think. Okay, there's a shipwreck over there and a blacksmith. This could be good. We don't have a lava pool though, which is annoying. [Music] Um uh I feel like we just grabbed that shipwreck. So I think we just grab a couple hay bales here. We grab the shipwreck. Maybe we just go straight down so we'll have food and Yeah, I'm going to take a feel I want to take a bet again. Uh we're going to get enough iron in there for the things we need. Um I I'm taking probably a decent sized bet, but we don't have a lava pool and this will make things so much better if my bet pays off, which it probably will, but could get unlucky. Uh, okay. [Applause] All right. I really wish there was a lava pool. I'm tempted to tower up and see if there is one. Um, all right. Let's see. Uh, but also we can just dig down. Um, Come on. I didn't get flint. Why was there no lava pops? Is it because there the blocks were all covered? Like the lava was like completely covered. Like there was there was like blocks right above the lava. Careful what you wish for. Well, got a lava pool, but nothing else. But it's okay cuz maybe there's iron in like a cave right around here. That would be ideal. Um, let's see. There's a pillager outpost. The thing is, it's annoying because could have iron golems and iron, but also could have nothing. And if I travel all the way over there and it's nothing, then I'll be rather annoyed. But I think it's probably our best play. I'm going to get this wood. I'm going to travel over there. I actually like pillager outposts like for this. Like I think I I think I I want to refine my strategy offline for villager outpost cuz I think that they're usually in my mind bad. And like I've never seen anyone speedrun using them, but they sometimes have iron in the chest. They a lot of times have iron golems and they have hay bells around them, so they have a little bit of food. Um so it is interesting. Like I I do I like them and I want to learn how to utilize them to their fullest. Like right now my strategy is I go up and then I go down and then I uh dig below like the iron golem if there's an iron golem. >> I feel like when there's a laz there's usually not an iron golem. I could be wrong. Yeah, like there's a laz and I don't see an iron golem unfortunately. We can hope there's iron in the chest, though. There's not iron in the chest. Is there another box cage? No. >> Unfortunate. We got unlucky. Um, maybe there's iron though. We got some food though, which I guess would make this run more bearable if there was a cave. But I don't see a cave. [Music] Okay. I was going to say I'm going to reset unless there's something right here. I'm just going to see how much iron this is. Okay. Well, it's enough. Uh uh. So at least we have food and we have uh blocks. I saw gravel right up there. And we won't have a uh iron pick, which is a little unfortunate. [Music] But we do have food. Yeah. Uh [Music] [Music] [Music] [Music] Okay. Hey. [Applause] Really? There's a blue biome through it. Um, yeah, we have a bastion past this, but it's probably far cuz it wasn't that much higher until I moved over here. So, it's probably 300 blocks or something. [Music] [Music] [Music] Well, Um, where the muffin do we go? It's like in this wall. Go down here. [Music] Well, that's annoying. It's like literally in this wall. I don't have any gold. There we go. Well, uh, okay. Treasure. Um, well, I don't like this. I hear brutes. Oh god. Let's go somewhere else. Hello friends. [Music] Um, I need an iron pick from uh somewhere. [Music] [Music] Okay, let's go over here for a second because No, no, no, no, no. I hate these guys so much. No, no, no, no, no, no, no. [Music] [Music] Okay. [Music] Well, this treasure kind of sucks. There's less gold, I guess. Problem is, I'm not even trading yet. It's already 11 minutes. Um, going to have to be really quick if I want to do it. Luckily, I think I heard a bunch of guys over here. Yes. Come here. Um, okay. [Music] Brute somewhere. Um, okay. Looting three. Now we might actually be talking. Um, I don't have enough yet. Is there anyone over here? I don't think so. I need to go back and make sure they have more gold. Hey, friend. Come here. Here, guys. Um, [Music] uh, we don't have enough obsidian. Uh, what am I doing? What am I doing? What am I doing? Um. Oh, wait. Hey, I left my crafting bench. Uh, keep the crafting bench. [Music] Oh, we didn't we didn't even get 10 obsidian. unlucky. Um. Um. Okay. [Music] Where am I going? What? You guys are all trapped. Um, this is annoying. There's going to be three brutes up here. How do I navigate this? Let's see. What do I want to do? Uh, I want to block myself in. I feel like got to be quick. Oh, they're up a floor. Uh >> oh. [Music] Oh my god. I mean, I didn't get enough trades and stuff. Feed the pigs. They're brutes. I got to go to the bathroom. I'll be right back, guys. Speedrun timer. I mean, I don't really care that I died there. It's just It was a stupid It was a really bad generation. Here, time me. I'm back. Time I'll not stand by and watch y'all hit on brutes. I will join you. Yeah, it's annoying. But to be fair, I don't think we've died. I think there's been one death today that that was like stupid. Like I'm not saying that wasn't stupid, but the only reason that happened Well, not I don't think that was stupid. I think the only reason that happened is because we were not on a good enough pace where we could we had time to mine through the walls. I easily could have if this was like when we had a 27minut time or something. I would have just mine through the walls and like safely got the chests, but I was like we don't have time. I need to run up. I mean, I had a looting sword, which could have made it which could have made it better, but like we just had no time. Like, we need to get to the the fortress like ASAP. Did you even wash your hands? No, of course not. I didn't have time. It was a speedrun. Bro, you didn't even need anything else in the bastion. I needed obsidian. I had nine obsidian. I needed at least 10. I needed 20 really, but I need at least 10 to home portal. But home portaling is like crap anyway. It would have like I couldn't phone portal and be my time. Uh-huh. Uh-huh. [Applause] Well, I guess we don't have an iron pick, which does make this slow, but Uh, Uh, okay. Well, oh, there's a fortress here. Uh, I don't know where a bastion is, so I guess we'll do the fortress. [Music] Oh, well. Well, Oh, heat. [Music] No drops. If anything dropped, it burned. But I don't think anything dropped. I didn't hear anything. Same thing. I didn't hear anything. [Music] I mean, I've killed a lot of blaze. Yeah, I mean, I shouldn't have stopped to eat. I thought I was going to die if I didn't, but I I don't know where Bastion was anyway, so it's kind of a bad run. And also got terrible blaze luck. Um, all right. Let's high roll for a a mine shaft. [Music] It spreads world record. Oh, you're kidding me. That is bad luck. Oh, I think what I need to do is um Uh like this is stuff that happens in a manhunt. Like what I just what just what I just did there. Like that's exactly what I would have done in a manhunt. Um and then cool stuff just like happens, you know? eventually. Uh, so can I live here or no? Rotten flesh. That's unfortunate. Ah, I knew I was going to die. That's such bad luck with the uh spider dropping down. Everything would have been perfect. That was a cool start though. We had like one other chest or something there and it would have been really good. I want to get a blacksmith. I want to get like a tiger village and a blacksmith. like 10 blacksmiths. I just want a good seed. A lava pool the shipwreck. No. Why? I Ali [Music] Dream never chat. We're still here. I do read chat. Sometimes I don't. Oh god. All right, let's go down. Surely there's a way down. Damn it. There's not even a way down. This was all for nothing. really across the way. Auto does not pop make a sound when blocks are placed directly above it. Needs an air block above it. That makes sense. So, bad luck. Well, that's annoying. I don't know where the chest is. It's on the other side. I want to see what this portal is. Oh, it's so close. So close. Wait, we can do it. We need a bucket, but we can do it. We just need two iron. [Music] Um, can we get piece of iron? Well, this is annoying. So annoying. Do you use the normal keyboard keyboard numbers for the hot keys? No, I don't. I use a bunch of letters. The only numbers I use are three and four. Oh well. Um, Doesn't seem like there's any iron, which is quite unfortunate. There's never any iron though, is there? The goal is sub 20 I guess. Yeah, I guess right now that's the goal. Sub 20. The goal is really sub 30 if we get a decent seed and I want to get consistent at that. And we've we've gotten a lot better at that because we we had we have a sub 30 today. um on like a decent seed. It was an okay seed and like it was the only seed. Well, I guess there was a couple seeds that we died on one seed. Oh, sub 25. Yeah, I forgot. Oops. I mean, even better. I missed a $50 donation before. Sorry, Sway. Oblivion. Thank you. Quick, quick piss, twin. Respect. It was It was quick. I don't know how I missed that. Sorry, I must have been locked in. All right, that's good. Um, all right. Let's go down this cave here. Um. All right. Well, what do we want to do here? is the question. The answer is I do not know. All right, we got our flint. Oh, well, uh, we have all the iron that we need. Do we just dig down? Guess I was hoping there was a better spot. I hear mobs. Well, it's definitely above, but I guess I can just hope. Thank for the gifted subs. Your ace Well, it's a good sign that there's caves around, but it's a bad sign. Well, it's annoying sign that I didn't hit any of them. I don't think there's lava anywhere. The only direction I haven't tried is this way. Nah, there's nothing. Bad luck. Um well, Oh, got a notch apple. Thank you, Sleeping Belly, for the gifted. All right, let's two three is not enough. Another ruin portal though. There's a shipwreck as well, but it's the bad side. So, we don't need the shipwreck. Ruin portal. However, what am I doing? I already have what I need. There could be food in it. Uh well, I mean kind of pointless. There's just no surface lava pools. Otherwise, this would just this would be like a decent seed. But instead, we have to dig down a million blocks, get a stone pick, get an iron pick. Like, just have to reset. Two ruined portals, but nothing good. [Music] Uh, Well, that's unfortunate. take so long to break this. Uh Uh, Okay. If there's water down here, then cool. Um, if there's not, then like there's water over there. Water over there. I want to get these diamonds. Um, all right. Well, I mean, it's probably a reset, but I guess we'll see in a second. Um, I think I'll just avoid the diamonds. It's too too far up. Diamonds here. Skeleton's still chasing me. It's rather annoying. Pretty low right now. Like there's no way there's not lava here. There's just no way. We're so low. We will find lava. We will 100% find lava. It just matters when. And where? It's lava right here. Let's break this so we don't have to deal with this. Oh, the stupid bat got in my way. You're kidding me. Okay. Oh, we got a little bit of food. That's That could come in handy. Uh, I might have picked the wrong side to do this on God. I mean, it's not a great enter, but it's not it's not that bad. If we had food, it'd be okay. Food and blocks. But the problem is we have no food and we have no blocks. I mean, we have very little food. Uh, okay. So, it's that way. The bastion's over there. Well, that's like the worst way it could have been. I'm tempted to just reset. But I'll try. All right. Uh, well, I think we're actually have decent pathing pathing to it now. Not bad. At least these guys are annoying though. Well, it's not what I meant to do. Uh, okay. Well, it's bridge. I think this is a triple here. Or maybe not. Everything stupid. Um well, [Music] perfect. Um, [Music] okay. Didn't mean to do that. I think it was worth Um, you're annoying me. I really want to kill you. Okay. I don't know where everyone is, but I didn't see anyone else, so cool. That was probably worth it. Any blocks. All right, let's deal with this gas real quickly. Actually, we're fine. Oh god, it went down. Why'd it go down? There's not many guys here. Um, so let's see down here. Where is everyone? There you are. Come here. Huh? [Music] Um, okay. Let's Oops. Um, okay. Let's do this. [Music] Uh, let's check this out. Uh, let's do this. Um, Maybe there's another triple on the other side. I don't know. My foot is falling asleep cuz I'm sitting on it. Oh, well, I guess hopefully I get more. Um, there might be a guy up here though. There is. Um, I have fire res. Let's see. I hit you guys. Oh, I'm not wearing gold. Oops. Okay, so there's no I need to get the obsidian from here. I have enough. Um, okay. Let's go. Uh, I don't know where to go. That is the problem. What are our coordinates? Uh, what are our coordinates? We're negative, positive. Okay. Well, um, there's our portal. There's another bastion. [Music] That's unlucky that there's another bastion there. Not going to blind Pearl. Uh, I guess we can go positive. Positive probably. Oh, over there. I'm going to blind I'm going to blind Pearl. No, I'm not. Oh, no. Wait. Uh, let's go over here. Make it easier. [Music] It's just not It's not fast enough. It's not fast enough. I might hit a wall or something. Bey the pearl. It's just not fast enough. Strays. This is good. But the wither skeleton. I would take the wither skeleton out. This could be good. [Music] I have six already. Was that six for six? I need an extra one. Oh god. Wait. Oh my god. That could have been a throw. Seven. 2368 768. Uh 2368 768. Uh so we need to go this way. Had a little bit to my time jumping down here, but Uh, where do we go? 2368. Oh, it's terrible terrain. It's terrible terrain. No, it's terrible terrain. Uh, I think I need to pearl up here. I need to pay attention to my fire res. I have a minute 20 left. Um, I got to go down here. What is it? 2368 768. Such bad terrain. I don't know if the terrain could be much worse. I hit my gap already. It's my last piece of food. No. Such bad terrain. No. It sucks. If it was good terrain, then it'd be good. But I mean, we can't even like It's not even It might It might not even be a sub 30. Yeah, actually. We have to go through the wall. Bad luck. Second ring. Killed it. Yeah, maybe I should have gone. Maybe I should have moved. I don't know. I don't know what I should have done to be honest. I just want to reset. We could get a completion, but I'm just going to reset. Yeah, the only thing I could have done there was pearl closer before building the first portal to make sure I was in the first ring. Maybe next time I should do that, but I don't know. Yeah, I got insane blaze drops like seven for seven, I think. Blaze drops are not increased. It's just 50/50. Yeah, it would have been a sub 30 if I played it out, but I don't care. I don't care. We don't need that practice right now. We're just going for sub 20 or at least beating at the best time. On to the next run. We'll get it streaming two days in a row. Thank you. I stream many days in a row. Probably streamed like almost every day the last like week I just want another seed like the one that was at the very beginning of the stream that I that I threw on. Why can't I have that? What' you study in college? I didn't go to college. I think that's a shipwreck, but okay. I think next time if we got a fortress off a spawn, we go for the fortress. We go to the bastion and then we just we just blind at the bastion. Like maybe when we maybe we get enough obsidian, but the thing is maybe we don't. And if we just blind and then we just we literally just we hope we get the pearls right away. We don't need the fire res, we don't need to travel, whatever. We just like pearl spam. I don't know if that's good a good strategy or not. I feel like it is. I feel like we wouldn't have to go that many blocks and we can dig down pretty pretty quickly. We have a diamond pick. I could have patience, get 20 obsidian, but also like I could just see how far the stronghold is and if it's close. Like I just blind instantly hoping that like like usually I would wait and then decide whether or not to do my home portal. Um but the thing is I just like I just I don't do I shouldn't like I feel like I just if I'm going for a sub 20 I need to not do that. I need to either get the 20 obsidian quickly or blind hope that it's close if the for if I have the blaze rods already. which I feel like it's it's it's good. What's the math behind throwing two eyes and finding the stronghold? Well, basically when you throw an eye, it gives you a direction, like a specific direction that it's going. And there's only certain places like Minecraft chunks and stuff that uh within like a ring that the stronghold can spawn and it has to point towards like this a specific corner. And so if you have a precise enough direction and you draw a line or if you have two, you know, two lines that draw and then where they converge basically um tells you where the stronghold is essentially. It's pretty much just math. 50k viewers. Woo. This happened the other day at 2 a.m. and we ended up with 180k. I don't think that's going to happen again. But welcome to the stream. If you're en enjoying it, stick around. Come on. All right, Savannah Village. Guess we'll check it out, but I feel like it's kind of mid. We could get a bucket in a chest, though, and it make it good, I guess. Okay. All right. I think that makes it worth running here. Um, all right. Go kill the golem. Let's get four ingots from the golem. Five. Never mind. Let's get five. I'll take five. Um, all right, let's just grab a couple of these hay bales and [Music] Grab this tree. Yeah, I will not forget my flint. Don't you worry. Yeah, now we need a lava pool. That's a crappy chest. Um, and ideally, oh, there's a ruined portal here. Um, let's just get this. What am I trying to do? Let's make our bread. Let's make a boat doors. All right, here we go. Okay. Uh, we can't complete the portal. So, we don't need to go down. There's a shipwreck right here. I mean, I don't need it, but it's not that much more. It's not that much further to grab it. There's a ravine right here that I liked. Goes down deep. Diamonds over here. Whole bunch of them. Let's get us some diamonds. What was that? Oh, what the heck? Yo. Of course, we spawn in a wall, but it's okay. Um, let's get a diamond pick. Uh, let's get a diamond sword. Let's get a diamond axe. I mean, iron axe, an iron shovel. All right. Uh this way. Only thing I don't really have is blocks. Like the bastion. It's right here. Hey friends, I know I don't have gold. Almost enough. Okay, I have enough fortress right there. Okay, this is good. I'm going to put this gold on to be careful. Um, let me do this. I already have gold in my inventory. Okay, I'm stupid. But it's fine. Um, I want to come up here and grab this chest. Hello, sir. Come here. Perfect. Um, nothing of importance there. Uh, same thing over here. Um, okay. I don't know if he can get to me. I'm a little worried. Let's just go straight for this. Oh no, it's a bad gap. I'm going to go check this chest. But please don't be a double bad gap. Please don't be a double bad gap. Please don't be a double bad gap. Yes. Thank the Lord. >> Hey Jeez, there's two brutes there. I didn't kill him. I don't know where he went, but there he is. Crap. I want to kill him. Okay. Um, well, the only problem is I didn't There's not many guys here. God, I need more pigmen. Oh god. >> I want all the pigglin to be mad at me. I kind of want to hit this guy, but I'm worried about Okay, now come this way. Wait, what am I doing? Where did I go? Down here. Down here. Hey guys, follow me down. Move. Oh no, I didn't get the full blocks. Wait, what? >> Oh, I already turned them into gold. I was like, where did the gold blocks go? >> Um, perfect. Um. All right. No gold block up here. That's unlucky. Uh, okay. Let's see. Uh, what do I want to do? I need that. Be right back, guys. So slow. I want to grab this chest. I don't think I did. Sweet. Um [Music] question is do I just go now 13. I I think I maybe need to I can home portal. I don't have enough pearls though. Okay, I do. Um I don't have a fire res though. So, I have one uh Okay. Well, I just got to go. I just got to go. I have 16. Do I loot chests? No, I think I just go. I only have one fire res. I really want to save my fire res for travel. Going to the stronghold, which is annoying. Well, there's a wither skeleton there. If we like if I can home portal. Come on. Give us something good. Please spawner. [Music] Two for two. I have a diamond pick. I'm just going to I don't Okay, I got lucky there. I drink fire res. That was a good choice cuz more spawned. [Music] You step out here for a second. We need more still, but it's fine. I can mine obsidian while they wait to spawn. Um, all right. Well, being slow. Okay. that way. Oh god, I thought I could maybe extension it. Did the other one break? Crap. Where' the other one go? There it is. It's -3842128 384 2128. I don't need them, but I got to kill them. I got to break two obsidian and then go. It's what? 10 seconds per piece. I'm going to check my might be four actually. I check to make sure. Yeah, it's four. That's annoying. This adds a lot of time, but hey. 3842128. We're reasonably close. Actually, we're not. It's far. Bad luck. Uh, well, this is not great terrain for what we need. We're also running out of fire res 2128. Well, we're out of fire res. So hopefully we can do this fine. Pretty please. Four 2128 Uh, I really hope there's not lava. It's annoy. I'm 55. I got If I want to be PB or anything, I got to be a little risky at least. unlucky. Um, well, what am I doing? Have 384. Oh, we got so unlucky. It took us off course. No, I was in the right place. It just I'm going to go up to the stone to mine to the side. It's quicker cuz we need to go some blocks this way. That's the starter. We came from We came from that way. It's got to be here. It's got to be here. Wait, I think that was it. Um [Music] What the heck? [Applause] Uh, Uh well that's unfortunate. [Music] My theory was right. Well, I can't. Don't hit me. Please, dragon. Don't hit me. And I'm gonna back up and hit its head. I'm eating. No. Oh my god. They changed the way it worked. They changed the way the boat worked. I would have been in the boat. I placed it and it did the up thing and I still didn't get in it. I still didn't get in it. I still didn't get in it. Oh my god. Why' they change how boats work? Why did they do that? Why did they do that? Why? Why? Why did they change how boats work? If that was on a server, that would have been a boat clutch 100%. That's so annoying. I would have had a PB there. Ah, I didn't know I had no pearls left. That was just stupid of me. This guy used my last pearl. I should I should have known. God, that's annoying. That's so annoying. Like, they change the way you enter boats. It's so stupid. How did I not get in the boat? How did I not get in the boat? Damn. All right, we need another seed. That Wait, to be fair, that was not a that was a a a good Nether seed. It was a crappy overworld seed, right? I didn't have a water, guys. Sharpness doesn't work on the dragon, right? Isn't it like smite or something? What kill what kills the dragon does more damage. I don't think sharpness does anything to the dragon. It's so dumb. Yeah, Minecraft made a change to the way boat like boat Well, they didn't do it for boat clutches, but they did it for boats and like it affects boat clutches. It's so dumb. Like it's a lot harder to boat clutch on the the new versions versus the old versions. And from that high like I don't know though. It's weird. Like I I like froze in midair. Like I I placed the boat and it was like it like I had a second or two and I was spamming right click and I just did not get in the boat. It's such a scam. Such a scam. I just needed more pearls. If I just had one more pearl, it would have been GG. You were too low to pearl. No, if I had a P. Oh, I was too low on health to pearl. Yeah, I guess I was I was muffin either way. That's dumb. That's so annoying. H But there was a lot of things with that. That run could have been I don't know if it could have been sub 20. Well, I mean, maybe with like better terrain. I dug. Wait. Wait, is that the run that I dug through the wall? No, that's not. That had good That had That had good terrain to run. That had good terrain. What was bad about that run? The beginning was bad. Give me two obsidian. Really? Give me one obsidian. You tease me. You tease me with completing this. And there's no lava either. Damn. All we needed was one little measly piece of obsidian and that would have been completable. We could have just gone in the Nether right then. Come here, dolphin. Come here. Come here. Come here. Stop avoiding me. Yes. Um, let's see. Empty map really. No food. That's kind of unfortunate. Um, all right. Let's go ahead and make a boat. Make doors. Make more of that. Uh, I guess actually I could make this Um, I think we just dig down because we don't have one piece of lava. Actually, I kind of have a strategy here. Let's get in here. Okay, perfect. No, no, no. Don't blow me up. Please don't blow me up. No. Mission impossible. We don't have any food. But I rescued the lava. It's so dumb that that there was an empty map and there was no food in the half of the shipwreck chest. Um, I have food though. Okay, the B's kind of far this direction. Um, give us some golden carrots. I don't know. Can the ruin portals have golden carrots? Feel like they can. No, of course. You give us glistening melons, which we really don't need. Take the armor, though. Unfortunately, we're going to be able to sprint soon, though, which does make it a lot more annoying. It's kind of diagonal. Maybe we can take a detour to this red biome. Uh, I guess. Don't hit me. Ghast, you annoying prick. Not a sprint. All right. Well, this became a little bit of an L. Uh, guys, please. Oh, well. Hello, Ghast. Don't Don't see me. [Music] I'm going on a stroll through the Nether. I'm going on a stroll. Yes, I am. I have no food. I have Oh, but I see a bastion. I'm going to walk into the bastion and say hello to all the pigmen friends. They're going to greet me with a smile because they love me and I'm their friend. All right. It's treasure. Let's go. All right. Hello, treasure. I'm here to loot you. This is actually not bad cuz I don't need this. I don't need to sprint that much, you know. >> Um Like ideally I just this guy sees me he sees me. Perfect. Can this other guy see me? Sir, I don't want to jump down there. Okay, that works. Guys, you see me? Gather below. Lava's going to flow. All right, cool. Well, I hear one of you. You lived. Where are you? Now you're dead. All right. Give me food. Oh, there's a magma guy here. Uhoh. Nope. Okay. Yes. Yes. That's exactly what we needed. I mean, we need more food than that, but like we'll take that for sure. All right. All right. Cool. I got our sprint back temporarily. Hello, friends. Get in the hole. Get in my hole. It's time for you guys to give me some loot. You see that? There you go. All right, let's make uh the diamond pick. Hello, buddy. You see me over here? Watch this. Oh, you don't like that, do you? Come here. Um, all right. Let me go ahead and do that. Hello, sir. See this? Yes. I broke your block. You don't like it. [Music] All right. Let's do this. Um, I don't want I don't want to pick off that. Uh, what do I not need anymore? I don't need that. I don't need that. I need food, which means I I'll definitely need to loot the chest upstairs. Um, uh, do we need anything else? We need more obby. But again, maybe the Oh, shoot. Um, I want to get 10 at least. And then maybe I just go [Music] nine. Guys are out of gold. Of course you gave me nine. Um, you didn't give me many fire res potions. Let me just check. Cool. That actually worked well. All right. Sweet. Let's take this back. [Music] Um, well, I'm going to run out of sprint soon, so I do kind of need food. There's some chests in here. Um, well, are there chests down here that are worth looting? You know what? There might be. Um, well, you see, I didn't actually get uh many arrows. There's another chest over here. Uh, well, I actually kind of wanted that, but whatever. I don't need it, guys. Obsidian's in chests, and I need obsidian, guys. There's not obby in the main chest. There's crying obsidian in the main chest. Um, hello guys. Please fall off. There you go. All right. Can I pull off a heist here really quickly? Well, crap. I'm not used to it being on land. Um, but come on. Um, obsidian uh is good enough. We can maybe home portal. You guys are all idiots. All right. I really don't need you. We have 17. Okay. Well, we're going to have to home portal or break the obsidian, but that's fine. Do we see the fortress? I do not remember. I don't think so. Um, all right. Where can we run to? What's the smartest play? I think it's going further out actually, especially because there's an open area. Please. Fortress. Fortress. Fortress. Oh, it's so open. It's perfect. Oh, it's so open. Come on. No. Yes. Oh, what? I don't have any food, though. Wait, I'm throwing pearls. I have no food. Uh I need to throw one more unfortunately. Uh okay. Well, uh I need to avoid wither skeletons and I don't have food. What the muffin? Jesus. Okay. Uh what is happening? This is like the most What? There's more. Jesus. All right. Uh, okay. There's a spawner down there. Come on. Oh, there's no red mushrooms. It's a double spawner. Need to not get hit, which means I need to not stay on the spawner for too long because I'm going to back away from this spawner. Do not want to get hit right off the spawn. There actually might be food in the overworld. Um, so I'm going to go through here. Okay. Well, that's actually really good. Please be on the surface and please have food. No, this is like the worst thing that could have happened. Okay. Well, uh, we will do it anyway. And it's that way. Okay. 3872 2960. We're far. Don't shoot me. Jesus. Uh, we don't need another one, but we do need food. Uh, only problem is we can't pearl. I don't have any wood. Um, all right. Well, this became unfortunate. Oh, get obsidian. I don't have obsidian. Yeah, you're right. Maybe I'll find a ruin portal on the way. It's too slow. Too slow to go back. I need the red biome. Okay, there's red mushrooms here. We need a little bit to go right. Uh I don't have any wood, so I can't I'm out of sprint. We do have to go into this red biome anyway. No, we don't. Uh uh. We're going too far. Oh, we can. God, why is there not just a tree right here? I have like no blocks. Uh, maybe I should just reset. It ain't going to be the best time. Well, no, let's not reset. If I just had a little bit of food, this would be good. But instead, we also we still need like a ruin portal. So, I mean, so if we didn't have to break obsidian, then I'd be much more interested in this run, but we have to break obsidian. So, Um, [Music] okay. Well, uh, all right. Well, now I can pearl. Fire res over here. Well, not exactly what I wanted to do. Make it to the island. Yeah. Come on. 3872 2960. It's right here. Get good practice regardless. I don't have obsidian. Yeah. Well, GG. Could have been a good run. I mean, it was a good run, but it could have been a great run. Yeah, there's no ruin portal right here. GG. [Music] Let's get another good seed. I feel it. I feel like I'm doing well. Um I feel like I'm doing well. I just need to I think if I get a good seed right now, it'll it'll be good. That would have been a sub 30 as well. I feel like I feel like um I feel like sub 30 feels like pretty good to me now. Like my goal my original goal was I want to be able to beat the game in 30 minutes on like whenever I get like decent seeds. Like I feel like I could have beaten the game in 30 minutes on that seed. Like if I wasn't trying to go super fast, I wouldn't I wouldn't have like forgotten about the obsidian, whatever. Like if I was kind of chilling, I think I would have beaten that in 30 minutes if I was actually just like chilling out. Man, I w that was the run where I walked to the I ran out of hunger and I walked to the the uh bastion. Holy cow. I had a chance to be PB when I ran out of hunger and walked like two minutes to the bastion. And I collected the lava from under the cave. 130k viewers. Crazy. Make sure to subscribe if you're watching and you're here. You're unsubscribed. Been streaming pretty much every day. Doing speedruns, practicing for the upcoming videos. Yeah, my goal right now is beating my time and secondary goal is sub 20. Thank you, cowboy. like the stream. Yeah, sure. Like the stream. I think a lot of people are like I think it says 80% of my viewers or something like that are watching from TV. So, they're less likely to chat and they're less likely to like the like the stream because it's like harder. Um, yeah, if you can like the stream, press the like button and get those numbers up. You just joined. Well, welcome SJ BCS. Bro doesn't even read his Twitch chat. I do. I do just read it a little less cuz it's a combined chat and there's there's 120,000 viewers on YouTube and then like a couple thousand on Twitch. So you there's just way more chats on YouTube. Oh, give me a shipwreck. Give me a shipwreck. Give me a shipwreck. I'm going to find a shipwreck. No, it's like a It's not an ocean. It's like a thing. Jesus. Um, okay. What do I want to do here? It goes out to an ocean maybe. I'm just going to go this way. Surely, surely there's a shipwreck. It's dirt. I thought it was wood. I thought it was a shipwreck. It's just a dirt pillar. The one time we need a shipwreck. There's no shipwreck. But this ruined thing could have a buried treasure. So, we'll we'll try that. No. Maybe there's another one. No. Is that it? That's the only one. Unlucky. Unlucky. What is the pearl drop chance? It's the same as 1.16. Don't worry, Dream. I'll always be here for you to say L. Thank you. I appreciate it. and if there was a lava pool here, then I would continue. But even though there's a shipwreck, I don't see anything interesting. We need a We need a shipwreck with lava and then we're getting a We're beating our time. As long as the Bastion I I don't know. Even if the bastion for As long as the bastion is not like terrible terrain, we get a shipwreck and a lava pool, we're beating our time. Okay. Well, I mean, be fair, not a shipwreck like this. That's a caveat. Well, actually, there's uh buried treasures close. It's south east, so it's that way. Interesting. It's probably right over there. Yeah, it is. Okay. W I'm going to do what I usually do. I'm going to take a risk. It'll speed things up a lot if I just go ahead and make an axe. It's a little riskier because we do have less iron this time than usual, but it really speeds things up. And the odds are we probably will get enough iron from the shipwreck. How do you know if it's a good seed? Um, well, there's just ways to tell. Like you're you're you're just trying to find seeds that have the things you need. And if the seed doesn't look like it has the things you need, then it's a bad seed. Like you need iron, you need lava, you need to go to the Nether, you need food. So So okay. Um, well, technically we didn't get all of the iron that we need, but that's all right. We can wood light if we find a thing. Um, all right, let's see. Let's go ahead and blow one of these up here. Um. Oops. Cool. Let's go. We go. We should dig down. Um, we'll go right here. Um, Uh, really don't like that witch. God damn. Surely. Yes, it's lava. Yes, we're rich. Is this easier? All right. Oh, well, it's actually not done. There we go. All right. Well, we have to wood light unfortunately because we So, I guess the the way we know whether or not the initial play was smart is if the amount of time we saved is greater than amount of time we lose from this, which I guess we will just have to see. Um, I think it is cuz I think we just we're going to be sorting our inventory like that anyway. I think it was worth it. All right. Um, okay. Well, I think it's this way. Only problem is we're in a very crappy situation. We're really low. I'm going to go up. Oh, I hear a hog. If only we weren't so low. Oh, sweet. Oh, there's a fortress. Okay, let's do the fortress. Actually, we don't have that much. Is that a blaze spawner? Oh, no. It's a blaze though. God. Okay. Um jeez. Hello Blaze. Actually, I'm going to run back over here and kill you cuz all the wither skeletons are gone. That's a blaze spawner. Need to watch out for wither skeletons though. Oh, this is mayhem. Oh no, I want that blaze rod. No, don't hit wither me. Don't wither me. Ah, okay. Let's just chill here for a second. Okay. [Music] [Music] All right, let's get some food. [Music] Oh god, please run to death. No. Okay, let's get out of that area. Oh, there's more. Oh no, there's a guy here. No. Oh my god. Why? Why didn't I have food? If I had food, everything would have been epic. I just had no food. That was a chaotic like Nether. It was a good practice, but it was a chaotic um uh fortress. It's like you tried to die there. Are you joking? Are you a meme? It's like I tried to die. Yeah, I tried to die to the 100 blaze, five wither skeletons, 10 piglins when I had no gold, five hoglins, two magma cubes. I tried to die. I had seven blaze rods in like freaking five minutes. It was a good run. It just was unlucky we didn't have food. If we had food in the boat, if it was a full boat, then it would have been good. But no, unfortunately. Please give us a shipwreck. We never get a shipwreck. I swear to God, they made it so that if there's a lava pool in the vicinity, there's no shipwreck because why why is there an ocean here and we see no shipwreck? That's like so rare. Um, all right. Let's just cross our fingers. What is that? Uh, is that a shipwreck? That's a ship. Is it a good one or is it a bad one? I guess we're about to find out. I don't know. It's hard to tell. I think it's good. It's good. It's a full ship. Please. Oh my god. He gave us a stupid one iron less chest and no food. That was probably about the worst shipwreck we could have gotten, but it was a shipwreck. I got what I asked for. Now, I should have stipulated a shipwreck that had a little tiny bit of food and also enough iron to not have to woodlight the portal, but it's fine. Someone just said kelp for food. I'm sorry. Please go get your brain checked. Kelp for food. Are you joking? kelp. You have to cook it in a furnace and then even then it does half a heart, half a hunger bar. Yes. Let me just spend an hour cooking kelp and then eating it for the whole entire run. God, you stupid sheep are in a like a sunflower garden. Okay. Well, hey, we need a little bit more wood probably. Um, I guess ideally we need more stone as well. So, got to go down get this. Um, uh, then we can go here. Perfect. We can do that. We need a little bit more wood primarily because we're going to have to wood light. All right, let's get on over there. Guess we're wood. We don't even need to get flint. Uh oh my god, that would have been bad. All right. Well, we orphaned we orphaned a sheep. worst biome to spawn in. But there's a fortress there. And I think there's bastion right here. Yes, there is. It's bridge. I think that's actually not what I thought I was getting myself into when I got in the boat. Good. Okay. Oh, just just screw off gas. Please, [Music] Gas. Just like just leave me be. I don't even care. There's so many skeletons. Everything's going wrong. Okay, let's eat this. What is this brute doing here? You're kidding me. That is so Oh my god. That just like makes me question everything. It makes me so mad. Like, oh my god, the odds of the ravine being right there, the skeleton being on the other side, the skeleton having the arrow primed to fire, firing right as I step up, knocking me in the ravine, and and just like there's no way I can do anything. It's a lava. I can't do anything. I can't boat clutch. I can't do anything. There's nothing. It's impossible. It was a good seed. Oh my god, it was such a good seed. That was That was the best seed of the day. I mean, no, I think the seed earlier was the best seed of the day, but that was the second best seed of the day. But why? Both seeds. Oh my god. It's like both seeds. Something really stupid happened on like that's not Okay, that's like partially my fault. I could have been more careful, but like it's not my fault. It's not my fault. It's so dumb. That is such bad luck. Why does a skeleton spawn in that stupid location? Why is there gas in that same exact freaking place? Ah, I hate it. I actually like and it makes me want to quit. Who's a genius? Go to the Nether with no armor. I go with diamond armor. All right, genius. Go to the Nether with diamond armor, genius. You can finally you can live because you have your diamond armor. and pass on your high IQ to your your sons and daughters that also will go to the D that will that will also go to the Nether in full diamond armor. I really need a good seed to cheer me up. Otherwise, I'm just I'm quitting soon. I need a good C. Otherwise, I'm just going to leave. There's just no lava pool. There's no blacksmith because there's never blacksmiths. Like, I don't even care about this dude. Um, Do you think they'll give you a sticker when you get out of surgery? I don't know. Maybe a sticker. You did good. Good job. You survived. guys, every time we get a seed, like it's so annoying. I don't I honestly I don't I think if we if I played that seed 20 times, like that that that probably wouldn't happen any other time. Maybe something else stupid would happen next. But like that just wouldn't happen. It takes the skeleton spawning there, the gas spawning there, it takes me doing the boat like down instead of saying hi. I just voted down because I was like, \"Oh, I thought I thought it was like a quicker thing. I could have stayed high, but I decided not to stay high.\" And then he takes the lava ravine being there. Me deciding to take that route, me instead of me like missing the gas fire back instead of hitting it. Like, oh my god, it just like all of those things at once. But it's so annoying because it's just it's like crap. We're not going to get that good a seed with a bastion, a fortress, and then a lava pool, and a shipwreck. Like, we just we need that. Like, why? I feel like if I had a seed, the only the only thing that's annoying is that if I had like a seed wall, I would get seeds like that way more often. And there's just no version. There's like there's not even that is annoying. Always complaining. Well, of course I'm going to complain whenever I die. What do you mean to do? Just sit there and be like, \"Well, guys, we died. That was an awesome run otherwise, guys. You know what? Let's just move on. We don't want to complain. Come on. Complaining's for for losers. Guys, we're positive. That was awesome. Guys, what you want me to be like a You want me to fake it? You want me to fake it? You want me to be like a psychopath that has no feelings and empathy? Well, guess what? I have feelings and they're hurt because I died. Yeah, this is the best shipwreck. I'm drowning myself. Go, go, go, go, go. Speed on. Wait, what the heck? There's a massive pillar outpost. It's like a pillar of your mansion. Come on. Give us a blacksmith. No, there's like two houses. That's it. Oh my god. There's like two houses. We can go to the outpost. There's There's one There's two three iron golems over there. But like there's no lava pool. If there was a lava pool, then It'll be good. I'm just leaving. I need a lava pool. Is that a ruin portal like underground or am I tripping? It's like under that sand or something. We'll dig there. We'll see if we have x-ray. I'm just not going to find it. And this is crappy. Come on. H. We got a lava pool, but nothing else. We can mine maybe. This looks promising. You want to avoid taking damage if we can Okay. Uh well, do want iron. I don't want to take damage. No. Oh my god. Oh my god, Minecraft sucks. I hate Minecraft. I'm quitting. I hate it. It's so bad. Okay, let's just get a good seed. We really want a good seed. We really want to get one right now. Jimmy, you're muted. I'm just not talking. I'm just not talking. Not muted. I'm just not talking. Just not talking. Cuz I'm talking and then I'll be mad. If I'm mad, then I'll be extra mad. Hi Dream, how are you? And I love you all your manhunt video. Thank you. I'm pretty good except for these crappy seeds. Yes, finally some some good lunch. And we're going to go ahead and take a risk. Um well, actually the reason I wanted to do that was to do this. It's not as big of a risk this time, but it's still a risk. All right. Well, I wish there was a lava pool. I don't see anything on this map. I'm going to go more to the edge of the map, though, because we can see if there is one. Could any of that be a lava pool? Do we think any of there's any lava pool visible on this map? Do we think? I don't think so. Go down this cave. I don't have food though. I guess we have a little bit. Uh, let's go ahead and do this. Okay. Well, no. This is We're digging down from so high. It It's going to be faster to just find somewhere else to dig down. Maybe even in the ocean. right here. So slow. It's so slow. I mean, it's not that much better here or whatever. Uh well, Holy cow, I almost broke that block under me. Well, we don't have much uh food. Well, there ain't no ain't much of anything anywhere. I don't have gold either. There's a decent amount. Ah, my foot's asleep. I was sitting on it. Ah, it's asleep. Okay. Oh yeah, there's definitely a B this way. Well, it's probably far though cuz there wasn't that many entities. This is far. Oh no. It's going to be like in a wall. No, no, no. Okay. Hello guys. Really don't want that guy. Okay. Um. Oh god. Get down. Sweet. Buddy. Get over here. Come on. Um, there still is more of them. >> Get over here. Okay. Come on. All right. Is that all of them? Uh, okay. Well, that's good. I like that. That's also good. I approve of that. Um, there should be single chest up here. How did you see me open it? I don't think you I didn't think you could see me from there. Um, there's some stuff here. Okay. Uh, what do I want to do? I want to go down. Let's go and make a little bit of gold. Okay. Should be fine. These guys aren't mad at me. Oh, you're so annoying. I hate you so much. How are you still alive? All right. Um, all right. What do we need to do? I want to come over here and get in. Sweet. There a little baby here. Go away. Perfect. [Music] Get in there. Come on. Go in, idiot. Where? Um, okay. We not need We don't need that. Uh, what do we not need? Let's eat. Uh, I mean, we have so many golden carrots. We don't need the pork chops. Don't need that. Need that. We don't need that. Um, perfect. Um [Music] uh um there could be more obsidian out in the chest, but I still need more pearls. Um I can come back cuz we're right here. Oh god. No. Oh my god, I splashed it with fire. Why was there a brute there? He wasn't there when I went in. Ah, I'm like rage baiting myself so hard. I splashed him with I splashed the brute with fire res. Like that is so I didn't I don't even know why I didn't think about that. You are such a rage baiter chatter. You said the problem isn't always about seeds. I didn't say anything about the seed. That was a good seed. That was a good seed. I just I just threw I mean I wasn't going that fast like we needed six more obsidian and more pearls but hey good luck your practice stream coming for your next man hunt. Thank you. Thank you for the dono. All right, there's a lava pool here. So, we're just going to get a bucket and then go. Like, surely it's not worth it to stay and get more. Surely it's not like to do to get the bucket trade. Okay, maybe it is. I actually do not know. I mean, it might be. Guess we can see. Um, I mean, there's already a barrel. There's a farmer right there. If he has the wheat trade, I'll definitely do it. And if this guy drops five, four. Yes, that's what I meant. for please have the we trade. No. [Applause] Is this your thing? There's more farmers. [Applause] I hate these guys. so much. I hate them. I hate them. >> Hey, come here. >> Where is he going? He's like going on an adventure. Like this just take so long. It's so annoying. No, he found another job already. Bro, come here. Ah, I hate it. I hate it so much. Um, what am I doing? Okay. All right. Uh, boat pickaxe. So, we need flint and steel. >> This is stupid. [Applause] Um, I'll look for gravel, but I'll also just get wood. Surely there's gravel somewhere. All right. Okay. Um, we don't have gold. There is a bastion. I do think it's reasonably close. There it is. And we don't have gold, so it's another like housing or stables or something, I think. Hard to see. Okay. Um, let's see. Uh, all right. Okay. Well, this is better. Hey friends, I'm coming over here. Perfect. All right. Well, uh, this is annoying cuz they probably Um, am I being stupid? Okay, I don't know what bastion this is. >> Okay. problem is that um be wary of brutes. Um, all right. I don't know. Well, that's unfortunate. I don't know where. Um, well, hey friends. All right. What? Okay. Well, I didn't I don't like that there's no block behind them. That was an accident. Oh, I placed it. I think. Oh, no. I know. I know what it is. There's a block there or something. I don't know. Yeah. Jesus. Whatever. Can't I place that? get in there. The very least I can or whatever. Okay, that's fine. Let's just do this. [Music] Perfect. Take that. I picked up the gold. [Music] Okay, I need sticks. Um, what else do I not need? I don't need need to make this in case this breaks. Need to make a bow. We didn't get We didn't get everything we need. Is there more gold? Nope. Uh uh. Well, I'm going to go up. Uh there's a lot of them. There's some gold out here for sure that I can get. Um that was almost really bad. Um, what I want to do is come to this chest. Uh, sweet. We just need gold though, cuz we need more uh pearls. Okay. Well, uh, let's just go drop this on them. Hope that it's enough. [Music] Please. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Um, crap. I didn't get that many like fires or anything. Um, all right. Which way do we need to go to try and find a fortress? We need to go whichever way is going to be the quickest. Probably this way. Um, just throw a pearl over there. Which direction is that? I don't even know. We got to get out of the quadrant. We got to go this way. Um, land. Uh well, I don't have that many pearls, which is annoying. This is all the pearls I have left is 14. Got to get into the uh regardless, we're going to Um, okay. This fire in my face is rather annoying. Uh, fortress. Um, there's a spawner right there. There's another spawner right there. Thought that was a wither skeleton. It was just like smoke coming off the blaze. [Music] Mhm. [Music] Oh, no. No, no. [Music] I need to save my fire res. [Music] I don't know how many I have, but six. could be enough. Okay. I don't know where this one went. 1664 912 and that's all I need. 1664 912. If we get good nav, it could be good. We have no good nav. I mean, we need to go the opposite way, but we can run down here. Um, actually, this could be good. Yes. Keep leading me this way. Yes. Yes. Yes. Yes. Yes. Yes. Go left. Go left. Go left, please. Yes. Holy crap. That is epic. That is epic. Yes, that is so epic. Um, well, thought I had diamond pick. I guess not. I mean, this isn't going to be beat my record, I don't think. But No, it's not. It's not. But um good practice though. This is the starter staircase. That's a dead end. I don't like this. I also don't like this. This going down. Um, maybe it was the other way. This is going to be it. This is going to be it. Yes. Well, that's my last pearl. Hopefully there's not another end island that falls off a cliff. Um Um Well, actually meant to get this one. Yeah. I think I got it. [Music] Hey, what's up? [Music] Hey. [Music] Uh, okay. I mean, it was good. Wasn't terrible. Heat. [Music] Heat. [Music] [Music] Yeah. [Music] Not another sub25, but I mean close. Come on. It was a good run, but I think getting to the fortress was rough. Running out of pearls was rough. I don't remember what the beginning was on that, like what the beginning of the seed was, but I don't think it was that that epic. I think we had to dig down or something. Hey, we got we got a bunch of good times today so far. Oh, the goal is sub 25 now. Yeah, that's funny. Well, hey, we completed under sub 30 again and again. We keep doing it. Why don't use the bed strat instead of the arrows? Um because I have no one I'm doing no one cycle. Yeah, I mean obviously it would shave off a couple minutes just from one cycling obviously, but you spend too much time in the bastion. Yeah. that time. Well, that time I definitely did. Um I don't remember what I did. I think it's because I had loot the chest at the top. I don't remember. But if I hadn't done that, I would have had 20. I think the problem was I ran out of gold. Yeah, that was the problem is I ran out of gold. I had to go I'd like run to get a gold and that added like minutes. Could you please go under 20 minutes this time? I'll try. I'm trying my best. All right. Um, we got a lava pool. If we have iron nearby, we can smelt and get a decent enter. We'll just see. 170k viewers again. That is insane. Um, where is the cave? Well, I have to get a sub 20 for you guys. You have to stick around and see it. There's too many viewers to not get a sub 20, right? Where the heck is a cave? Surely there's going to be iron. Let's get a new seed. We need a better better seed. Yeah, we had the mo we had uh we were in the top 10 most viewed live streams with one of our last with our last with like two live streams ago. Saw a tweet about it. The other the other like top live streams were all like esports events and stuff and like the game awards other than CreekCraft. Creek had big live stream but pretty cool. Pretty cool. Yeah, with that Nether we had earlier when I threw it away at the very beginning of the stream. Oh my god, that could have been so good cuz like we had a 100 piglins and it was bridge and it was like oh my god. And then fortress was right there and we already in like it was 8 minutes or something like I don't remember the timing that that had like that had sub like sub 15 potential like actually like we got good pearl trades that was like potentially really good. I think it probably wouldn't have been a sub 15. But it could have been it could it definitely would have been sub 20 if we like actually did everything right because I was already in the bastion with 100 piglins trading with all the gold from the bridge at like I don't remember how long 8 minutes or something or less and for and saw the fortress across. Let's see if we can beat our peak viewership record. We're pretty close. We only need like 6K more or something. Stick around. See if you become a part of the the moment. I think we only need to get to 200k to be one of the most be the most viewed live stream uh this month or something. There's a blacksmith. This could be pretty good. There's a lava pool over there. There's a ruin portal there. We got flint. We have three extra iron here already. I feel like this this could be a good seed. It's just the travel is annoying and the fact that there's no wood because it's a desert. There's lav right there. Travel was half solved. >> Okay. Well, that doesn't really help us. Um, we need a tree. I want the gold chest plate. So, unfortunately, iron chest plate, you're getting left in the dust. Get one more piece of wood. All right, we can go with this. This is fine. Need to kill the iron golem. Uh there's hay bales, which is also good. There's cobblestone behind this. I'm going to grab, but I want to kill the iron golem first. I should have made a gold axe. That would have been uh that would have been good. I don't know what I'm doing. Being slow. That's what I'm doing. Uh okay. Let's do this as well. Come on. Kill the iron golem real quickly. Feel like a wooden hoe does like no difference almost. >> Wow, he hit me from far. Come here. Perfect. Got everything we need. Let's There's water in this well. There's this here. Uh, okay. Let's uh Oops. No, that's not what I want to do. Bread. Uh, that's all we need. Um, let's see. What else do we need? I'll make this for blocks in the Nether. And then I think that we're good. All right, here we go. Here we go. We're off to the Nether. All right, here we go. [Applause] A whole bunch of blocks in half a stack. Tell me it's close and not this direction. I mean, we hope Well, there's a whole bunch of lava flowing down here. I had to jump. Otherwise, it would have been a lot harder to get across that. Oh my god, there's just lava flowing from everywhere. I can eat a gapple, so it's fine. Um, well, it's not fine if this guy trucks me. Okay. Yeah, there's there is a bastion this way based on the anti count, but it's far at least decently far cuz it didn't load in initially. It's probably like 300 blocks. All right. I think I saw it to my right side. Yep, it's here. Treasure. Um, okay. What do we want to do here? Say we just do what we've been doing successfully. Be weary. [Music] There's a guy here. Um Okay. Are there any more chests? I don't No, I don't see any. Um, okay. Well, oh my god, I [Music] I'm dead. I like slipped off the edge. I slipped off the edge. Like, what is wrong with me? I want to see I want to see that again. I actually like don't know what I did. What the muffin did I do? I'm actually just watching the stream back. I don't know what the heck I did. What did I do? All right, placed a block there. Oh my god, I slipped. I just slipped off the edge. I think my I think my shift key just like I let go of my shift key. Oh my god. I just I just throw. I just throw. I just throw. Every time I get like a really good seed, I'm just I just throw. Every time I get a good seed, I just throw. Like it doesn't even matter. I just throw. Like I lit literally I just let go of my shift key. Like I was shifting on the edge of the block and I let go of my shift key. The seed was mid. The seed was not mid. I mean it wasn't honestly it was not amazing but it wasn't mid. I mean we're in the bastion at his treasure at 7:30. Like that was that's really good. I mean we spawned in and we got a blacksmith that had some armor. But that's so dumb. I mean yeah it is the point of practice. This is the point of practice, but like I just let go my shift key. Like Jesus, my ice cup is empty. It's empty. My cup of ice. Skill issue. Not going to lie. Yeah, it was. That was a skill issue. I literally just let go of my shift key. Like what am I doing? I just I just panic. But that wasn't even panic. I didn't feel panic. Like I don't know what that I don't know how I did that. I I just I'm so mad at myself. I don't know how I did that. I don't know how the heck I did that. I wasn't even panicked. Like I felt fine. Like I wasn't like nervous or whatever. I was like I felt perfectly fine. I felt normal. I just slipped. True obsidian, please. Please. No. It never has it when you need it. Uh Okay. What do I want to do? We don't have any food. Uh, well, we need iron and food and a lava pool. We can go down here. Can we mine iron with this or no? Okay. Well, there's a cave there. Oh my god. Oh my god. [Applause] [Applause] Um, okay. Well, all right. Uh, what do we want to do here? Uh, I want to go down, I guess. Just have to wait for this, I guess. Um, okay. There's lava down there. We don't have food, but it's fine. We can get some in the Nether. Hopefully, I mean, let's just wait only for the We have the fire charge. We don't need the flint and steel. We'll get fire charge from trades unless we just forget. But I think we will not forget. Therefore, we can just Well, I might as well get the iron. It's right here. Uh, boom. It's fine. Um, Um, there's So close bastion maybe northeast. We don't have food though. Oh no. Is this just what? Oh my god. This is what caused fancies. Surely Oh my god, there are so many. Oh my god, that was it. Okay, well then where is it? Um, I'm out of sprint. I have no sprints. Okay, this is a real bastion. It's probably far though. I don't know if I just reset or I mean, we walked to the last bastion and we got on that on that run that we finished in 25 minutes or whatever. We'll just see. This is a slow run, guys. We're going on a stroll through a forest. It's a friendly forest. Um, we got to go more left. Red biome. That could be good. We can get some hog meat. Perfect. Screw it. Let's just throw a pearl. Why not? Why not save us some time? We'll take damage, but like let's just do it. Here we are. We made it. Now we're going to have to walk all the way through the bastion. And it's a stupid bastion that I don't like. Okay, let's go for a little walk. We don't have We have gold armor, so that's good. Um, let's just go ahead and take a peek in here. Do we have food? Let's block this off cuz there's a brood up there and he killed me last time. Um, no food. That's not good. Okay. Uh, let's Oh, there's going to be a brewin there. Well, that sucks. Um, we need to get a chest out here or kill a hog. Oh, well, you can cross a Oh, god, there's another one. Yes. Why are you killing me? Oh, you're not, sir. I need that pork chop. I need that pork chop. Yes. Yes. Now we can sprint. All right. Hey, Brute. You're an idiot and I hate you and I'm going to kill you. Okay. Um All right, there we go. Can we get another another chest up in here? Cuz I I don't really I mean, I don't mind taking this gold, but then people are going to be mad at me. [Music] [Music] There's so many of you. That was lucky. Oh, well, I ran out of blocks. Okay, here's what I want to do. You guys still mad at me? Surely not. All right. Oh, it's going to burn. Well, there's no point in doing it. Well, I guess I can do this. Okay, this is not going to work. Okay. Oh my god, this is chaos. Can he hit me here? He can definitely hit me here. If I hit him, he'll hit me back. I don't know why the mechanic is that, but if I hit him, he'll hit me back. So, I have to do this. No, no, no. Why'd it flow? I did the same. I have no food either. I I was doing it the same timing. Why did it not flow sometimes and flew the other time? Ah. I hate piglin brutes. I hate piglin brutes. I hate piglin brutes. I mean, it was a bad run anyway. Like, we had no food. We had zero food. We had nothing. We had nothing. Look, I'm we're we're having a good run soon. I can feel it. I can feel it. Oh, there's a whole bunch of rage baiters in chat. There's a whole bunch of rage baiters in chat. if it weren't for those meddling brutes. Like I can't I I I clutched like three or four times in a row there in epic in epic proportions and then I died to a brute. No, I'm sorry. I died to my own lava when lavaing a brute because they they can reach you through like a foot trap for some reason. Um, can we get a good run? That's That's the real question. I don't know. We had a bunch of good runs today, but We haven't had the elusive sub 20 or sub 23. Door button to stop lava flow. Yeah. Yeah. Do I have a door? I don't know if I had a door. I should have thought about that. I thought I could just time it, but it just ticked at the wrong moment. The lava tick. All right. Well, there's a lava pool here, but because there's nothing else because there's never anything else. Take a No, just we'll get We'll get a stream. We'll get a thing with a lava pool and I don't know, a shipwreck. We'll get one. 180k people saw you choke. Shut your mouth. messed up most of the good ones. So, yeah, I did. I've choked, but I've done that most days as well. I think it makes sense though, like you're under the most pressure. You're trying to go the quickest because you want to get like I want to get like really good time, you know? It's like if I get a god seed then I want it to be like a super super good time instead of like just a better like I don't know like I can take it slow maybe on like a really good seed and beat a sub 23 but then like I'm like holy cow this seed's so good it could be you know sub whatever so I'm going like extra fast and then I end up choking When you do fortress first, change your game to peace mode. Peaceful after that. Well, I can't. I'm not changing the difficulty because I can't do that in like videos. Well, this shipwreck chest sucked. Maybe there's a nearby buried treasure though. Not really. Check it out though. Where's a village? Edge. Uh, all right. Well, I think the ruin the buried treasure is over by that village. Maybe there's a lava pool in the desert. There's just no I feel like the desert should have lava pools, but there's just never any lava pools. Hey friends, here to take some hay bills. Am I able to see a lava pool on the buried treasure map? We do kind of need the iron golem. We don't need him, but he would be pretty helpful. All righty. [Applause] Surely there'll be a lava pool on this map. Doesn't seem like it. There's no lava pools. Um, well, I don't know if I just reset. I mean, it's already at 4 minutes and yeah, I'm just going to reset. PB means personal best. That is indeed what PB means. Good thing is guys, you guys have seen the progress that we've made. We've made a lot of progress. And um I think that I feel I feel good right now. Like I feel like there's a bunch of stuff that I want to like research and things that I want to um you know practice and plan unrelated to I guess speedrunning and PvP for manhunt. But I feel like we've we've done a lot and I I really think that we can beat six hunters. Like I think I think we can. I feel like uh I I want to I need a lot I just need more just more reps I guess of like to you know die to more stupid stuff to prevent those stupid deaths. Um but I feel like in terms of efficiency, speed and like knowledge were we're we've progressed a lot. We're beating it in under 30 minutes pretty much. Like if we get a decent seed, we we we beat it in 30 minutes or less. I mean, we actually I feel like recently recently we when we get a decent seed, we beat it in 25 minutes. And we've had what two 25minute finishes today. We had one yesterday obviously with 23 minutes, but we had one today that could have been, you know, 26 27 that we just quit on because it it was clearly not going to be PB. doing pretty good. Yeah, we're being consistent except for in the really good runs. Like the really good runs we end up throwing. Yeah, I'm waiting for a 20 bomb as well. Like that's the next step. It'll really show the progression. What is a spawn? I didn't know you could spawn inside of this crap. That's kind of funny. Come on. Add music. You can use your own music. I I don't put music. I don't play music. That way you guys can add your own music if you want because if I have music and you're trying to play your own music, then it's like conflicting. And I don't like that. Like I feel like I want to be able to have you guys be able to, you know, just just have this on in the background while you do something if you want while you do whatever you work or you do school or I don't know. I don't need to be the star of the show. It's okay. And then whenever I get a good run, that's when you need to lock in. Cuz we need to lock in and grind. Um, interesting. Got to go get this tree. You did say that. Let's see. Uh, let's see. [Applause] [Applause] All right. Now we can get this buried treasure for food. Don't really need anything else, but food. Food food would be helpful. We need a lava pool, but I mean like food and a lava pool and we'd be pretty good. Oh, it's north. What am I doing? Oh, is this buried treasure like the opposite way? Uh oh. So, it's like way over there. I don't know if it's worth it to get then. Well, I guess maybe if we go ahead and if we're going to go underground, which I guess uh we probably will do. We need food. I guess we have to. I thought it was over here, but I guess not. I guess it's the opposite way. It's probably right here, though. Playing for 7 hours straight is not that good. You have to rest. What do you mean? I've played for 11 hours straight. 12. Oh, it's a chicken. I thought it was a lava pool. Um, okay. Well, we only really need the food. And there's just no lava pool. Like, we're going to have to dig down. And we're already at 4 minutes. Ah, I hate it. I hate how rare lava pools are on this version of Minecraft. I don't hit a cave. Huge cave in a second. We're in biome. Lush caves. Surely. Surely there's another. Okay, we're on a beach biome now. We're not in a lush cave anymore. Guys, where is this buried treasure? I have no idea. I feel like I've been searching for for it forever. Man, we got diamonds. It's like a seven minute enter. Kind of trash, but um crap. That's not what I meant to do. I didn't get a flint and steel. It's slow. So, if there's not a bastion here, but this is an open nether, so it's good if there's a um there's a lot of striders out there. I like um northeast. Where's the buried treasure? We're finding it in the Nether. Well, this is just terrible terrain. Uh, I mean, it's annoying cuz it's just bad because we need to be like in in the bastion already. Um, uh, I mean, if we're like really quick, which we're usually not in bastions. There's too many brutes here. That guy's annoying. I hate stables. Hey guys. [Music] Mhm. Huh? Huh? Um well [Music] beam Uh, all right. Well, We don't have pearls yet, which is quite annoying. There's two obsidian which is also quite annoying. Okay, we have pearls. Um, we don't have much food either. Uh, I mean this is this runs that I think. Check the other chest. We don't have We have a We have 11 and we have like not enough pearls and also very low obsidian. We could get an OP obsidian chest here. um there's more gold there, but like well I mean I was just cooked either way. No matter where I went, I was cooked once I fell in that hole. I mean it was that run was sucked. That run sucked. Didn't was sucked. Run portal. Brown sheep. That's a shipwreck over there. Maybe. Um, okay. Well, we got a little bit of wood. There's a shipwreck. Looks like it's probably a full one as well. This portal looks kind of good as well. No. Um, okay. We don't need it, so we won't get it. Uh, but Oh my god. Oh my god. I did not mean to make an iron hoe. Why did I make an iron hoe? What is wrong with me? Uh, okay. doors. I mean, we can get some of this here. I already have a flint steel. I don't even know what I'm doing. Let's get one more piece of wood. All right, let's check this chest. Actually, that's actually a decent chest. That is shocking for us. Okay. Um I want a good place to go down. Okay, you over here. Really? There we go. Well, I mean, that's still kind of stupid. Gold. Ah, digging down. Always taking up so much time in the speedrun. That's a W. Come on. Give us three. That's three. Three. Yes. It loves us. Minecraft is awesome. I love Minecraft. The best game that is ever invented. Lead me to lava. Not single source. Um, lead me to lava. No, surely there's lava in this lush cave. Oh god, there's a creeper. There's a couple creepers. down here. Lead me to No, you're a witch. Lead me to lava. Oh, I can smell it. There's lava down here. I can smell it. Where the honking heck is the lava? You're joking. I mean, seems like an L, but we got two iron. So, maybe there's a blacksmith. That's a blacksmith. Please give have something good. Have something good. Give me what? You son of a Why does a blacksmith have apples? Come on. How long have you been alive for? Only seven hours. Actually, blacksmiths do have windows, so your apple joke doesn't make sense. Where there's a dolphin here. Okay. The shrine portal could be completable. Wait, this makes us be able to breathe underwater. This helmet, this is W. There's a shipwreck here. We don't have any wood, though. Um, and this is where doing this makes sense for once. Okay. Uh, let's go ahead and do this. Uh, um. Okay, let's do that. God dang it. All right, it's empty buried treasure. Okay, let's go ahead and sort this out. A boat, make doors. Um, I mean, that's good enough for now. Well, let's hope there's no crying obsidian underneath this and both obsidian. That would be a W. Obsidian. Obsidian. Yes. Okay, then we can do this. Okay. Um, let's go ahead and do that. Um, Well, there's no close bastion, which is rather unfortunate cuz we need food. Um, which way is the best way to go though? There's just no close bastion. There's no entities. [Music] Um, I also didn't I don't have lava, which is kind of annoying. Go grab lava from here, though. Um, I mean, there's just nothing. There's a fortress way over here. But we have Okay, what do I want to do? I want to grab this. I need to get food. Maybe I can kill this hoglin real quickly. Oh god. Well, so worth it. gives us a lot more. Problem is, we're kind of cooked. We have the fortress, but we have no bastion. There's no close bastion, which means maybe past the fortress there'll be a bastion. Hopefully, we have to hope for that like in the next quadrant because there's no entities. And there's a bassalt delta which is not good for us. Um I actually don't know where we go to go to the fortress. Oh well. What is the best way? I think it's two fortresses. Um, okay. I hear a blaze spawner, I think. Oh god. [Music] I can't even kill him that fast. I'm just going to die. There's too many. I think I have to leave this place spawner. I'm going to get black stone so I can get a stone axe cuz I just can't kill them very quickly. Is there another blaze spawner? Oh god. I think this being here is bad cuz it's it like lowers their spawn rate. Hey, come here. If I get hit, I'm dead. Maybe I go back and try my luck. Oh god. [Music] No, another one spawned. Ah. They're like out of sync. [Music] No drops. Ow. Out of my reach. I mean, this is stupid, but okay, we can go. Uh, now the only way that we do anything is if we need more brown mushrooms. But, uh, we need there to be a bastion if we just keep going this way. Need to get lucky with the bastion and also with brown mushrooms. I don't know why I didn't shift at all. I just thought I could make it. I thought the I thought the boat was going to make it. I couldn't see the blocks underneath. I thought there was more blocks. I mean, it was a cooked run anyway, but that's so funny. If I was playing safe, I was going for aura and then it just was negative aura cuz I missed. Uh like I thought it was easy. I thought it was an easy gap, but no. Oh, that was so promising. Are you a meme? Are you actually a meme? Are you being serious when you do you actually think that or are you just like rage baiting me? That was promising. What was promising about it? We didn't know where the bastion was. We were 10 minutes in the run. We had no food. We had no blocks. We were boating away from a fortress going to the second ring because of how bad the bastion luck was. What do you mean that one had potential or it was promising? It wasn't promising. There was no promise. The only promise was between your mother and your father. And your father broke that promise. And you should be ashamed. The boat is so far. Jesus. What is this ship? It's a broken ship. All right, here we go. I apologize. I took it too far, guys. I I didn't mean it. Okay. I say we just go straight down. No lolly gagging around. No wasting time. Well, All right, I'm sitting up in my chair. Let's hit some lava right now. Well, I mean, not like No, don't hit lava. Let's hit like a lava pool, but not like where I can be fine, you know? Like I don't fall in the lava, but Oh, Jesus. Okay. Come on. Show me the lava. You're such an idiot. Oh, you're rage baiting me, aren't you? Okay. Oh, I hear lava. I hear lava. Oh my god. No, there's no close bastion. Hey guys. [Music] >> Um, where? Oh, where? Okay, let's Oh, well that's not what I meant to do. We have no food. Once again, we just took so much damage cuz we're a stupid idiot. All right. Um, there's no closed bastion. Like, this is so bad. We can never get a closed bastion when we have a quick enter. It just doesn't they don't pair together. Quick enter always pairs with close fortress, but never with close bastion. When ideally we have a close bastion when we click enter because we need the food. I'm willing to see. Let's uh do this. We can get some blocks. Um, sweet. That saves us time for sure. Don't shoot me, please. I really need to avoid skeletons. What? The fortress is in the bastion. Okay. Don't sell. Don't sell. Don't sell. >> Only problem is I have no gold armor. I can get it right now. I can get it right now. Perfect. All right. First things first, we make gold armor. Let's just throw some gold over there. We really need food. We better hope there's like a triple. Oh no, the fortress might like override it or something. I don't think it is. I don't know if either. No, I don't think either is a triple. That's actually bad. Um, okay. Well, we can use this pathing. Um, what I want to do probably is Jeez, I need to like rage bait these guys, but I can't rage bait them. >> No, it's there's no triples. Hey guys. Hey, come in here. Guys, [Music] [Music] yes. Perfect. Um, well, this is a bit of a problem because I need these guys to come get here. Come here. Get in. I don't want to rage bait these guys until I have food. Okay, that's good enough. Guys, I'm going to rage bait you over here. Come here. Oh, well. Where's the other guys? Hey, come here. I don't know where the other guys are. This is not going to be fast. Um, okay. Let's grab that at least. Hey, buddy. Come here. Why are you running? It's a stupid pig. Okay. Um, let's make a bow. Uh, throw some coal here. Is there more guys over here? Nope. Guys, come here. Don't shoot me. Whatever. Okay, we really just need obsidian. Oops, that's not ideal. We need fire res. Um, we need obsidian. Uh, Okay, let's see if we can do the blaze here a blaze. We need to get to the open area which is over here. There's a blaze spawner right there. Only problem is we don't have obsidian and we didn't get like a triple at all. So I I there's one more chest maybe we can check, but that's pretty much it. This guy's taking up a spawn, which is annoying. We just have no food. Like, this is not Hey, guys. It's not going to be PB. We have no food. Can't pearl or anything. Like, the only way it would be PB is if we get really lucky um with the chest. I mean, we have seven. [Music] Where did I come from? Up here. Um, they're still trading. I mean, so many not enough obsidian. I need to go and check um I need to go and check the other chest. Be careful with my health. There's a brute right there, which is annoying. [Music] food. No, no obsidian. No food. Um, is there chest down on the side of this one? Wish I knew the bastion slightly better. [Music] I can't remember if there's chests down there. You guys know? Check here. This chest. Can't remember if it can have food or not. I don't think it can. Uh, got mushrooms, bro. Leave me alone. Where are the pigs? I almost got sniped. [Music] already checked this [Music] uh Okay. Well, we don't have we don't have enough [Music] we don't have enough obsidian. And then we could we could pearl, but the problem is we can't. I mean, the only thing I can do is blind, I guess. Move, idiot. [Music] Um, of course it's night time. Some sheep over there. I don't even have a sprint. I don't need those. 608 1584. We're not that far. Actually, I should have blinded earlier probably. Honestly, I should have just blinded earlier cuz we're in the first ring. Um, I have more food. Let's kill one more. Okay. Uh, we need to go to 608, which is this way. 1584, which is this way. Go quickly. We're able to have food. Jeez, I got the seeds. Oh my god. Oh my god. It's still super far. Bad luck. Uh, was I fine? No, I wasn't. Okay, come on. Surely I'm just going to I think it's I'm going to hit the stronghold anyway. I'm off the chunk. But I mean, uh, okay, I can go back on the chunk now. Uh well, it's just trash. It's just trash. It's trash. Would have been epic if we had good luck in the stronghold. I mean, in the bastion. If we got the obsidian, it would have been epic. It could have been, I don't know, sub 20 or something. Um, that's the starter. Nothing there. Well, it's got to be like right here. Well, I guess it literally has to be down here. Oh my god. Um, well, I mean was promising. It was promising. No food. I hate you, dragon. I hate you so much. What the muffin? Okay. No, no, no. I have no sprint. [Music] Uh jeez, this is far. Okay. Well, dragon, please don't hit me. No, I knew I was too close. All right. Hey, it was a good run. It had potential, but I mean, it just got to a certain point. We had to pearl, so we had to use all our food. Very unlucky. I could have still finished it out in sub25 though. I could have still finished it out in sub25. There's a shipwreck there and it maybe there was there could have been lava or something. I'm going to go back. There's lava. Holy cow. I'm glad I'm glad that I saw that shipwreck. If I waited like one more frame, the lava would have loaded in and the shipwreck would have loaded in. But it didn't. There's also a ruined portal, but we really don't need it if we unless this shipwreck sucks. It does look promising, though. Oh, we got lucky. We got unlucky, but we got lucky that we had just the exact amount of iron that iron nuggets to make an iron ingot. Otherwise, we wouldn't had enough. Okay. Um, is it worth it to run over there? Honestly, I don't think so. There is just waste our hunger and stuff. We don't have any food. Honestly, don't think it is. [Music] uh problem is definitely this way, but there's It's not good routing yet. Um um okay. This actually could be good. Okay. Oh, Jesus. The only thing is there's no routing to it. If there was routing to it, this could be really good. There's not. So, it's making this really annoying. Luckily, we we able to grab that food quickly, though. Oh, it's going to be right through here. [Music] Yes. Um, there's a lot of pigs. I want to get this gold. I think it's bridge. I'm already over here, so I'm just going to loot this chest really quickly. Um, I don't need that. Um, I haven't seen a fortress though. Um, okay. How many of you are down here? Not enough. There are more of you up here though that I can grab quickly. Yes, there are. Crap. I didn't mean to throw my axe. Jesus Christ. Just go away. Um [Music] just die. I want to eat these suspicious stews. [Music] Um uh what do I want to do? What do I need to do? Um, need that. Okay, can leave them for now. Hey Okay, let me go check out the other area. [Music] It's a triple. Yes. Um, okay. Be careful. Oh my god. Okay, I'm blocking this up. I'm going over here and I'm being extra careful. Come here, Brute. Just get down with your friends. Perfect. Um, okay. Well, that's kind of L chess, but hey, it doesn't really matter. I think we're fine. Um, I need to make a bow. I need to make a bed. We only have 10. Uh, okay. Well, my thought is God, we surely there's more fire res. [Music] Okay, good enough. Um, okay. My thought is we need a home portal no matter what. So, we need to go back towards spawn. Um, no matter what, unfortunately. Uh, so I'm not going to blind Pearl cuz I might die. But we do just need to head back towards spawn. Um, negative8 and negative 50. Actually, no. I think it was annoying. We don't have that much food. Um, but we also want to head into a different quadrant. So, let's get into negative negative. But now we're closer towards spawn. Please open up. It's annoying. We're going to have to home portal or blind. I guess we'll just decide based on uh it opens up. This is nice. There's nothing. There's literally absolutely nothing. Um, okay. Well, maybe we go a different direction. Um, I'm being indecisive. Oh my god. My gut told me that was the end like the end of the fortress. I was right, but I was like, wait. Oh, drop quickly. Come on. The only thing is uh we again we're going to have to go all the way back to home portal. Fire is almost out. That's fine cuz I have more Oh, we got such bad drops. We had good drops, then we got bad drops. Five. Or do we just blind? Is it too far to blind? Like, are we in a good position to blind? Does anyone that actually knows? Oh, of course we get poisoned. 111 25. This is the last spawn. I I don't think we blind. We We can get back fairly quick probably. Yeah, we have enough. Crap. Wait, what? That's not where we came from. It's annoying that we have to go all the way to our portal. Do we blind or do home portal? Oh god. Guess we're not that far from home portal. [Laughter] Oh my god. Ah, I was reading my coordinates and I was eating and running the Nether. I just shouldn't I just need to not do that. Oh my god, that hurt. That hurt me. Oh my god. Oh my god. Why do we not get lucky with obsidian? Why do we have to go to our home portal? We should, right? We should have been in the in the overworld right then. Oh my god. Why do we have to go to our home portal? It's a stupid It's 1.21. It's the the pearl the obsidian rates are so bad. So trash. It was a good run. It was a good run. every run that we have a shipwreck next to a lava pool, we like have we almost we have like sub 20 potential cuz that wasn't even like the fortress wasn't close to the bastion. The bastion wasn't close like the Nether was bad. That Nether was bad. It wasn't like atrocious but it was bad. Okay, maybe maybe it wasn't bad. It definitely wasn't good though. Like but the run was good. Maybe I should have blinded. I don't know. I don't know. I was just reading the coordinates to the portal. I was like staring at my coordinates and just run off the edge and fall in lava. It's so stupid. Members are back. I'll meet my friend right. I say hi. Hi. Thank you. Um, this isn't even worth it to run. Yeah, I think home portal was the right play, but but the problem is is that it's just like it just takes so long. Like it added a couple minutes and then I would have had to run from there to the stronghold anyway. So, it's annoying. But yeah, I mean, I think it was the right play. It's just I I just obviously fell in lava. Yeah, it's annoying. It is what it is. Thank you guys for becoming a member, guys. I'm going to be doing a membersonly stream this weekend. So, if you want to get into that to see and be be a part of it, then make sure to click the join button on YouTube or the subscribe button on Twitch. Um, and I'll be doing a membersonly live stream on I don't know, it'll be this weekend. I don't know when. I'll I'll probably I'll put something up on a community post soon about it, but I'll be doing a I don't know how long, but I'll be doing a live stream. What do I plan for? I don't have any plan. I might do some speedrunning, but I don't know exactly what. Maybe I'll do like with like a challenge or something or like you guys control it or I don't know. We'll do something. >> This seed sucks. Oh, does it really not give him weakness through the bars? needed four. which is kind of annoying. We don't have iron either, which makes it extra annoying. I have a interesting idea for a play here. Um, Okay. Um, let's see. Um, actually, I need to make this [Music] Well, That goes down pretty far. I was just planning on rescuing lava and bringing it to the top, but like that cave goes down pretty far. Might just be better to just check it for lava. [Applause] I guess we don't have water, but there's probably water over here. I don't know why I made another whatever. Was there water here? I don't know. But there surely there's water somewhere in the cave. Yeah, there's water down there. Water right here. Is that into a lava pit? I don't think so. I have to go see. It just looks too beautiful to be a lava pit. No. Oh well. Okay, guys. Chill. Well, we're at like prime lava level. There we go. Let's say there's no way in this massive open cave at prime lava level there's no lava Well, I used my last food to get into the Nether. Okay. Well, there's a bastion over there. Um, [Applause] um, you're really annoying. [Music] We speed bridge of gas. I have to. Oh god. All right. Um, We need food from the bastion. Uh yeah, we're definitely going to need food in the bastion. Um but this is kind of nice. Um, well, actually, oh, they both have thorns. They could muffin us potentially. Um, okay. Here's what we need to do. Uh, You really don't have food. Um, okay. What I want to do is I want to I don't know when I'll let them [Music] Uh well, need food. Uh, Okay. Well, oops. Uh, well, this is I think what I need to do is that. Okay. Uh, put that there. All right. Um, I don't know where these guys went. Guess it doesn't matter. I need to get more food. I need to find more chests out here. Uh, I need to go up to the top. I mean, I don't think it's any good chest, but we kind of need it to be. Uh, okay. Well, the problem is that there's definitely going to be brutes. Oh, I think it's a triple. Don't know. Or Yeah. Okay. Cool. So, there should be what? There's like one chest over here or something. Yeah. And that's why you're here cuz you're guarding it. Now, don't reach through the freaking wall. Uh um I don't need that anymore. Uh oh god. >> Okay, let's take him for a little ride. [Music] Okay. Um. Oh. Oh [__] How'd he get up? I mean, shoot. How the muffin did he get up? Um, what? Jesus. Okay. [Music] only that many pearls really. We have the obsidian. I guess we have enough pearls. Barely like not really cuz I don't know where the fortress is. Um what are we in right now? We have like no food. Uh well, okay. Um we need to find a fortress. I also got no fire res. So, um that's a fortress way over there. Um, only problem is how the heck in heck do we get there? I go around I pearl over there. Nope. Uh, I don't know. I think this is cooked. Oh, maybe we can go up here. Okay, this opens up. I guess that's a different like a whole entire different quadrant. So, we can just check this one. See if there's a fortress. There is. Um, I need to grab this. Where are place spawners? I need to be careful cuz I don't have fire. There's a place spawner right here. [Music] Nothing. [Music] Huh? This is mayhem. But no, no, no. All right, we got to kill this guy. I can't really handle both of them at once. Where did he go? Oh god. Holy crap. 1504 negative 1616 1 15 04 1 616 Um 416 Well, we got to throw a pearl over there. Six. Um, I'm very worried. Oh, well. I don't know if we can go down or not. No, there no fire res. Okay, this is the lowest we can go, I guess. Unfortunately, Well, that ruins the chances of uh anything super good. I don't have any Yeah. I mean, we're not going to we're not we're not even going to get a we're not even gonna honestly we're not even going to get that good of a time. I mean like decent but um but hey we can finish it out. Okay. That was close. All right. Well, I guess our challenge is just not to die here. [Music] What the hell? Um, let's get this one. [__] Um, I don't even know if I want to go in. Guess I kind of have to sprint. There's another one. I'm stupid. All right. I know. I want to wait for the dragon to get near it. This is a hit. Come on, dragon. Go near it. [Music] Oh my god. No sprint. [Music] [Music] I have no sprint. [Music] Can't even go in. Oh, it's going to kill me whenever it flies away. Clearing up. [Music] Okay. I mean, [Music] you missed the double chest near the trader dudes in the bastion. Did I actually Wait, what? That's not the closest one. Where do we go? This way. Yeah, it's this way. Locate's just wrong. I don't get that. Why is Minecraft/locate so bad? Um, we came up here, right? Yeah, we were up here. Did we just not loot it? I thought I I thought we did. Yeah, we looted it. We loot everything. Um, and the only thing we didn't loot was this, I think, cuz we never got down to it. Actually, no, we did, cuz we mined down. Yeah, we mined down and grabbed it. Yeah, we did it. We looted everything. Not this one down below. What do you mean? The chest that we came in on, like this one, I didn't loot it. Oh, I might not have looted it. I think I looted it. Maybe I guess there was a gapple. It wouldn't have helped. The gapple would have helped. That's it. I'm in. Um, I think I'm going to end soon. I'm just thinking, just thinking maybe we wait 10 minutes at least. That way there's a lava pool. I was going to say cuz at 7:00 a.m. breakfast places will open up where I live. I can get some good breakfast. Maybe I'll get some like I was I was I was just about to say Waffle House which is open 24/7. I was like wait maybe I'll get some Waffle House after I just commented on breakfast places opening. Um, well, there's no blacksmith, so I mean, unless there happens to be a shipwreck right here. Got to reset. Why was there a cut in the stream? I don't know. Maybe it lagged. There's a shipwreck way over there. I mean, that's pretty far, but like we still get a sub five enter probably. It's just such a far run. Boating is faster than sprint jumping, right? Like you can you can ride a boat faster than you can sprint jump. Like I should take this ocean back instead of um not um Okay. Well, nine is not enough. I mean, is enough actually. We can kill the iron golem. Was there an iron golem? Surely there's an iron golem. Yeah, I could take the emeralds to trade, but that's the thing. Um, I don't know what. Oops. I'm making a house. Pancakes or waffles? It depends. It really depends. I like pancakes, but I think waffles can be better sometimes. All right, let's just grab a couple of these so we and get some bread. Let's not spend too much time lolly gagging around. Um, I guess we don't have a flint. All right, we don't have a flint. We can grab one real quickly. Well, this is kind of annoying actually. Um, well, I guess uh Okay. Perfect. All right. Well, we give us a bastion. Yes. Okay. Okay, so we know the fortress is uh northeast of spawn. The bastion is southeast, which is good, but there's not good terrain. I need to go to the left. Perfect. It opens up. Yes. Okay, that's actually pretty good. Are we always getting this these bastions? Instead of getting treasure or like one of my faves, treasure or bridge almost just fell. Instead of getting treasure or bridge, I always just get this damn one. Don't tell me there's a crossbow guy cuz I can't handle him right now. Um, okay. All right, got the brood off, which is the most important thing. Um, I always just kill these guys, care for them. Good enough. All right. Uh I mean, hey guys, I went to the wrong place on accident. Where? All right, perfect. Uh, okay. Well, all right. Good enough. Um, hello friend. Okay. Um, let's see. I want to go down here. Actually, no, I don't. I want to go out here cuz it's a little easier. Hello, sir. Hi, sir. Okay. Um, uh, I wish I had more blocks. Be free. All right. Oh, well. Get some more blocks really quickly. Crap. I kind of want those arrows. There's also just not a clear pathway here. Uh well, there's not really a good way to make a clear pathway here. And there's brutes through here, which is rather annoying. I can hear them. Can I get down quick enough? >> I think so. [Music] Okay, I just need to get these and get out because there's not big ones around here. I have like all the obsidian I need. We really only need pearls and arrows. I know there's arrows in the middle. I saw them. I don't want to just throw out the crap that we don't need. Uh crap. Whatever. All right. Now I can just kill these two guys over here real quickly. Come here. All right, cool. And then where are all the guys? [Music] Get in the hole. [Music] Uh need to make a bow. Otherwise, we don't need string. We don't need that. Uh what else do we need? [Music] Need pearls. Give me more pearls. Give me more pearls. 13. Do I leave now? Come on. Couple more trades. Couple more trades. Couple more trades. I have the obsidian. I have the pearls, but I need more pearls. I need more pearls. I need more pearls. Be perfect. I just need one more pearl trade. One more pearl trade and it's perfect. Please. One more pearl trade. One more pearl trade. Yes. Okay. Um, which direction was it? It was towards uh. Um. Um. Which direction is it? This way. Yes. Oh, come on. Is this high? Drop. No drops. [Music] Okay. I don't even know if I'm just going to build the portal. Perfect. We have enough regardless. Come on. Come on. Come on. Come on. Come on. Got to be real quick. It's got to be close. Uh Um, okay. What's this? Who's the other eye? It break or something? I don't know. It doesn't matter. I have an extra pearl. 464 592 4 64 I got 592. Uh I'm probably going to have to throw both these pearls and just really hope that there's one in the honor. 46 4 Um, Is this a starter? This is a starter. I think um I think we're getting too far maybe. Back back. This is scuff. Oh god. What is this? Um, secret room or not secret room but Oh, this is it. [Music] I don't have another pearl. Uh, it's not going to be PB. Just ain't don't have a pearl. Um, just start to kill these. [Music] Okay. Oh, I didn't put on a block. There you go. [Music] Heat. [Music] Heat. [Music] [Music] [Music] [Music] [Music] It went so high. It's not my PB. Oh, also I died. [Music] Yeah, I still killed it. That was a manhunt. I would have won. But I don't understand. Wait, how did it hit me when it was dead? Wait, what? I just realized it's like a glitch. I was The dragon was dead. I didn't even think about that. How did that happen? How did the dragon eat me when the dragon was already dead? What? Well, that should have been that should that should have been PB. It was so close to PB. Uh, if the dragon didn't go so high near the end, it would have PBD by like 10 seconds or something. If we had pearls, it would have PBD by, I don't know, 30 seconds. But instead, but it doesn't matter. It wouldn't have been PB no matter what, right? Because it's 10 sec. It would have been 10 seconds. It takes 10 seconds and I killed it after. So, it would have been 23 minutes and like 25 seconds or 30 seconds. Like, it wasn't PB anyway. Even if I didn't get yeed up, it wasn't PB. Unfortunately, that's funny though. It's just a glitch. Yeah. I mean, that wasn't that a great run by me, but it was another 23 minute dragon kill. We've gotten some consistently good um like times. I mean, I swear if we get a lava pool and a source for iron, we almost always like nearly PB or PB. I think it makes sense because we don't get many seeds that are like that. But it's like if we were just playing on like the wall or something, that means we'd be like if we had like the wall where we where it was like nine seeds and and we were only we were only choosing seeds that basically had like a lava pool in a village or like a lava pool and a shipwreck. I feel like we'd be I don't know. I want the wall or like um Yeah, I want like the wall. I want to set up the wall, but like I just can't because it's not it's not on this version. I'll look into it. Maybe whenever I'm back, maybe maybe I can have someone Cody or something and whenever I'm back um from uh after my wrist surgery, I can do it. Maybe. I don't know. All right. Well, I think that's going to be the end for me. We got We went nine hours today. Pretty good. Um unless this next seed's like a goat seed. Let's see. I guess unless we unless we pull like a goat seed like a couple resets. Listen. All right. Thank you guys for coming to my streams recently. I appreciate it. There's a lot of you and uh I really appreciate it. It's awesome. I'm having a lot of fun streaming and uh yeah, I appreciate you guys for um coming out to the streams, hanging out. Hope you guys have been enjoying them. I still plan to keep them up until my wrist surgery, but once I have my wrist surgery, uh I'll probably be not streaming for at least like a month and that kind of sucks. But uh we will see. I appreciate you guys. Thank you guys. Bye.",
    "start_time": 6.56,
    "end_time": 32983.04
}