{
    "video_id": "NWPS33mhRc4",
    "channel_url": "@dream",
    "transcript": "Yo yo yo yo. What is up? Let me pull up chat here. Perfect. Get it rolling. We're back. What's up, guys? How's it going? What is up? 24 hours on stream. No, it's probably actually going to be a shorter stream than usual cuz I'm already really tired. But this is the thing, guys. Look, I'm grinding, okay? I literally just got done recording a new speedrunner swap video and literally 20 minutes ago finished and then now I am live because I want to go live tonight. Uh, so I'll probably be pretty tired. Third with who? It was with Bablau. Shipwreck. Why not take a rest? Because I don't think I'm going to stream tomorrow. Uh, and I on Sunday I'm going to be doing a sponsored stream. Uh, so I wanted to do a normal stream even if it's short today. That way we don't lose our connection. You know, we can't be separated for too long. Why so late? Because I just finished recording a video and was busy all day. Um. Uh. Well, this is interesting. All right. Here we are. See if we get anything good here. Hey, we got what we need. Um at least to get a pick. Look at a mushroom island. Maybe, just maybe, there's a lava pool. Seems unlikely, but you never know. Do I kill some of these animals for food? We actually found one of these in the video I just recorded. Um, come on. Sure. This is a big mushroom island. That's a lava pool. [Music] That's surely a lava pool. [Music] >> No, it's not. Oh, that is. Uh, all right. Well, oops. That's doesn't make any sense. Uh, all right. I'm slow. Oh, I'm slow. All right. All right. >> All right. It's east. Hello guys. I don't actually need you for food, so I'm going to ignore you. When will you do another manhunt soon? Do you mean like a manhunt manhunt or do you mean like a just a manhunt video like speedrunner swap? We actually just recorded one. Literally ended recording and came here. That's kind of annoying. All right. Well, I guess the title implies that this is going to be a long stream. It's going to be a quick stream cuz me passing out is going to happen soon. Uh, can I make it there? Probably not. 639. It's not that bad. There's probably a fortress in that biome. All right, let's see. Uh, all right. Well, All right. Is there more piglins up here that I can bring down? Uh, is there going to be a brute here? Yeah. Oh Okay, I'm dead. That was stupid. I for some reason thought he couldn't get down there, but I guess I broke the block that prevents him from jumping down. My bad. Your voice is very deep tonight. Are you sick? Well, I've just been like playing Minecraft all day. I recorded a video, so it's just like I'm congested. Not because I'm sick, though. The swap manhunt was with Babloo and Fanced. Spawning at a pale forest is crazy. Yeah, exactly. How long are we streaming tonight? Probably not that long. Maybe a couple hours. Guys, leave me alone. Come on. >> Oh no, there's a guy there. Uh, let's see. All right. Use this as a little outpost cuz that is what it is. All right. Huh? Um, let's get this guy. Come on. All right. Oh no. Okay. Well, let's Can I place this anywhere? No, I'm dead. No. I thought I had enough time. That's unfortunate. It would have been good. Look at how many pillagers are in this hole. I >> already broke my one rule of no deaths. [Applause] [Music] That was pretty cool. It's interesting doing manh hunts with people that aren't my best friends, you know, or really good friends of mine. Um, let's see. Uh, that actually is completable, but only if we have an iron pick. Or I mean, I guess a gold. Well, I guess we can just break it, but it'd be a lot easier if we had a gold or iron pick, but we for some reason don't. Uh so uh I don't want to break it with a wooden or stone pick. I think hopefully yes, there's iron. Please, please tell me there's one more. Tell me there's one more. That's all we need. One more. Oh no, there's idiots after me. One more down here. No, it's going to be two. It's going to be stupid, too. No. No. Why do you hate me, God? What did I ever do to you? >> I did nothing to you. Oh, come on. There's actually just not iron. It'd be so beautiful if there was just iron. No, not even one iron. Why do you talk about your sick something happened? I'm just I've been up all day. I don't think I'm sick. There's no iron. Hey, copper tool. You can't get gold with copper. What exactly do you search before reset the world for good stuff? Iron structures that contain iron, food, lava. My nose is stuffy, but I'm not sick. Didn't Uh, see Um, there's a shipwreck, but there's not any lava, which would have been pretty cool. Was Bob Lou swapping with you? Yes. Hey Jam, you smell like one second. I need to do this. Um, you smell like something. I'm not looking cuz I'm doing this. Uh, you I know for a fact you can beat me if you were a hunter and not you won't beat me at Brawl Hollow. It's one v one. I don't know what that is. Genuinely have no idea what that is. So sorry. Another shipwreck. Uh, The seed is kind of memed. Unless there's a lava pool right here. Give us a lava pool. Lava pool dreams. Lava pool is awesome as hell. That's a lava pool. Yes. Um, well, that's kind of annoying. Uh, I don't want that. I want that. Uh well, Come on. Give us a go. Nether. It's crappy nether. What the muffin? Uh There ain't nothing here. Terrible nether. Maybe I should just reset. It's only a few more days that I can play Minecraft. Is the next video a banger? All my videos are bangers. All of them. Every last one. Well, only a few more days because I am having a surgery on my wrist on Tuesday. Because I have surgery on my right hand wrist on Tuesday. I'm also doing another elective surgery for more skin removal at the uh like shortly after because I it doesn't increase the downtime and I the only reason I haven't done it is because there's just downtime but it doesn't increase the downtime. So basically I'll be bedridden. But my I have my cast on for two to three weeks and I have six weeks of uh a splint. Probably remove all skin. Exactly. I'll be skinning myself. Leaving to the military on Tuesday. Desperate says desperate desperate pie. Recording any more videos before surgery? I think so. I think I have two more I'm supposed to record, but we'll see. We'll see if I get them all done. One down. should be back late October. Uh I mean at the latest. Yes. At the latest. Late October. At the earliest like early October or late very late September. So not too long. You'll get at least two videos between then. So maybe more Do you consider yourself good at speedrunning? I think good is like subjective. I think I'm good at speedr running, but I think that it's it's very subjective. I think if you ask a speedrunner if they're good at PvP, they'd, you know, they'd probably say yes, but then people that are actually good at PvP would be like no, you suck. So, I think it's kind of uh a little bit of both ways. Like I think that for a Minecraft YouTuber, I'm very good at speedrunning. For a speedrunner, I'm not very good at speedrunning. I don't even know if that's necessarily accurate, but something like that. Like I guess by by a forest speedrunner, I mean like for a speedrunner that literally that is their job. Like they they speedrun Minecraft 100 times, you know, 100 hours a day. Like there's some really cracked players, but that's the thing. I've always been good at kind of being a jack of all trades. Like my Minecraft knowledge plus my PvP skills plus my speedrun skills plus my like coding and uh whatever. Like I'm very I'm very wellrounded. shipwreck. That is the worst shipwreck chest I've ever seen. We need the buried treasure. Luckily, it looks like it's reasonably close potentially. Uh, well, we don't even have What is it? It's west. It's east. Of course it is. I don't have a boat. There's a dolphin. No dolphin. Uh, this is so far I have to swim instead of making a boat. I didn't even get I got a total of one gold and zero iron from that shipwreck. That's crazy. Maco Shark $50 donation. What the muffin? Thank you. I appreciate it. Um uh well, god damn it. I don't even know. It's so annoying. All right. Uh, let's make that that that Of course, there's a hill. So, I could climb it and see if there's lava. the Savannah Village. Fun fact, uh you and my cat Finn both had surgeries on Tuesday. Wish you the best on your surgeries. dream hope all goes well and you recover swiftly and are able to get back to playing MC and get some well-deserved rest. Love your dream. Thank you. Thank you for the dono. [Music] Did you see Lacy and Marlin's Minecraft stream? I saw it. I didn't see it, but I saw it. I'm aware of its existence. I saw clips of it. Will we get the member stream before Tuesday? Yes. I I just don't know when to announce it because I don't I'm not I don't want to like I I honestly I don't know when I when I when I'm going to be able to do it, but I'm going to be able to do it. Um, it'll be Sunday, I I believe. Um, but I I just don't know when because I don't know when how long my sponsored stream will go for. I think I'll do it after that. So, it should be like afternoon on Sunday, but I don't I don't know for sure, honestly. Could be later, could be earlier. [Music] Wow. I wish there was a tree right here. There was a tree right here. That'd be epic. But for some reason, the tree is way over here. I can still get mobs though on the way back. So maybe it's not as bad. Uh well, guess it's slightly annoying that this is All right. Well, let's get this. I wonder if bees get mad if you break down their tree. Surely not. Surely Mojang's not that smart. All right, let's see. Is three sheep enough? I guess it's probably enough to get me through the Nether. Or not through the Nether, but get me to the Nether. And then, you know, I can work out the rest. All right. There we go. Uh, uh, I guess I don't have a pick. Uh, well, let's make a boat. I guess we don't we we'll just get a pick in the bastion. So, Except there's not a bastion. Except there's just not a bastion. Um. Oh, there's a fortress. That's kind of good. Except I don't have that much food. Maybe we'll find a bastion. What is that? Oh, I hear like wither skeletons. What the muffin? All right, that is nice. That is about the best possible chest we could have gotten. Like, actually, I don't know. I really don't know what else uh we could have gotten. That would be epic. Like, we could have gotten a chest just like that, but we didn't. We got a good one. Oh, well, I don't want to go to you. Hello, Blaze. Oh, go. Bye-bye, Blaze. [Music] Well, uh, that's all the way down there. Um, let's see. Okay. Hello. [Music] Um, uh, what do I want to do? Um, well, I don't know if this is going to work because I don't have much food left. There's wither skeletons I can hear. I just don't want them to see me. There's a guy up there. Oh no. Of course, he's wandering right down here. Oh god. Come here. Um, well, that's my last food. and even heal quickly. Um, okay. We got six. Oh, well that's there's no nowhere to go there. Um, could be hoglands. Well, uh, let us Oh well, that's unfortunate. I'm going to die. Crap. It was either the wither skeletons or the blaze. I had to pick my poison. I went for the the withermen, but it didn't work out. There was so many there. There's like 10 wither skeletons, 10 blaze, everything. All right, we get decent chest. Empty map. Really? Really? An empty map. Uh, well, that's just not ideal. This isn't going to give us anything good because I don't have enough to make what I want to make. So, I need to get this and get a wooden one. Uh, let's just make this. Get one more. Get a boat. Oh my god. All right, there we go. Hey, I want to say thanks for inspiring me to practice PvP from the Dquavvis Trilogy training streams. And now I'm an LT5 in PP and I want to speedrun because of your training ship. That's awesome. Good luck. I wish you the best of luck. You will no longer suck at video games. [Music] I like the look of this savannah, but the problem is I don't have any food. All right, I finally got a flint. Uh, we have a lava pool. Um, let's see. Uh, all right. Hey, stop. Stop. What? I made sure. Okay. [Applause] All right, that's a little cooked, but whatever. Okay, that's going to be good. We don't have any food though, but we could maybe kill hoglins if there's any inviting hoglins here in this red biome. But we are leaving the red biome. Actually, probably not. Well, that's not what I meant to do. We are leaving the red biome. Uh, which is unfortunate. Um, let's see. We can maybe get food from the bastion. Otherwise, we're cooked. I don't know what bastion it is yet. It's treasure. I think it is kind of perfect. >> Hey buddy, come here. Okay. >> Oh, I don't I don't have gold on. I was like, why is he after me? Okay, let's just get up out of here. This is really convenient. Uh, well, I'm out of sprint, but I shouldn't be cuz I have food, but I am. Ah, okay. You're an idiot. All right. Uh, let's put that on. Let's put that on. Perfect. Let's get this there. Let's get this here. Get that there. Crap. I didn't bring sticks because I'm a genius with high IQ. Um, let's go here. Let's just dig straight down into the treasure cuz we have no food anyway. Why not? We can see if we do something cool. Don't do that. Shut up. Shut up. I did not ask your opinion. Um, okay. What do we do here? We make a Uh, pickaxe and shovel. We already have a pickaxe. Crap. God, I'm a joke. Um, okay. Well, we need food. Hey guys. Uh uh we need food. Is there going to be chests? There's chests over there. Uh there's a chest here. Let's just make sure. Yes. Okay. Surely. Uh, what the muffin do I want to do? I guess I'll go here. Then I'll go here. Perfect. That was quick. I'll break this. Come here. Hello, friends. There's still a guy down there. Oh my god. Okay, finally you're dead. All right. Um. Uh. Get the hell out of here, buddy. Face my knock back. Hello buddies. Oh Jesus. Get in the hole, idiot. Get in the hole. Go. In. In the hole. Um friends, come here. All right, perfect. Let's get you all in there. Let's get you trading. Uh, let's get that out. Let's get that out. Let's get that Let's put that there. Get that there. Uh, what else do I need? That's fine. All right. Let's go ahead and put that there. Uh, that there. What the muffin am I trying to do? I'm trying to do this. Let's [Music] Uh, I [Music] I would like more arrows, but whatever. It's good enough. I guess I would like more obsidian, but hey, it is what it is. Um, do we see the fortress on the way in? I do not remember. Um, oh crap. I did not mean to do that. Um, I did not mean to throw a pearl. I meant to eat food. All right. Where the heck can we go? I'm going this way. Uh, I don't see anything. Unlucky. Have one food left. Um, there's a lot of entities this way, which imply there's probably a bastion, which is not good for us. Oh, I miss and I landed it. Okay. Uh I'm still low on food. I could kill hoglands, though. Um let's avoid the bastion, which is over there. Fortress in this quadrant. I don't have enough pearls left to waste pearls, but I kind of have to. Otherwise, run's dead. Um, fortress and a blaze spawner right here. Uh, I might need I can get a pearl in the chest surely. [Music] We got one blaze drop cuz of course we did. I need to get out of here cuz I don't want them to spawn on me. I don't have food. Um, maybe there's food. Okay, >> good enough. -45 28. We're in the second ring, so it's just far as hell. These are ones. We're actually We're not that far. Is there another blaze spawner potentially? I guess we're going away from the going away from where it is. So, no point. We just got to hope. Uh [Music] give me one more. [Music] It didn't drop. Why? Why didn't I drop? [Music] 2061 282061. I mean, it's still a decent run. Uh, maybe I shouldn't have came down here. Actually, this is going to be slow. Um, I got to throw a pearl. Otherwise, the run's just cooked. 4282061. Yeah. Unfortunately, we just got to find a pearl. Or maybe maybe we'll have a 2i. It's not that unlikely. Two 016 [Music] 458. Uh uh that's the starter staircase probably. This is good. Uh, well, oh, it's a library. No, this is also good. Nope. Please. This is good at least. No. Um I got I got all the chests as well. It's still bad. And we're pretty far. No pearls in any of the chests. So, we need two. Uh, it could be down here. We need two eye. Otherwise, the run's dead. Crap. I'm losing track of where where I am. I think I need to go back. Um, I really don't know where the heck I am. Nope. Really? Where the muffin? Guess I'll take this chest. Uh, I got to go all the way back. Bad nav. I think it's unlucky nav, but this is probably this way. Wait, I already went this way. Did I look every way? No, there's a library. Which way is it? Oh. Oh god. It's going to be right here. Oh, it's right here. No. Two eye. At least it's a two eye. I mean, it's a it's not a you know, it's not 19 minutes. Uh Um, there you go. H. Well, I hit these. Um, oh, come on. You're so high, dragon. You're so high. You're landing, right? There. [Music] [Music] Let's have some fun. Let's see if we can hit a clutch bow shot in the air. You ready? Oh no. I was trying to get it to boost me higher. It didn't boost me higher. Heat. Heat. [Music] You ready for this? You ready? No. I was trying to get it to boost me and it didn't didn't boost me. The one time I want the dragon to boost me and it doesn't boost me. It's mostly south. We can head over there. That seems fine. Um, all right. Let's do this. I actually think we have enough for once to make like an axe and stuff, which is good. Uh, well, we'll do this, but I don't know if we'll even need it, but we do it anyway. Uh, I just sit. It's not quick, but it's also not that slow. That log really cost me. All right, there we go. Uh, let's put that there. Make that there. Just in case we need this. Get this food chest. [Music] There's a village right there. Honestly, I do not need this. It looks like it goes out more to the ocean. I just want to get these leaves. Let's up. See if we have lava pool adjacent. [Applause] Only thing I need is food, but we do have a village. All right, there's a lava pool here. Uh, I didn't get flint, which is a little annoying, but Flint. We have a flint. All right, cool. Um, well, crap. Uh-huh. Uh well, we really don't have that many B I mean uh bastions. We don't have that many entities. [Music] Well, uh, well, this is not fun. Can I see anything over here? No. Uh, I guess I can We just got a terrible Nether. Terrible Nether. I see some land this way, but it's probably not like a land land. It's probably just like a corner of this stupid island. And there's more corners. Uh, I mean, I should probably just reset, but um, yeah, let's just reset. after getting a tiny bit of nether nav practice. Um, yeah, the bastions are way over there. Uh, whoa. I don't think I can make this. But no, I can't. right now. It's a lot of pressure. I guess I do see a shipwreck. Thank you for the donut. even think about the fact that I'm drowning. Uh yeah, I got enough iron that if there's a lava pool, it's probably decent. Let's get this Uh, let's make a diamond shovel. Give me a flint. Um, can we get a lava pool? Wait, this thing is this way. Oh, it is. What? The shipwreck is I mean the bra treasure is right over here. For some reason, I thought it was like the opposite way. Um. Oh, is that a lava pool? That is a lava pool, I think. Do we want to just go for that then? Yeah. Screw it. Screw the shipwreck. [Music] Uh [Music] all All right. Uh, all right. That's a fortress. Um, which unfortunately is not what we wanted. Oops. Let's get that out of there. Um, let's see. I guess we probably do the fortress first and then uh go to the stronghold after that. I mean, not the stronghold. Yeah, go to the stronghold right after that and then we're good. We're in. Just kidding. go to the bastion after that. Um because we're right here by the fortress. I shouldn't have done that. I knew I shouldn't have. I I didn't get punished for it, but I should not have done that. I should have just entered safely. But instead, I thought for some reason that it was a good idea to do whatever I did. Of course, there's wither skeletons. Um, Jesus, I hate you so much. going to be blazed shooting at me. Uh [Music] [Music] Well, I actually don't have that much more. to get. [Music] I want to hold the axe. That way whenever they spawn, it's charged up. [Music] Six. Do we just go with that? Nah, we got to get one more. We'll let this be the decider. He's the decider of fate. Well, I mean, he's out here, which is annoying. Oh god. Jesus. No. Oh, how' I not place it? Okay, I'm just going. It was the decider of fate and then I didn't listen. Oh, Jesus. Okay. Um Oh, hello friends. I don't even have an axe. What am I doing? Get this. Come here. Come on. Oh, that was perfect. Oh, it wasn't perfect. It was like one off. Um, please say there's Sebastian this way. [Music] Um. >> Oh. Well, okay. There's a bassalt delta. So, not that way. Maybe this way. Okay. There's some entities. I should have gotten an axe while I was there, but I didn't. But it's okay because we will just do this because we're the goats. Um, surely. Yes, there is. So, there's definitely a bastion this way. Oh, it's right there. Oh, no. That's a bassel delta. But there is a bastion. Um, what is the easiest way to get there? I really don't know. Uh, maybe down here. What the heck? How did that happen? I like clutched, but it didn't count. Um, oh god. You're such an idiot, skeleton. I hate you. [Music] Oh, it's way over there. Probably a reset, but um [Applause] We have to go all the way across this lava because we just got a crappy bastion spawn. It's still way over here. This is going to burn. Such a far. I wish I had a pearl. Could have been good if I had a pearl, but I don't got no pearls. Absolutely none. Zero Can we get a desert temple or something interesting? Yes. Ooh, rune portal and a desert temple. And all of a sudden, we're back in it. The desert seed just might be possible for once in our life. All right. Where is this chest? Okay. Well, uh, two obsidian is completable, but we don't we don't got any. Cuz of course we don't got any. There's a lava pool right there. Desert temple. Give me everything I need. Give me everything I need. Oh god. Holy crap. That was kind of nice. Thank you, creeper. That's kind of clutch of you. Is there another creeper up there? I don't like that. There's probably another creeper. See it? All right. Uh, we don't have a crafting bench cuz we don't got wood. Um, but if we did, we'd have enough for water. Surely there's wood right here. I I guess I don't know where I would get wood in a mine shaft or one of those like Aelia trees. We don't got one of those trees. Can you say hi to my friend Judge Alex who's also watching stream? Hi, Judge Alex. Uh, we don't have any wood. Well, that only leaves us with one last thing to do. I'm going sneeze. I'm going to sneeze. There's a sneeze coming on. There's a sneeze coming on. Oh god. Shipwreck. I didn't sneeze. Why did I not sneeze? I actually don't like that I didn't sneeze. How are you playing Minecraft with NBA 2K just dropped? Oh my god. Wait, NBA 2K just dropped. I need to go play it because I don't care about NBA 2K. I don't play it. Minecraft speedrunning is my life whether you like it or not. It's right here. I mean, yeah, it's just right here. All right. Uh, let's see. Uh, um, what do I want to do? I want to make There we go. Um, I want to go ahead and do this. I already have a boat, which I don't need. I do need a pickaxe, though. And I do need a shovel. Um, crap. And I do need a sword. And then I do need a shears. And then I guess we go straight down. Why not? I guess I don't need shears that much because uh we're just going to go down in the ground. That's a mine. Really? Come on. Give us a lush cave. A really lush one. so lush that it's beautiful and all of the mobs want to be in it. Come on. I hear lava. Sounds like it could be one of those single pools, though. Come on. Be a lava pool. Really? You don't want to give me flint? Give me flint. Give me Come on. Be a lava pool. Be a lava pool. No, you stupid idiot. I hate you. Um, I'm just going to dig it down. That was a funny donation. Where is the buried treasure? I can't find it. I'm at Y -30. Why haven't I hit it yet? Um, okay. Well, I hear lava pops. It doesn't sound close. Where the muffin is this lava? Oh no, it's one of these stupid places. Okay, best place to do it is here. All right. I think this is kind of slow, but I didn't get the flint. I didn't get the flint. Just resetting. It was trash. Come on. It's too far. It's way too far. unless there's a blacksmith. I don't really want it. No blacksmith. Do you plan to play six, seven hours? I don't think so. So, I think tonight will be shorter. I just I've been up all day. I recorded a video earlier, actually. And then I started streaming right after my video because I wanted to stream. I want to like I want to like announce six hunters, but I don't know. I I just I don't know how my recovery will be. So, like I don't know. I just don't know when I would be able to because I want to do six hunters right after I'm recovered. Um, but I don't know when that will be. And I don't know if like right after I'm recovered if I'm going to be like because I think I'll be in physical therapy as well. And I don't know if it'll be like, oh, my wrist is just like basically perfect and I can use my mouth mouse perfectly fine and I'm and I'm epic and good or if it's still going to like really hurt or be uncomfortable or something or if I'm just going to be like bad. So, I'm waiting to see. I'll probably do some uh I don't know. I might do a couple live streams when I'm whenever I my Splint is on if I'm like uh out of my cast. I'm not in the cast yet obviously, but Um, let's see. Um, lava pool. Wow. It's kind of a deep deep river. Uh-oh. It's a big portal. We'll just see what it is. Um, there's a lava pool here. No iron though. Maybe one second. Heat. Heat. [Music] You're going to pass out. Yes, I am. I'm tired. Got some good practice in though. Did did some cool stuff today. Probably be uh filming tomorrow again, which is cool. read chat. I am just not very frequently. Can you edit after your surgery or not? I mean, I I I I will be I won't probably not until I'm in my splint, but I can have helpers. I can have an editor. I can have an editor cut stuff up and then I can review it and talk to them and work on it. There ain't nothing good. See, I think I'm going to stream Sunday for a sponsored stream and I'm going to stream uh for a sub only as well. There's no chest. That's odd. Um, on Sunday I might stream Monday as my final like harrah maybe, you know, like before my wrist uh surgery on Tuesday. But otherwise, I've just been practicing and stuff. So, All right, I think I'm going to end it. It's a really short stream. It's my shortest stream in such a long time. It's only two hours, but uh I'm just tired. So, sucks for you guys. You guys are gonna have to catch me another time. Thank you guys for coming. Appreciate it. Uh, I will see you guys soon. Got some more video stuff to do. And yeah, thank you guys. Thanks for all the well wishes. Appreciate you guys. Want to keep up the streaming, you know, so I gota gota even if I have to do a couple hours, I can't play Minecraft that much more before my surgery. So, I want to play it as much as I can, but I also got to sleep. So,",
    "start_time": 5.839,
    "end_time": 6874.8
}