{
    "video_id": "2EO7svaMTLk",
    "channel_url": "@dream",
    "transcript": "Um, hello hello VOD viewers. Welcome to my epic stream. This is your secret message. Thank you. Um, now let me just pull up the chat for the nonvod viewers. Sweet. All right, there we go. All right, guys. Hello. I'm on bedrock edition uh for once. And look, my skin looks all goofy. Bedrock edition. Am I right? Am I right, guys? Today we are speedr running garden in Minecraft. Where's my farm? Where's my farm? Here. Here I am. I'm at my farm. Um, let you guys roll in, grow a farm, grow a garden. You guys can join and play with me. Yeah, we're on we're on Bug Rock. We're on Bug Rock. You can join on Java if you want, but also there's there's Bedrock as well. And I never play on bedrock. So, if you want to come, you know, play on bedrock with me, then you can. But yeah, basically this is a sponsored stream uh by Mineville for you guys to come and play with me. And uh I'm just going to try it out and learn and see how to play. And um apparently you can grow a garden. And so look, this is this guy's garden. I'm in this person's garden. Whoever this is, the queen bee. And apparently I can like steal I think. Yeah. Look. Do you want to steal a fruit by using steel credits? You can steal. I failed. How did I fail to steal? What? All right, I'm going again. How did I fail to steal again? I'm stealing. Yes, I got a blackberry fruit. Okay, now I'm taking this fruit. I'm going to go plant it in my own garden because it's mine now. I don't have Optifine Zoom. How do I How do I find my my my garden? My farm, should I say? Here it is. Yeah, guys, I'm playing on Bedrock Edition. It's crazy. I've actually I had to download it. I had to download it for the first time. Oh, I stole a fruit. I didn't steal a plant. I'm stupid. Oh, look. I have Okay. Yeah. Wait, guys. You can click me like the big me. And look, it says dream event because there's a big event going on. So, it's available until September 30th. You get the dream seed from dream and uh yeah, you basically can like I I already planted it. Like I want to Where is it? This is it. This is the dream plant. Look, it's smiley. And then I can click it and harvest. And now I have these fruits and I can sell them. This is interesting. How do I Wait, how do I sell them? I forget. Oh, here we go. I click. Yeah, sell fruits. Sell all. There's pets as well. Do you love this edition? I don't know. I don't know. I like this server. I don't know about Bedrock, though. Bedrock's funny. Like, look at my skin. Bedrock is so funny. Um, yeah. I basically I can like it says it's ready in two seconds. I can harvest it. I don't know. I I feel like I've never played a game like this. I've never played a game like this on Roblox or anywhere. Um, look at my flamingo pet. There's just so much. There's so much. But I have a flamingo pet. Look at them. I don't know what I don't know what I want to name them. I don't know what I want to name them. Pink. It's pink. There you go. Um, okay. So, I can also buy seeds with the money that I've earned from selling my seeds. So, what do I want to buy? What do I want to plant? Wait, those plants kind of looked cool. Was that a blackberry plant or what was that? I don't know what was over there. Let's see. Um, all right. I'm going to buy blackberry seed. Oh, there's no stock. Oh, you have to wait until they restock. Is it from other people like selling them? Probably. Yeah, there'll be uh like I can make weather events, which I guess like the rain and the storms make it so things grow quicker. And so if you want to and then you basically can level up your plants quicker, I guess. Uh like as I farm this, I think there's a chance that the fruit is like a better fruit or a golden fruit. And it if it's raining then it means that it's a higher chance or 100% chance actually. I think if it's raining, but I don't know. We'll have to see. All right. What should I do? What should I do? I want to buy I need to buy a plant. How do I What seed do I get? Mushroom seed. Okay. I'm planting a mushroom. Okay. Wait. Hey, we should be like I don't know, organized. That's pretty sick. Wait. Oh, I picked it up. I can like move it. Oh, no. I can't just keep farming it. No, it's not like the dream plant. Okay. All right. [Music] I can sell that. But let me buy Why are these so expensive? I'm going to get an apple seed. No stock. Um tier apricot seed in stock. Sure. Buying them. All right. I actually Like I want to just put down all my uh pets. Here's my apricot seeds. Nuts are a great investment. Okay, I can buy nuts as well. Wait, I want to put down all my pets. Okay, cat. All right, I have a cat pet dog. I don't know how they do this. I'm not I'm not even I don't have any mods or anything. Like it's kind of crazy. Um monkey pet be pet. There we go. Okay, now my pets all run around. They give you like buffs, I think. Wait, what do they I want to know what they do. Bet. What does BPAD do? Every 90 seconds, it flies to a random plant and makes it pollinated. When you harvest that plant, you get two times the fruits. Okay. Wait. Ooh. Okay. Wait, I'm getting tons of apricots. It's just It just keeps growing. Wait, should I put Wait, I want I want to get more of those. That feels good. Wait, what am I doing? I'm putting chat. Wait. Uh, I want to get more apricot seeds. No, there's none in stock. Guava. Do I have enough? I don't know how much I have. I have 2,500. Okay, I'm I'm doing I'm doing two of these. I'm going to put them here. Um, let me see. All right. Let's see. Are we farmers today? Yes, we are farmers today. I want to see other people's farms, but also But I want to like plant stuff first. I want to like plant stuff and then go see the farms. So, the admin abuse thing was real. Yes, I am on the server. I'm going to admin abuse. I'm going to do I guess weather events and the weather events will make it that everyone like farms really quickly. So, if you play or if you want to play, you should log on and then when I'm abusing, you can farm lots of plants and get epic plants. Otherwise, we're just chilling and farming. Uh h okay. I'm selling all my fruits. Try growing a garden IRO. Bro, I can't. That's why I'm doing it in Minecraft. How do I get this? Give me Give it to me. Okay. I feel like Okay, so I just I'm going to I can use these to buy more. These are good, too. They go quickly. Okay, I can sell sell all. I buy more. Buy more. Right. What do I want? What's in stock? What should I buy? What is the server, please say? It's in the description. It's Mineville. If you're on Bedrock, you can join just by clicking the Here, I'll You know what? I'll show you. Like, I'm leaving so I can show you. Hopefully. Hopefully, I'm I'm whitisted or something. If you go like just on Bedrock Edition, guys, I don't even know Bedrock Edition like works like this. Oh, look. It's my scuffed like name. You go to play servers and then it's literally just right there. Like, you don't have to add anything. You just click on it. They even made me the banner dream admin abuse and then you just click play or if you're on Java edition then you can use the IP in the description. Bedrock is better. Maybe the better maybe the bedrock server is better. This will not help you beat the hunters. It's all a part of uh my training. I need to be a good farmer. Do you not remember the great potato wars? Those were that was a great example. Farming is important. Farming is important to our society. Um, okay. Guava. All right. I'll get more guava then. Someone in chat said guava. So, we will get more guava if we can. Wait, somebody said nuts a good investment, but I can't. It's out. Guava. Okay, I'm getting more guava. Do I have the money? I don't have enough money. Can I buy one more? Yes. All right, here we go. Come on. All right. I just need like it's like cookie clicker. I need to like quickly get all the get all the plants. Wait, someone's here. Someone's in my garden. Are they stealing from me? Okay. Oh, wait. It had golden golden dream plant as well. Okay. Wait. I need to memorize what these plants are. Wait. Guava is here. This is the dream plant. And this is the apricot. Okay. And then we can sell them. All right. I want to buy more as well. Thank you, Anthony. No message. I appreciate it. What do I What do I buy? I don't know how much money I'm getting. Wait, papaya. It's too expensive. only 507. Okay, I need to just I need to I think I need to farm a little bit. Can you get more dream plants? I don't know. That's actually a good question. Can I get more dream plants? I have the one. I think it can grow bigger and bigger and bigger and I can just like farm it instantly. Olive seeds. I want to get olive seed. I actually love, fun fact, I love olives. Black olives specifically, but I like olives as well. What the heck is this? Okay, I am I think that was brain rot. You know what's interesting? Bedrock Edition doesn't have uh auto sprint. Um, okay. You hate olives. Black olives are definitely better than green ones. I agree. I definitely agree. Have any of you guys like played this already? Like do you have a big Does anyone have like a big farm? I want to see like a big farm. Uh better edition, but which version? It's just like I don't know the default one like the latest one. Maybe all of them. I don't know. I didn't have to do anything special. I just I literally download I literally downloaded bed edition and joined here just fine. When are you ever going to do this in a manhunt? You don't know the next manhunt video, dude. It's six hunters in a garden and I have to farm as many apricots as possible. Okay, going to sell all my fruits. Perfect. How much money? Where can I say my Oh, my money my money's on the top left. I'm just I'm just a doofus. Wait, this is slow. I want to buy more. Oh, there's somebody here. Hello. Hello. Why? What is this dude? Bedrock is so goofy. Okay. Um, [Music] this is peak practice 6 hunters. It is. It is really good practice. I need more fruit. I need more fruit. getting as much as possible. All right, I I'm already back at a thousand. What else is there? What can I buy? There's more mushrooms in stock. There's nut. Someone said nut's good. All right, I'm buying one nut. All right. I don't know how to Look, I'm accepting some people. I don't know. I don't know what that is, but I'm just accepting it. Oh, I don't know if I I don't know where they went. Grow. Nut grow. Should we watch nut grow? What the Oh, $770. Just wait. That is a good investment. That's actually a great investment. I want more grow nut. All right. And we harvest all these as well. Wait, nut nut grew quickly and we harvested it and then we sold it quickly. Even dream switched over to grow a garden. Guys, it's in. It's in. This is all training. This is a part of my training arc. Come on. Come on. What the muffin? Thank you, Shark, for the dono. Hi. Thank you. Um, okay. I'm selling all my fruits. [Music] Okay. Nut grow. Sell it. $800. Perfect. Buy more. I can buy two more nuts. Yes. planting them there. Okay, this kind of cool actually. I like this. I feel like I just don't play grindy progressionbased games. I'm so I just speedrun. That's it. You got to beat them quick. Wait, nut grew. Come on. Yes. Wait, I got three nuts. Wait, nut duplication glitch. All right, I'm selling it. I'm buying more. Give me nuts. Yes. [Music] I don't know if I should be accepting people's requests, but okay. I am I want to do a weather event. That way I can get things quicker because I'm an abuser and I want things quicker. So I'm going to do a lucky thunder lightning event which apparently has a 50% chance of lightning hitting my plant and it gives it 10 times the value when I sell it. And I want it to hit nut. So let me sell this so I can have it hit nut. Uh how do I sell this? Sell. Sell. Let me buy more nuts quickly before before it happens. I'm getting nuts. All right. Now, surely please please please surely Lucky Thunder will strike my nuts. Come on. Thank you for the dono. Stop. Don't at least put a message. Wait, so can I wait or is this not I don't know if the lucky thunder works here. Okay, wait. I'm just I'm just farming. I'm farming. Should I Should I get the Should I grab the nuts? I don't know. All right, I'm selling them. Uh, I'm grabbing all the nuts. Lucky Thunder. Oh, no. It didn't hit my nuts. I can put it down, though. Why is nut so good? That sounds Oh, no. There's none in stock. No, I have no I liked it. Crap. We can get a papaya though. We have 30k. Wait, wait, what? We got 10 times on something for sure. What do we get 10 times on? I don't even know. Something something got struck. All right. Papaya seed. Where do we put this, guys? Where do I put the seed? I want to have a more organized farm. Wait, wait, can give me stuff. Yes. Give me everything. Yes. Yes. That is awesome. Thank you, kind sir or ma'am, I don't know. Thank you. Wait, give me everything. What is this? Candy. Wait. Sells for 20,000. Give me everything. Give me everything. Keep Keep tossing it to me. Give it to me. Yes. Yes. Yes. Yes. Yes. I'm cheating. This is awesome. Wait. Wait, I'm selling it all. I'm selling it all. I don't care. I'm selling the literally the fruits of your labor. Give it. Give it, guys. Give Drop all your Drop all your things. This is a This is a robbery. Give it to me. This is awesome. Yes, guys. Please. Please. I'm poor. Guys, we need to take advantage of the the lucky thunder quickly. How is there a guy in here? Wait. Yes. What is this? Mango. Eggplant. I like eggplant. Boom. Mushroom. Mushrooms are kind of lame. Come on. Oh, when everything grows, it's going to be so marvelous. Do I have more or I'm selling? Sell fruits. So, guys, give me more seeds. I want the seeds. You're giving me the fruits of your labor, but I want the seeds. Golden pumpkin. I guy's moon spirit. Golden squash. Wait. Sell price 11,000. Wait, I'm rich. I have 20 I have 627,000 right now. I'm actually rich. Guys, join the server and give me stuff, please. That's how guys, look, this the only way we're going to dominate the server, okay? Actually, we need to take over the server. And the only way we will is if you all funnel me. I'll be the the the drug or sorry, I'll be the uh the farm king pin and you guys can all funnel me your resources and go and farm for me and bring it to me. This is perfect. This is a great plan, guys. Good smart thinking. Please give me stuff, guys. more stuff. Come on. Accept our TPA. TP accept slashTP accept. SlashTP accept. I don't know if this works, but I'm doing it. I'm doing it. TP accept. Please bring me bring me things. Oh, wait. I don't know. Why am I doing SL? All right. Sell all the fruits. By the end of this, I will be the richest on the server. Oh, they're growing. Yes. Yes, it's working. Oh, it's marvelous. It's beautiful. We will dominate and reach the top. Wait, what's Bowtop? 1.3 billion. What? There's some wealth inequality on this server and I'm here to fix it. Give me all your money. Give me all your money and I'll fix it. I promise. Please. How do you join? Uh on Bedrock Edition, which is like the Microsoft version, just like click on servers and it's Mineville and you'll see a big picture of me and then click join. I can show people again in a minute maybe. But guys, come on. Give me all the stuff. [Music] Keep giving me stuff, guys. It's not enough. Give me that. What is that? Drop it. Drop the pineapple looking thing. Give me the pineapple. How do I chat? Give me the pineapple. How do Wait, how do I spell pineapple? Is it literally pineapple? Give it to me. Come on. You're not going to know that it's me. I'm selling L. Oh, I have a million now. Oh, everything's growing. Everything is growing. I'm grabbing it all. Wait, I'm just going to accept TP accepts as well. TP accept. TP accept. Keep tping. Get in. Get in. And guys, get in, start a farm, and bring me things. And then go back to your farm. Farm for me. You can join on Java as well. You don't have to join on bedrock. Okay. Drop me things. Come on. Drop me things. I'm over here. My skin looks so goofy. Drop it. Come on. Yes. Yes. Yes. Yes. Yes. What is that? We sell all these. Give me some seeds, guys. I need more seeds. What is this? Feather. I don't know what that is. Pineapple. Wait. Pineapple seed. Pineapple seed. We're making this our pineapple. Okay. Pineapple seed. Eggplant. What is this? Wait. Is this eggplant? No, this is eggplant. Do I need to like move it? Is it Wait, it says it's too close. Is it actually too close? I don't even care. I'm I'm getting all of these. How do you got the candy blossom? I don't There's a candy blossom. Wait, that's how I got the candy. Golden papaya. Um, my dream plant is kind of is kind of small. Wait, what? All right. My dream plan is big. Yes. Yes. All right. How do I How do I sell? I'm selling everything. I am actually a cheater. Having everyone farm for you will do the opposite of fixed wealth inequality. No, listen. I'm infiltrating them. Okay? Give me give me your materials and I'm infiltrating. Well, I was going to say the billionaires, but there's only one billionaire. Bowtop, this guy, NPC 6884. We must dethrone them. We have to. And in order to do that, I need you guys to bring me loot and farm for me. This is good. What is this? Wait, guys. Give me all the seeds. Give me all the seeds. Come on. Okay. What is this? What the heck is that? Honeydew seed. Olive seed. Wait, wait, wait. Olive seed. Okay, I'm putting the olives. Wait, why are the pineapples not growing? I'm putting the olives over here. Olives are here. Wait, I've been paid money. Pay me money. Pay me money. Pay me money, please. Thank you. Look. Dream playing Minecraft Bedrock. What universe are we in? Exactly. We're in the best one, guys. Okay, look. I'm I'm actually climbing. I'm at 1.21 million. I need more seeds, though, guys. I need more I need more like OP seeds. I don't know what's good and what's not tier. Fantastic. What's the best What's the What are the best plants? Are these too close? Oh, he grows in five minutes. I need to like jitter click by the Does it actually make it go faster? I don't even know if it makes it go faster. I'm going back to the dream. Wait, why am I not farming the dream plant? The dream plant's OP, isn't it? Let me see. Sell fruits. Okay, I'm farming it. Wait, is it OP? How much are these worth? It's $5 still. Dream plays Bedrock before GTA 6. Let's go. I think that would make sense. I would play a version of Minecraft before GTA 6, but it's odd that that's normally not the case. Dream, are you becoming uh I give up? Literally probably a top three player in terms of farm wealth and can't get a TPN. Okay, I'm accepting. I'm accepting. I'm accepting more people. Bring me the loot. Bring me all the loot. Give me the OPCs. Yes. Yes. Yes. I love you. Yes. We are best friends. All of us. We are besties. Come join me and farm for your own benefit, not my own greediness. Come on. Wait, I paid more money. I'm accepting. I'm accepting. I'm accepting. I'm accepting. TP accept. TP accept. TP accept. Yes. What is this? Pineapple seed. Yes. Plant the pineapple. I really want to see this pineapple. What are they? What is it? Wait. Yes. Help me farm. Wait. Can they help me? Get in. Get in. Come on. Yes. Wait, where are they stealing from me? Are they helping me or are they stealing from me? I don't even know what's happening. Oh. Oh, it's just their footsteps. This is funny. Guys, give me stuff. All right, I am going to I wish they I wish they could literally just farm for me. They can't. What is this? Papaya plus 3,200 from Lucky Thunder. Wait, I'm at 2.4 million. Give me more. There's so much going on. I know. It's awesome. It's not greed. It's seed. Exactly. Keep accepting. TP accept. We need more farmers and people gifting me things. Come on, guys. Give it here. Yes. Yes. There's so much stuff. Sell all my fruit. Sell it all, guys. Give it to me. Come on. What is this? Plum seed. Incredible. I don't know if that's I mean, surely it's good. What the heck is this guy? I don't even understand. Wait, I want to be one of those. Wait, how do I do it? What is it again? It's like Oh, I for I forget what it is. What's the command? It's like something. Oh, it's W. It's this want to be. Yes, I'm him. Okay, I'll change back. Actually, I'll change back. All right. Yes. There's so much loot here. Oh my god. I'm getting I'm like I I am being gifted everything. Sell my fruit. Sell it all. 3.35 million. We're still not even close. Btop. Okay. To get on Btop, we need to We need 200 more million. Give me stuff, guys. Just give me everything. Otherwise, we're not going to do this. And this is a we. This is there. There is no there's no I and we [Music] plum seed. Incredible. Plant some plum seeds. More lucky thunder hit. I don't want to plant any of them that are not incredible. That was great. That maybe that's good enough. I don't know. What is that? Oh, it's Pineapple. Oh, it's so good. What server is this? It's Mineville. Look in the top right. You see over here? Like it says, uh, join to play with Dream. Go to bedrock server. Let's click on Mineville or Java IP. There you go. The top right of the stream. Show us how to enter. Okay, fine. Is it okay? Yeah, I guess it's fine. Look, I'm going to show you how to enter. This how you enter. Okay, look. I'm on the Minecraft home screen, right? It's this simple. You ready? Play servers. Mineville. It says dream live event. There's a big picture of me. Click play. Then click on game selector and click on grow farm. Or just walk ahead and click on grow farm and then join Grow Farm. Boom. Easy peasy. Or you can join on Java if you want as well. I usually play Java, but I wanted to try I wanted to I wanted to try Bedrock Edition for this one. Okay. No, they're gone. No, my farmers come here. I need to accept as many people as possible. Guys, we need as many people in here as possible. Spam me. Send me TPA requests, guys. And bring all of your goods. Bring literally every item that you have. Okay, guys. Give me all your stuff. Thank you. Come on. I didn't let you guys in here to just stand there. You better be farming. Go farm. I'm TP more. TP accept. TP accept. TP accept. TP accept. TP accept. TP accept. TP accept. TP accept. TP accept. Okay, there we go. All right, guys. Wait. Another dream seed. Wait, guys. Wait. Bring me more dream seeds. No, I reached I Wait, I can't get I I can only have one. No, I was trying to cheat. I was trying to have tons of dream seeds everywhere. I can't. Look, you can have your dream seed back, guys. Don't Don't give me your dream seeds. Don't give me your dream seeds. You need to use them yourself on your own farm. I'm dropping them. Do not give me the dream seed. There's a stream delay. Don't drop them. Keep them. You can't I can't even use them. Give me all the pineapple. Wait, is it is it Are they grown? Wait, they've grown. How is this not a mod? I don't understand. Like, how does this work? How I don't understand. Is there a texture pack or something? Like, how they I don't I really don't get it. Give me things. All right. What good seeds do I have? Mushroom. Apricot seed, honeydew seed, pear seed. We have another pair. Hey guys, can you drop me things please? Pretty please let me in. Okay, I'm accepting. TP accept. Accept. Accept. Accept. Accept. Accept. There you go. Perfect. Okay, I want to I want the rain thing. Like, not the thunder one, but the rain one, cuz I think that makes everything gold. Wait, wait, wait, wait. I want to I want to let all my stuff grow as much as possible. And then I'm going to do the rain one cuz the rain makes everything. What is this? It's grow a garden, but in Minecraft, it's grow a farm cuz in Minecraft you farm. And basically, uh, if you've never seen the Roblox game, but it's kind of like that. And basically, you I have a farm and I'm leveling it up and I'm going to win. Btop. Okay, where are we? We only have 4 million, guys. I'm poor. I only have $5 million. Give me your money. Give it to me. Pay me. Uh, drop all your the fruits of your labor to me. Lucky thunder. Accept more TPA. TP accept. I'm I'm spamming it. What do you mean accept more TPA? I'm I'm doing it. Everyone should be here. Come on, guys. Guys, stop standing there and go farm. Drop your stuff. Run back to your farm and then come back, you lazy bums. Go. Go farm for me. All right. Come on. We're Guys, we're not going Look, we're not going to be the top of B top unless you guys farm. I actually need you all I actually need everyone here to to be farming. Okay. Uh, okay. The pineapples are all grown. Okay. I want the rain. I want the rain thing. I want the rain. Staff members. Dream abuse rain incoming. Golden rain or midas rain which is gold. Come on. Come on, start it, guys. Give me your stuff. Take the dream seed. Guys, listen. If your seed doesn't say tier incredible or tier like amazing, don't drop it on me. It's a waste of a seed. It's a waste of a seed if you drop it on me. Wait, it's Oh, it's raining. It's raining. It's raining. I'm farming at all. Quickly, quickly, quickly. How do I get them? It's ready in 56 seconds. No. I thought they were ready. No. Go, go, go, go, go. Come on, Dream Plants. Here we go. All right, dude. TP accept. TP accept. TP accept. TP accept. I can only accept so many people. I'm I'm doing it constantly, guys. Just come on. Get here and farm and don't just stand around. You're you're take look if you get here and if I TP you here and you don't drop all your loot right here and then and then leave and go back to your farm after saying hi you're a waste farm. Come on. We need to do this. We if we're not all working as a team then then we're nothing. We're together as one. There's no there's no I in team. Guys, don't be selfish. Give me all your stuff. Give it to me. specifically me. Okay. Sell fruits. Sell. Are you speedr runninging grow garden? Yes. I'm trying to become the richest person on the server and I'm not going to be able to do that unless you guys all come and give me your money because there's there's enough of us in here. There's enough of us in here that uh we can we can do it. But but it has to be me specifically because we just we what? There's gonna be someone else we can pick that can do it. No. And look, after I become the richest person on the server, I will I will divide my my money up and give it to everybody. See? And then and we'll What the heck? Okay. Sell fruits. So, guys, give me give me give me give me give me give me. Okay. Look, take your take this back, guys. Go plant Go plant these regular seeds. Put them in your measly little farms and then uh come back and bring them to me. Air seed. Yes. Bring bring the good ones to me. Go buy good seeds and bring them to me. Wait, this is going to be our nut farm. You ready? Okay, this is our nut farm. Stop. Stop. Get out of here. Move. Change name. Uh, invalid pet name. Try another. I can't name my pet idiot. Really? Oh, wait. It's Golden Nuts. It's Golden Nuts. Oh, it's OP. I'm selling it. This sell all. Okay, here we go. Dude, do we have to? No, you can be on Java as well. The Java IP is in the top if you just T. You can TP here. I'm trying to I'm TP accepting more. TP accept. This server is all inclusive. You can play on Java or on I'm TPing just everyone. I'm literally just tping everybody. Guys, I still see this same purple dude here. Dude, you've been standing there. Drop all your I see you holding stuff. Drop it. Come on. Don't be lazy. Give me your stuff. Come on, purple guy. WBU 6651, I think. Okay. All right. Now, go farm. Drop your stuff and then go farm. All right. I'm doing this. Sell fruits. So, I I want to take advantage of the might the the rain. Guys, guys, listen. It's Midas rain. Why are you standing around? All of your fruits are gold. Go and farm and then bring them to me. Please. Okay. I don't know what I'm doing wrong. I I need I clearly need to do better. I'm I'm only at 5 mil. Wait. Oh, people are still tping or I'm tping more. TP accept. TP accept. Okay. All right. Come on. All right. Can I sell more? I feel like our farms are not even close to like full. Like this is inefficient. I need to fill these up. What do we have to fill them up? This is great. This is great. Um, this is more Wait, is a golden nut good? I want to see. Why is it too close to another plant? I don't have anything there. I have to shovel it. What? That doesn't seem right. Get him out of here. TPA, please. Come on, guys. Look, I don't want to accept your TPA unless you're going to bring me things. Drop them. Guys, listen. I'm going to show you what you do. Okay, look. This is what you do. You come over here. You run in your farm. This your farm is empty. You're doing nothing. LT Bumblebee, you're doing nothing. Look, you come here, you plant all your seeds, you you grab them, you go like this, you run through your I'm stealing them. I'm Wait, I'm stealing them. Steal. How am I failing every time? How am I failing every time? What? I Oh my god, I just fell like seven times in a row. Guys, look. Okay, you grab them all and then you run out here. You run across the way and then you drop them in my farm, please. Come on. Please. Uh, donation. Is there any type of TP accept all command? I don't think so. No, it said invalid player. I'm accept. I can accept more though. All right, drop your stuff. We're at 5 million. 5 million. We still Wait, how much do we have for Bowtop? 275 million. Oh my god. I'm going to be here a week. Come on, guys. We need to be more efficient. Okay, look. Guys, seriously. Okay, guys. Look. I'm I'm going to I'm going to give back some of the the the wealth. Okay, you ready? I'm giving back some of the wealth. Wait, this is nut seeds. I want those. I want the I want the Take these mushroom seeds. Go plant them. Take these seeds. Go plant them. Oh, I like these. Oh, these are fantastic. Who gave me the fantastic seeds? You're awesome. Pineapple seeds. Incredible. Yes. More, more, more pineapples. We should make this exclusively pineapple farm probably. I'm I'm digging this up. Wait, actually, let me farm it first. Okay, the admins of the server just told me that they are giving away a hero rank to a random player every 15 seconds to a random player. Just you just have to be on the server. As long as you're on the server online, I don't think you have to do anything. If you're just online, a random player will get a free hero rank. I don't know. I don't know exactly what that is, but if you if you want to play the server or you play the server, it's a free it's free stuff. Free stuff is always good. Um, and they they they they made the caveat, you have to you have to give me all your stuff and slash pay me all your money. That's what they said. Word for word. I'm just kidding. They didn't say that part. That wasn't part of it. They just said you have to be on the server. But anyway, uh, TP accept. I can't play Bedrock. Can you switch to Java? There's there's the Java IP in the top right as well. if you want to play on uh Java. Okay, guys. Wait, I have so much stuff. Okay, I'm at five. Well, I'm still at like 5 mil. I need to plant this stuff. We need to make one of these are like great. Okay, I'm making this one our like. Let's break all of these. Look, I'm going to be I'm going to become the best farmer known to man other than the late great Technoblade. I'll be the second best farmer. Okay, maybe the third best. I think squid is pretty good. Um, all right. Here we go. I want to plant fantastic seeds here. Fantastic. Fantastic. Fantastic. Those are pears. These are apples. Uh oh, these are incredible. Wait, is this plum? I don't remember. Wait, I'm already messing up. How am I already messing up? Okay, placing these here. Do TP accept all. Guys, it's not a command. TP accept. I accepted more TP request though. Um, one second. Um, okay. All right. So, these all need to grow. I just scooped up all the loot. Okay, let me sell this. Guys, give me fruit. Wait, I need those really good ones. The candy one. Wait, guys, give me a candy thing. Whoever brings me the candy seed gets admin rank on the server. That is what I was told. The owner of the server told me that whoever brings me a bunch of candy seeds will get admin rank on the server. Why is my skin messed up? Why is bug rock? Why is bedrock so buggy, guys? Whoever brings me the candy fruit is this it celestial grape rainbow apple. What is that? Those sell for so much. Bring me the seeds for those. How do I get those passion fruit seed? Wait, is that good? Golden candy. What? How do we join your lobby? Um, you can try and TP to me. Um, I'm on I'm on an alt because I don't have Dream on Bedrock. So, that's my name. It's Dr. Killer Killer. I know it's a banger name. Dr. Killer Killer. Guys, give me stuff. Come on. I'll accept you. I'll accept your TPA request if you give me things. Just tell me you're going to give me things and I will accept it and and and you can give it to me. Okay. What do I have? Let me see. Grown man playing grow. Yes. Look, we need farmers in this world. The whole the whole ecosystem is built on farmers. The backs of farmers. The reason you can live and say that a grown man playing grow is because of the farmers that built this land. Um, give me stuff, guys, please. What are the seeds there? Okay. Passion fruit seed is good. I like that one. And plum is incredible. I'm planting the plum. I don't remember where. Somewhere over here. I think that's probably plum. Passion fruit. Let's put this back here. Get rid of that. Do we have anything else good? Squash is magical. What does that mean? I'm putting squash over here. You can TP all at once. Check chat properly. TP all at once. It's not a command, guys. It's not a command. You guys keep saying commands that are invalid. TP Dream. TP accept Swift Strike. TP accept a message was deleted. Oops. Um, I hate his garden organization. Well, then come organize it for me. What are you doing? Sitting around critiquing me in chat instead of growing your garden and then bringing me your stuff to grow it more. Candy, wait, I have so many apple seeds. Who did that? Who gave me the apple seeds? Why do I have no candy seeds, guys? I'm planting these apples. Wait, apples are here. Look, the pineapple next to the apples. Oh, this is good. This is going to be a This is going to be a good garden. All right, I'm putting Wait, I'm putting text on the screen, guys. Like, I'm duplicating this. Uh, you guys need to help me, and I need you guys to know that you can help me. How do I How do I do this? Copy. All right. Whatever. I'm editing this. How do I edit this? Editing this text. Join me and help me become the richest on the server. Farm for me. All right. We see this. Where does it go? There we go. Yes. Join me. Oh, wait. No, no, it's over this. Crap. What am I doing? It's all going wrong. Ever since we stopped farming. What if I put it here? Is this good? Is that stupid? I don't know if that's stupid. It's going to be stupid or whatever. I'm turning it off. You guys get the point. All right, I'm back in game. Uh, I've got stuff. Okay, you better have candy. Wait, what is this? Oh, my inventory is like so full. Sell fruits. Sell all. Okay. What's he doing? Sakira, can you see that I'm farming and creating the greatest farm empire that has ever existed on Mineville? You really have to You really have to ask me what I'm doing. I'm training for six hunters. Can you not tell? All right, here we are. Sell fruits. Selling them all. All right, let me see what seeds I got. If you guys didn't give me candy seeds, like I I want I want you all gone. Okay, we still don't have a candy seed. We have no We have eggplant seed, though. Magical eggplant. Look, this is the owner. Owner, they're not giving me candy seeds. Kick them all. I need a new batch of people to actually farm for me. Get them all out of here. Please. I don't know if you can do that, but please do. No, you can definitely do it. Do it. Get them all gone. I hate you all. No, I'm just kidding. I'm joking. Give me stuff. Rainbow apple. Wait, that's good. Okay. Sell fruits. Is there a way to turn the fruit into seeds? I don't think so. Wait, what if you eat it and then you poop it out? I don't know how to do that. Rainbow apple. Who's giving me the rainbow apples? Sneak. If you give me the rainbow apples, shift, if you give me the rainbow apples. Who's doing it? Somebody's doing it. Wait, you're doing it? Oh, that can't. Okay, that's kind of stupid. I guess everyone can hear me. They're just going to be liars. What is that? Okay, that's like nothing. Get that out of here. Um, apple. Rainbow apple. Who Who's giving me all the rainbow apples? TP accept all. TP accept all. Guys, it's not a player. TP accept. All right, I'm accepting some. What is the game? Can you explain? Okay, here I'll explain the best that I can. Okay, you join the server there. You have plots of land. You can buy You start with like very little money. You can buy seeds. You plant the seeds. The seeds grow slowly over time. You walk around. You harvest the seeds like this. You click on them and it harvests them to like take them and pick them. And then you sell them on the market like that. You get money and you become the richest person on the server. Or sorry, you don't. I do. But you can become the second richest maybe. Um, wait. Okay. I want to name I want to I'm taking a Guys, look, I'm going to take a short farming break to name my pets. And if I don't see rainbow seeds or whatever the heck it is, candy seeds on the ground, by the time I'm done naming my pets, you're all getting banned. And that's what the owner said. The owner said I can do whatever I want. They said it's admin abuse. And that's why they titled it admin abuse. Okay. All right. Now, I'm I'm going to look I'm going to look right now and check and see. I don't see anything. All right. You have until I'm done naming my pets. Uh, what do I name them? Guys, in chat, look, I'm going to I'm going to give some I'm going to give Twitch chat some special treatment. Twitch, give me a give me a name for my cat. My my blue cat. Hurry up. I don't want to wait. Come on. It's the first one I see. The first one I see. Bob. That was the first one I saw. It was Bob. All right, Bob. Wait, why does it not show up above its head? Come on. Okay, YouTube chat. First one I see. What do I name the bee? Where's the bee? There it is. What do I name the bee? Benson. Benson the bee. All right. Where is it? I'm like lagging. Let me turn my render distance down. I don't know how this I don't know how better works. Uh where is it? Video 96 chunks. Is that like a lot? I don't know. Uh, I don't know if this is like good or not. Surely that's better. Oh, what did I turn it up or down? I think I see more now. I don't know. I'm like I'm lagging a little bit. Uh video. I don't know. Okay. TP accept. Okay. Let me see. Do I have candy? Celestial grape. Guys, somebody tell me how the how I get the candy. Wait, is that on the market? Let me see. slash uh wait. Okay, I'm selling all this. Sweet. We're at 11.9 mil. I'm clicking on this. Let me see. I'm going to see if I can buy them on the market. Buy seeds. Ooh, wait. No, I can't buy them. Get from a bundle. Oh, wait. I actually have bundles. Wait, where's my bundles? How do I How do I How do I see my Oh, wait. Slash bundles. Oh, I'm only going to get an apple seed. Come on. I want to I I want the the candy one. Give me the candy one. Wait, where is it? Eternal bundle. Eternal bundle papaya. Uh, I guess I'll take it. I really want the the uh pumpkin. Can I get it here? Well, yeah, I can. Open bundle. What is this? Golden pine. Pineapple pumpkin. Still, I want the stupid passion fruit. No, I want the rainbow stuff. Give me it. You didn't name the be. I forgot. But his name is Benson. Okay, I already know it. 50,000. Okay. Well, that's kind of OP. Just give me Look, I don't want to open too many bundles. Just give me the damn rainbow apple, guys. Give me Rainbow apples. Seeds. Seeds. Not the rainbow apples. I know you have seeds because I see the rainbow apples. Please. Please. I I I don't want to have to open a thousand bundles. Give it to me. I don't know how many to be fair. It's probably Wait, what are the odds it say? Oh, they're rare. That makes sense, I guess. Okay. Uh please, please, please. $50,000 cash, please. Candy. Monkey pet. I already have the monkey pet. Oh my god. Do I really need to just farm more? Give it to me. Give it to me. I already have a monkey pet. I want another monkey pet. Oh my god. I need to sell my stuff. Sell fruits. Wait, we're actually Wait, we're kind of rich now. 12 million battle top. Okay, we're like not really that close, but we're getting there. H I really I I don't want to keep opening bundles, but I want Rocky's Moon Spirit. Wait, this is kind of cool. Is that rare? Oh, no. But it's not that rare. I think it is rare, but it's not it's not what I want. Give me the candy one. Just give me the Wait, what is this? Yes. Candy tree. Where are we putting it? I'm putting it right here. Boom. Wait, what? Oh, I I just planted something else. Get out of here. Candy tree. Yes. Okay, we did it. We have a candy tree. All right. All right. Look, I'm selling the dream views. No. No. Guys, stop accusing me of cheating. Stop. Okay, I'm going to drop Wait, I'm going to drop my trash over here in this person's farm. Lil Bean, where's Lil Bean? Hey, Lil Bean. I'm I'm going in your farm. I'm going to drop you some Wait, Lilian, give me all your stuff. Come on. Give me it all. All right, whatever. I'm going to drop some trash in your farm. I don't want that. I don't really want that, to be honest. I'll drop the dream seed. I don't want the string. Tropical fish. All right. Now that I'm done littering, I'll leave your farm. All right. All right. Okay, here we go. Uh, let me sell these. Maybe maybe my farm is like good enough now to where if I farm it, it's actually like good. Cuz before when I would farm it, I wouldn't end up with enough to like justify the time I spent farming it. But maybe now that's changed. Let's see. I'm just running through this farm. Do I have more? Come on. Give me stuff. Give me all this loot. There's just so much I want to give you everything I own in the game. How to how to TP, dude. TPA slashTPA space uh Dr. Killerkiller, I think. Please, I will I will I will let you come. Why are you farming wheat? I'm not. This is all legal. What? Bob, get away. So, okay, that was Oh, guys, just drop me stuff, guys. I can't be I don't want I You really want me out here working in the farms? Just please, just My wrist is broken, guys. I don't want to farm. Just Just give me all your stuff and I'll and I'll farm the candy tree when it grows, please. Sell fruits. Sell. Stop shaking your head. No. And give me my stuff. Give it all. Please. Please. All right. TP accept. I'm just accepting more people cuz you guys clearly need more people to give me stuff. Guys, give me If you don't give me things after I TP you, you you get banned from the server. That is what happens. I'm just kidding, guys. Um, all right. Well, I did get something that I wanted to look at. Uh, buy seeds. I want to buy Wait, wait. Why is squash seeds so much? Rainbow apple seed. Um. Oh, I'll buy that. Oh, there's no stock. Okay. Well, let me sell all my stuff. Guys, look. I'll give you guys some good seeds. Wait. Pineapple and pumpkin. Pineapple here. Oh, wait. Stuff's grown. The candy one hasn't grown, though. When is it going to grow? 7 hours. This is a meme. Seven hours. How do I make it f How do I make it faster? Can I like upgrade it to make it faster? Props. Wiki. Where is that grow time? 28,000. Okay. No wonder. No wonder. No wonder you guys are being greedy about the please just one full minute of accepting people. Okay, DP accept DP accept DP accept TP accept DP accept TP accept. Well, I'm on a new server. All right, guys. New people, guys. I'm I'm I'm accepting you guys. Give me stuff, sir. Give me things. What is this? Crimson pineapple. How' you How do I get it? Hey, the guy left. Okay, I'm tping I'm ting you guys one at a time. You ready? Keep accept. Hey, give me stuff. Come on. Come on. Come on, Nugie. Give me things. Please, please. Really? Really? Miss Mighty Cab, give me things. Come on. Please. Really? Okay, I'm done with that. I'm done with that. I'm just I'm accepting in mass. Clearly. Clearly peer pressuring one person doesn't work. I need I need the masses. This is brain rot. No, it's not. You want to see what brain rod is? Watch this. Okay, that's bring. Uh, I'll turn that off, though. All right, what do I want to do? I'm going to sell this all this stuff. Sweet. I got a lot of money from that. Wait, am I in someone else's farm? I was actually thinking, why is this so organized? It's cuz I'm in someone else's farm. Wait, where's my farm? Is this my farm? I don't know where my farm is. Let me TP to my farm from here, I think. teleport to farm. Aha, I'm back at my farm. And I'm farming. And I'm farming. And I'm farming. Oh, someone did TP ex TP it here. That makes sense. Look, a whole bunch of you here now. Look at that. A whole bunch of you here. Help me farm, please. Okay. Going to sell this. Um, let me check the shop again. Buy seeds. I'll buy one of these. Oh, there's no stock. I think I need to check quicker. I don't know the timings, though. Um, how come every Roblox game gets put into Minecraft? Because they're both like sandbox games. Like, it makes sense. TP accept. No, I got TPD here. Damn it. Oh. Thank you. Yes. That wasn't That was like $400, dude. That was like $400. Hey, really? Only $400? I'm I I only have 12.8 million. How do I Wait, you said there's an auction house. Is there actually 265 million is still the richest. I'm ranked 290, guys. I'm the 290th ranked richest player. We can get into the top 100 for sure. Especially if I go I'm going to go back to my farm because I'm like wasting time. Okay. All right. All right, I'm back in my farm. I can farm up, son. I can farm up some. You're on the server right now. Good. Join. Join me. Farm with me. Farm for me. I'm just getting more. I'm just harvesting as many crops as I possibly can. sell 14,000. Just clicking clicking. How much should I get for that? 2,000. Okay. So, this this whole like area is useless. It's like it's these it's the these are the big money ones, aren't they? I don't remember these big money ones. No, they're not. Wait, what? Where are the big money ones? Oh, I like that skin. It's kind of cool, I think. Where are these big money? These are pretty good. What's the best? What? What's the best one? Pineball's 1,500. That's pretty good. What's the best one that I have? I don't know. Um, what is this? Is this good? Wait. Golden candy. Yes. Give me more. Give me more. Wait. Give me all the candy. Guys, guys, guys. Guys, we're ranking up. Wait, I'm going to check. I'm going to sell and I'll see how much I rank up. Please, please. 13.35. Okay. What's our What's our rank now? 287. We We moved ahead of three players. We're slowly moving up. Give me candy, please. Yes. Yes. Please. More. Yes. Give me the candy, please. Yes. Yes. Yes. It's so good. It's wonderful. Wait. 13.47. I can farm this while while I get stuff as well. Thank you, Dazed Orchid. You're the best. Except TPA. Okay. Okay. Okay. You're right. You're right. You're right. I should All right, there you go. Wait, what? Did I TP to someone again? No, I didn't. Is this my farm? Oh, this is my farm. There. All right. Hello. You want to give me things? Slime. Um, is that Minecraft Bedrock? Yeah, shocking. I do not ever play I've never played Bedrock before. This is my first time playing I downloaded Bedrock Edition literally to play this game. Okay, they're still they're still doing the hero rank, right? But yeah, you still they're still giving away hero rank if you're on the server. That's pretty cool. Billboard. Let me sell all 13.5 million. I feel like we're still so far from what we need to be. Well, yeah, you can play it you can play it uh on Java as well, but I wanted I wanted to experience it on Bedrock. Do TP auto. TP auto is unknown command. All right. How can I join you? Um, you can uh go to the Bedrock server list and click on Mineville or you can use the server IP on Java. It says it in the top right of the screen if you'd like. All right, I'm selling all the fruit. Look at the seeds. Par seed. Fantastic. Let's see. Oh, what? Wait, wait, wait, wait, wait, wait, wait, wait, wait, wait. Okay, I have a rainbow apple seed, a crimson pineapple seeds, and I have celestial grape seeds. Are they quick? I'm guessing they're not quick. Look, I made a pattern over here. Guys, move. You're You're in the way of my plant. Celestial grape seed. I'll do that here. Uh, and then rainbow apple seed. Wait. And then rainbow apple. This is epic. Oh, there's so much. There's so much. Do you ever get bored of Minecraft? How can you get bored of Minecraft when there's so many different things you can do? One day you can be speedrunning against six hunters and the other day you can be speedrunning against a thousand farmers. How can you ever get bored? It's actually impossible. Wait, look. That's so satisfying. Crimson pineapple. Oh, it's actually really good. Look at me. Look when I like harvest it. It's so satisfying. Watch this. Boom. Boom. Boom. Boom. Boom. Boom. The crimson pineapple is the most OP. That is crazy. I'm selling. So, all right. I have gold fruits to give you. What's your IN? Tell me your gold fruits to give me. You better tell me your because I need the gold fruits. I need the crimson pineapples as well. That's the biggest thing that I need to be honest. Um, here we go. All right. Um, is there any more plants in here? No. Oh, wait. There is. Wow. Well, there's so many of these. So many rainbow apples. More, more, more. Are fights enabled on the server? Yeah, you can go fight people and then uh you can steal all their all their farm stuff. I'm just kidding. That's not true. Fights are not enabled. Otherwise, I'd be fighting each and every one of these people. 17.9 million 23 minutes to let those regrow. All right, let's let's just look at what we have. Oh, yeah. The dream dream plants. Check the leaderboard. All right, I'll check the leaderboard. We're 231. We're number 231. Ah, we actually have moved up. We're moving up in the world. Um, I need more people though. I need more people. Like, actually, I feel like if we don't get more people, I just will not have enough stuff. All right, there we go. Come on, give me stuff, guys. Please. Wait, I have more stuff. 18.75. All right. Wait, there's stuff behind me. What are these buttons? more more stuff. Guys, I can't use the dream seeds. You only have one per farm, unfortunately. Um, thank you guys. Wait, that's actually really good, guys. Good job. TP Tropical G. TPA here. Tropical G 1890. There you go. Oh, invalid player. Did you type it wrong or did I type wrong? I think you typed it wrong. Unfortunate. Uh, let me sell sell all these fruits. Yes. 150. What? I had like so many fruits. What did you guys do? You guys harvested nothing. You harvested ant food. You harvested like seeds. TP accept all, dude. Um, TP accept all, dude. Invalid player, guys. Stop saying TP accept all. Um uh I thought it was TNT for a second. Oh, what is this? Oh, it's just a pineapple. Candy. Yeah, the candy trees grew. That was admin abuse from me. It's okay cuz it's allowed. Have a sip of my drink. All right. I need stuff. You know what I'm going to do? I'm just going to I'm just going to grind for a minute and see see if we make any progress. Lucky Thunder. Let's see. Should I organize this? [Music] Wait, how are we getting Oh, that's eggplant. I thought it was tropical fish. I was like, how are we getting tropical fish off of the tree? TP accept all. It doesn't work, guys. It actually doesn't work. [Music] Mhm. All right. Intriguing. All right. Do I have any interesting seeds? Let's see. Let's look at our inventory. We got an olive seed. I mean, these are all Wait, plum seeds are good. I mean, they're not great, but they're good enough for me to be worth planting. Passion fruit. What was the Is it just like basically pineapple? That's the one that's really good. We buy more. by seeds. [Music] [Music] Yeah, I guess I can't buy any of those. But I could buy a squash seed. But why is it so exp Oh, there in stock. Why is it so expensive, though? What is that? 200. Wait, is that 250? That's 25 million or something. No, that's two million. I don't know, guys. Give me stuff. Please, just let me just give me give me things. Okay. Hey, look. Guys, I'll dance. You guys can give me things. Boom. Boom. Boom. Boom. Boom. Come on, give me things. Accept more people. Yeah, I don't think these people are giving me enough. TP accept. TP accept. TP accept. TP accept TP accept all quotation mark slashTP except all. It will work. Trust me, it doesn't work, guys. Seriously, just stop trolling. All right, I'm going to sell sell this. I've got gold fruits and a couple gold seeds for you. Um, is that good? I think the gold fruits are not that good. Well, no. Actually, the gold fruits are good, but it depends. Right now, we're we're $20 million, though. If you only have a few measly gold fruits, I don't want them. I want the candies. Come on. Give me the good stuff that you're hiding. I know you're hiding some good stuff. Go ahead and give it to me, please, bro. Do slashtp accept. TP accept. TP accept. You have a full inventory full of gold fruits. Bring them here, sir. Ma'am, bring them here. TP accept. Guys, bring me all the gold fruit. Guys, listen. You better be farming. I'm I I'm being so serious. You guys better have a farm that like looks similar to mine. And you guys better be running through it, collecting all the farms, and then bringing them to me so I can become the richest. Wait, guys. Slashpay me. Wait, guys. Guys, my IGN is Dr. Killerkiller. Dr. Killer Killer like that. Do slashpay space doctor killer killer and pay me please. We'll be the richest. We can become the richest. Where are we right now? Where we Where are we on the list right now? Let's see. We are We are number 212. 212. We are so close to the top 200 already. I'm accepting more requests. $6,000. Thank you for Thank you for the $6,000. Oh, wait. That wasn't somebody. That was me selling fruit. Okay, I'm a little a little dumb. Am I getting paid? Really? I say everyone pay me and no one pays me. Are you guys poor? Pay me. What is this? What the heck? There's so much stuff. Yes. Wait. Wait. That was big. That was actually big. Where are we now? 201 guys. Drop stuff. We're at 201. Come on. I'm farming this. Guys, look. I'll farm. By the time I come back here, there better be more. What is this? Crimson pineapples. Oops. I didn't mean to TP except crimson pineapples. More of them. Okay. Surely surely we're top 200. We're 189, guys. We're We're so rich all together. Our money. It's our collected. Guys, I'm Look, guys. I'm starting a bank, okay? It's called the dream bank. Basically, it's not my money. It's our money, but it's just in a bank. Imagine you're putting your money in your bank. You can come retrieve it at some point. You know, we can share together, but you're putting it in the bank. The dream bank for now. Please. Then we can take down the top guy. He has a like a billion dollars. We are so far from a billion dollars, guys. We actually need to ramp it up, guys. Get to planting. Look, the seeds are good. Wait, guys. I'm getting back to you guys, guys. Seriously, take these seeds, go plant them, and bring them back here. Come on, please. We need some farming action going on. Otherwise, it's just not We're not going to be able to do it. Okay. All right. Sell more. Okay, I'm going to accept more of you guys. TP in here. Yes. Boom. Bunch of stuff. Give me stuff. Give me stuff. Give me stuff. Give me stuff. This is going swimmingly. What are all of these golden apricots? I mean, it's fine, you know. I'm not going to say no because I can just sell them. It's not I'm not really There's no downside to me refusing them, but I will say you could do better. You could definitely do better. Okay, I'm going through this farm. I think it's This one's good. We got all the pineapple. All right, let's sell all this real quick. I don't even know if it's worth going up there and grabbing those. STP accepted more people, therefore I expect more loot. [Music] Guys, I'm not going to be able to farm after my wrist surgery like for a bit. I'm not going to be able to farm. Wait, what are these? Crimson pineapples. Why are they so good? And wait, can you guys can you farm them quickly? Wait, I think I have No, I have crimson pineapples. You can't farm them quickly. Thank you. That's awesome. 24.7. All right, let's see where we Let's see where we're at. Where are we at on the richest players list? These are the richest players on the server. 178. Wait, did we fall? Wait, no, we're higher, right? I think we're higher. 178. What is this passion fruit? I mean, we'll we'll take it, guys. Just drop me all your stuff. Come on. and go to farm slashtp accept all slashtp accept all guys just give it up it's not a command. All right. Are you reaching the top today? I mean the top is a billionaire. I think it's very unlikely, but we could uh we could try and see. Um [Music] [Music] give me everything. Who is the top player and what is their name? MPC6884. [Music] Well, who the heck is that person? How do I like Can I click them? I have so much stuff. I want to I want to like talk to them. I want to fight them. Um, please speedrun normal. This is this is part of my training arc. All right, there we go. Okay, we're at 25 million. Let's check out our rank. 25 million. We're at 177. We're still moving up. We're still moving up. We have a long ways before we're getting to the top 20, though. Accept more people. Okay, TP accept, guys. I'm accepting. Send a TP request. Oh, well, I got sent to a farm. Uh, give me things, please. Give me things. Yes, yes, yes, yes, yes, yes. Give it all to me. Please, yes. He's farming for me, I think. Is this for me? Are you farming everything for me? I think so. Watch. He's going to He's going to end and then just not not give it to me. Please. Come on. Impostor. Yes. Give me stuff. Yes. Yes. Yes. Yes. Yes. He's He's helping the cause. We are going to be the richest on the server. Sell fruits. All the fruits. Sell all. All right. That is epic. 25 million. He He might give us a 26 million. Thank you. Thank you. You're the goat. Give more. Come on. You can drop. Press like control Q or something. Wait, I think on Mac that like quits, guys. Be careful. That like quits your game. Be careful. Yay. Wait, there's more. Wait, those are the good ones. Ooh. Oh, I saw you had more of those. You didn't drop them, though. It's fine. I'll let it pass. You gave me some. Not greedy. Okay, you're dropping them kind of slowly. I do. I mean, I want to stay cuz I like the free stuff, but it is it is coming kind of slowly. Thank you. Yes. Impostor is the best. All right, I'm going to sell all these. Let's check where we are on the on the bow top now. We are 170. Cool. Yes. How do you have more? just somehow always have more sell fruits. Sell. All right, I gotta leave, man. I I You got to either drop it all or All right, I'm going. I'm leaving. I'm leaving. Thank you. Wait, crimson pineapple. Boom. Wait, what? Oh, okay. I teleported to my farm. Thank you. Sorry, I didn't mean to leave that quickly. All right, I'm TP accepting. TP accept. TP accept. TP accept. Guys, give me things. There's so many of you here now. Please give me things. Hey guys, my skin is so messed up on Bedrock, guys. Guys, there's too many people. They're not going to They're going to get all the stuff that they drop. And that's not good. TP except for two minutes. I'm not going to do it for two minutes, but I'll TP accept a couple. Okay. I don't know if I ever farmed these. Sure I did. Okay, I did. They're olives. Stupid olives. I want more. I actually want more. [Music] Okay, here we go. Sell fruits. Let me see if I have more seeds I can buy. Do I have any more good seeds to buy? Like, look, some people would say that it's cheating to let other people farm for you and then claim to be the best farmer. That's what some people would say. I don't know. I don't know why my skin's messed up. But not me. I say that I can have everyone farm for me. And that means I'm the best farmer because I'm efficient. I never actually joined a real server with anyone. You know, you know, actually that's really cool, Star. And genuinely, like obviously this is a sponsored stream, but genuinely if you've actually never joined a server, you should join this server and meet people and like try and find friends. I found so many of my best friends on Minecraft servers. Like the first server I ever joined, I met Bad Boy Halo. I met Sapnap on it. I met a bunch of people on it. And then the next the second server I played like later on I met other people like awesome dude and George and bunch of other people. So um so yeah even though this is the dream event and also right now if you join the server you literally there's a massive dream here. So, uh, yeah, I mean, you should join just to see that, but all right, I am farming. I kind of want more. Wait, look. Look at the monkey. Where'd it go? There it is. Where' the monkey go? It's so cool. Look at the monkey. Anyway, what's the name of the server? It's Mineville. I have loads of gold fruits for you. Um, then bring them to me. Bring them to me. I'm going to TP accept some more guys. TP to me and give me your fruit. Give me the literal fruits of your labor. Wait, I kind of want you guys locked out of the farm so that way you have to throw it in. I play bedrock on that server. Yeah, seems like you can. I've never played bedrock, but now I am. I didn't get I didn't get to see the monkey. Let me find him. Where is he? Where is There's There's There's other There's my other pets as well. Look, there's my cat. My cat Bob. Uh where where did the monkey go? Monkey see monkey do. Oh, look. It's It's my uh flamingo. Look. Look. It's my flamingo. Look at it go. It's so nonchalant. Okay. Uh, where's the monkey? Where the heck did my monkey go? There's my dog. There's my bee. I'm just going to sit here and surely he's going to walk by me. There he is. There's the monkey. Crap. He's juking me. There he is. Come on. Look at him. He's He's running for me, actually. There he is. There's the monkey. Okay. Anyway, guys, I need more money. I actually need more money. Please, can people steal your fruits? Like on Roblox? Yeah. Like, here, I'll go steal some fruit. It's like there's a chance if you go up and steal someone's fruit, there's like a chance of it. What fruit do I want? I want to take this one. Steal. I failed to steal the nut. I'm stealing it. I failed to steal the apricot. I'm stealing this nut. Yes, I stole the nut. I stole the nut, guys. It's wonderful. The nut has been stolen. It's wonderful. Um, now I'm selling it all. [Music] Uh, let's see. What's my strategy here? because I feel like my farm is not OP enough to make millions of dollars a minute. Like I I have to actually farm. But if I had lots of people that were also farming, we could become the richest on the server. But probably not if we're not able to. Do these all grow again? No. The only way we'll get first is by selling ow seeds. What's that? Does dream read chat? Yes. H [Music] I'm collecting all my fruits. Selling my fruits. This game is awesome. I think it is pretty cool. Okay, there's too many people in my farm. I need them out, guys. I need you to be outside. Come on. Come outside the farm. Follow me. I can go to I can go I can go teleport to my farm. I can teleport somewhere else maybe and then teleport. I don't know how to do it. Open vaults. What is that? Oh, I can like put my items away. Wait, I still have bundles, I think. Wait, candy tree seed. That's my next extra reward. Wait, I have it. I plant more than one. Oh, that's OP. That's OP. It's going to take a while to grow, but that's OP. Wait, what other bundles do I have? Bundles. Pa seed. H. Eggplant seed. Passion fruit seed. mango seed. Okay. Well, I mean, we can't ignore these fruit. Like, it's still they're still good. We just have like higher standards now cuz we we've had all the we've had the candy. Candy has like corrupted our mind. [Music] Just collecting more fruit. Can I not There we go. All right. They're giving away ranks, by the way. Every 15 seconds, players are winning hero rank. As long as you're online, it just picks a random player. So, make sure you're online and you could get a free rank. Why not? It's free stuff. Don't you want to take advantage of free stuff? I think so. Plant high paying seeds. I have They just don't grow quickly. Look, all these are like not ready. and we'll be ready in 20 minutes or something. Candy. I have a million 1.8 million worth of gold fruits for you. Where? Where? Where? Where? Where? I don't know what your name is. solo act. You keep saying that, but I don't know where. I will TP to you right now. But if you're lying, you're getting banned. Let's sell these. I just want to check where are we? We're 30 million. What's our rank? 150. We're in the top 150 players. Wait, a new billionaire has entered the ranks. Dine Vader. We must eat the rich. We must eat the rich, not eat the fruit. We must sell the fruit to eat the rich. And when we become the rich, we will eat each other. It's only fair. You've been on 30 mil for a minute now. I know it takes forever to uh go up. We need a new strategy. What's a good strategy other than just having everyone give us free stuff? [Music] What is the best strategy? Uh Someone said, \"I am the one who's the new billionaire.\" You're a liar. If you're the new billionaire, then pay me pay me a billion right now. Selling stuff on ah is that actually a thing? Ah. Oh, wait. What? List item. Five minutes. Let me see. What item do I have? That's good. An apple and a pork chop. All right. I'm trying this. I'm trying this. List item. Select a price you want for the item. 50k at least. All right. Dream fruit. I'm auctioning it. I'm auctioning Dream Fruit for It's Dreams Dream Fruit. I'm auctioning it for a million dollars. That's 10 million. I don't care. Dream fruit added. How do I know when my auction stuff happens though? Someone bought my apple 50 50 for 50k. Wait, someone to buy my thing for my dream fruit. Dreams dream fruit is up on the auction, guys. If you want to buy it, surely you're not poor. Surely you can afford it. I mean, it's only a million dollars or 10 million. Fine, I'll put up tropical fish for how much do I want to do? What's reasonable? I think 800,000 or 700,000 I think is good. It's Dreams Tropical Fish. Come on. 700,000 seems very reasonable for Dreams Tropical Fish. Yes. Wait, they bought it. again. I'm selling another tropical fish. That was quick. So, now I'm devaluing devaluing it technically, but I'm making it 760,000 tropical fish. Yes, people are buying it. Wait, what if it was worth more than that? What if it was actually worth more than that? I don't know if it was. I just assumed that it wouldn't be. Um, what else do I have that I could ah I have pork chops. I guess I can age some pork chops. Wait, let's do for 1.4 million. I auctioned a pork chop. I don't know what it's worth, but it is a pork chop. And that means it's related to a pig. They bought it for 1.4 million. Wait, I'm putting another one out. This is the strat, guys. This is actually the strat. I put another pork chop up and it got purchased. Yes, it's working, guys. Sooner rather than later, we will be the richest person on the server. We're at 46 mil. Where are we now? We're almost top 100. We're 104. Guys, look. Little did I know hard work pays off. Like, I thought I could just mooch off of all you guys. But I can I can auction stuff. I can work hard. I can actually like work hard on myself by myself and like do all the work and put it in. I don't have any more pork chops, though. How How did I get them? I think I I think you guys gave me those. Give me more so I can work by myself again. I'm going to TP more you guys here. TP accept. TP accept. TP accept. TP accept. TP accept. Okay. [Music] All right. [Music] What do I have to auction? I don't have any weird items. I can try auctioning a mushroom. I'll try I'll try auctioning a mushroom cuz surely no one's no one will buy that for 900k. A mushroom seed. No one will buy that for 900k. It's just not going to happen. What could I sell? Guys, give me stuff that I can sell in the auction house. Give me like pork chops or like items that aren't seeds and food. Wait, someone bought the mushroom for 900k. H, what about blackberry seeds? This might be the strat we can do. We can do 600k for this one. Seems like it makes sense. [Music] Okay, we're at almost at 50 million. We're so close. 50 mil. Wonder if there's Oh, what is this? I can farm this. Maybe it's ready in 3 minutes. [Music] I'll TP more people here. TP accept accept. Guys, we're so close to 50 million. We only need like 400. But we only like 500k more. We only need like 500k more and then we're completely set. How close are we? We're 98. We're 98, guys. We're actually getting far. I need I need Guys, give me more weird items. Actually, please. I'm spamming TP accepts. Wait, wait. I need to Okay, I'm going in. Guys, I'm hiding. I'm I'm going over here. I'm going to TP accept people until we get what we need. I need rare items, guys. I need like pork chops and like that stuff. Give me rare items. Just come on. The problem is you guys can How are you going to How are you going to get it to me and not someone else? Come on. Give me rare stuff. Give me rare stuff. We're back or I'm just spamming it. I'm just spamming accept. All right, there should be a lot of people here now. A lot of people to give me stuff. Yeah, the server is a featured server on Bedrock. So, you can just go to the server tab and it will pop up without any else. Mhm. All right. Bell top. What is a Okay, let me let me think for a second. We're 98. We have 51 million. Yeah, there's a lot of people here, but there's no good loot. Let me look around. How did people get pigs and stuff? Let me think. 999. I just got a million dollars from Lucky Thunder. [Music] There might be some kind of glitch that we can do to get us a pig. I don't like not having auto sprint. Let's see. Okay, we're way up here. Is there anything we can do up here? What if we can escape out of this? Escape like out of the wall and then get a pig. That might be the strategy. [Music] Okay, nice. Some mushrooms. Not what we need, but it's still nice. I'll still accept it. I'm not going to turn you away just because you're poor. Of course, whatever you can afford, it's fine. Just put it in the bucket. [Music] I don't see where these glitches could have happened. I'm guessing that's what it was. It's like a glitch and therefore they get like food from it and stuff and then it's in these chests. [Music] I guess not. I guess we just have to do it legit. Imagine I was not cheating at all. I would just be here forever to farm so many of everything. All right. All right. Just give me stuff. It just makes it so much easier if I can just be given things. Okay, still tping everyone. How do you win hero rank? They're giving it away randomly. If you just log on the server and stay on the server, they're giving it away. I think every 15 seconds they give it to someone someone else. So, you have a pretty high chance if you just get on the server. You don't have to get anything. Just just get on the server and then uh there's a there's a chance you get it. It just picks a random online player. Um Okay. Wait. This one grew. Ooh. Ooh. Some of this stuff grew. Wait, some of the OP plants grew. All right. Sell fruits. $130,000. Look, we're at 55 mil. Let's do a progress check. We're number 90. Number 90. We're working our way up. All right. Look, I'm just going to try I'm going to try auctioning this this uh what is it? This apple seed. This apple seed is going up on the auction for 700,000. Just a mere 700,000. Someone bought it. Why do people buy them? All right. Guava. We're doing guava. All right. H. And we're all back right here where we started. That sucks. 56 mil. H I don't know. You keep tping, your money will increase. Is that true? TP accept. TP accept. How far to reach the billionaire club dream? I'm pretty far. How do I join? What are you playing? It's like uh grow a farm. It's like grow a garden but on Minecraft. You can play it on Bedrock or Java Edition and you can just join from if you have the homepage like like I'm on the homepage of Minecraft on Bedrock Edition. I literally can just click play and then servers and it's just a partnered ser a featured server. So it's just right here mineville and it says dream live event as well on the uh underside. It's like if you don't know which one it is, it just it's just it's Mineville and it says dream live event and then you can click play and hop on. And I think if you then obviously if you want to go to grow garden then you need to go to uh the grow garden or grow farm which is here or just click on game selector and then click grow farm. Pretty easy. And look, I'm on it right now. I think it lasts a month where you can use uh you can grow the dream tree. Where's Where's my dream tree? Here it is. Look, there's like little smiles on it. There's fruit with smiles as well, which is cool. All right. Uh well, lucky thunder. I got a million dollars in that lucky thunder. I can sell from here. What was I looking at? Yeah, I was going to look at where I am now. Richest players 85. 85 isn't bad. 85 is not bad. I feel accomplished. I farmed a lot. Look at our Look at our beautiful farm. These trees are the coolest. These trees are definitely the coolest. Purple one and this one. Well, I feel like we accomplished a lot today with our farm. If you think that you can do better, then hop on and do better. Otherwise, uh, make sure to check out Mineville. I think this where I'm going to end today. I'm actually pretty tired, but I'm I'm going to do a substream uh in a bit. I'll probably take a quick nap and then do a substream because I'm a little tired. But if you guys think you can do better, maybe tweet pictures at me or something or like just or I don't know, show me your farm and maybe I'll I'll see them. But uh otherwise, make sure to check out Mineville. It's very cool. They sponsored this stream and they set up this event. I think it goes on for a month. There's a giant dream on the server and uh you can uh grow the dream tree. Oh yeah, you can unlock I don't think I even showed it. You can unlock uh like dream wardrobes stuff. Uh, like if you level up the dream seeds enough, then you can get like a dream mask hat and you can get like a dream plushy and a dream play button in game. It's like on you. It's pretty cool. I like that as well. It's pretty cool. How do you get the dream seed? If you just click on dream, then he'll he'll give it to you. And then if you click on him, it also tells you like what to do, which is cool. And these are all the rewards. Wait, yeah, dream wings. cuz that's like the final one. Pretty cool. Yeah, it's cool. I like the server. I like the people. Very cool. Thank you to Mineville for sponsoring this uh stream. And uh yeah, I'll probably Maybe I can get to the richest. Maybe I can get to the richest on the server. Maybe that's Maybe I can maybe with a broken wrist I can farm. It's possible. It's possible. I just I can use I can use one hand and farm and become the richest on the server. I don't know. We'll see. Thank you guys for watching. Thanks for coming. Make sure to check out Mineville. The link uh the IP is in the description or you can also join through the featured servers on uh Bedrock. I've actually never played Bedrock before. This is my first time. It's pretty cool, but also my skin is messed up. I don't know why and I can't seem to fix it, but it's okay. Hello person. Anyway, thank you guys.",
    "start_time": 4.48,
    "end_time": 9031.640000000001
}