{
    "video_id": "yFmizY7pe7U",
    "channel_url": "@markiplier",
    "transcript": "Okay. What in the [ __ ] is that? What in the holy [ __ ] What the [ __ ] is happening? Oh my god. >> Hi, my name is Markiplier. I've been having a great time getting this game up and running. Nothing about the game. Actually, the game's totally fine. Actually, I don't even know. I haven't even played the game. But getting to the point where I'm playing the game has been arduous to say the least. Sorry, I got nuts in my mouth. Hold on. Oh, my mouse. Uh, no. That's really inconvenient that that happens, but my mouse just uh suddenly died and then all my USB devices kind of just reattached themselves. Oh, also it said that I needed a controller for this. Damn it. Every day I feel more and more like that Malcolm in the Middle meme. Well, that bit from Malcolm in the Middle. I'm sent on one goose chase, which leads me to another goose chase, which then sends me to another goose chase to go find batteries for a controller that doesn't have a back cover anymore. So, I go find another Xbox controller, but this is a new Xbox controller in the series of whatever the [ __ ] it's called right now. And the old Xbox controller cover doesn't cover it. At the first jump scare I get in this game, the batteries are going to go flying out across the room. I was looking for some kind of like tape or something to put it in there, but I couldn't find the tape roll. And so I was like, \"Fuck it, I guess.\" And then I couldn't find the dongle. You know, the wireless dongle, but I don't even know if I need that anymore because I think it's probably got Bluetooth in it at this point. And the computer's probably got Bluetooth in it. But all of it was leading from one to another until I can't find anything. And then I'm back here more frustrated than I've ever It all crashed. I can't type. My keyboard's not working. My mouse and keyboard are dead. Now, I am having a great time. This is a great great start to this and I'm going to be super happy and fun about this great great time that I'm having in this great great game. I've never played a Silent Hill game. If you didn't know, there's Silent Hill F. And I'm starting with this one because I know there's a Silent Hill 2 remake, but at this point, I'm so far behind that this one came out recently and I'm like, \"Okay, I'm gonna try this one. I don't know how it fits into the timeline. I don't even know the timeline. All I know from Silent Hill is that there was a movie and someone got their whole entire skin ripped off by Pyramid Head. And also, there's a Pyramid Head. That's what I know and that's all I need to know. And if anyone else gets in my way, I'm going to rip your skin off. I'mma rip Lixian skin off. Sorry about that. There you go. All right. Now that I'm here with you on this wonderful day where we're going to explore the world of Silent Hill, [ __ ] I'm going to have a great time and I'm not going to be frustrated and I'm not going to carry any of this ill will into the game or anywhere else out of the game or anywhere in the game that for that matter or for any matter or for the matters that you have in your world and not mine cuz I'm having a great time. This is Morse code for kill me action. Weaker enemies more resources traditional Silent Hill difficulty for story focused players. Story and hard. Story and hard. Well, I am hard. Puzzles lost in the [ __ ] How do you Wait, wait. Whoa. How do you make the puzzles? How puzzly are we talking? You know, I probably should do the harder difficulties. I've never said that before at the beginning of one of these. I've never played a Silent Hill game, but I can't imagine it'll be all that different from other games that I've played. Plus, I'm kind of curious to how the puzzles are going to be hard. I'm very smart. My brain has swollen. The doctors say that my brain is tripled in size. It's pressing up against my skull and the pressure will soon kill me. So they say, but I'm guessing that it's going to kill me from intelligence. Cuz too smart for your own good is a saying that some people have said. I pressed enter. I don't even know which ones I I picked. >> Ew. >> I don't need them anyway. >> Huh? >> Who even cares about their dunk games? H >> I thought you were playing with your friends. >> They said I can't play house with them cuz I hang out with boys. >> Oh my god. >> Well, how about you play with your big sister instead? >> Really? >> Oh, hi big sister. >> Thanks for waiting. Junko, did something happen? >> Just reminiscing a little. How about, you know, when we were kids, you you always looked out for me. >> Why can't we see her face? He not I [Music] here. This is for you. >> Why did my controller rumble for that? >> It's beautiful. >> Mhm. >> Thank you. >> You're welcome. The last time I played a game that was like set in Japan, I think it was actually Fatal Frame 2, which is a game that it was very fun, but I can barely remember any of it. I know I was going through it, and I know that I was winning and doing an incredible job, but I don't know exactly what I was doing besides taking pictures of ghosts. I guess that was all I was doing. Anyway, this is set in, I believe, 1960s Japan. I think it said something like that. And once again, if I didn't have this included before, I don't actually know a whole lot about Silent Hill besides the movie, which I watched so long ago, and I know that doesn't really matter to the lore of Silent Hill. And a lot of you might be asking why I haven't played Silent Hill 2. There's a funny thing about Silent Hill 2. I went out of my way to find the PC version of Silent Hill 2, which apparently is a rarity, but I went on eBay and I bought it a long time ago back when I was first starting my channel. Legitimately, like this first year let's play that I was planning to do. And I forget what got in my way. I was having trouble like setting it up. something about the PC port was not good in the first place and there was some compatibility issues and it was an older game as it was being um I think it was PlayStation 2. I'm not 100% sure, but I I again I got the PC port of it so I never actually got around to playing Silent Hill 2. And then the remake came out and I was like, \"Oh [ __ ] I'm going to do that.\" But then obviously I've been so busy with things that I'm finally going to be able to talk about pretty soon. And now I'm here and this just came out so I figured Silent Hill Finak. >> That's what we're going to do. >> How dare you speak to your parents like that? >> Dear, please calm down. >> At 2:15, >> this Junko knows how to show some respect. You're >> going to be disrespectful at 2:15. Oh, [Music] >> where do you think you're going? We're not done here, young lady. >> Darling, please. You've already made your point. >> Then why isn't she listening to me? If you hadn't spoiled her so much, she would have acted like such a brat all the time. >> Go, don't go. Your father's just worried. >> I'm going to go see my friends come soon. Okay. >> Oh, okay. Ma, head down the mountain. >> There's no way. Never. >> Uh, no. No way. Never. Come home soon. What? What do you mean? No way soon. Come home. Never to what? What? All right. Me. There's not a single extraordinary thing about me except maybe being tall for a girl my age. I guess I got used to running around a lot since I when I was a kid. Since I preferred playing with a boy, >> pitiful. She's the one who bears the brunt of my father's violent moods and malicious abuse. When I was younger, she used to protect me from him, so I didn't hate her back then. But maybe I do hate her now. Oh, not again. Please. I've been having issues. My my keyboard and my mouse just suddenly randomly disconnect for no apparent reason. And I don't know why. Maybe it's because the USB hub I'm using was like 10 years old. Whatever. Uh, patriarchal husband and that it meant a man who does nothing but boss his wife around and he was the first person to come to mind. Dad barely talks. He ignores me when I tell him good morning. If I but if I say nothing, he gets angry instead. And once he's angry, he just explodes. He loses all control over his emotion in the blink of an eye. He was a mom throws things around. He even hits us. Jimo again. No face. My older sister. She's one of the prettiest and kindest people I know. And there's nothing she can't do. I can rely on her for anything. Honestly, she's the greatest sister anyone could ask for. She's always been there for me ever since the day I was born until until she left to get married. So, she's not dead or nothing, right? All right. So, I'm going to do my best to not compare this in any way, and I know probably some people fall into this trap. Uh not to compare this in any way to Resident Evil. And despite them being, you know, they're they're not similar. I don't think in any way, shape, or form other than that they are horror games. Um, so I'm not going to compare them. I'm not. But I am glad that they are doing these uh because of the success of Resident Evil. Local doctors note, there have been sightings of foxes coming into the town recently. I'm sure that the older generations who have grown up learning to respect foxes are fine, but I'm concerned for any children who may try and chase or provoke the creatures. This is a doctor's note. I got a prescription for taking care of the local foxes. Is that what we're talking about here? Or whatever. Uhhuh. All right. I love that there's no interface right now. I really truly enjoy games that do as little interface as possible. Some people will talk about like the immersion of it and how much I want to be immersed into the story and that is important for horror. That absolutely is. But I think from an aesthetic standpoint, you have these game worlds that are so detailed and beautiful and involved and it's just sometimes >> guess I'll pray. Guess I'll pray. Rest at the Hakora. Journal updated. >> Oh god, what should I do? >> I I don't know. Is that your prayer? Maybe you got to pray better. Mhm. Lost in the fog action. Oh [ __ ] I did hit the most difficult. Well, you know, that's fine. Maybe I only have no HUD because I picked the most hardest difficulties, but um it is what it is. Hey, listen. All of you guys that are cringing right now think that I'm going to be bad at this, don't you worry. Liixian's going to make me look really, really, really good, right? All right. Bye. I don't need a yes or no from him because I know he's going to do exactly what I want. Or else I I guess I already sent him away. Lixie, come back here. I'm sorry. Yeah. Yeah. Yep. All right. Why did I uh Li, come back. No, I actually wanted I actually wanted to ask you something. No, don't worry. It's fine. Listen, can you edit this to make me look good? And by that I mean don't don't edit out me. What? Oh, sorry. That was an example. You you walked into that one. Can you come can you I'm not going to hit you. Please come come back. Okay. You're very mad. I know that was mean. Half of that was incidental. The other half was intentional, but half of that, a good 50% was accidental. I forgotten what I was going to say. All right, back to the game. A woman is only complete when she's loved. Featuring the latest fashion for young women so pure, they even make flowers blush. There was a disclaimer at the beginning of this game that was talking about um that it's of the era. It's of the era. It's of the time that it was made. So, please don't be offended by anything that is in this game. It is intention intentional to reflect that time. Drinking at this time of the day. Well, I looked at the I looked at the clock and it said 2:30, so I'm guessing it's afternoon, but what do I know? Sure is foggy here. I've heard that that is a thing about Silent Hill. >> Where is everyone? >> Good question. What about Chiseruya? Maybe I'll find someone there. >> Chiseruya, the general store. All right. Ebisuka Gaoka. I live in the small rural town of Ebisugaoka. Before the war, the town was lively due to an influx of people coming for the coal mines and dam construction going into the northern mountains. After the dam construction finished and the coal mine closed down, it just became a sad little town. The grand iron bridge that connects the town to the nearby cities is the only reminder of the sorry town's former glory. Wow, that's incredible. Okay, open the map. Oh, there's a there's a there's a nice little drawing right over there. So, um that's probably important. Maybe a friend's house or something. Oh. Uh, that's never a good start. >> Excuse me. >> Um, is anyone there? [Music] What the hell is that? Is that a bird? Is that what's left of a bird? Oh, how did you do that? How did you just step on that bird? I mean, I'm assuming the bird was already dead away. >> Yeah. Yeah. All right, whatever. Gross. Um, are my footprints now coating blood everywhere? All right, this will be fine. >> I remember there was a shortcut up ahead. >> Uh-huh. Sure there was. I don't like that. Also, why is the light on at this time of the day? I'm guessing this is the shortcut. I'm hoping that it's not going to do the Resident Evil thing of having the the important things bright yellow. I mean, it's I know that's indicative of a lot of games. And this light is nice cuz like the light >> it has to be. How else could she die like that? >> Huh? >> I would never. Not that family. >> Huh? >> Someone's going to hear you. >> Who died? You ain't talking about my sister, are you? My sister couldn't possibly be dead. She went off to get married. Hello there. [Music] All right. [Music] Oh, good. Yes. >> You traitor. >> Huh? Me? Talking about me? >> Sako, where are you off to? Don't usually see you around here. >> Uh, all right. >> A truck was blocking the road. >> Chizeruya. Just want to talk to someone. I'll be there in a bit. Okay. >> Okay. All right. >> See you, >> you traitor. >> Okay, again with that. That's okay. A little strange. All right. Not going to lie, just a little bit odd. Unless that's this town's traditional way of opening and closing greetings, which I'm happy to use. You traders. I usually do. certain stuff like that. Let me go this way first just to see if there was anything secretive on a path that they wouldn't ordinarily think. Where >> the driver go? >> I don't know. He was never there in the first place. So, what I know fascinating. Okay. Well, that's an ominous alley where I'm sure that nothing bad is going to happen. Let me look at my map again. Oh, yeah. Right there. Yippee. Just going to quickly look this away. Zoom. Identify that man. That's one of my childhood friends. You traitor. Shoo. Shoo. You traitor. Smoking again. Hey partner. >> Partner. It's traitor. Thank you. >> I What was that? >> You want to say that again? Run that by me one more time. Say something. >> What about you? Nothing you want to say. >> Well, if you don't have anything, neither do I. >> Well, that's my Ho. >> Your Ho. It's not like you to just let stuff happen, though. But whatever you end up choosing, you know, I'll always be there for you. >> What? What happened? >> Shu. >> Shu, thanks for waiting. And Hako, too. >> Yep, I'm here. >> Rinko, what were you guys talking about? Uh >> uh nothing really. >> Actually nothing. Literally nothing. >> She said that she just wanted to talk to someone. >> Thanks. >> It helped too. >> Oh, glad to be of service. Ma'am, >> if I had known you'd be here, I would have brought that magazine you lent me. Oh, you can hold on to it. I knew I wasn't getting it back when I lent it to you. >> What's that supposed to mean? >> What do you think you're laughing at? You've got something of hers, too, don't you? Right. >> Wait, did I borrow something? Hey, Hino, do I get to hold on to the 500 yen I owe you, too? >> What happened to paying her back with interest? >> I never said that. You can't prove I did. Okay, that does it. If I lend you something, you're signing a contract to give it back. Don't be such a meanie. >> Hey, you guys seeing this? >> Hey, did you >> You guys You guys seeing this? Uh, >> Sako, why won't you go out? >> Why is this me? Uh, >> sorry. What? Huh? You trip. [Music] >> Okay. What in the [ __ ] is that? What in the Holy [ __ ] What the [ __ ] is that? Oh my god. Holy [ __ ] Oh my god. I'm running now. Oh, I got to escape from the fog monster. You goddamn right. And kudos to them for pointing it at the monster that I'm running from, but I probably need to look where I'm going. No, I don't need to. I'm just running. Oh my god. Hi. All right. Oh, well, that's bad. Oh, I'm so I'm still running. We're not done with this. Okay. Oh, no. Oh, my legs caught in my headphone cord. No, no, no, no, no, no, no, no. Okay. Don't run into the puddles. All right. Okay. All right. You want some of this? You want something? Leap. Yeah, that's what I thought. Can't beat a fence, can you? Oh, you can beat a fence. Oh, no. I'm still going this way. That was a dumb idea. That was dumb. That was really dumb of me. That was dumb. I'm going to die. Okay. All right. That's bad. Oh, no. I'm not going to look. Actually, I I I I really Oh, I dislike that so much. All I looked. Why did I look? Okay. Is it good? You good? Okay, good. All right. Well, that was awful. Uh-huh. Okay. The signs are the puzzles are really tough. Where those things fall down is where I should not be. And where this is Yep. Nope. Okay. Maybe not. Maybe not. Maybe not. Maybe not. Okay, let's go. Let's go. Let's go. Let's go. Probably should have gone this way from the get- go. All right, I'm just going to keep going. I'm just going to keep going. I'm still going. I'm still going. Still going. Still going. Man, you think I could run a little faster? Just like a little bit. Oh, where do I go? Oh, where do I go? Where where am I going? Oh, there. No, don't give up. >> Oh, you [Applause] [Music] [Music] [Applause] Okay. Well, glad that's over and I'll never have to face that ever again. We really did it, everybody. What a game. Okay. Hey, why am I hurt? But I didn't even I got even got an achievement that I didn't even get touched even though I got touched and killed that other time. But we're not going to pretend like that exists. We're not going to pretend like that. It doesn't because it didn't. Hey partner, these painkillers should work best for you. They'll not only take care of your headaches, but also any pain from injuries. I suspect that the main cause behind your nasty headaches is from you unconsciously grinding your teeth when you're upset. Does that sound about right? If you ever need to talk or anything, just call my name and I'll be there. Oh, relieves pain and raises spirits and sanity. [ __ ] yeah, we got to am these are the dark descent. Must be okay. >> Left bumper. Uh, aby. Okay. Glump. One more glmp. Wow. It is hard mode, isn't it? Okay. What is that bandage? Oh, well that would have been good to know before I started globbing down the painkillers. It's probably going to be too much. I'll do another painkiller. It's not like I can overdose on these, right? >> What is this, please? I need to get back to Sako. >> You don't recognize this. Okay. Yeah. The reason why I didn't like all that red stuff in the face is because it very very trypophobia. Extremely. Actually, it's actually the worst type where it look I'm Yeah. where it looked kind of woundlike. And that wasn't kind of woundlike. That was woundlike. All right, I'll go I'll go up there in a second. Let me just see what's around the corner here. Oh, yeah. I'll take the pills that are on top of this propane tank. They're probably good. Probably definitely. I always take the random pills I find in alleys. Those are the best kind. At least you feel those the most, I'm sure. All right. Hello. Well, I don't want to jump down there. That looks like a place I can't come back from. I guess this isn't anywhere I can go either. All right. Yippee. [Music] friends. >> Who's there? Is that you? >> I'm sure it was my buddies, my fellow traitors. The [ __ ] The [ __ ] man. They really like doing those tight crawl spaces. They love doing it. That's the third time already. I'm sure that there's not going to be a jump scare at the end of one of them. >> Shoo, Rinko. >> Yeah. Okay, that's fine. It's just a bucket. Nothing scary about a bucket. It was a bucket full of something else. Maybe that might be scary. Oh god. What in the [ __ ] Ew. Oh, that's not good. Oh, that's not good. Oh, what are you? What the What the Hold on here. Wait a minute. Hold on here. What? Huh? you. You okay? What? Uh, no. You know, I'd be going faster than that. I'd be going a lot. All right. You know, I'm going Never mind. I'm going to stand my ground. You're about to get a face full of hurt. If you dodge just before an enemy attack lands, you will perform a perfect dodge. Recover your stamina. All right, you got it. Wait, which button was it? B. All right, I'm so ready. Bring it on. Ah, nope. That's not it. Come on. Hit me. Hit me. This is important for me to learn. Oh, I was going to dodge that perfectly. Oh, did that do it? Was that a perfect Donk? Nope. Come on. Ring skills. That was not perfect either. What is with you? I tried to dodge that, man. You do not telegraph very much. Okay, come on. Wa! Look at you. Who programmed you? Fun fun person. Oh god. Hit me. Nope. Don't hit me, please. I'm using this as an opportunity to get better. [Applause] Missed me. Now you must kiss me. Okay, that seemed to be okay. Oh god. Okay, so that's just a solid time. I'm going to do this till I die because I have a feeling that I don't want to go into the next area with low health. Can I lock onto you in some way? Yes. There. Perfect dodge, baby. So, I can lock onto you. Who? Whoa. Ah. Whoa. Okay. That's Yeah, that's dead. That might be That might be it for me. You almost had me with that. Okay, I'm dead. But that was good practice. I needed that. What's that? I'm right back to where I was. It's a power of editing. >> Well, I shouldn't be talking right now because I'm not very well. Oh, what? That was a perfect dodge. All right, I'm out of here. You know what? I don't want to play with you anymore. I don't want I'm going to pop a pill and you're going to you're going to shut up. Yeah, that's right. You're too slow and weird. I haven't decided whether I'm creeped out by you or not. I mean, I am, but whether I should get bonus creep for you being kind of a mannequin or something. Getting out of the enemy's sight. Okay. All right. Peekab-oo. You can't see me. Oh, that would be a great spot to hide. You don't see this, right? You don't see this. Oh, this is a pill. Never mind. Well, you're not fast, so that that bodess well for me. Zoinks. Oh, where does this go? All right. Ah, okay. Well, this is nice. Uhhuh. What is that? Yokoon. A jelly-ike dessert filled with red bean paste. A bite-sized delight. Greatly restores health. Can also be used in an offering. So, what you're saying is I should save that for offerings and never ever use them. What good is a woman who can't even talk? [Music] Uh-huh. Okay. Ignoring that. Ignoring that. So, I'm guessing that was just a side path. I never know what's a side path unless the real way to go. I might be supposed to go up that way, but let me see this real quick here. Whoa, map. That's very helpful. Ew. Uhhuh. Seems like that goes the way that I'm supposed to be going anyway. So, let me go over this way first. Oh, this actually. Yeah, I go this way first. There's a dead end over here. So, I don't imagine that I'm supposed to be going this way, but there might be some goodies or something. Yep. Goodies. Excuse me. I heard the creaking of that mannequin thing. Local doctors know there are cases where patients see an improvement in their symptoms not by taking medicine, but rather by simply talking to a doctor. The cause of this phenomena lies undeniably in the trust foster between practitioner and patient. Conclusively, the pharmacists who have been trusted since ancient times perhaps could be said to contain a similar power to that of the local gods here. That's my professional medical opinion. Of course, even among the younger generations of this town, there are many who believe praying to oar son will soothe pain and speed up the healing process. Once fortitude to faith is sought to have a direct relation to potency. There are even some town elders who claim to have bread broken bones miraculously mended after praying to Oni and Arian. Great. I was talking to my uh my Oh. Oh, [Music] I was talking to my Japanese cousin Tommo for I'm Korean, right? But one of my cousins is Japanese cuz one of my aunts married Japanese guy. He was born in Japan so he's Japanese. Uh speaks Japanese, right? Little bit of English. Uh it was between him and then my cousin Huyong. He's Tommo. And then Huyong um is one of my Korean cousins and we were all together at a place and it was it was an interesting meeting of the minds trying to communicate. But man, I'm just always impressed by their ability to at least pretend to understand me. Hi. How's it going there? How you doing? How you doing? Oh man, you you are funny. Oh, you don't see me, do you? Or maybe you did and you're just stupid. You might just be stupid. Um, but a lot of this reminds me of trying to speak really broken Japanese to uh my cousins or to my cousin. Actually, Huang speaks Japanese and Korean and a good bit of English, too. So, he's uh very helpful in that regard. Hope to someday. I've never actually been to Japan, but I do plan to go visit him uh and my aunt in the very near future. >> Uh, anyone here? >> You mind if I barge into your house? Uh, I'm kind of being chased by these mannequin demons, so sure you don't mind. I'm going to take your prescriptions. I don't care if this is for some underlying condition you're not telling me about. I'm stealing them. At least pills make a lot more sense than rubbing herbs in your wound like with Resident Evil. I said I wasn't going to compare it to that. That's not a comparison. I'm just making a tangential relation comparison. I need a key. All right. So, there's a key in here somewhere. Man, this is one of those hard puzzles, I bet. I bet. Nope. Okay. >> Did I do it? >> Oh, nice. So, you just mean I can open certain drawers, right? That's all you're saying. Did I get a key from one of them? Did I get a key from that first one? No. Unless I'm supposed to go back out the way I came in upstairs. I'm sure nothing bad is upstairs. Sure nothing bad is waiting for me in this home [Music] Yan. That's more of that jelly. Good. Is that a head? Is that Is that a What am I looking? Is that a head? What am I Huh? Is that a Is that a head? Is that a head? Is that's not a head. Is that a head? What am I? Huh? Is that a face? Oh boy. Let me just examine you. It's a trap. All right. Cool. Ew. Oh, good. A key with unknown blood stains. Not sure what it unlocks. I have a I have an idea. I have an idea. Oh boy, more pills. How's my health? One pill. Yum. Anything else? Anything else I should know about? Oh, what a beautiful day. What a beautiful day. All right. Oh my god. Run, please. Hey, but what's over there? Hey, I bet there's something good over there. I bet there's some goodies. Why don't you come over to me? Oh, that was a sweet dodge. If only the wall wasn't in the way. I'm going to run past you. Oh. Oh, not that way. God damn it. What are you doing? Why are you doing this? Why are you embarrassing me like this? Can you not? Oh my god. Can you lock onto that? Oh, okay. All right. I'm going to go now. All right. See you. Wouldn't want to be you. I'm going. Give me Give me what's in there. Give me all the goodies. Give me all the goodies. Yes, I knew there would. Look at that. Look at There was probably something I'm supposed to find. Sturdy looking barrel key. Judging from its size and blades it should be used to open the back door. All right, so that's actually what I needed in the first place. Bloody key over there. Oh well, [ __ ] It's bloody because I'm about to bleed a lot. Wait, no. Wait, no. Stop. Wait. Come back. Wait. I want to go over there. Hi. Oh my god. Your face is not there. Oh my god. All right. Oh, wait. Am I Is this a secret path or is the See, I don't know. I see. This was in an area that was harder to get to. It was the bloody key that I got out of the face. And then I go over here. For what purpose? I don't know. So then why am I here? And why would I Is this just as an escape? No, it's a way to get down. But am I missing something if I don't go inside? And I don't I want to go in the back door. I'm going in that back door. And you can't stop me. I'm going down. Oh, are you down? Oh [ __ ] Oh my god. Oh my god. Uh-huh. Oh yeah. Easy, easy. Hold on. Hold on. Wait for it. Wait for it. There we go. Okay. Well, is this the way out? I don't see um I don't like it. Oh, no. Not that way. Wo. Okay. Let's see. Now I don't know which way to go. Now I'm all confused. I don't know which way is the good way and which way's the bad way. But if this was over here and then there was a key over there to go downstairs, then that must have been the tougher way to go. Oh my god. I think I'm going to go out the back door. I'm going to go out the back door. That seemed like the harder way to go. And therefore, missed me. Oh, sorry, pal. Why did you dodge that way? I'm going this way now. Jump. I didn't jump at all. I clambered down quite calmly, actually. It's the goodies. When using a restorative item, you will not be interrupted by normal attacks. Well, I didn't even know I could be interrupted in the first place. This was so the right way to go. Go to I'm going to select your equipment. Oore. Nice. Very nice. So, that was a sneaky. I almost missed out on that. Good thing my gamer instincts got the better of me, which is a good thing in this case. Where you at? Faceless. It's like poofless but way less interesting. N no no no. I don't think so. Nah nah nah nah. All right. Now we go. All right. Sweet. Again. I think I'm going to jump and I do not. Which is actually probably wise because in real life if you just started jumping off of roofs it wouldn't go well for you. >> I really hope Shu and Ringo. All right. >> Uh-huh. Uh, I'm sure they are so good. So fine. Just like your friend that got all the pimples all of a sudden. Maybe this is all just a big allegory for puberty. Oh my god. Okay. Hi. All right. So, we're going to play this game cuz I've been practicing. Come on. Come on. Oh god. Don't do that. Okay. Goodbye. I'm hoping I'm going the right way. Let me go this way first. See if there's a goodie. Goodies. Goodies. H small hairbrush used to make yields a great deal of faith when enshrined. Of course, of course. Pray oh. Use faith at a hakora to fully restore your sanity. If you've chosen story as your action difficulty level, then you can recover both your health and sanity without using faith by visiting a hakura. Use faith you have received at the hokura to obtain omaamorei. Umamorei. I'm going to save. That's good. And I'm going to enshrine the antique comb. Take this god. All right. And then I got the yokan. See, I don't even know what to do with the faith just yet. But my inventory isn't full, so I don't feel like I need to absolutely give this away right now. Receive a random omamori for 300, but I already have one. I'm going to save it just because I don't know my sanity is at maximum. You're goddamn right it is. I don't know if I need to hold on to that just yet. And I swear guys, I'm It's not going to be the thing where I hoard these things till the very end of the game and I never use them and I try to sprint them all at the finish. It's not going to be like that. I just don't know what I need yet. So, I'm going to hold off because that's smart. This feels like a poop seller. >> What now? No, I don't think that's Rinko. No, I'm pretty sure that's not. They're very mechanical, so they must be some kind of a doll, but they do seem to be bleeding and have some kind of flesh to them. So, that's where I'm not 100% sure. Oh, hit back. Oh, yeah. Fight back. [Music] Yep. Let's do this, buddy. You going to give me a Okay. RB to light attack. Though you won't deal too much damage. You will be able to attack more swiftly. RT to heavy attack. Your movements will be slower, but you'll do far more damage and have a higher chance of stunning enemies. Enemies take more damage while stunned. X to lock onto an enemy. X again to cancel. I was using advert button, but I'll do that. Okay, here we go. Come on. Come on, let's dance. Come on. Oh god, that missed me. Now you must kiss that. Oh. Oh god. Okay. I saw a little a little like chromatic aberration thing going on. Wow. I wish the camera wasn't exactly behind. Take one of these. Wonk. That's what I thought. Okay. There's like a little chromatic blur going on when they're about to strike. Okay, that was a bit early. I don't know. It's not It hasn't even fallen down yet. There we go. Why you got to say if it's dead yet? All right. Well, that was good. I'm really strong. I did it. I didn't even get hit. Hard. That's what I always say. I'm unstoppable. I'm like some kind of a killing machine. I am the destroyer. Oh, you want some of this? Watch out. Certain enemies will leave vulnerable counterattacks. Visual H will appear when it's possible. Okay, that's that chromatic thing that a counter will be possible with visel longer when you're using LT to focus. Interesting. If no visual hint is shown during an enemy's attack, that enemy cannot be countered. Okay, I got it. I think I know. Oh yeah. Okay, that is that. Okay, let me won you again. Right in the grundle. Oh my god. Okay, I might be really good at this game. I might be unstoppable. My keen eyes, my keen eyes and my great sense of smell really going to aid me a long way in this one. All right, my chiseled features and my loose relation to uh Japan. A portable tool t containing commonly used tools for home repair. I'm going to beat the [ __ ] out of it. I'm going to beat the ever loving [ __ ] out of that thing. Huh? Tool kits repair. Repair weapons. Restore their durability. You mean you mean I'm not an unstoppable killing machine? Once a weapon's durability has been exhausted, that weapon will break and disappear. [ __ ] Shouldn't have hit that wall. All right, fine. So, I got to make my way back to the general store, apparently. Can I wonk this? How about give the swift wonk? All right, I shouldn't do that. Your sanity will deplete when you use focus or take psychological damage from enemies. When not in a state of focus, your sanity will recover after some time. Sure, sure, sure, sure. Whatever you say. >> How dare you? >> Shoo, where are you? >> I mean, that sounded pretty nearby. Shoo. Shoo. Shoo. Shooy. Shooy. Shooy. Shooy. Ramune, the bestselling soft drink in town. It packs a fizzy, refreshing punch that wakes you up when one sip. Oh, greatly restores current max sanity. Can also be used as an offering. Okie dokie then. I'm going to do that. Shoo shoo. You want some jelly? Shoo. Shoo. Shoo. Oh, god damn it. All right. Don't worry. I got this guy. What are you going to do? Huh? What are you going to do? I did it. And then I'm going to do it this again. Wonk right in the grundle. Okay. Are you not dead? Okay. I missed way hard. Oh, that was not interruptible or that was not counterable. So, I just got to be on the lookout for when it actually is doing it because that's the tricky bit. It's not what I wanted to do. There we go. All right. What? Summer moon. Can't use any of this. What do you What do you mean there's nothing in there? What do you mean I can't use any of that? There ain't nothing in there. All right. Okay. So, I'm back where the red stuff is. Uhhuh. Good drink. Good drink indeed. I'm going to pray. I got another steel pipe. I have two steel pipes for when one inevitably breaks. So maybe if I'm going to get more steel pipes, I shouldn't waste any repair kits on these cuz if it's going to give me more then uhoh, am I going to fight some kind of a boss? Sh [Music] so I don't think I don't think you're going to get very far with that. Time to time to steal everything in the general store. [Music] [Music] So, Since you were little, you dreamed of a different life. A family that owned a candy store instead of some stuffy old shrine. [Music] And here it's all yours. As much candy as you could ever want. [Music] Sweet dreams. Suck go. [Music] I know that looked like I just stubbed my toe in the middle of this. I've got this weird problem where my USB devices will like detach and then reattach it. It's actually just my keyboard and mouse. I don't know what's going on with them. I got to fix things. >> The store is closed for the day. So, even if you're going, I'll keep my promise. >> I'll keep my promise. I'm going to beat the [ __ ] out of every customer. >> Yeah. You're about to get some. Don't Don't you worry. I thought I had that. Take one of those. And also one of these right on your tank or whatever you have. That's the equivalent of a tank. H. Wait, wait, whoa, whoa, whoa. Why did I get hit there? Why? Why did that hit me so good? Hold on. Hold on, everybody. Hold on, everybody. Okay, hold on. All right, let's let's see this. I did not see a blur there. Okay, so that's good use of the focus mechanic. Uh-oh. You going to you going to cause an issue for me? Oh my Oh, come on. Take one of these. >> No, I Oh, but I but I used my not today. I've got pills for that. Wonk. Take one of those. And another one. That's what you get. Both of you. Aha. Not today. Oh, god damn it. Come on. There you go. That's what I'm talking about. [Music] [Applause] [Music] That's what I'm talking about. [Music] Oh. Oh. Darkablier. [Music] >> Huh? [Music] Well, damn. The baby bird takes her first steps. Well, the only bird I know in this game has got crushed by me, so better watch out for all those birds. >> Oh, where am I now? >> Are you all right? >> Sh. Do not push yourself. Take a moment to rest if you need to. You're not Shu. Where's Shu? Shoo. [Music] >> Okay, cool. Nice temple. >> Where am I? >> It's a temple. Come on, keep up. Even I'm getting this. >> What's this? >> Sorry if that breaks the immersion. Oh, what horrifying little dolls. Kudzu, respected by all and the leader of the people, was wed to pine. Plum, loved by all and always at the center of any group, was wed to bamboo. Chrysanthemum, who had no meat, spent their days studying under Kudzu and became known as the sage of the east. Let the prosperity of our clan be eternal. Okay, so this is a puzzle, right? Plum is in the center. Kudu is wed to pine. Uh plum wed to bamboo. So they got to be next to each other is all that's saying. And then crosanthenum was sage of the east. So all the way over to the left probably is where that is. Seems like there's five. So that should make it pretty obvious. So if it's crosanthemum on the left, plums in the middle, bamboo's to the left, second from the left, and then it's Kuzu, leader of the people would be all the way to the right, and then pine. I don't know. Okay. What is examine? I don't know what this is. This chrysanthenum. Is it chrysanthenum? Is it chrysanthenum? You got pictures to tell me what's what. Yeah. Okay. I don't Am I supposed to know what these are from the get- go? You got names on them? Do they got labels? Is this I see a little flower. Is that Chris? That's a rat. That's a rat. That's a rat. It's a rat. It's a rat. That's a bird. Okay. All right. So, the names don't really seem to match up with what I was thinking that the e bamboo. This might be made of bamboo. It looks like it's got bamboo leaves. So, bamboo, if I remember where that one was. Okay. Bamboo's in the second from the left. Right. I'm picking you up. Uhhuh. Plum. Okay. Plum's in the center. Okay. There's some kind of like looks like either dense force or some kind of veins, but there is a flower on the bottom and there's two loops up at the top. Could be a penis. Probably not. Three loops there. Two loops. two strings there. You have flowers on you. So, this is the only one that actually is flowers and you have uh fish. Okay. So, if there's a top bottom, that means something else. Okay. Plum center bamboo. So, actually this is probably over here because plum would be in the center. You have a flower on yours. So, you must be chrysanthenum. Well, you also had a flower on yours, but more more than that you had Whoa. Nope. More than that, you had that might not be a flower. That might be something else. This also looks like some flowery design. It looks like kind of like a fruit. So maybe that's plum. Given the robe, I would say that you're some kind of a important person. Okay, there's there's nothing about a fish, but Kudzu could be a fish, I guess. Okay, studying under Kudsu. So, Curtsantham, who had no maze, studying under Kudu. Wait, no, hold on. If this is Plum, was to bamboo. Chrysanthenum became the sage of the east, which would be left. So, that means Okay, that's not it. Cuz that is What the Holy [ __ ] Oh, I did. I did it. Of course, the bird was plum and the sage of the east was the drink cuz it's chrysanthenum. It did have a flower on the bottom. did kind of have that. I did it and I'm incredibly intelligent and I figured that out with my big big brain. I guess it did have a flower on the bottom of it. Yippee. I did it. What exactly? I don't know. [Music] Oh, good. Glad that's here as well. Uh, I should leave now. Yeah, I'm going. Don't worry. I'm I'm out of here. I'm trying. My sanity is really burning up. Bo I'm get I'm getting [Music] anybody >> calm yourself. this stuck. It won't open. >> That's enough. Give me a moment. >> I will open it for you. >> Open it. Open it. >> Hello. >> Good morning. >> Yeah. What the >> must have been some nightmare. I >> looks like I'm still in it. >> Are you injured? >> You must not be so reckless. >> Okay. All right. >> You should take better care of yourself. >> Thank you very much for your advice. >> Thanks. >> Nice mushroom. >> Shall we get going? >> You know, why not? Why not? You know, why not? Good stuff. >> Where? What's wrong? >> Oh, nothing. >> This way. >> Ah, yes, of course. Why do you get the cool blue one? Why do I get the same yellow one as everyone else? All right. And with that, I have to end this here. But this is only part one. Part two and all the rest of the parts of this will be coming very soon. And don't worry, I'm not going to abandon this one. I'm gonna finish it because I'm going to play the entirety of it over the next few days. Thank you everybody so much for watching. Let me know what you thought down in the comments and as always, I will see you in the next video. Bye-bye.",
    "start_time": 0.4,
    "end_time": 3819.48
}