{
    "video_id": "sUjw3fddmww",
    "channel_url": "@markiplier",
    "transcript": "Ladies and gentlemen, I have terrible news. Supermarket Simulator released in full like a month ago. Uh, but it released in full and unfortunately my shop has regressed. For some reason, it has reverted down. I don't know why it I I legitimately I was at a loss. So what I did was I played it a good bit. You can see I have money now. So I I was just trying to sell all my inventory and I still couldn't sell my [ __ ] yogurt. I was just trying to sell all my inventory so that I could get back to a point where I could start up and do things again and I wouldn't have to feel like I was starting over from nothing. Even though the full release means that there's going to be some fun things happening. Unless I already played it during the full release. I can't even remember. Something went wrong. And I don't have my godamn store like I used to. But the good news is I have no loans. I have no bones. I have no something. I'm going to pay my bills. I guess I got bills. Stupid bills. Uh, but I, you know, it's kind of like, you know, I got maybe it's a good thing I have slightly less items than I have had in the past. So, what we're going to do, here's what we're going to do. We are going to do something differently. You'll notice that I actually got rid of one of these things, right? It was about time. It needed to happen. And I'm going to fire you. No, I'm not. You're I'm a fine. Uh, fine. Mispronounced fired. How do I fire you again? I forgot. Management. Management. Get ready. Get ready. Uh, gone. onto nothingness. Okay, so what I need to do now, you'll notice the shelves are like more detailed for some reason. Um, I'm going to hold this. How do I box it up? Okay, I'm going to box it up. Drop. Yep. Uh, put that by the freaking trash. That's what I'm talking about. Get out of here. Okay. So, you also might notice that I don't have my dudes standing on the sewer grade over there. Um, and you also might notice I don't have as many shelves as I did before, but that's fine. I'm not open. Go away. These customers are just so eager. Eagers eager beavers. I'm having difficulties adjusting to modern society. And you know, there's a lot of people out there that are like anti- capitalism at this point. That's Yeah, that's fine for you. But me as a capitalistic man running a supermarket here, I got to make my money. What's my point here? I don't have one. So, shush. I don't know what I'm doing with my life. Okay, so I have $15,414. I want to expand my store and I can do a two 4x4 sections. I could get those and that would still leave me enough money to realistically uh deal some bonus damage to my customers psyches. Uh and then break them down and make them buy everything that I have. So, I'm going to buy one to make sure that it's what I want. Yes, that's what I want. Okay. And then I'm going to buy two because that's going to open up that freak. It's three. >> I I thought it'd be two. >> It's fine. This is not a problem. This is fine. I thought I don't know what I thought. I don't know what I was thinking. Did they change the color of the yellow? By the way, is this yellow like slightly more dis I I don't know. It's like they changed something, but I don't know what it was. So, something's changed. I I don't know what it is. Uh, I guess I'll I'll adjust this here. This could work. This can still work. Okay, it's not a total loss. Okay, we're fine. I'll make like the fridge out. I forgot that these were different colors, man. All the beautifification in the world and they still going to be ugly. I don't know what I was thinking. Okay. Well, that overlap is ugly as hell, but it makes sense. It doesn't make sense. It makes sense. It'll make me sense when I make money. It It makes sense. That's a lot of open space. So, I can fill that [Music] with my boy. Oh, yeah. We'll have this right here. This was terrible. Uh, for now because I don't want to buy more shelves just yet because I don't know if I'm going to need to save my money for the inventory. I have to actually put food and stuff on the shelves. So, I'm going to do that first. We also have a crate. And I forgot that it was full of yogurt. Oh, I just got to restock the goddamn shelves. I forgot my cruise [ __ ] yogurt. How could I forget? Yeah, that's good. Wait, this is weird. But they aren't full, but they're full. Wait, why are they not full? Why did they change that? Doesn't have Well, visually I Man, I think my save going over broke some [ __ ] Broke it real bad. So, I don't know what's going on there. I guess this works for the apples. Take that. Take that. Take that. Take these out of there. Come on. Fit. Oh, you're so close. You're so close. Oh, please, please, please, please. Yes. Oh, things are going to go well for me for once. That was perfect. That was perfect. That was unbelievable. That was a upstanding [ __ ] good thing. I don't know what I'm doing. All right, I got to buy groceries. So, I'm going to make sure that I have one of everything. One of the things that was holding me back as a good store was not actually having the things that people expected me to have. So, for right now, I'm just going to order one. One, one, one, one, one, one, one, one, one, one, one. Where was I? Yeah. Yeah. One, one, one, one, one, one, one, one. Can't do one. No. I'll take that out. I'll remember to delete that from my one. One. One. One. One one one. And that's 42. That's not bad. I got to take the yogurt out cuz I have such a perfect God. If I had forgotten to do that, that would I would have been very mad. All of you would have been like, you would have been a good bit. Shut up. I don't care. I have burdened myself with the chaos that is this. I don't ever want to have to live it ever forever. Oh, that's nice. That actually fit perfectly on there. Okay. So, what I'm going to do is I'm going to establish uh where things are and uh yeah, that's what I'm going to do. Okay. Salt. People like salt. People like to see salt. Yeah, I think they like sea salt. They like to see the sea salt. Yeah, that's it. Oh, that didn't fit at all. Whatever. Okay. All right. Cool. This is just the grunt work that you got to do when you're trying to be good at what you're doing. That's good. Candies. Candies are only going to exist here. [Music] kind of exciting. It's kind of like a re re-imagining of Why is soap here? Reimagining of uh of my store sale, man. Even I got excited. Hey, calm down everybody. Hey, calm down. Whoa. Hands off the merchandise. You just clipped right through that. That was very strange. Race my body. price boss body. Okay, honey. Uh, yeah, that should go over [Music] there. Don't ask me why it needs to be that shelf, but those that get it get it. That needed to be there. Okay, Pablo sugar. That is This is exactly why it needed to go there. Okay. So then we're going to have two shelves of that. That'll be good. Uh eggs goes with the other eggs. That way the eggs are in both sizes right next to each other. That makes so much sense. It'll make me so much sense when it's making me money. [Laughter] God, I'm only going to be making pennies on these things. I am going to be poor. All right. One's the food fridge, one's the drink fridge. That's what we're going to do for now. Because I don't have a lot of fridge space, I can't do double up on the the items. It has to be one in one. So, hopefully people don't clear it out too fast. Okay. Coffee. Coffee. People love seeing coffee. People love seeing coffee. They love to see it. I love to see it. Everyone loves to see it. Coffee. And then the tea, which is so pretty and beautiful up top. That's strange. Nope. There we go. All right. It's like they stopped doing twelves and started doing tens on some of this stuff. Okay. Soap. I think soap's already here. Doesn't make a lot of sense to me, but I guess. Yeah, that makes that's fine. Yeah, soap. Need some soap. Wasn't an insult. I didn't mean it like that. Um, well, that's an inconvenient amount. Okay. Well, that's going to go into storage, so I'm going to just leave that for them. Almost there, everybody. Almost there. This is what it takes. This is what it takes. If you want to build your own business, you got to be willing to do this kind of stuff yourself. You got to be willing to start from the ground up. Get them Get them clamoring. You want them clamoring, don't you? You want to get them clamorred. Come get clamored at RAW. Sorry. Come and get clamored. Come get clamored at She's not running away. Wanted to be very clear. She's just walking calmly away. And that's a win in my book. You Okay. Body wash. You know, that looks nice. That looks nice. That's nice. That's getting nice. Okay. Body wash. All right, then. TC cola. I probably should have put the milk. Uh there. Let's put the cola up top. I think it'll be enough for the drinks to be in two of these. I think this is okay. I don't think that there's that many drinks, but I might be wrong. I might have to take some of those away. All right, we got the the thingamabob. The the pasta pasta. Okay, we'll put that next to the boss mata. Pasta basmata. Bus be smart. Get your pasta. Pos stigmata. [ __ ] stigma. Stigma balls. I'm actually laughing at that. Stigma balls. That was a good one. That was a good one. That was a good one. That was a good one, guys. Stigma balls. I am actually [Laughter] God. I don't know, man. I don't know. Uh, we'll put the bread over here because you got to put the hazelnut on the bread, right? Peanut butter or whatever. Oh my god. H. Okay, we're fine. Okay, we got more juice. Ah, we don't need more juice. I have plenty of juice. Okay. All right. I'll leave this for the boys. Oh yeah. Oh yeah. Oh yeah. Oh yeah. Yeah. Oh yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. That's nice. Yeah. It's nice. It's kind of nice being able to rebuild the whole store. It's something that I wanted to do for a while and here I am doing it. So good for me. Okay. You're only six to you. I'm going to make this whole thing. That's going to be all that cuz those go pretty quick. Those go pretty good. So, I'm thinking that you can go to SP. I don't know why my mind fell apart on uh this is kind of like oil. So, it can be Whoa, you can fit a lot of those there. I thought that was going to be bigger. Uh Zap soda. Okay. Yeah. So, I think this is um good evidence that I'm right about what I was talking about before, how this can fit all there. I'm going to put the milk down there. Actually, I'm going to put all the milk down on one for now. I know milk is popular, so I'm going to need to do that. Oh, developer, can you please implement that where if I throw it and it hits trash can, it goes in the trash can? That would be amazing and is a necessity. I think I probably should save two for that. Yeah, it should be two. I know there's orange juice still. Um, and I don't have a ton of fridge space, but I could buy another fridge technically. Okay, so this is what I want to do. I want cuz there's a problem, right? The problem with toilet paper is that it gets extremely difficult to stock it because it pick takes up so much space. And also, this is a PP kind of stand anyway. So, I Why not the thing that you wipe your poo poo with? It's called doodoo. Like I don't think that I'm too off base here, but it just feels weird. Hello. Why don't you wait? Oh, no. Wait, that guy. They both They're both wearing the kind of business outfit of uh Lewis from Left 4 Dead. It's the same red tie, same white shirt. That guy had a jacket on, but whatever. And I don't matter. What's the difference between this cola and the other cola? Okay. And then this. Okay. This is good. Until proven otherwise, I'm going to assume that that's going to span the bottom there. Um even though I didn't do it right there. Um assume that I did. Okay. There is apple juice. Uh, I might be able to spill the juice over to here. Yeah, I'm going to wait until I see what else I got. Got the suzu sugar. That's good. Put that under the bread. That's kind of always where I've had that. It's one of my staples. All right, we got the spaghetti. Put that below the pa right next to the bosi. [Music] Okay, we're almost done. We almost got this. Yes. Yes. Yes. Yes. Yes. Yes. And we actually have a good bit of space. So, I don't need to buy anything besides another fridge. I think I definitely need to buy another fridge. So, I'm going to buy another fridge because that is a water. Water is a good example of why I need another fridge. But this is great. This is awesome. We are going to be in so much business. Look at all the shelf space. I still have a ton of shelf space. I How did I not use all the sh What was I doing last time? What was I doing wrong? What was I doing? I don't even know what I was doing. I don't know. Anyway, I know it looks like I have space down there, but shut up. Okay, shut up. I don't care what you think. I don't care. I'mma buy another fridge. Uh, I could get a display fridge. That'd be pretty cool. Oh, freezers. I didn't even know that they had a freezer. That's interesting. Okay, so freezer is fun because that uh but I want a unit. I want a freezer. Oh god, I have to pick a color. See, the problem is there's an established color pattern here already. It's not a good one, but it's established. It fits the sign. Everyone knows when they come in here, they're going to see yellow. Now, it's a problem that these are not yellow. And eventually, I hope to be able to sell them. I don't know if I can sell them. Can I sell something? Sella 250. Wait, how much did that cost me? God [ __ ] Why did I just sell that? I could have used that when I spent I could have just saved it. It's fine. So, I get half back if anyone was wondering. I get half of it back. Good. [ __ ] Oh, I could get I could get corner. I don't need shelves. I don't need shelves right now. I got to stay focused. I need a fridge. Do I get the double fridge or do I get the display fridge, which is really nice, but what color would I get it? Green. Careful. Okay, I'm trying to imagine this green that yellow. They're kind of close. So, I feel like that would be a safe bet. I'm going to make What about another P? Like purple. Okay, purple. Purple and yellow go together, right? Or do green and yellow go together? Purple and yellow kind of go together, right? Like blue. Blue and yellow. Isn't that a thing? Uh orange and blue are opposites. So maybe that blue cuz I, you know, next to each other they're not bad. I could just do more yellow, of course. and and and but at this point I'm trying to save some semblance of honor in this godforsaken store. Okay, green or freak. Oh man, what about just white? No, white didn't look good next to the other ones. I could do a darker color. My stone floor is gone, by the way. My stone floor, honestly, that's fine. It was terrible to begin with. I could do red. No, that would look awful. It' be like ketchup and mustard. Unless that's what I want. That's not what I want. I want this green. Or I want that purple. I'm going to flip a coin. Heads it's green. Tails purple. I didn't. Head's green. [ __ ] This better be the right choice. I did it. No, I didn't do it yet. I did it now. Now I did it. Let's look. It's going to be great. It's going to be so good. Here we go. Wait, hold on. Ah, I love that. Okay, wait, hold on. That's great. That's a great green. Oh my god. And I know it doesn't really match everything else, but that is a great green. Oh my god. I think we're going to do this. I think we're actually going to do this. I think we actually That is a beautiful green. When did I release the first episode? It's only been a year, guys. Only been a year. I got it. Look at that green. Look at that green. Look at that green. It's beautiful. Oh my god, it's beautiful. Oh, frock. Frog. Frog is beautiful. That is okay. You know what I'm going to do? I'm going to put this back at the front because I I know for a fact uh can I box you up without destroying every All right, I'm going to put you there for a second. I forgot I have those. Um I'm going to put this in the back because I really really actually, no joke, like that color. This is really nice. I think it's I think it's just really good. [Music] It's good, right? It's It was better in the sunlight. Oh. Oh, it's not the sunlight. So, there's a light. So, I got to buy lights. Okay, I'm going to buy lights. I need light. Okay, hold on. Everything's fine. Hold on. It's good. I know it's good. It is good. Oh, right. I can I can have speakers. I forgot about that. Uh, I need two more of those. Scale security antenna category sign. I'm not organized enough for that. I'm just going to I'm just going to get the bare minimum here. Okay, we're so close. Okay, where's the grid? Good enough. That good? Yeah, it's fine. And I'll adjust it here so it's even here. Line this one over to that one. Why can't I have that in a grid? Ah, I did pretty good, you know. Actually, that's not bad. I think it probably should be more right, but I whatever. It's fine. Yeah, this looks good under the light. It actually works well with the walls. [Music] I think I'm not bullshitting here. I think it actually does. So, I think this is about as good as I can hope for. So, I'm going to put I'm going to put this back in the front. Even though I did a whole thing to get it away from the front, I'm putting this back in the front cuz that's where this belongs. I can't fit it. Okay, there we go. Okay. And you go right there. Why can this not fit there? What? Oh, what what? Okay, whatever. That's fine. People can cram in the corner there. And that leaves that walkway pretty open. Let me get actually a little closer if I can. I don't know if I can. Yes, I can. Bam. Okay, now we got it. So, I'm going to fill this whole display with uh toilet paper. I'm going to fill that one with whatever else the hell that I got. And I'm going to put these uh actually that should be a food display. So, I'm going to put the food stuff there. Nice, nice, nice. Yeah. Or Whoa. What the What the hell kind of algorithm did they have for that? I'm just guessing here. Oh [ __ ] Okay. Pull that. Put that. Yeah. Put that. Nope. Put that there. Yep. Yep. Yep. That's good. Okay. Put that there. And [ __ ] [ __ ] My There we go. Okay. And then take the rest. I don't know why I did it that way. Okay. All right. Okay. I actually think that this is uh I might need another one of those uh next to it. Um cuz I like that being the food display. And I still have eggs. And then um I need another one of those. Might need I'm doing great on money actually. I've got good money going on. I was farming for a bit. Yeah, I think this is my new color scheme. Piss yellow is out. Green of of lime. Lime lime. Lime green. Kind of like mint mint. Mint. Mint. Mint. Green is in. Come on. Get even. Oh, I had it. I had it. I had it. Bam. That is a be. That is a be. That is a be. Okay, cool. So, let me put the eggs over there. All right, that's fine. We're going to put small up top. I have two things for eggs cuz eggs are always very popular. I mean, I mean, when I go to the grocery, eggs are popular. I've gotten good at getting discount eggs, by the way. I get I go there either right right before close or right after open. You can get the manager discount. Yeah, even though it expires in a couple days and you boil those bad boys up. I don't mind it when it's 275 a dozen. I don't mind it. All right. I don't mind it. Some 325, but still this way better than what it was. And these are the good eggs, too. Not the not the crammed in a cage and never see the sun kind of eggs. Okay, so let me put the water. There's going to be a lot of water. I know that everyone buys bottles of water. So, I'm going to put four for the bottle of water for now. I've got OJ. So, I've got the milk and the OJ. I'm going to put this down here. So, the bottom shelf is all the OJ. All right. Cool. And eventually there's another type of juice, I think. Um, you know, I guess I could put the milk over here. I guess I could put the milk over here and then the juice could be over with the sugary ones because it's technically kind of sugary. Maybe. Maybe. Maybe. [Music] Okay, these shelves are out of place, but um it's fine. [Music] I got so much shelves. Why do I have so much shelter? [Music] [Applause] [Music] That doesn't make any sense. [Music] I know. I know. I know what I'm going to do. I know. I know. I know. I just need to get two more. I am into the aesthetics. I am into the aesthetics. The aesthetics are what I want. And I know what I'm going to do. Okay. a little not as not quite as snug as a bug as I thought, but that's more like what I'm talking about. And then I could put this over here so that it kind of mirrors the other one. And then boom, bam, boom, bam. I bought two more. Why? Why did I buy two more? Why did I buy two? Why did I buy two? What the [ __ ] Why did I buy two? Why did I What? Why did I make two more? [Music] Wait, why did Why did I do that? I guess I could I guess I could Yeah, this will this is Yeah, this is Oh, yeah. This is This is what I am talking about. Yep. This is what we're all talking about, actually. Uh just Oh, man. Yep. That's what I wanted. That's exactly what I was hoping for. Yeah, it's fine. Man, this being on the end here is really weird. Why is everything kind of like Why Why did I build the aisles like this? I don't know. I I got to get into the opening shop. Ah, frick. Okay, I'm going to put you there so that I'm doing this so that the automatons, those clankers are gonna actually fill the space properly. You know what I mean? So that's going to go there. And then I'm going to uh these are still going to alternate. Uh so those go down. Those go down. This goes up. Come on. Oh, [ __ ] off. Okay. All right. Okay. Okay. All right. Okay. All right. I need a lot more of you. I'm just going to go ahead and play toilet roulette here and just pop that there so that all of them get started with the price tag for that and they will be filled and we'll have a non-stop towering thingamabob of toilet paper. And actually, now that I'm thinking about it, this does not make any sense over here because if I have this and I have all this shelf space, then the milk should go here with the cereal, right? Doesn't that make more sense? Not there. That should be the tower of oil. That's the whole thing about it. It's supposed to draw customers in with its oil. And that's the whole thing. All right. There we go. Okay. So, we have that. I would like because I have two of these. I'm going to put also these eggs are going to go here and there. You're also going to go there. You're also going to go there. I don't need to do this, but just so I know. And you mirrored over here just so we have more inventory for all of this. Okay. Oh my god, I am exhausted. I am actually exhausted. I have a lot of shelf space. I am not using my shelf space properly. Whatever. It don't matter. Okay, it's time to hire those dudes. We're going to hire the dudes. Management. It has been like 40 minutes of me setting this back up and I've been loving every minute, but I know that I'm got to get get gone. Purchase racks. Seven of 13. Ooh, I just need to buy more racks. I can buy more racks. Yeah, I can do that. Uh, small rack, tall rack. Why would every anyone ever get a small rack? Seven of 13. I need six more. Six more racks, which makes sense cuz I'm going to need a lot of inventory. 4,641. That's good. That's enough to be able to get what I need. Um, and I definitely This is Oh, this is different. No, it's not. No, it's not. It's not different at all. Not different at all. Can I still walk through there? Oh, yeah, you can. Oh, they can squeeze. They're only carrying big boxes. They don't actually need to be nimble about any of this, do they? Nah, nah. That's what I always say. Okay, you go there. Oh, freak. Oh, come on. Uh, how did I do this before? I thought I fit more of these here. Okay, there's got to be a way to squeeze more in here. Maybe sideways like this. Uh, box up. That actually help. Ah, I don't think that helps cuz I can't get in there. Unless I can put one that way. I have one left. And if I can get Come on, baby. No, it's not going to let me do that. Okay. All right, then. How the [ __ ] did I do this before? Just a human. [Music] [ __ ] I have two more. God damn it. Okay, so you can squeeze. That's how I did it before. I I had him squeezing through this little gap. That's what it was. But that is kind of stuck there. Unless I can fit too. No, I can't. [Music] Uh maybe not. Okay. It's even worse than before. So, I I don't like what I've done. I don't think I can fit all of these in here. I I liked it better before. It just felt better. And if it doesn't give me any space benefit, then I'm not going to do that. Okay, I think weirdly enough, maybe this is where I'm going wrong. Maybe what this needs is to be more efficient here, right? Wow, that's like one pixel of clearance. I have an idea. Boom. Boom. Boom. It's going to happen. It's going to happen. Oh yeah. Got it. Nailed it. Nailed it. Okay, just had to scoot that forward a little bit. And it's perfectly comfortable to navigate. It's perfectly good. Wait, actually, let me see if I can put maybe something over here. No, no, no, no. That's not going to work. Okay. I wish I could just undo. Okay, there we go. All right. Well, I got everything and I can hire one of more of those dudes. And the reason that's important is because three should be able to keep up with all the inventory that I need to put everywhere. So, I'm going to hire him. That's really good. All right. So, remove label. Uh, do not do that. Yeah, don't remove label. Remove label. Throw the empty boxes on the floor in the trash. Products on the shelf. Restock from vehicles. Allow restockers to move boxes from vehicles. What do you mean from vehicles? What does that even mean? Okay. Do not use unlabeled racks. Definitely don't do that. Okay. Don't do that. We got three guys. Three guys. All right. So now what I need to do is I need to go through and I need to fill in the rest of the orders. [Applause] [Music] I need to put the mirror of the candy on this side. [Applause] [Music] Boom. That's everything. Everything's going to be loaded up. Oh my god. That's more than I thought it would be. Okay. Well, I'll quickly just slam these in here. I'm going to help out cuz Wow. Okay. All right. I should have done that from the beginning. They They could have been filling as I was doing literally any of this, but I didn't. And it's fine. It's fine. It is fine. Uh oh, racks. Use unlabeled racks. I do want them to use unlabeled racks because that's for storage and not necessarily for loading up the shelves. Shelves are different cuz they can't even do that by themselves, I don't think. Coffee. Coffeey's full, I guess. Okay. Oh boy. This is um this is a little silly. I guess I might have done this slightly wrong. Why didn't you finish this? Oh, probably. No, that doesn't make any sense. Why wouldn't they finish that? Also, I can get them to hurry up. All right, it's opening time. It's time to actually make some money because I I am at $748. All this has gone way too far. I barely had enough money, even though I definitely didn't waste a dime on any of that. It's time to make it all back. This store is starting back up for the best. Come on down. Wow, look at you, Colonel Sanders. How you doing over there? I I thought you were wearing a bolo. Uh, but that tie is still sharp. Oh, a nice. Thanks for coming in. I knew you'd be the first customer. God. Just checking. Anyway, have fun. Enjoy. Uh, have a good time in a good day. In a good way. Hey, looking stupid. Uh, looking stupider. Looking stupidest. Just like these prices. They're so I didn't set the [ __ ] prices. Oh god. Oh god. Okay. Uh, hi. How you doing, handsome? Uh, don't worry about a thing. This price is probably fair. Oh, I don't have a freaking nump pad right now. Oh god, this keyboard doesn't have a nump pad. All right. Well, that's fine. He paid in cash. All right. I got to look at this market price is uh that's good. That's fine. That's a little uh 3.99. We got $4.99. That's 3.99. 3. Uh this be Let's go 319. Oh, shut up, you beautiful bastard. 489. Uh that's okay. Okay, that's okay. Okay, most of these are okay. It's not It's not the worst thing in the world. All right. Oh, exact change. Yes, please. Hold on. Hold on. 529 with a 6% discount. Oh [ __ ] I forgot I got sales going on. God damn it. Let's see. 937. There you go. Okay. 1946. Wow, this is much harder without a keypad. Uh, where's the keyboard with the keypad? Where the keyboard with the keypad? Yes, I do need this. I need the keypad because entering in the numbers without the keypad is just that much slower. Okay, that exact change. Love that. All right, watch this speed. Look at this. Oh man, the products. The products. 118 17. Perfect. Oh, what in the [ __ ] is wrong with Oh my god, your twins over there. All right. Okay. Uh, it's fine. Okay. 3205. Wowza. Yes, please. Thank you for being such a good That was only 70 83. I felt like it should have been more. All right. Whatever. Uh, keep the change. Nice, nice, nice, nice. Very nice. Oh, love you. Love you, smooches. All right. 535. Get that. I forgot how much I enjoyed just doing the checkouts. I don't get why people don't like doing this. It's like they don't want to run a supermarket. There's nothing better than the selling of product and keep change. I see you got yogurt there. Very wise and smart and beautiful of you. Ah, so wise, so beautiful. Very blue of you. 16. Nice. Nice. Nice. Nice. Nice. Nice. Nice. Nice. Very nice. Very nice. Excellent. Oh my god. I love you. 2618. Yeah. Okay. 4758. All right. Cool. Holy [ __ ] Wish this game could be more immersive. I want an actual credit card swiper. I have to pick up a credit card. You know, like the guys that played World of Tanks with an actual like tank change for you. Damn, these customers are [ __ ] customing. Nice. There you go. 959. Oh, no. No, no, no, no. 959. Nice with the bone poppies. All right. Oh my god. Up to $2,000 already. Zack change. Thank you very What are you doing? What are you doing over there? You being sneaky? I haven't been watching for criminals, so I have no idea. 508, sir, ma'am. Easy on the cheese. All right. Easy on the change, why don't you? All right. Exact. Thank you. All right. 60. Oh, 60. Ah, man. Change. You son of a lovely. Oh, man. You got the weirdest prices. Thanks. Thanks, pal. Thanks, buddy. 7638 for you, my good friend. All right. 19. Yep. There you go. 125 for you. Damn, there's so many customers. Uh, I knew that the grand reopening would be big, but I didn't think it would be this big. Um, 5610. Got it. Checkouts are full. No, it's not. How could it be full? Wait, what did you just give me? Okay. Uh, 38 24. Wasn't even paying attention. Yep. Yep. Yep. Yep. Yep. Yep. Yep. Yep. Yep. Yep. Yep. Yep. Yep. I'm being bought out of house and home. Uh, boom. Jesus Christ. I wasn't ready for the Why are there so many? Just keep the change. Go, go, go. Holy [ __ ] All right. One, two, three, four. Keep the change. Okay. Thank you. [Music] Okay. Uh, keep the change. Oh my god. Oh my god. Oh my god. Get. Okay. What do you got? Okay. Don't. One, two, three, four. There you go. Out of water. How are we out of water? No. Not that. Don't keep that change. Just Oh, freak. No. There you go. I was about to be generous to you, but I don't have time to be generous. All right. I don't have the money to be generous. I don't have time to be not generous. I just got to go. Okay. 9428. Boom. Okay. I didn't even get to set my prices, right? One, two, three. There you go. We're out of bottled water. Those guys need to hurry the hell up. 48. Okay, we got this. [Music] Perfect. 5203. Thank you. Change. Holy [ __ ] It just is not stopping. Oh my god. It's already closing time and it's just not ending. [Music] Oh my god, my hand's cramping up. 250. Thank you. How are people still getting into the store? This uh doesn't seem right. [Music] Dollar keep changing. Thank you. Thank you for the yogurt. God, no one buys yogurt. Why does no one buy yogurt? 2955. Thank you. 1981. There you go. Oh, this is the last one. Bonk. Bing bunk. Oh my god. Holy hell. Paper bag. What the [ __ ] is paper bag for? I don't even know. No, that's not what I need. Um, no. I just need to pick it up. Oh my god, that was insanity. That was crazy. How the hell did that happen? Oh my god, I'm exhausted. I'm like actually tired. I don't know how that happened. I'm actually tired. I made four well $3,000. So I made 30 $3,500. Damn. Holy hell. That's crazy. Oh, and I bet I maybe I got stole from. I I don't know. I I didn't even get to see. All right, we're closed. Thank you. We're closed. Good lord, we are closed. Holy hell, we're closed. All right, enter the finish of the goddamn day. 57 customers, eight products not found, one found expensive. Lot of money in, lot of money out. Doing okay. 644 store points added in. I don't know what that means for me, but Oh yeah, this is great. Okay, let me look at the prices cuz wow, I don't know what was going on there. I forgot I had sales. Um, yeah, whatever. That's fine. Why can't I put a number in for the sale? Why do I have to click and drag? I think I wondered that last time when I was putting these in before a little annoying. Okay. Oh my god. Okay. 2150 299. I do want to make it a little easier for me. So, sometimes I do need to put it as like just quarters. Uh I should or whole numbers, but the psychology the psychology. I know that they programmed a bunch of really good AI into this. You know, they got AI out the wazoo. Oh. Oh, fruits and vegetables. I guess now that I think about that, why didn't I have that before? That's fun. Uh store level 32. That's not bad. Tools. We got all the tools. Vehicles. Oh, what? Why do I Why do I need a vehicle? Why do I need a vehicle? What is What is it for? Oh, what? What? Why? Why? Why? Why? Why? Oh, no. Look out. Oh, the blood. Oh, so much blood. Okay. Well, uh I know that I have my competitor over here, but ow. Sorry. This thing turns on too much of a dime. Why do I have this? I don't know why I have it. Wait, I see something on the mini map. I don't know why there's a mini map. GTA style. Okay. Speed. What is this? Booze. I can sell booze. Can I sell booze? Oh my god. What is this? It's another competitor. Liquor store. Oh. Oh. I probably got to get a license. Uh or something like that. Maybe make some shady back alley deal. You want to make a shady back alley deal? Don't run from me. Yo, you Oh, the blood. Oh god, the blood. All right. Okay. I don't know why I have a vehicle. I'm guessing it's to get to a place like that and bring Ooh, there's something over here. What are you about? What are you? Janitorial supply. Why would I need that? Supply. Supply. Oh, you have discounts. [ __ ] Oh, wait, wait. But what is what is the normal price for that? How can I check? Interesting. That's kind of useful, I think. I think it's kind of useful. So, if I buy something from here, like a box of bleach, and I put it in my uh I wonder if I can carry one more than that. Probably not. H. Okay. Take this hand soap, right? Trunk is full. Of course it is. God damn it. I can carry one freaking box. I'll just throw it in front of me. That's how I'll get it home. I'll just get out and throw it each freaking time. Why did I do this to myself? Get that. Yeah. Thank you. Should just saved up and bought a car. Why did I do this? I guess it's I can only carry one at a time with my hands. So, I guess technically it's better. So, that would make sense. It's at a discount so that you can get it, but it takes work to go get it. Uh, hi. That that makes that makes a bit more sense. Oh, I need water. I must not have ordered water when I had it. Water goes very fast. So, I'm going to put another stack of water on there. Okay. Well, let me see. Actually, what was the price of the janitorial stuff? Like that shampoo, how much was it per uh bottle? Shampoo was $51. So, that actually shows the original price and what it is. The difference is gigantic. Okay, so this is important. Wait a minute. Wait a minute. Wait a minute. Wait a minute. Then was this not my competitor over here? Was this actually another thing like that where I could get it for wholesale? I'm going to burn it to the ground anyway. I don't give a [ __ ] what you have. I'm never buying a thing from your store. I'm",
    "start_time": 0.16,
    "end_time": 3146.52
}