{
    "video_id": "hlIVYlxLBBg",
    "channel_url": "@markiplier",
    "transcript": "Hello everybody. My name is Markiplier and welcome to the butterfly. This is not going to be a happy butterfly. This is going to be a very depressing butterfly that looks like this. Or maybe this. Or maybe this. Or maybe it looks like this. Or this. Or this. Or this. Or this. Or this. Or this. Or this. Or this. Or this. This. This. This. It's on your nose. Don't move a muscle. Shoot him. Shoot him. Shoot him. Shoot him. Lixian. Shoot him. Uh. Well, ain't that lovely. Usually it's dark and dreary. It's kind of bright and dreary. Is this a No, it's locked. Huh. I can't even leave. Not even for a fake achievement. I promise you if I ever make a horror game, you're not going to be able to leave ever peg. You know, much like Blood Mall, I love when a game just kicks off where just big and bold right off the bat. Hey, an egg sandwich. Sandwich is untouched. It's about to be touched by me in a completely appropriate way. It's a note you wrote this morning. Ila, please eat something today. It hurts me to see you like this. Love you, Leila. Huh? So, I'm assuming I wrote it to Ila. And Leila did not eat. And Leila might be an egg. [Music] I'm hearing a computer. I heard some kind of a hard drive over there. And what might be a CRT? It's a bottle containing a light blue liquid. You don't know why it's here. Good. Okay. Something's blocking the door. He's a butterfly. He's a drawing of a butterfly. Very specifically different. Is locked. I don't know what the I don't know what I'm looking at there. It's a picture of Ila. You've been together for nearly two years. She's beautiful in a Minecraft villager kind of way. You notice her eyes are very small compared to the rest of her face. Two years in and I'm only just noticing this now. Huh. It looks uncanny. Huh. That's weird. That's weird about my significant other. Very weird. What's going on outside? It's a Leila's office. 2F key. You take it. Uh, why it foggy? Why it get foggy? It's a TV with a built-in VCR player. All right, so if I find a VCR, that'll be useful. But why' it get foggy? All right. [Music] Huh? It's a wooden mannequin. Yeah, I'm sure it is. It's a 2F key. I take it. Was its arm always out? I know. I just looked at it, but I can't remember if its arm was always out. It's a wooden mannequin. It sure is. I'll kill everything. I'll kill everybody. I'll kill everybody. I'll kill you. Leila, Leila, Leila, Leila, use two F key. All right. Well, I did hear someone stomping around up there, so I might as well go up. Leila, it sure is. Leila. Leila. Leila, it's a note you wrote a few days ago. Ila, is that Ila in the bed over there? That better be. Please hold on. Keep taking your medicine until I can give you the cure. Stay strong. Uh, Leila. Leila hides under the covers. Don't look at me. It's gotten worse. Please get my medicine. Okay, I will. Honey, dear, where is it? I seem to be having some memory troubles. Where is the Medus son? It's Leila's diary. Most of its entries are addressed to you. 209. Since we moved in, you're so close all the time. I love you and you're so close. You always know where I am. 219. We find each other using the creaking of the floorboards. I'm never lonely anymore. Sometimes you say something mean, but that's fine. Besides, maybe it's my fault. I haven't bent myself since I got sick. You said there's a cure, though, so I will hold on. Will you be there for me? Today, you said my fingers look chubby. You son of a You've never said anything like that before. I guess you notice these things when you're together all the time. I felt worse today. My fever doesn't go away, and that itchiness is unbearable. I'm eating less. I spend a lot of time looking at my fingers. I really don't like them. They're chubby. You've been hard at work in the woods. I should be proud, but it honestly creeps me out. Thanks, babe. I'm sorry for not eating the sandwich you made. I know you miss the old me. Please, I need that cure. Whatever it is, at night, it feels like my skin is ripping apart. Huh? Oh, hey, wait a minute. I was supposed to get a cure. Uh, honey, deer. Larva? What do you mean larvae? Uhoh. Uh, I maybe I shouldn't have read her diary. I think I was supposed to get the medicine, but I don't think I I don't think Close the door. It moves even when you're not there. What do you mean? What do you mean? What do you mean? Where were you? Wait a minute. Honey, where are you? You in here? Babe, babe, babe, babe. Babe, babe. What? I don't know. Well, I'm confused. We got a dog. Do we have a dog? Leila, do we have a dog, Leila? I don't like this. I don't like it. Okay, so this is something that horror games do well that I like. It's when they they put you in an environment and then change the environment, but you know, it's the same environment. I'll kill you. Hello. It's a wooden mannequin. I don't I don't know if it is. It's a note. Thank you so much. I loved it for the three-digit lock. First, the hours, hands, current time. Second, how often I should be fed. Third, the years you have suffered her. Well, the third number is two. How often I should be fed? Probably three times a day. You know, three square meals, hours, hands, current time. Huh? That's where the barking came from. The dog bowl reads spotty. Sure does. La. Okay, so there was a clock upstairs, which is fun that I get to go back. Great. I'm going to close the door now. So, I could brute force it. Now I got to Yep. I'm just going to check real quick to make sure nothing's down here. Note I wrote it's been suffocatingly dry for weeks. The glass isn't thick enough. They're breaking all the windows. What? What's breaking all the windows? What is What? What are you talking about? What do you mean? What are you saying? Eh, what are you talking about? Honey, you're not in here, are you? This is a different note. Yep. Whoa. Whoa. Whoa. Something was interactable. I don't know what though. Oh, there we go. There's a small door in the foot of the clock. It's locked. Okay. Okay, but the hourhand says one, so that's good. I don't know where I went. Then again, I don't know if Ila was there to begin with. I only saw a pile of covers. You know, insanity runs pretty conveniently through these types of stories. Not conveniently, but you know what I mean. Commonly, I know words. So, it said one. So, the first one's definitely one. So, how many meals should you get a four? Who gets four meals? Don't know why that scared. Don't know why that scared me. That was just a Yeah, I might give the door closed. Thanks. It's a front door key. You take it. Well, a coward would sprint screaming, \"I'll kill you.\" Well, I don't know what that was. Probably nothing, right? Am I right, everybody? Oh, well, that's not my problem. I'll close that. [Music] It's open. Come on, man. That's not very fair. Oh, no. The Slender Man note is pinned to the tree. Two initials are joined together in a crudely drawn heart. A plus L. Aruplier and L. Lara. What was her name? Leila. Leila. Lara. Yep. It's a bench. Before she got sick, you used to sit here with Ila, listening to the cicade as on special nights, she went into the woods to pick apples. That does sound pretty special. I'm not going to lie. I'm guessing I'm going That's a precipitous fall. Spotty. Spotty, come here. What are you doing out in the woods all alone? Spotty. Spotty. Spotty. All right. Oh, Spotty, there you are. Hey, good pup. Thanks, pup. Inside it, you find a small broken handle. You take it. Thank you, puppy. Good puppy. Oh no, I'm lost. Oh no, I don't remember where I was. I don't remember from whence I came. Ah. Oh, wait a minute. So, no. Deep forest gate. Uh-huh. It sure is. Oh. Oh. Oh, that's weird. It's a note you wrote last night. Leila doesn't like my latest mannequin. She says it's too lifelike, too real. It moves even when I'm not there. However, it still needs a soul. To give a life, one must take a life. Forgive me, Ila. Spotty will die now, but live on forever. I will make it quick. You used a pair of bolt cutters. It wasn't quick. Quick. Why? I used a pair of bolt cutters to do what? To cut Spotty's head off. All right. It's the first mannequin you made. It was quiet and obedient as it should be. As it should be, but did not feel alive. A simple winding key protrudes from its stomach. You take it. You combine the winding key and the broken handle to make a fence gate key. Okay, I do that. I do that. Uh-huh. Great. There must have been some key. Okay. Am I just going home? Am I? Oh, Leila, I'm so sorry. Please forgive me. I won't run off again. I felt so hungry. So hungry. Please. There should be something in the refrigerator. Kitchen store room key. All right. Well, I'm a little confused. But if your appetite's back, that's a good thing, right? Oh, poopa. The poopa. Not the poopa again. Is it open already? Is it open? Is it open? Is it just open already? Is it open? Hey, look. Butterflies. It's a picture showing the life cycle of a butterfly. Egg. Larae. Poopa. Imago. Butterfly starts its life as an egg before turning into a larvae. A larva's primary concern is finding and eating enough food before wandering around in search of a place to become a pooa. A pooa is a stationary again, just like an egg. And this stage marks the beginning of a transformation into a winged adult known as an imago. In this final stage, the butterfly is fully grown. I guess also it's called a butterfly. H seems like this would have been better than a bolt cutters. It's a knife. Very good. Again, dog food. You should have fed Spotty four times every day, but you often forgot. Well, that I don't know how I would have gotten that information to solve the key. This door was closed before, unless it wasn't, and I'm very stupid. All right, the refrigerator. Strange stench emanates from inside. I open it. I sure did. It's a sandwich made for Leila. I take it. I guess that's fine. That's weird. Oh Okay. So no. Was it worth it? Let me work. Oh yeah. This is great. This is good. I'm I'm happy. I'm happy. Leila, don't worry. I got food for you. It's a delicious sand a witch. You ever have a sand a witch before? It's made from real witch. Here, take that. I'll just shove it under the blankets. You're welcome, babe. I think I feel a little bit better still. Please get me more medicine. I think there's some in the attic. Third floor key. You grow tired of errands. I don't. You know, I don't. I'm very happy to run your errands. I'm happy about it. I don't know why we keep the medicine in the attic, but hey, wherever it's good for you is good for me, right, babe? I'm such a loving and caring partner. That definitely isn't bad. Yoohoo, medicine. Uh, yes, it's a note you wrote a few days ago. Log 138. I designed my mannequin to be exactly like Leila, to mimic her in mannerisms, habits, and abilities. But it has often started to surpass her. While Ila plays the piano clumsily, my mannequin shows the most incredible precision. Its slim, non-chubby fingers will never miss a note. Really, really odd about those fingers, huh? It's an old piano. Two keys are missing. Probably pulled out by Leila in frustration. Or her big sausage fingers got wedged between them and ripped him out when she tried to pull him. All right. Or it was so heavy her big her big 900 lb fingers. Clum clum clum. Bong bang. Broke it right through the floorboards. Am I right? All right. Medicine. No, that's a key. It's an attic key. Great. I thought I had that. Oh, there's other doors, I guess. Ila, you aren't out there, are you? Are you [Music] medicine? Medicine. Oh, I take every bottle. VHS tape. Name written on the back. Spotty. I take it. Sure. Sure I do. Wait, the blue bottle. Those are the same bottles that were downstairs. But I don't recla. Oh no. Well, that's not good. Guess I'll go watch a movie. Man, that actually got like the panic response like the holy I got instead of usually as horror games where I'm like I got to run away from something. That had the I got to run. I got to run and help kind of thing. I didn't like that. A little too much. Okay, I got that one. Okay. Well, anyway, Leila, let's fine. Probably fine. Doesn't need this medicine that I got. Doesn't need it. All right. Let's watch this movie. Nothing happens. Uh-oh. I better look up. Hi, Spotty. Holy hell. Oh my god. It's your wooden mannequin. Holds two piano keys in his blood seed mouth. Take them. Thanks, Spotty. Oh, thanks buddy. Thank you. Was that always there? Feel like I would have noticed that. Okay. Love that dog. Love that mannequin, you know, with its slender fingers. Yeah. Leila. Leila. [Music] Oh, medicine. Well, that's Oh, I guess it's different now for some reason. Oh, this is open. Why is it open? I don't know. I don't know. Uh, honey, do you still want your medicine? You know. [Music] All right, I'll go upstairs. Hey, Leila. Um, just don't jump out at me. Laya, help, please. It's too much. I got it. I got it. Babe, babe, babe, babe, babe, babe. Babe, okay. Here you go. Pour it into your open rib cage there. You're welcome. Feels so horribly itchy all the time. I know it bothers you, but please feed Spotty for me. His food should be in the kitchen. I uh It's blood. Leila has been hitting her head against the wall. It was Ila herself. Your mannequin did not do this. Uh-huh. Thanks for specifying voice in my head. La. Hey, Spotty. Uh, you like food, right? Still, still you like food. Why do I have the key to this if I was already Why do I have it if it was already? Should I I don't I Oh. Uh, this Oh, interesting. Weird. Okay. So, should I should I should I spotty? Oh, Hey. Oh. Uh. Oh, hey. It's a wooden mannequin. Oh, yeah. Sure it is. Sure is. That's locked. This is open. Spotty. Spotty. H. Okie dokie. Then guess I'll go back upstairs. Uh, honey. Let's uh uh it just couldn't be bothered. Hi. Spotty. What are you doing back there? Spotty. What are you doing? Spotty. Spotty. Spotty. Spotty. Um uh potty. I remember what I'm supposed to do. I have the piano keys. Please don't go away. I won't. Okay, I won't. Okay, honey. I don't want to I don't want to play this anymore. I don't want to play this game anymore. I don't want to play that game anymore. I don't want to play it anymore. I'm sad. No, I'm sad. You still there? No, you're gone. That's locked. Maybe I need to open this combination thing. The only thing I would be able to do is brute force it. I don't know what the combo would be. Yeah, I'm beginning to think that this medicine might not actually be medicine. So, I can't open that. I can't do anything with the dog food that I know of. And all I have is this combination. So, I guess I must brute force the combination, right? Unless there's something else that I missed over in this area, cuz she gave me a key to go this way. And there is a can of dog food, but it doesn't do me anything to actually interact with it. This is not a good way to brute force it. Maybe it's the same thing, but because the time has changed, the first number has changed because now it's seven. So maybe it's maybe it's 742. Because if the rules of it is still the same, then maybe the maybe it's all okay. What the What? 138. Is that for real? I wrote a title about Spotty. Spotty belonged to Ila, not me. I've never liked dogs. Ila was very attached to him and felt awfully guilty to no longer be able to take care of him after falling ill. They used to be inseparable. Sometimes it seemed as if Spotty was the only soul in this world to truly get close to Leila's. That bastard. Ow. Kill that dog. It's Spotty's headless body. Oh, yippee. So, why did I um uh Ah, yep, yep, yep. Why Why did that open at 138? Why did it open 138? Was I like one number away from brute forcing it and I just got lucky? I don't know. I don't know. Hey, Leila. Uh, nice spot. Did anything change in here? No. Why not? Please don't go away. I'm trying not to go away. I don't know what I'm supposed to away to or do to why. I don't know. Okay, so if the headless body is over there and then the dog bowl's over here, I'll bring the dog bowl to the headless body as a gesture of symbolism. I'm so confused. I'm thinking maybe I might actually be bugged because I got the piano keys, but I didn't go straight to the piano, which maybe I should have done. And I guess I could have broken something. Not sure what or why. because I'm willing to bet that I was supposed to go to the piano or something and that would have given me the combination, right? Or something like that. Okay, I definitely think something's bugged. I don't know what I did. Weird, but that's weird. Uh, okay. I doubt it saved. I don't think it would have saved. So, I think I got to start from the beginning. That's okay. I'll be right back. Foggy. Oh, what the hell? Oh, right. This is the mannequin. Forgot about that. That did move its arm. I knew it. Get my medicine. So, what if I go get the medicine first? I imagine this blue is the So, I somehow skipped over that. That's weird. All right. Give Leila the medicine. Thanks. It feels so horribly itchy all the time. I know it bothers you, but please feed Spotty for me. Ah, that's why it broke. Because this is dialogue. This should have been earlier in, but I never got it because I didn't get the medicine first because I went straight for the diary. Oh, okay. Well, now it's time to feed Spotty. Did I close her door? I did not. Don't worry, babe. Ah, I gotcha. Well, isn't this so good? This is great. Oh, hi. Okay. Yeah, you spawned there. We Oh my god. Okay. Ah, inside Spotty's body is a pair of bolt cutters. I take them. Wow. Yeah, that that's okay. Yeah. Mhm. Yeah. I didn't get that before. Hey, what's up, L? Uh, keep it up. Whap. Uhhuh. Full cutters. Dusty looking VHS tape. Uh, be right there, honey. Uh, no response. Great. Must be sleeping. Hi. Hi. hi. Nothing happens. Great. Of course it happens.  Whoa. Okay, it's a note. I love you. I love you. I love you. I'm healthy. I'm happy. I'm perfect. I'm so full of energy. Well, that's that's great. That's nice. Thanks. Oh, Oh, Uh-huh. Yeah, I missed all of this. Wow. What? What? Not sure what I'm supposed to do again. Uh, help. Help. Let me out. Help. Help. Help. Help. Help. Help. Let me out. I think I Is it broken? What happened? Was there supposed to be like a key that smashed through the window as well? What was with the thing of flies? Uh, I guess I broke it again. I'm going to try this again. I'm going to try it again. I don't think I was supposed to get that key yet. That's why the whole air. Ah, okay. This is going to sound strange, but I think that I'm not supposed to get that key yet because that key is only supposed to appear after you watch the VHS. That way you're in the room. I think it's just a bug. Leila, it's me, babe. Medicine. So, I go get medicine. Then I'm going to close the door cuz I'm a good holy boyfriend, fiance, husband, [Music] Madison. Well, this is going well. I think Leila's going to be just fine. Ila, here you go. Horribly itchy all the time. Both please spotty for me. His food should be in the kitchen. Okay, you got it. La. Ah. Uhhuh. [Music] Uh-huh. All right. Hi. What's up, pal? Wham! Excuse me. What the Clunk. Yoink. Oh, interesting. H. Well, we're all here, aren't we? I'm going to leave that open this time. Let's watch this beautiful show. Ah, I see it now. Now that opens. All right. And that's why that all happens. I think good. Now we're on the right track. I believe it was a little strange with how that's laid out. But I think I think what happened was there was probably a patch that fixed one thing, broke another, and I just happened to run into that. I think it probably, you know, it's not that Okay, we know all this. I'm going to skip ahead until I get back to where I was. Leila. Oh, yeah. Leila's gone. I forgot. Are you there? No. That's why the That's why this would be concerning about that. Dog barking would be very concerning. Ah, now I get it. Hey, don't worry. I already know what this is. One, four, two. Yippee. Oh, front door key. I'm going to choose to ignore that. All right, out the door we go. There, Leila is. So, hi, Ila. Sorry. Please forgive me. I won't run off again. I felt so hungry. So hungry. Please. Should be something in the refrigerator. Okie dokie. Now that makes more sense of why that's there. Okay. All right. I forgot to close the door. Sorry, I'm not going to open that just yet because I don't want to break it again unless I'm supposed to. But I know the combination, so I guess I could get it at any time if I really wanted to. Leila, I've got a sandwich for you. You're going to enjoy it. Smoosh. Yep. I think I feel a little bit better still. Please give me more medicine. And there's some in the attic. You grow tired of running her errands. I don't. That's the thing. I don't. But I'm getting the feeling that the person that I'm inside of puppeting all meat puppet style is a bit of an Just a little bit. Ah. Yep. Delicate. Beautiful fingers. Yep. Yep. Yep. Key. Yep. All right. [Music] Uh, here's the part I don't like. A Uhhuh. Yeah, that's very good. I don't like that part. I don't like that part. All right. Anyway, time to watch a movie. Am I right? Got you. Please. Thank you. Yeah. Uh-huh. Okay. I'm sorry. I'm sorry. I'm sorry. I'm sorry. Yep. I'm here. Don't worry. I'm here. Hello. I lied. It has never gotten better. So, we're back to where we were. All right. I can't bear it anymore. The terrible pain, the itchiness, but worst of all, that disgusted, scared look on your face. What have I done wrong? Why is everything different now? Why are you so distant? My fingers are so very slender now. Leila doesn't respond anymore. Okay. Okay. I got these piano keys, though, so that's fun. Get to play a little ding-dong jingle. Interesting. Clock key for the door in the foot of Leila's clock. Thanks. If I didn't find that before, yeah, I would not have known that Rutro didn't know you wrote. It's titled Confession. Oh, Leila, I couldn't bring myself to tell you the medicine wasn't medicine. I'm calling it. There was never a cure. The doctors haven't seen anything like this before. Every test came back with unimaginable results. They speak of the strangest things. transformations, changes, metamorphosis. They doubt you'll be here much longer, Ila. But when you're gone, I'll have my mannequin. Watching TV, having dinner with me, walking in the woods, picking apples, playing piano. It will always be around. Like you, Ila, like you. Everything will be just as it was, and you won't really be gone. In front of the note is a four F key. Four Fs. Damn. Four. Oh, this is going to be so good for me and my mannequin. My fun fun just like Leila mannequin. The hell. Oh, good. Yeah, this is a useful fourth floor. A notice pinned to the wall is written by Ila. I'm beautiful. I'm free. I'm right behind me. I love fresh spring rain. Oh. Oh. Oh. Oh. Oh. I'm thinking of the ending of Squirrel Stapler. God is coming. God is coming. God is coming. God is coming. God is coming. Yeah. Yeah. All right. There you have it. That was the butterfly. A few bugs, but you know, I'm sure those will get fixed up. I liked it. It was very creepy. There are many parts that I was found to be unpleasant, but in the way that horror games should be. So, well done. Thank you everybody so much for watching. Check out this game in the description below. And hey, make more of these. Maybe less horrible. Not horrible is in bad game. I mean, horrible isn't that was horrible. And I think the bugs, you know, uh you get them fixed. That's fine. Some things have bugs. They get patched out. It's all good. Don't worry about it. And then, you know, patching things is like whack-a-ole. You fix one, you break another. It just happens. So, don't worry about it. Thank you. And as always, I will see you in the next video. Bye-bye.",
    "start_time": 0.0,
    "end_time": 2353.7200000000003
}