{
    "video_id": "FF5uEvoHa8s",
    "channel_url": "@markiplier",
    "transcript": "[Music] Heat. Hi, welcome to that. It does also doesn't say the name of the game. I'm in trouble because I don't remember what it was. But it's something about taking care of your friend's pet. You see that pet? Isn't it adorable? There's a correct answer to that. Put it in the comments. Now, if you don't get the correct do comment on answer down there, you're going to be banned for life. Okay, good. [ __ ] Blow everything up. Hi. Welcome. [ __ ] Blow it up. Blow it. Jesus Christ. Uh, I didn't even say to blow it up then. Huh? Why do we blow that up? That seemed perfectly valid. Hello. All right. Okay. We're just gonna start. I don't remember what the name of the game. Why? What? Yeah, I guess there are stupider ways to hold a phone. Thanks for looking after dog this weekend. There's a to-do list on the fridge. Deaf, say hi to dog first. He's been sulking lately. Lauo, I left ingredients around the kitchen when you want to make dinner. Slash. All right, cool. Nice. How do I get rid of you? How do I go away? I'm pressing buttons now. Hang up. That's what it is. That's how That's how you've got to hang up your texts. Back in my day, any of the old phones, got to hang up every time someone texts you. Whoa, you're so cute. Uh-huh. Yep. That's fine. Make dinner. Give dog a whole bath. Put dog toe bed. Sleep on couch. Am I not allowed to sleep in your bed, old buddy of mine? that I'm dogsitting for you. Is that what it is? Make dinner. Okay. From what? How? What am I making dinner for? I'm ordering. Oh, hi. Uh-huh. Uh-huh. Okay. Well, that was terrifying. This is going to go good. I got a great feeling about it. Hey, haird dryer. Hey, bath. Okay, turlet. Okay. Well, I'm not exactly sure what you want. Oh, look at that. And good memory. I'm not exactly sure what you want from me, but Okay. Ah. Oh, soup. Oh, a battery. Okay. Place collected ingredients. I'm trying. Okay. Aha. Uhhuh. Close that. Close these. Okay. There we go. Nice. So, put ingredients in pot. Al kazam. Kaboo. Kablam. Oh. Hey. Okay. Jesus Christ. No. Hi. Hello. How are you doing? You got a cold? What's What's the deal with you? Hey, listen. It's not that you're not cute, but could you get away from me a little bit? I'm working on it. Blump. And a battery. Start cooking. Huh? Kaboo. Oh, I didn't expect that to work. I thought it might blow up or something. I'm going to put this whole pot on the on the table and you just stick your face right in it. I served pot. You need anything else? I just give you a little pet there. Oh, what a cutie. Eat dinner. Oh, we eat together. Oh, it's like a date. So, when are we going to lady in the [ __ ] this? You're going to play the noodle. Am I right? Blow it up. All right. Pick up dog. Hey, dog. You're done. Come here. You Why did I pick it up like this? Why? Why would I pick it up like this? All right. You're getting a bath. Oh, god. Why did I pick it up like this? Get in there. Now that almost hurt. Now you got to learn to behave yourself. And I bet you're not going to like this. Squish. Take that and get your soaps and your conditioners right in the eyes. So, am I wounded? What's the story here? Happy. I'm going to pick you up now. And if you bite me again, I'm going to blow you up. Okay. I just want to say that straight up. Oh, haird dryer. Right. Okay. Get ready. Okay. That was fast. All right. Come here. You. Yay. All right. We're going to put you to bed. All right. I don't remember where or how, but I think I put you to bed. Put dog in bed. Put dog to bed. All right. Dog going to bed. Of course, you go to the human bed. That makes sense. I'm sure that my friend Where did I meet this friend? I'm sure that my friend enjoys sleeping next to their dog. I know some people like that, but it gets all the dirt from outside and poop in the bed, and you just don't want that. So, Tuck, you know this dog ain't so bad. This dog ain't so bad. I'm not going to lie. That dog ain't so bad. All right, let me close the doors for you. All right, my dear. All right, my darling. You have a good night. Squ a fine day's work and a beautiful sunset, too. Time for me to go to sleep. Hope I don't blow up. Yawn. Sure is middle of the night. Am I going to the bathroom? Do I have to poop? Don't mind me, pup. Okay, that was what I thought logically would happen. What? Okay. What? What? What am I doing here? What's the logic of my actions here? What What is the logic of my actions here? What am I What am I doing? All right, whatever. Fine. Oh, you having a bad dream? You okay? Yeah. Stick it right up in my How How are things? How's dog? Hi, Laauo. Is everything okay? Oh yeah, buddy. Everything is just fine. Does your dog glow red and wythe when they're sleeping? I won't respond. Goodbye. We don't need to talk. Oh, the hang up button is also the reply button. Okay. Dog just bit me earlier and is tossing all over the bed right now. What should I do? Send. Okay. Haha. Yeah, he does that sometimes. Don't worry. He's just having nightmares and need his sleep medicine. I think I have some in the kitchen. Don. Okay. Don't worry, dog. I'm going to get your sleep medicine. La. Who needs to turn on lights? Actually, I don't even think they have lights here. All right. Medicine. Medicine. Medicine. Where would medicine be? Medi medicine medicine. You have some in the kitchen, huh? Oh, happy worm. Guessing that happy worm. Sleep medicine. Don't worry, wormy. I mean, dog. Have some of this. Stuff it in your gob. Did I do it? I'm imagining that I'm doing it. Oh, there we go. I can't fall asleep either. Maybe I should take some. I know it says it's for worms. What's the worst that could happen? I turn into a worm. Yeah, right. That won't happen. Not to me. I'll just take a little or I'll sleep on it as a pillow or something. I guess that's what I'm doing. [Music] [Music] This is human. [Music] Yes. Yeah. I sorry very loud in here. You look nice. Oh, thanks. Yeah, I need your help. Okay, can you speak up a little bit, please? I hate it here. I want to escape. Okay, will you help me? I would need a few things from you. I need your phone. I need my sleep medicine. Wait, did you eat some of my sleep medicine? What? What did you do that for? I also need my shampoo and conditioner. Help me pack these items and I'll leave in the morning. Also, I'm sorry for biting you earlier. Okay, see you in the morning. [Music] Okay. Tell you what, weird dreams, huh? Weird dreams. Worms talking, wanting to escape. What a craziness. What psychotic tree. Oh. Oh, you do want to go. Oh, okay. That wasn't just a fever dream. All right. Donk. Okay, I got to collect it all. Never mind. All right. Your shampoo and conditioner. You need that. Okay, that makes sense. Okay. What else did you need? Your pillow. Did you say something about a pillow? Also, where does my friend sleep? That is strange. Food. Did you need food? I'm going to put your food in the thing. I don't need to clean that up. Why would I need to do that? Okay, I guess there's nothing else. So, hi. Need to borrow your phone, right? Yeah, why not? Thanks. You're welcome. Hey, it's been real, worm. You have a good one. You stay safe out there. Not everyone's as nice to worms as I am. I'm going back to sleep. Yeah, sure. Why not? You know what? That makes sense. Oh, sleep. Yawn. I should put those leftovers in the fridge. I think it's a little late for that. I think it's extremely late for that. I think that that would be incredibly spoiled at this point. Okay, how will I explain all this? [Music] Oh. Oh my god, you phoned home. What? I I don't know. I don't know. All right. Well, that was it. Okay. Petsitting. That's what the name of the game was. I did all that to find out what the name of the game was. I wouldn't call that the most scary game that I've ever played, but it was game. Not bad game, but not the scariest. But that's okay. That's why there's three of these, so that one of them can be super scary. Moving on. I can't hear anything. I still can't hear anything. Well, I mean, I hear a little bit. Hello. Welcome to Gutter Knight. Not Lucky Lanes. I know it says Lucky Lane in Big Bold Text, and you'd think that'd be the name of the game. That is not the name of the game. It is Gutter Knight, like Shovel Knight, but for gutters. You ever go bowling? You ever go bowling and have the worst nightmare of your entire existence? That's what I'm assuming this game is. Look at that grass. Now that's a YouTube compression destroyer if I ever saw one. Oh yeah, that's FNAF static right there. You ever wonder why when I play FNAF games and the video goes all kinds of blocking even my webcam? That's because the the static there destroys compression. And compression is what makes videos online be videos. Hi. Damn, you're ugly. God damn, you're Is this the developer? Man, that's I'm gonna feel really bad if this was a picture of like the developer put I Damn, you're ugly. I'm just gonna double down on it. >> Hi, co-orker Mike. Hey, are you the new employee for the night shift? Don't worry. >> I love your voice. Don't worry about the sign, by the way. That happens all the time. >> Well, come in. I'll show you around. Nice lack of ass, buddy. Why Why you got to walk so slow? Damn. Damn. Damn. You are misfortunately shaped. Damn you. You uh Man, I really hope this isn't the developer. I really hope I can't help it. I'm compelled. I've never done this in my life before. >> This is the bar where I'll work. Behind you are the bowling lanes. At left of you are the toilets. One of those stalls is closed due to someone clogging the toilet. You will have to do some desert around here. You can start by cleaning the bowling alley and the trash that's laying around. Editors, please overlay my voice when he's going uh unless that's bad. And then don't do that. But I have a funny feeling that it's going to work out nicely because I bet I'm matching the pitch perfectly. I got this thing called memory. And if I remember something, then I'm going to be able to recall that information later. Not many have this trick. So when I hear these notes, I bet I am spot on because of my memory. >> There's a broom. There there's a broom. I forgot entirely what I was doing before. You see, whenever I get done with a bit, it's my memory goes away. God [ __ ] I don't have any memory. There's a broom in the staff room. And keep an eye out for this one guy. >> He keeps coming in at night and tries to hide in the toilets. Okay, crazy thought. You said someone clogged the toilets. What if he is in the toilets and he's the one clogging it? Did you do that? Did Did you do that? I'm sorry. Did you do that? That's not a bowling ball. All right, man. This feels really good. Skinwalker, huh? All right. Oh, it's the turlets. Uh-huh. Uh-huh. Uh-huh. And then one more. There's no clowns in here, is there? Can't jump. Can't crouch. H. There's a plunger over here. Nope. Don't need that. Okay, buddy. Listen. When I go in there and I come back, you better not be a dismembered mess with blood stains all over the floor and walls and ceiling. Okay, I know that's a weird thing for me to say, but I've played a number of horror games in my time and uh not uncommon for you to be a mangled mess by the end of this. Okay. All right. Okay, cool. Also, not uncommon for me to be a mangled mess by the end of this. What was I supposed to do? I've entirely forgotten. That's horrifying. Is this supposed to be for a bowling at? What is this supposed to be? What are you supposed to be? God damn. At least you're not as ugly as that guy outside. Kind of giving me vibes of Baldi's Basics for some reason. Okay. So, what was I doing? Oh, broom. Broom. I got you, buddy. I got you. So, I need to clean up the trash. Is that what I need? Am I using the broom correctly? God, this guy's watching some [ __ ] that just came in as a new hire and he's using a broom to clean off the tops of the table. Yeah. You want this bar cleaned, right? Don't worry. I've broomed before. I'm doing a good job. Don't worry about me. I thought I cleaned this already. Must have been that other table. I haven't gone bowling in a good bit. I've never really been like super in love with bowling. Oh. Oh. Oh, wait. No. Bad. Bad. Good. Bad. Where are you going? What are you up to? You ugly. You ugly. Oh my god. You're ugly. Okay. You're not going to pay or nothing. Do you just have such huge muscles that you need to walk like that or are you drunk? >> I too sometimes stare longingly at the pins wondering where my life went arry. >> All right, I've practiced my bullying skills. Not everyone has an unimportant job. I was trying to relate to you, buddy. I was trying to pontificate the nature of our reality with you. I guess I don't get to do that cuz I'm just a lowly whatever I am. Okay, I think I got all the trash. Boss. Hey, boss. Anzoo. Hey, boss. I think I got it. More skin walker. Oh, no, I didn't. I love life and I love the life that I live and life that I lead. The life is great. I think I did it, boss. You happy with me? No. Cuz I've missed something somewhere. You know, maybe instead of mocking the guy for being horribly ugly and also mocking his voice, I should have paid attention to what he was saying. Oh, these How did this get here? Who ran out into the middle of the lane and pooped on the floor? Who in the hell did that? I mean, this seems like some kind of black viscous bile. I know that's common place in bowling alleys, but it's been a while since I've been to one, so I'm not 100% about this. All right. Did I do it, boss? Was that enough? >> Good job cleaning the place. >> It's looking clean like me. Agree to disagree. >> By the way, did you speak to Rick? Better not distract him. >> He has some minor anger issues. Anyway, could you try and fix a clog toilet? It's starting to smell. You got it. I kind of forgot what I was doing here. Um, well, you know what about that? I have a funny feeling something bad's going to happen. Damn, you're handsome. Look at you. Oh, well, how can you not be trusting of a smile like that? >> Ah, what a relief. Okay, that was a big one. >> Good luck flushing that one, new guy. >> You're going to need a plunger. Well, bye. Good lord. Well, I'm not going to look at that. I mean, I will have to look at that, but I'm not going to stare at it first. I'm only going to stare at it when I have to clean it. Okay, bye, I guess. Hey, what was with that guy? Did you see him running out? What was that? All right, never mind. I'll go unclog it first, I guess. How did you know that it was clogged if it Whatever. I'm not going to Well, great. Great. Great. Ah, job's done, boss. I did it. >> That guy that just ran out of the toilets. That's the guy I was talking about earlier. He keeps coming back to clog the toilets with his massive dumps. We will catch him next time. Anyway, my shift is done. I'm going home. It should be quiet, so I think you'll manage. You take out the trash bags in the staff room. All right. Okay. All right. Bye, Counter Mike. Bye, bud. Do I got to take them one at a time or can I take them all in a lump? Yes. All right. This is setting the scene. It's setting the scene. And the mundanity of it is just to get you immersed into the job of a Lucky Lanes employee. Hope I'm going the right way. I swear. H That's peculiar. Not sure about that one. Also not sure about this one. Not sure about either of these. Just not sure about the grass. But hi. >> Well, you're not the guy in the toilets. >> Hey, man. >> You have some spare change for me? >> What do you mean, no? I didn't even say that. >> People these days are so selfish. Uh, well, you know, I didn't even get a chance, so maybe you should have some faith in someone. >> Watch my back. Something bad might happen tonight. >> Start chanting some weird words I don't understand. >> Well, that's probably fine. All right. Okay. All right. Anyway, I took out the trash, so that's what I needed to do. Hope no person snuck into the bowling alley when I was away. Sure hope some bowler doesn't get exploded into a shower of blood and guts that coats the Oh, good thing I'm looking at the ground. What was that? I must be seeing things. >> Look like a man with the head of a bowling ball. Sure. It can't be. I'm probably just hungry. I should eat something. I should be next to the microwave. Yeah. You know what? You're goddamn right. You're goddamn right. That guy is mysteriously missing. Head of a bowling ball, you say? God damn it. God damn it. H maybe now there's going to be someone's guts and blood splattered all over the place. Nope. Still no. Mysteriously that bowler is missing. Not sure why that table's overturned. Is this food? That's a plate of nothing. I said so something behind me. Is there a secret door? What's going on? Why do I see a secret something over here? H. That was some good food. Uh-huh. Okay. I don't know if some developers do this intentionally or not, but some people are really good at making level designs that just make you feel like you're cornered and something's got to stand behind you and then they don't do it. And I don't know if that's intentional or not. Hi. Surely there is no way he will make this shot. It's impossible. Oh, hey. Do you work here? There was a creepy man on the road when we walked here. He just stood there and didn't say anything. Can I check it out? Listen, man. It's going to be okay. >> I'm going to lose on the first date. >> I can't let that happen. I have to make this shot to impress her. >> Can't you rig it for me or something? Uh, well, what do you mean lose? You don't really lose in bowling unless you're losing to her. And in that case, maybe make Let let her win. I don't know. How would I rig it? I don't know. Hey, lady. Look over there. I did what I could, man. I did what I could. It didn't work. I got to go check. Oh, is that a present for me? Oh, you shouldn't have. Okay. All right. You know what? Is that blood? I had a funny feeling that someone would be smitherooned all over every surface here. There's going to be a head in here. Yep. Oh my god. Is that my boss? I'd know that ugly face anywhere. Uh-oh. Uh oh. Oh. Oh. Well, that could be anything. H Well, this seems fine. Yeah, this is fine. Help me. Please get me out of here before he sees us. Leave him there. He's a goner anyway. Quick, pick me up and let's get out of here. Uh, I mean, you're totally right. He does look like a goner. I'm not going to lie, that guy. Let's get out of here. Yeah, keep shouting, lady. Keep shouting. Oh, the hell? I wasn't looking. Hi. What's all this noise? >> What's happened to her? >> Follow me. I think I know a safe spot. Turn around the corner. Come quick. Yeah. Okay. Okay. Hey, lady, could you stop looking at me like that? I mean, I know everyone just has a tendency to fall in love with me, but right now doesn't seem like it would be an appropriate time for that. So, why don't we just, you know? Okay. Not look at me like that. All right. Whatever. Okay. So, you think this is safer than like the hospital or the police station or anywhere else but here. Should I set her on the fire? What am I doing? >> Quickly climb up on the roof. >> Should be safer than the police. Okay, this actually makes sense. Just lad on the wall to climb up. Okay, with her. Damn. You think I'm strong? God damn, I'm strong. Sorry, lady. You kind of I'm sure you'll be fine. Sure that didn't hurt at all. Can you put me down? I want arrest. Lay me down on the floor. Uh yeah, this convenient carpet. I need to tell you the truth. I was never really me tonight. He controlled me. The one with the bowling ball head. Everything I said wasn't mine. Please run before he takes you two. What? What? What? Huh? What the hell? Wait a minute. What in the world? What? What do you mean? You weren't really you. What is it? Huh? What? What does that mean? Oh, [ __ ] me. I should have gone the other way. Off the roof. Should have gone off the roof. Why did I go further on the roof? Should have gone off the roof. I think I've seen that guy in Sirius Sam. Judging by the credits here where it says, \"Thanks for playing Mick.\" And the guy in the left, I'm thinking that might have actually been the developer. And I might have just been calling the developer horrifically ugly this entire time. I apologize. Moving on. It's a good game. It's a good It's a good game. I liked it. Moving on. I'm sorry. I'm mov I'm moving on now. Okay. Bye. Hello everybody. My name is Markiplier and welcome to Deck Line. It's a card game. Horrific card game of some kind. I don't know the full premise of it, but it seems like the description was uh you're playing one last round of some card game that I didn't know while war rages on around you. So yeah, it sounds interesting and horrifying and more in like a oh god war kind of way, but you know could be in an amnesia the bunker kind of way of war. [Music] foreign. [Music] [Applause] [Music] [Music] [Music] over. [Music] [Music] Well, it looks like it's going to be the oh god war kind of horrifying, huh? Oh god. First time. I don't know what you're talking about. To end your turn, use the knife on the table. For what? What am I using the knife on the table for? To minimize the tremors from the artillery. Take the pills on the table. Once the electricity is out, use the kerosene lamp on the table. Uh-huh. To deselect the card, press space. Look around. Hold right. Press T to zoom in. If you did not understand the rules, open Steam guides. Thanks. We don't have much time. Now, let's start. Yeah. Okay. Um, I didn't get any of the rules of the game, but okay. Each player gets six cards from a 36 card deck. 36 card. Each player gets six cards. Uh-huh. And then what? Can I have the pills? One suit is selected to be the strongest called Trump suit and placed below the deck. So, hearts. Players take turns attacking each other with their cards. The first player to attack is chosen randomly. The attacker starts by placing any card or multiple cards of the same rank on the table. The defender can beat a card with a higher card, the same suit or a trump card. Trump cards can only be beaten by a higher trump card. So in this case, a eight of hearts would win or queen of clubs. Blam. I thought I was going to use the the knife. The defender beats all the cards placed by the attacker rolls switch and the attacker becomes the defender. Okay. If the defender can't beat all cards, they pick up all cards and the attacker keeps attacking. Players draw cards from the deck to refill their hand to six cards after each turn. If they already have six plus, no cards are drawn. Continues until player runs out of cards. First player to get rid of all their cards wins. All right. Okay. So, I'm guessing that I want to do low or I don't know. Oh, wait. No [ __ ] I should have done I should have done diamonds now. I see. Okay. All right. Let me get the shaking down. Oh, man. Woo. Seven. All right. How you doing, handsome? Uh, you just watching you got next, I'm guessing. Uh-huh. Okay. All right, then. Ah, you know me. All done, baby. Uh-huh. Take this. Take this. Take this. Take this. Take this. Isn't that a trump card? I guess this isn't a trump card. But does it have to be a higher of the trump card? Ah, so it still has to go up. I think that's that's it. All right. So, I take these cards. All right. That's interesting. Okay. Well, I can't beat that. So, I got to take my lumps. Yeah, I know. I know. >> Okay. But I can do this. All right. Um, let's try that. I guess I could have put the Oh, I should have put the queen down. Oh well. I guess it wouldn't have mattered. I would have gotten it anyway. Wait, why do those get swept aside? I'm confused. I guess cuz he couldn't beat it. I No. Okay. >> Oh, but if it's Okay, it does work. The trump card does work in that case. Why are they getting shuffled away again? I don't know. Hold on. Nope. Un select. No. God, why did that happen? That's not what Ah, okay. I'm not used to the game yet. Hold on. It's probably my nerves. Got to take another pill. This won't work. Okay. I'm confused. Oh god. Okay. All right. Well, it's dark now, so that's good. Where's the kerosene lamp? There it is. Ah, there we are. Ain't that nice? All right. Well, this beats that. Take that. And that gets swept. Okay. Interesting. So, I'm going to play this and this and this. I thought I could do multiple of the same suit. I thought I could. What did he mean by playing multiple cards? Oh, that sucks. And that gets swept. Okay. So, I took that. Okay. Why? All right. I'm confused. Okay. So, then I could I could use the trump card. Okay. Oh, so now I'm the attacker. That's what it is. So the attacker's the only I think I understand now. So if I do this and I do this, that should be valid. Maybe the same suit has to be the same numbers. Oh, damn. Well, my attack failed. So that gets swept. Now he's attacking me. Seems close. Seems a lot and very close. I can't do it. Yeah, I know. You're very good at this game. Oh, come on. [Music] Hey, we're all okay. Oh, the light. Oh, there's still electricity. That's nice. I got nothing, man. I got nothing for that. Hey, you got a lot of those trump cards. That seems unfair. Damn. Oh, Jesus. How do you have all those? This seems unfair. I don't know what's going on here. Well, clearly I can beat that. Okay. So, now I'm attacking. So, I'm going to attack on all of the fronts. This one, that one, and that one. Oh, come on. Now, wait. What are you doing? No. Come on. That seems very close. Uh yep. Okay. Why can't I do that? Well, I lost. And wouldn't you know it, I get to die a loser. Great. Oh, yeah. That's it. Okay. Well, that was good. I like that, actually. That was It was so chaotic. I mean, I know that's the point, but it really nailed it down. I was like, I'm I was just flabbergasted. I was like, \"Oh, what the [ __ ] Oh my god. How can anybody concentrate?\" Don't worry. I got this. I got this now. I got it. No, it's not my first time. I've I've played. I I have played. I have played. >> Okay, I can definitely win this one. Wham wham. There's no way you can beat that. Beat that, [ __ ] That's what I thought. Do I get to laugh maniacally? Nah. All right, fine. >> Didn't think this one through, huh? All right, my attack failed, but they get swept away. That's fine. Nice. Okay. All right. Let's do this. Uh oo. Can I Oh, man. I don't think I can. Oh, this is going well for me. Oh, you sorry sack of poop. It's got to feel bad even though you take those cards and you can use them. So, it's kind of funny about that. Yeah, because if he has the cards, then he's going to use them. But I guess they get swept off. So, I guess that's all that really matters. All right. Okay. H There they go. Well, I can beat that. >> Okay. Weirdly, I can beat back one of those. What? Wait, wait, wait. But okay, I'm confused. Oh, in what? Oh. Oh, so I that's what it means by keep attacking. Interesting. And it has to be a different suit. Damn, he's able to beat all this [ __ ] So, if I had diamonds, I could keep going. But that kills all of those. Now, he's gotten his cards down quite a bit all of a sudden. Diamonds. Okay. But I got the trump. I can't beat that. Oh, I can beat that. Okay. So, any any value of the trump card can beat a different card. I can attack with malt. That's strange. Yeah, that's right. Take them. Yeah, you get them. Oh, I'm almost done. Hey, look at this. Well, you can beat this probably. Yeah, you got to use your trump cards. But can you trump this? Can you Can you trump this? This This All right. Whatever. Oh, if I can't beat all of them, I still get them. That's unfortunate. Okay. Yeah. Damn. Damn. Oh, you're down to now. Oh, damn it. Oh, he's going to win. This son of a [ __ ] Somehow clawed his way out. Oh, you bastard. You bastard. You bastard. Okay, come out here. [Applause]",
    "start_time": 6.67,
    "end_time": 2738.43
}