{
    "video_id": "yGnoL2FfzmE",
    "channel_url": "@markiplier",
    "transcript": "It's fine. I had the the monitor. Oh, there's one more VIP item, but I think I got I think it says it counted the monitor. The monitor was VIP >> cuz you touched it. >> Oh, no. Where is it? I got the keyboard. It counted the keyboard. Oh no. Where is it? >> Okay. It might not have counted the monitor, but it counted the keyboard in my inventory. >> Uh-huh. Yeah. Okay. >> That's cold and wet. >> Yeah. >> Holy Christ. >> That's how we do. How How bad is water energy drinks for electronics? Hang on. >> Wait a minute. >> N not bad at all. >> Flashbacks. Wait a minute. >> Do we keep the VIP stuff or do we bother? >> Yeah, keep it for now. >> All right. >> It's probably a link set. Is the same gold card? I didn't >> Stop being so liquidy. >> Bob, you all right? >> What's wrong with the gold card? >> It's fine. Can if you could still hear me. Everything's fine. >> Yeah, we're good. Yeah, man. >> Oh, that's pretty for electricity. Oh, gaming mouse and monitor. Mouse and monitor. Oh, there's liquid over there. Ah, you're all right, man. You are right. >> There's so many liquids. We got a couple smartphones. Is that anything? Uh, do they have a symbol by them? >> Yeah, maybe. I don't know. I didn't know. >> Oh, I jumped the gun. She's been jumped. >> Weed seeds. >> We can buy a weed grower, but they're very expensive. Uh yeah, we can buy something to unlock phones and then there's a couple that are part of a set apparently. >> Man, we got so many sets. We can't actually turn anything in. They're ridiculous. We're never going to make any money, >> guys. We made a lot of money. We're close to >> We're never going to make any money. My credit card stealer. Whoa. >> Wait, the 1930s newspaper, I don't think it's part of a set. It's just a VIP item. I think we can just sell that. >> Okay, we're going to have pretty sick. >> All right, I think everything's fine, guys. Don't worry about me. >> Okay. You all right, buddy? That sounded condescending. That sounded so condescending. I look all right, buddy. >> Yeah, you all right. >> Oh, I meant that sincerely. >> Uhhuh. Thanks. >> I did. >> Yep. Appreciate it. >> Even though this is serious sincerely >> my feelings. I can't believe you're being so touchy about this. >> Hey, we got a lot of money between >> all the onestar jobs, >> dude. Dude, >> Mark, >> what? >> Or Bob. >> Huh? >> I have a very expensive but fun job for one of you two. >> All right, >> guys. I got a bad feeling that liquid keeps draining out of my keyboard onto my desk. I keep thinking it's dry. >> No, that'll happen. One of you two needs to grab that item and put Tom to sleep by using it on his AC unit while he's inside. >> Ah, okay. >> Sounds like a me job. >> Yeah, Bob, that's a you smother and destroy kind of job. >> I need someone else to make Luke walk on a banana peel. >> That sounds like a Mark job. 500. >> Oh, come on, man. Why got to be the clown? >> Yep. >> And we need to >> unlock windows quietly. Yeah, I can do that. >> I was doing that. I need to buy someone a banana peel. >> A banana peel. >> That'd be Mark. >> Hey, come on, man. >> Hey, I'm the I'm the laughing gas. Come on. >> That was a [ __ ] heavy banana. That was the heaviest banana you would ever know in your goddamn life. >> Did you die to a banana? That banana was so heavy, you wouldn't believe. >> Got [ __ ] by that banana. >> Got [ __ ] up by the nan. How do I know who's who? >> Put Put it Put it down. Put it down. >> Okay. >> I got to buy a new banana. >> That's not what I thought would happen. >> A new banana. Well, man, I'm going to stand in this spot and laugh. >> Jesus Christ. >> That's not what I thought would happen at all. >> You died. You died. You [Laughter] >> Oh, there he is. Here I am. >> Hey, >> bananas are 75 bucks, by the way. >> What bananas are you buying? >> The only ones they have for sale. I know grocery store we can go to, it's like a couple bucks a pound for bananas. >> No. No. You give me 10 bucks, I'll get you a banana peel. Don't worry. All right. Who's Luke? Who do we Who's getting this? Tom is the one right next to the truck. I think he he's the one he's the dude in the house. the big house we keep robbing. Luke lives in Allen's house, which is 104 >> 104 Tom's. Got it. >> Yeah, 104 is Tom for you. >> I'm looking. >> Make sure he's inside the house. The AC thing won't work if he's outside. >> 101. Allen. He lives at Allen, right? >> Yeah, I think so. >> Okay, I'm going to unlock this. Both tenants stay home and rarely sleep. Well, that's not [ __ ] helpful. Thanks. >> Thanks, >> man. That That's some expensive useless information. Do you need any more tools? >> No. Look at my banana. >> You got that break into people's house. >> Yeah, I got I got a glass. >> You lost it all when you died like a person. >> All right. 101. 101. 101. 101. 101. 101. Hey, two. >> Time to sleep. Tom. 104. Tom's. >> Yeah. Two or >> I can go with one of you guys to help you make sure that they're like in the house or whatever. >> No, no, no. I get it's a banana. How hard could it be? So Luke, I don't even know what Luke looks like. [Music] >> Got him. >> Holy [ __ ] >> Jesus. >> Damn. >> Wait, if he's unconscious, we should rob the [ __ ] out of him. >> I need zip ties in order to rob the [ __ ] Yeah. Well, I'm Wait, do I go to sleep if I'm in the sleepy gas? >> No. No, you're good. >> Oh, are you sure? >> Yeah. >> It gets real foggy in here. >> No, no. 100% sure. Okay. Is that Luke? Is that Luke? There's a guy here. >> I got a key and a wallet. Okay. Oh, there's a basement in that house. Weird. Okay, that's that's odd. What a weird place for Dave to sit. That's unfortunate for me. >> Damn, that's a loud gate. All right. >> God, these guys have a lot of that very specific type of gin. >> God damn it. I didn't bring the lockpick set. It's in the truck. >> Oh, man. That lockpick set would really help. >> Yeah, it would. Okay. Was that sarcastic? >> No, I was trying to be helpful. >> Oh, okay then. That's Thank you. >> Yeah. Yeah. He's awake. >> [ __ ] >> Okay. One's in the bathroom. >> 15 responding. Who did that? >> That's Bob, I think. >> All right, >> it's fine. >> Whoa. Okay. All right. >> Okay. I just I got the windows. The windows quietly are done. Oh, this better be Luke. I really hope this is Luke. God help me if this isn't Luke. Oh, [ __ ] me if this isn't Luke. >> Hey, walk walk over this. >> Leave me alone. >> Run at me. Run at me. Oh, there we go. Got it. Got it. Got it. Got it. Got it. Got it. He's dead. He's down. Got him. >> All units respond. All >> units respond. >> Who's doing that? >> Uh, it's cuz I knocked that person over, but only after they saw me. They ran towards me and they slipped on the benial. >> West. >> How the [ __ ] am I supposed to get this out of here exactly? [Music] >> What the [ __ ] >> Someone sneaking up there. Stop right there. >> No. Oh no. Oh no. Oh no. A police officer. Oh no. Oh no. Oh no. I'm slowing down. >> I need this man to go away. He has a whole [ __ ] giant piano. I'm trying to steal. >> He's a what? He's a what? >> A whole piano. >> Uhhuh. >> Wait, why are the police running around the house? I >> don't worry. Don't worry about it. I like that. You're fine. You're fine, >> guys. I'm trapped in this backyard. So, good. >> Good. >> It's great. >> Am I an idiot or is this Uh-oh? There's no There's no gate here, right? I'm not 15 responding. >> Get out of my way. Get out of my way. Oh [ __ ] >> Oh [ __ ] >> EMT immediately. >> You okay, man? >> Hey, the police that were nearby ended up not being okay. >> Oh, >> on the bright side, there's now a piano in their sideyard that we could steal. >> Hey, you want to buy a medkit, Mark? >> Yeah. Do we get it here? >> Yeah. Yeah, it'll deliver here. >> Are you sure? Wow. >> Yeah. Pretty cool. >> I bought one to res Bob. >> Okay. Med kit on the way. Where where does it appear? >> Don't do it outside. It might drop on your [ __ ] head. >> Oh, all right. Where are you? >> You see that big red light next door? Dave. >> Yeah. Yeah. Yeah. Yeah. >> Yeah. You might need to find a rock and break that camera. >> I can't believe that just [ __ ] worked. >> Oh. >> I was trapped at this dude's house. He was coming home and as he came in through the front door, I climbed out the window next to the front door and it worked. He didn't see me. >> Huh. >> Oh man. Sometimes I surprise even myself how genius I am, you know. >> All right. I can't find a rock. >> Where's a rock? >> Bob, you you see any rocks around, Bob? >> You see any rocks, man? Uh, >> seem like the kind of guy that would have a rock. >> A bunch of rocks. >> I got a rock. You want me to break that camera for you, buddy? >> Yeah. Break that camera, please. >> Please. >> It turns out if you throw it from outside the fence, better aim than I did. You see that piano right there in the front yard? That's where I am. >> Yeah. Oh, >> anybody here? >> Uh, not immediately outside. I heard somebody yawn. >> Oh, doink. Yay! >> What was that? >> Got the camera. >> Oh god. >> Oh, that may have alerted them. >> Okay, you're strong, man. You're strong. You got that. >> I did what you asked. >> Stop dropping the piano. You're losing the value. >> I had to get the gaming mouse. >> Yeah, you get the gaming mouse. Stop it worrying about the gaming mouse. >> This piano is a VIP item. >> Yeah, well then protect it. >> A very important piano. >> I did by throwing it on the ground to grab my gaming mouse. >> My gaming m Someone sneaking up there. >> Someone sneaking out there. Oh my god. Basement. What the [ __ ] Basement. >> Basement is protected. Keep this in mind. 8344. 8344. Basement. Basement. 8344. >> I am in the basement. >> Mark, I don't want to cause you too many problems. >> Oh, [ __ ] 8344. You were right. >> 8344. 8344. >> Oh, 8344. 8344. >> Don't forget 8344. >> Oh, they're coming this way. Oh, they're coming this way. >> You're good. You're good. You're good. They're Oh, you're good. Yeah, you're good. >> All right. I'm so good. I got a blue vase. >> 8344. You're welcome, >> man. That that info came clutch. I just so happened to be deaf to it. All right, it's four of the AM. I feel like we're doing a great job, guys. Oddly, I think. Yes. Woman over here is looking for her pills right now. >> Yeah. I'm throwing stuff in the front yard if you guys want to snag any of it. >> Front yard, usually. >> Which front yard? This front yard. >> Oh, yeah. Okay. >> Ah, some more stuff. Well, by front yard, I mean like outside the gate, so it's easier to get. >> Oh, okay. Well, >> what was that? >> I'm here. So, >> you going to let me know when she leaves the kitchen? >> Oh, I'll let you know. Oh, she's leaving the kitchen. She's coming out to the you [ __ ] away. >> We're fine. >> 911 emergency. >> There is none. There is no emergency. Oh no. This is terrible timing for you guys. I'm sorry. I'm so sorry. I'm so sorry. I'm so sorry. I'm so sorry. Go. Go. Go. Go. Get in. Get in. Get in. Get in. Get in. Get in. Get in. We're going. No. >> Circle around. Get back in. Wait. Get in. Get in. Get in. Get in. Get in. Get in. Oh my god. >> Isn't there beating the [ __ ] out of us right now? >> What are we? >> Oh, nailed it. Nailed it. >> That went perfectly. >> Oh yeah. >> Oh my god. What? Oh [ __ ] >> A gaming monitor. Damn it. But we got so many things. >> I'm going to just sell the painting because it's not in a set, right? If it's not VIP not set, we sell it. >> If if it's no longer in a set, I did turn something that was in a set. >> Okay. So, >> Red Stroke painting's in a set. >> This piano's not in a set anymore. >> Horrible scanner is not in a set. >> Thanks, man. >> [ __ ] man. How did you get that? Oh, Jesus Christ. >> Don't worry about it. It's fine. I'm very scared of you. I don't know what you're up to. Hey, mouse though. Wonk. >> Oh, there we go. Golden card bonus. >> Uhhuh. Check it at your computer. >> Fast delivery is free and even quicker. Wasn't there? There should be a second golden card, right? >> I I just put it in. I just put it in. >> Pull the lever. Crock. >> Right lever. >> Crock to pull the lever. >> No request. That's what we want. Cameras take longer to spot you. >> Wow, >> we have a skill point. >> What do we do? Uh, >> hackermen might be good for >> We need Creek Wine. We have two of three wines. >> Oh, yeah. Somebody should read uh Basic Electronics, the hacker man. >> Uh, >> I'm going to read Interrogator to see if I can buy the uh zip ties. >> You guys can be strong. I want to be hacker man. >> You have to look at Hacker Man. Oh, >> guys, we're killing it right now. >> We're doing really good. I'm proud of us. And as soon as it gets harder, it'll be horrible. I always love us when we play games together cuz we're always like on the baby level and then we just started to get the hang of it right after people usually would and we're like, \"God, we must be we're really good. >> Holy shit.\" >> Do we want to turn this in and get a bunch of money or we want to do one more day again? >> Uh, one more day. >> I feel like we definitely want to press our luck, right? >> Yeah, sure. >> Yeah. Yeah. >> It's not like we could lose money. I'm gonna go to the far end of the the spot again because that building we haven't touched much and they had a basement in there. I want to find out what's in it. >> There was a camera down there, right? >> Maybe. Uh there was in the other place I went to that had a basement. >> Oh, okay. I don't know which one you're talking about then. I thought you >> What the hell? >> Hey, look at [ __ ] Yeah. Yeah. Look at Look at us. >> Whoa. Can we buy a weight set? >> I want to buy an armor vest. Will that stop me from getting tased? >> Uh, yeah. Actually, >> do we have any like jobs we need to be doing or are we chill right now? >> I did buy three jobs that I forgot to tell you all about. >> Oh, good. >> Or not by >> destroyer, disable cameras. They're supposed to be marked cameras. Plant a package and mark location unseen and disarm trap in the garage units. >> I wouldn't even know that. >> I do have a rock. Yes. >> The house that we've been robbing right here, Dave's has the uh c one of the cameras we need. All right. Yeah, the cameras are at Dave's. >> I have the pack. I have the package and I'm at the house. It needs to plant it. I'll try to do this one. >> Okay. I got the back gate open over here at Dave's if you want to come in this way to throw. >> I'm going to get this first camera over here. >> I missed. There's a policees. Okay. >> Oh, [ __ ] Oh, thank God for that camera thingamabob. Like I got that one. I got that one with the rock that you missed with. >> Really? Cuz I yeated my rock into the stratosphere. I >> Oh, maybe it was just another rock >> and one rock and I yeated. >> This side still needs it though. I don't have a rock still. >> Yeah. Let me see if I can find one. >> All of these windows are like super protected. >> Oh, there's rocks right here. Hold on. >> Well, [ __ ] Well, there's three more cameras still, I think. But >> at least those all of these windows are so [ __ ] locked up. I can't get into this house at all unless it's through the front door. You just said job done. Did you do the other camera? If it was only those two, then yeah, I guess we're good then. >> Okay. Planting package. Oh, no. Not yet. That's in the basement. God damn it. >> Huh? >> Oh god. I'm at Kate's and she just left. >> Okay. >> No, she did not just leave. >> Kate's basement 9968. [Music] [Music] >> 99 Mark. Oh no. Oh no. I'm going to go for it. No [ __ ] No, I'm not. >> Oh [ __ ] man. They Why do they got so many? Oh, [ __ ] Oh, this is terrible. Oh, truly. Oh, my friend. My friend. Oh, save me. >> All right. All right. I got you. >> There's two cops chasing you. Don't stop. >> Oh, I would never. >> West road. >> Nuh-uh, man. And there's a another car coming at me. Uh I'm running interference on you guys. That's that's what I'm doing. >> Okay. I stole a TV. Yay. Right. >> Yeah. Yay. >> Okay. The job for the planning the package I think failed. >> Oh, it failed. Oh, but I have the package. >> No, we need to disarm a trap at 107. The garage unit. Oh, I know what it's at. Okay, I'm going to go disarm that trap. >> Oh, yeah. That trap's easy. No, it's not easy, but it's easy to find. So, you're sure the package one is dead? >> Yeah, it said it failed. >> Well, god damn it. >> You had to do it unseen. >> Well, I could kill them. >> You know that's true. I can't argue with you there. >> I could kill them. >> What do they mean dodge? Wait, dodge? >> Yeah, when you have the crowbar, you could dodge. I have no idea what that means. >> If I sneak up on someone and whack them with a crowbar, what does that do? Uh, you have to do it multiple times and they go unconscious and they have like a zz bar and they slowly then they'll eventually wake back up. >> They're only out for like a minute. >> Well, that's annoying. Why does it take multiple hits? >> One of you might have a stethoscope, right? >> I do. Yes. Why? >> I'm trying to crack a safe, but I think that guy is standing right outside my garage door. >> Huh? >> He's in the the one of the garages here. I think I can spot him for you. >> Okay. I don't know if he'll Oh, did he hear that? He's just standing there. Okay, >> there. He's right there. >> Oh, thank you. >> He's just standing there. >> All the way back. >> What was that? Stay away. >> Oh, god damn it. Oh, man. The [ __ ] doors. >> What's your emergency? >> West Road. >> Police has been called. >> I know. I see. >> Ow. I'm Help. Help. So much help. Not why the doors always work the wrong way. >> I'll get a damn race for you. >> All right, guys. Egg on my face. I got caught. >> It happens. >> Oh, he's in the back now. Is that right? >> I don't know. >> I'm not watching anymore. >> I found advanced lockpicking. >> Oh [ __ ] Oh, hell yeah. >> I'm looking uh where you are and I can only see you. How can I go like >> Hello. >> Hello. Okay. I temporarily had to leave some tools behind. >> There's a guy coming over here way around the corner from you. >> Okay. Camera is gold. Is that the same one we already got? >> Maybe. Damn. How did you get all that stuff? >> I'm a thief. I'm a criminal. I'm a crimer. Bob, are you just stabbing toilet paper? >> No. No, I'm stealing stuff. >> How you are you guys able to like pulse and see things like Lethal Company? Because I don't know how you're spotting all this stuff. I can't see [ __ ] >> Yeah. Bob, how'd you highlight the guy? >> If you look at them, they like highlight. >> H I just did I just did some Oceans 11 [ __ ] I >> know. Yeah. What the [ __ ] >> That was crazy. That was crazy [ __ ] >> You got like five phones and What the How did you do I got an iPod, which I feel like is pretty valless. And then a smartphone. And then a uh something else. >> Huh. >> Yeah. Stuff. Where's our truck? >> You went the complete wrong way, but it's all right. >> Oh, God. It's fine. Do we have a first aid kit or did that get that got you? >> I am in a place where you couldn't want to get me. >> Oh, I could absolutely get you, Mark. Don't worry about it. Actually, I think I'm more in like the front door of a house, but don't worry about it. It's almost time anyway. >> Do you know where the guy is right now, Bob? >> What guy? >> The guy that you've been highlighting for me? >> No idea. Oh, there he is. He's in the He's outside. He's right there. He's just opened a garage. >> Okay. >> Yeah, he's he's looking at all the garages. >> Oh, is he going Oh, don't don't tell me he's not going back around. Oh, he's inside. >> He is going back around. >> Oh, he Yeah, he's inside. There's a cop by your body. >> Yeah, I know. >> It's okay. It's okay. I've got a plan. Got to really haul ass over here, but I got a plan. >> I in fact did not get a first aid kit cuz I'm stupid. >> But you got a sleep gas thing. >> Yeah, don't worry. >> You're going to put Mark to sleep? I'm >> Oh, they don't have AC. These peasants don't have AC. >> What was that? You could just you could grab my stuff and you just get out of here. Oh god. >> Get away from me. >> Get away from me. >> Yeah, don't worry about it. It's fine. >> Uh, did you at least get his stuff? >> Sure. >> It's okay. It was only a stethoscope and a glass cutter. Not valuable. >> And a laptop. >> Oh, the police are down here, too. I don't Okay, we're going to go back home. >> Coward. You coward. I sure am. >> Oh man. >> You can tell I'm using my coward voice. >> Uh-huh. Uh-huh. What time is it? I don't see the clock. >> It's 5:25. >> 5:30. There's a Hey, what's up? >> You know, if you just swoop in, grab my stuff, you probably able to outrun the cops. Yeah. Yeah. Yeah. All right, fine. Whatever. >> Yeah, Mark's Mark's stuff will make me faster. Where are you going? That's the wrong way. >> I was going to go help you. >> It's 5:40. We have time. >> No, we don't. >> Not with that attitude. Oh, wait. We could use the pay phone to take jobs while we're here. It just it just highlighted by random. >> Oh, okay. >> Well, that's fun. Look, it's fine, guys. I don't need >> I have 10 seconds to go >> to be alive. I don't need to be alive. >> It's fine. I'm guessing. >> And I've been really picking it up since I first started and died every >> Do we get to keep the stuff we have if we're not in the truck? Uh, if it's on you. I kept not the big items that take two hands to make you stand. >> I lost that monitor whenever I did that the one time, but I kept everything else. >> Okay. So, actually, it's not that bad to be out of the truck. >> As long as you're not carrying something like that TV or this painting, like the stuff that you Yeah. Everything else you keep. >> We have so many phones. >> Uh, today's turnin day, so I might be able to buy We're going to have a lot of money. I might be able to buy stuff to unlock them. >> Ooh, >> wait. This is the package to plant. Why is it up there? >> Yeah, I Well, I failed. I thought maybe we could have some good stuff. >> What? What? >> Just going to gonna sell that. >> No. Come on, man. >> Oh, man. We have 10,000 out of our $2,500 quota. >> Damn. It's pretty good. >> That's not bad. All right, time to do it then. Let's press the big red button. Oh, yeah. Oh, money confetti. >> Well, I don't want to spoil the run, but this might be a good ending point for me. >> That's fair. Yeah, >> that's fair. >> Oh, we got a lot of money. We'll figure out what we're spending it on next time then, I guess. >> Yeah. And we'll go to a new neighborhood. >> And then we'll remember to talk about our hit podcast, Distractable. >> Uh-oh. Oh, no. No. Don't shoot me. No. Don't shoot me. No. No. Wade, help me. [Applause] [Music]",
    "start_time": 0.16,
    "end_time": 1590.099
}