{
    "video_id": "wuFov2M9C0A",
    "channel_url": "@markiplier",
    "transcript": "Welcome to Quarantine Zone, also known as No, I'm not going to say that. Probably everyone said that when they play this game. It's nothing like Papers, Please. It's like that game that's like Papers, Please, but it's in 3D, and you have people driving their trucks up to say hi to you, and you inspect their vehicles for drugs and or dead bodies or bombs. I've never played that one, but I've played offshoots that are even worse than that. Let's just say any of the random simulator games that I played. But this one is about zombies, right? So, people come in and they might have a bite on them or they might just have a scab. Can't trust it. God, it's loud. >> Ah, finally awake, Commander. Thought you were dreaming of a vacation on some sunny beach. Not the best fantasy these days, huh? >> Jeez, I just woke up. What the [ __ ] >> Back to reality. We're almost there. Checkpoint Alpha. They've been holding out, but they need reinforcements. That means us. >> All right, get ready. You're dropping in 20. And commander, watch your step out there. It's not just the dead you got to worry about. This just reminds me that I have not continued my The Forest playthrough. Why is that? You know, The Forest One was such a compelling game and yet for some reason >> you are all aware of this situation. >> No, I'm not. >> The city is overrun by a zombie virus. >> Now I am. >> And while not everyone has turned into a zombie, >> we need to try to save them. >> Right. >> But at the same time, make sure the infected don't get into the zone. That's your job. Let's hurry to the checkpoint and start examining the survivors. >> Let's do that, boss. I can't wait to get my job done. I'm sure I won't have to make any horrible moral decisions that will haunt me for the rest of my dreams. I'm out of here. Solar panels, huh? Hooks, huh? Tape measure, huh? Box, huh? Bullets, huh? Oo. Can I take some of these? No. Fine. All right, let's just do the dang job. Hello. Okay, this definitely see that was a zombie check. You would have been dead. You got to stay on your toes. Do I have one of those suits? Am I protected at all? I don't have the legs. All right. Fuel stored. Food stored. Medkit stored. All right. I'm not going to do the zombie test on you cuz if I starting up in your face, you might shoot me. Oh, it was a freak. Stone cold killer. You are. Well, not killer, but stone cold pacifist you are. Well done. Keep it up. Okay. So, I'm guessing in the demo, because this is just a demo, it won't have any of these extended probably base like building mechanics or something like that. I don't know. That's pretty cool. What's over here? No. Oh, something. I did not expect this to open up. Street. Good. Very good. Interesting. It's a whole ass city over here. Nice. Cool. All right. Well, that's that was pretty bloody. I don't like the sign of that. All right. Let's do this. I'm ready. Tell me what to do. Give me my job. >> Next, and the soldiers will let the survivor in. >> All right, that's easy enough. I'm good at shouting. >> Identification verified. Quarantine status stable. No incidents reported. Good. Nice. Okay. So, I can put him in quarantine or I can watch him turn into a zombie. Do I have to be the one to take care of him? Maybe. All right. Well, let's do this. Next. >> So, the first survivor. Approach him and take a close look. >> I've had them. >> Are there any symptoms that immediately catch your eye? Of course there are. Just look at how red his head is. >> Stop talking about these right here. >> We must record this symptom on the symptom map. >> All right, you heard the man. I got to record this symptom on the symptom map. Here are all the known symptoms and the probability of infection. Mark the detected symptoms to decide where to allocate the survivor. Be careful. There are multiple symptoms. Survivors may try to hide them, but labor you will have tools to detect them more easily. Probably fine. Okay. You have a red skin. Pale skin's bad. Green skin real bad. All right. You got You definitely got the red skin. It's very inflamed up on your face. Don't worry about it. I'm just getting a really good look at you. Really red all up in here. Yep. Okay. So, I wrote it down. Is that all? Whoa. All right, drop them. Uh, identified. You must decide where to put them. All right. >> This subject only shows one symptom, but it's unclear. Send him to quarantine so we can monitor him for a while. >> Good idea. >> No. No. >> Look for symptoms, >> mark them, and classify them. And good luck. >> Thank you. Next. Don't make me wait. >> All right, let's get a good idea. >> My wife's already inside. She's waiting for me. >> Uh-huh. Uh-huh. And this wife. How many limbs does this wife have? Huh? You got two different hair colors going on. What's up with that? What's up with that? Hey, what's up with that? Very suave up top, but I'm getting a good look at you. A little splotchy there. That's a bruise and leave for your turn. Prepare your belongings for >> Yeah, you're kind of bruised, buddy. What's up with the bruises? >> What's up with the bruises? All right, we got not a red bruise. We do have bruises, though, for sure. Wait, hang on. Let me mark down cuz that's definitely what I would call bruises. Not necrosis, though. I would not say that. Uh, I don't have any way to take your temperature. [Music] All right. Zombie baggage. I don't like that. I don't like that. Having anyone coming into contact with zombie parts without a hazmat suit has an extremely high chance of infection. You haven't touched anything, have you? All right. You do have bruises, though. It's probably safe, but just in case, gotta send you. I'm >> not sick. I swear. >> I know. I know. But I'm putting you over there with the other probably not six, and I'm not going to put anyone that I >> verified. Quarantine status stable. No incidents reported. >> Uh-huh. All right. Well, I'll give it a second. Next. >> Hello. >> I was bitten by a dog. Not Not a zombie. Uh-huh. It sure don't look like a dog. Uh-huh. Boy howdy. Yep. All right, we got a bite. But hey, this said it might be a dog, so sorry. >> Is this another checkpoint? >> Uh-huh. Sure is. >> Oh, no. >> All right, that's it for today. Hit the bunks. We've got another long day tomorrow. >> Where' Where' they Where'd they go? Hey. Hey. Uhoh. Mhm. Ah, now I Okay, I get it. Okie dokie. Well, good day everybody. Thanks so much. Um, do I let the people in quarantine go or are they just going to sit there overnight? Probably overnight's good. An overnight check. Well, that was nice. Quarantine maintenance. Why do I have to pay for quarantine maintenance? Why do I have to pay? >> First, check out everyone in quarantine. >> Uh-huh. Okay. Thank you. Yes, we'll do. Identification verified. Quarantine status stable. No incidents reported. >> Okay. Re-examine the survivors. If infected, you leave them in quarantine for two days. They will turn to a zombie and kill everyone else. Cleansing everyone. Cleans. Oh, don't. I was going to say that switch really seemed like the >> He's still alive. >> Yep. >> Go over to him and call him in for a rechack. All right. >> He doesn't show that previous symptom anymore, so he can be moved to the block. >> All right, you got it. Okay, you are clear to go. >> Finally, >> tools help you spot symptoms faster. >> Grab the scanner. >> I'm just going to look at this guy. >> Go ahead, play God again. Let's see who you ruin this time. Okay. How pissed off are you? You got to sleep in a, you know, not out in the streets. I should send you to the block. >> Oh god, I made it. >> Yep. All right, I got to grab this caner. Maybe I should have done it for him. Ooh. Shines through tissue like clothes and boots. Ooh. I will not abuse this great power. This incredible power will not be abused by me. >> In the next one and the new tool on >> Hey, wait a minute. Hey, come on. Hey, come on. Oh, come on. Come on. All right, fine. UV. All right, next. >> Survivor. >> Hello. >> You don't need to check me. Just look at my eyes. I'm fine. >> I'm going to check you. I'm sure these rays won't do any permanent damage. Don't worry, they see right through your skin. All right. You got bruises on the face for sure. We got bruises. Uh, I'm going to be very polite. more bru. That's pretty bad bruising, but I think it's still bruising. Pretty sure that's still bruising. [Music] >> You are in the quarantine zone. Stay calm and wait for your turn. Prepare your >> skin cuts. A All right. Right. So, he does have skin cuts on the lower back. [Music] Okay. You got to go to quarantine, buddy. Sorry, pal. You're going to quarantine. >> No. No. You don't understand. >> I think I do. Next. >> I was bitten by by a dog. Not not a zombie. >> Uh-huh. You're just saying this straight up. Oh, you do not look good. Oh, you are not looking good. my friend. Ooh, let me Hang on. Let me look. Let's Okay, it's just yellow, which might be fine. Might also not be fine. You got the bruises. All right. And you said you were bitten by a dog, Abe. [Music] Okay. Interesting. Don't know what that is. Oh, it's gone. You just flexed it away. When you said you were bitten by a a dog, did you just say that to worry me or or what's the deal with that? Why would you just say that? Why did you say that? Seriously, why did you say that? All right, whatever. You're going into quarantine. I'll do anything. Just Just test me again. >> Uh-huh. I'm going to tomorrow. >> Move it. >> Hello. Boom. Wait a minute. >> I've bit my lip. That's all. Look. See, it's not serious. >> Yeah, I've bit my lip before, but holy [ __ ] All right, let's see. Mouth blood. It could be nothing. It really could be nothing. Plump. Okay. You got bruises for sure. Bruises. Bruises. Bruises. A lot of bruises. Oh, good. Okay. All right. Okay. I don't like the look of any of this. >> Stay calm and wait for your turn. Prepare your belongings for insp. >> You don't even know what I'm going to do. Listen, this is all for the good. >> Don't make me wait. >> Hello. >> I was bitten by a dog. Not Not a zombie. >> Uh-huh. Sure. Whoa. Whoa. Whoa. It's fine, Ellie. Don't worry about a thing. Whoa. Whoa. All right. This is uh How you feeling? How you feeling? You know what? I know just the place where you're going to feel really good. >> I trust you guys, but this feels wrong. >> Hey, I know a thing or two about things that feel wrong. And that's you. All right. Night, everybody. Killing an infected. Hey. All right. That's a lot of money. Yes. Yes. Yes. Yes. Successful block assignments. Oh, good. Well, hopefully these guys I was about to say these things >> and let through is staying in the block. >> And until the evacuation happens, you need to keep an eye on them. >> Ah, >> make sure there's enough food in space. Let's focus on the base today. >> Base management. Okay. How are you talking to me by the way? Voice in the sky. And why do you talk to everybody when you're talking to me? Okay. Places in the tent displayed red. Total number of place all tents. Less than survivors in the block. Number of places. Number of places in all tents. That's confusing. Okay. Another places in the dining hall. Okay. Generators mounted buildings. >> As you can see, there's no food or fuel for today. They need to be brought in from the warehouse. But first, you have to buy these resources. Restock the warehouse. >> Why do I have to buy everything myself? Is this actually not a voice on the radio? This is the voice in my own head and I'm the boss. I'm going to play like that. Is the thing replenish? >> Buy supplies and fuel for everyone in the block. >> In the block. It's like uh the guy I played from space. What was even his name? You know the guy? >> That's why I respect him so god damn much. >> [ __ ] was his name? They all have a stupid name I can't even remember. >> Great. Now that the warehouse is loaded with supplies fuel, >> you need to deliver them to the block. >> Head over to the warehouse. Head over to the warehouse. All right, you got it. Sure thing, buddy. Whoa. One went blue. Everybody see that? It's definitely not a sign of zombieism. >> All right, >> load the supplies and fuel onto the cart. [ __ ] God damn it. All right, auto take. What? Why would I ever take anything? Wait, hold on. Wait. Hold on. Hold on. Wait. What are we? >> Pick up the card. >> What? Pick up the cart. >> Now deliver the acceleration. >> Ow. Where am I going? To the block. Where's the block again? I don't even remember. Is it behind me? Ow. >> Supplies need to go to the dining hall and the fuel to the generator. >> Do I steal everything? Nice. I don't need to take it. Did it automatically. What are they talking about? They don't even know how to play their own game. [Music] God damn, I'm good. >> Any aggression towards personnel will not be tolerated. Offenders will be isolated. >> Where's the other guy? >> Anybody? Do we not have a med base? I'm guessing we don't have a med base. >> Excellent. Everyone's fat today. Go get some sleep. We're not checking any new survivors today. >> Uh-huh. >> There are reports of large zombie clusters in nearby areas, so we need to be ready. >> All right. Why is your voice getting like progressively deeper? Not that I mind it, but just I'm kind of curious. How do I get off this thing? All right. Auto take. Auto take. I love that. That's the most fun cart I've had in any video game. And I'm including Mario Kart 100% hands down. government support. Thanks. Thank you. High command. I like this. I like Okay. >> I'm sorry. Start drone control. >> Massive zombie attack. >> Massive. Whoa. No. [Applause] [Music] Okay. Bombs, bait, air strike. Love that. Okay. No upgrades. That's fine. Oh my god. Are you kidding me? Oh wow. All right, bait. Want bait? Do I not have bait? I don't think I have bait. Oh my god, that's a lot. Okay, okay, okay. Okay, okay. Hold on. Hold on. Wait. Stop. Everybody stop. Uh, okay. This is bad. I guess the walls are kind of there for a reason. Not that I think the big rocket launcher would or 37 mm cannon. I played a mobile game like this once. Nice. That game was cool and all, but it was like any other mobile game where it just >> according to our data >> stopped being fun and just started becoming impossible related symptoms. To check them, use this stethoscope. Pick it up from the table. >> All right, you got it. Nice. Huh? I can see that. Okay. Well, I'm going to go over here and check the Okay. >> Quarantine status unstable. Incident detected. [Music] >> Well, I'm glad I put you in quarantine. So, let me let me give you a listen. Maybe I could check one of you guys again here. Maybe it's maybe you don't know what. Wow, that is effective. That light must be unbelievable. All right, cool. Well, that was good. Um, great. Next. It must have been the person. >> My lip. That's all. Look. See? It's not serious. >> Definitely not. Let me take a look at I'll listen to you. You feeling angry at all? Cough a little harder in my face. I'm guessing this is inconclusive. I'm going to write inconclusive on your report. Don't worry. They just get this. Yep. Keep coughing. That's good. That's good. That's good. Yep. All right, you're good to go. Ah, >> am I in trouble? >> Not for much longer. I don't know. Next. >> I don't want to cause any problem. >> Shut up. Well, that does sound like just normal. It's that and a cough, which is concerning. Let me take more looks at you, buddy. All right. Scratch it. Man, you're not doing good, man. You're on thin ice. Thin ice. How bad is three yellow symptoms? You could be sick. He could just be sick. >> No. No. You don't understand. >> He could just be sick. >> Look, he maybe he could just be sick. >> What do I know? Hi. >> I feel okay. I promise. >> That is the least convincing thing I've ever heard anyone say. And I've had people say they were bit by dogs multiple times. Human mouthshaped dogs. Okay. You all right? Okay. All right. Okay. Let me give a listen to you. Breathe. Uh-huh. Not a symptom on you. Do you know what? Goddamn. All right, go on in. >> Finally, I'm safe. >> Yep, you sure are. Finally. Someone that doesn't have some horrible disease coming in here. >> Hey, please. Cough in my eyes. In my eyes. Cough in my eye. >> I promise. Are your I'm not looking at your freckles. I'm looking at your lips. Are they Are you wearing some kind of gloss? Don't purse them at me like that. Let's get a look at your scratches. Skin cuts. [Music] Uhhuh. More skin cuts, I think. Yeah, skin cuts. That's not too bad. Skin cuts is fine, but the lip thing is weird. You got freckles. You got goddamn freckles. Is there anything about the lips? Weird lips. I got weird lips. Lips on here. Weird lips. If you Hey, look. If it's just what you're wearing, that's fine. But you're not saying anything about your lips. I'm going to put you in quarantine, but don't worry. It's some guy that's probably not a zombie. They just cough a lot. Please. >> Kids in where? In there. Well, go on. Have fun. How you feeling, my guy? How you feeling, my guy? Well, at least that guy's nice and calm. You get it, man. You get it. You probably could have gone in anymore. Next. Oh, I feel like I should make a call on that guy. He seems okay. You were coughing like a lot. Let me get another look at you. Oh yeah. Oh yeah. That's a lot of coffee. >> Go ahead. Play God again. Let's see who we ruined this time. >> Oh, I didn't check the other guy's lungs. Wait. All right. Go back into quarantine. Hang on. >> No. No. You don't understand. >> Go back in here. Come out. You. I didn't check your lungs. That's right. I forgot I needed to do that. >> Please. I've lost too much already. Don't make me turn back now. >> You look clear. Aside from some scratches, but everyone's got scratches, man. Honestly, I think your lips have a healthy glow. I think you're good to go. >> Thank you. Thank you so much. >> You're welcome. You stay in there. You stay in there, buddy. You know what you did. You can't even look at me. You know what you did. All right. Time for sleepy bye. Sleepy bye-bye time. What about the base? How we doing? Good. Bad. Good. Bad. Bad. Good. Good. Bad. Clinic build. Bam. Oh [ __ ] Well, that was bad. All right. Oh [ __ ] All right. Grab the cart. Okay. We need fuel probably. Let's get two of those. One of these. Thunk. Thunk. Drive this bad boy out of here. Not going to lie. Best mechanics I've ever seen in a cart. Wow. Thonk. Watch out. Thought you were looking a little like you had the zombie lane going on there. No, not that one. All right, we're split up there. [Music] All right. So, wait, why is the energy not up? Oh. Oh. Yeah. Okay. Well, that's pretty good. I think we're doing well here. This is cool. I like the base building aspect of it cuz it it means that just the decisions you make don't just do nothing. They actually have a purpose. And the more survivors you have, probably the harder it is to keep it up. But maybe the better you are off if you do good. And maybe they help in an attack, maybe. I don't know. It's pretty cool. This is just a demo, by the way, so it's not the full game. I did pretty good. >> Today is the evacuation day and you will get a reward for the first batch of survivors. >> Survivors have developed new symptoms related to their poles and temperature. To check them, use the thermopometer. >> Pick it up from the table. >> Uhhuh. Uh, replenish. I need a lot of fuel. Uh, probably more food. Don't need more medkits, I don't think. Oh, I'm out of money. Ah, shoot. All right. Well, I'll just do the fuel for now cuz I have Let's do one more. They can go hungry for a bit. They won't rebel. Probably gun it. Not all there. What are you doing? All right. Oh, do I have to distribute every time? That's annoying. All right. So, for the med center, can I send people to the med center or what? You looking okay? Who you talking to? Concerning. Probably fine. Whatever. I'll get the cart back if I need it. I should have driven it back. God, I can't be that person where I just leave it. I got to be more attentive to the things around me. The organizational structure. Ow. That's as far as I'm going to take that. All right. Pulsometer. [Music] Thermal pulsometer. Uh-huh. >> Uhhuh. >> Survivor has some luggage. We allowed them to bring their own stuff, but now you need to carefully inspect the luggage for weapons or zombie body parts. >> Why would they have those? Why would they have those? >> Identification verified. Quarantine status stable. No incidents reported. >> Your mustache is looking kind of silly there, buddy. How's the cough? >> My kids made it through yesterday. I just need to join them. >> Uh-huh. This is not a gun. Nice. Not coughing as much today. That's nice. All right, let's get a look at you. Any new symptoms develop? Nope. Nope. Nope. Nothing crazy going on. You seem all right. It was for your own good. It was for your own good. Look, it's going to be all right. Get out of here. >> Thank you so much. >> Get out of here, you scamp. All right, next. Oh, somebody baggage. Do not confiscate. Personal items penalty will follow. If you see your weapons in the baggage, contraband must be confiscated. You'll be rewarded after the confiscation can be let go. I did. I think I heard metal detector. Illuminate. Show signs of infection. Elimination is also mandatory. Oh, they may show signs of infection. I don't know about that. All right. Yeah, you wait there. You wait there. >> You have to believe me. >> Well, that could be anything. This also could be anything. >> You're robbing me? Why >> do I confiscate? I'm not pocketing this. I swear. I swear >> you're robbing me. I'm not pocketing it. That's not That's a tool. Well, um, ma'am, uh, uh, liquidation is something where you liquidate your assets to try to, you know, yada yada. Uh, Uh-huh. Okay. Goodbye. >> I trust you guys, but next survivor. >> You shouldn't. Okay. What was that? >> I've been walking for hours. That's why I'm burning up. >> Okay. Cough and a sneeze. That's good to know. All right. You got SN hiccup, too. All right. You got the trifecta. All right. Let's get a look at you. Uh, you're supposed to take this off. You're supposed to take that off. All right. Oo, you're burning up. Uh, yep. Okay, you got the real bads. All right, elevated temp, elevated pulse. Um, I'm kind of borderline on the rest of it. Let's get a look at you. Man, you got all of the things. I think you might just be deathly ill, but that's probably fine. All right, time for the invasion of privacy. Well, not yet, I guess. Okay, you got the bad breath, sick breath. >> You are in a quarantine zone. Stay calm and wait for your turn. Prepare your belongings for inspection. Hats, glasses, and gloves. >> Really appreciate you following instructions, ma'am. >> All right. Pardon me. Good lord, lady. All right, so I think you're just sick. I legitimately think you are just sick. Can I report you to med bay? Can I Can I say go to medbay immediately? I'm going to put you in quarantine, though. You You are quite sick. >> This has to be a mistake. >> I'm not the one hiccup, coughing, sneezing, wheezing all in the same time. Come on. >> Oh boy. >> It's just allergies. I've had them since I was a kid. >> Uh-huh. Uh-huh. Go on. Yep. The sneeze. All right. You got the sneeze. Good to know. You got the mouth blood. You get the mouth sneeze. Was that a hiccup? Might have been a hiccup. Yep. Yep. Wow. I love What is that? That is some kind of skin rash, I believe. Skin rash. Concerning. Quite concerning. What is that? Bruising. Is that bruising? Is that what you would call bruising? I think bruising. Yeah. Okay. Once again, concerning. Uh, did you bring a bag? No, you didn't. Okay. You got the mouth blood hiccups. Man, why is everyone sick? And don't say zombie apocalypse. I'mma put you in quarantine. This is quite quite concerning, but Oh, yeah. Your lungs. Wait, I forgot the temperature. Whoa. Whoa. Quite concerning. Quite concerning. No, it was the temperature was elevated. Pulse was high. That was it. I It probably doesn't matter. I don't know why. Temperature elevated pulse was extreme pulse. That's what it is. >> Yep. Uh liquidation. >> Please tell me what's happening. >> Ah, you're going to a better place. >> You are in a quarantine zone. Stay calm and wait for your turn. Prepare your belongings for inspection. Remove your outer clothing, hats, glasses, and gloves. Your hat looks great. How's that for a lie? Okay, cool. You're looking good there. All right, take that off. Let's listen to your lungs. Oh, so clear. Finally, someone not coughing all over me. [Music] [Music] No, no. I thought that was that might be a bit of a bruise, but that's some nothing. Maybe a little bruising around the neck. Your lips kind of a little bruised. You look a little off in the face. You're looking a little green. I'm not going to lie. You don't have eye puss, which is cool. Did you have a bag? You had a hat. I think you're fine. Could be a trick. Nah, you you got you got to be fine. You're a-ok. Okay. I can't find one thing wrong with you. Get in there. Get in there. >> You're a hero. >> Oh, I know. And I didn't even have to lie. Maybe. Probably. Okay. Hey, let me let me look at >> verified. Quarantine status stable. No incidents reported. >> What happened to the other guy? Wait, what? Wait, there was another There was another guy in here. Wasn't there another guy? Wasn't there one more? I I sent another one. Oh, no. I was about to, but then I discovered that they were dying. Right. Hey, can I get another look at you real quick? >> Cuz it's kind of evacuation day and it's not going to be the best. Wait. Oh, >> I've been walking for hours. >> Wait, >> that's why I'm >> There's one thing I could check. >> Oh, okay. What were your symptoms? It was just literally you're just sick. I think you're just sick legitimately. But considering you're sick, you should stay in quarantine. I feel fine. >> As I said this morning, >> don't do this. >> Today's evacuation. Head to the blog to assign survivors for evacuation. >> Okay. Are we all evacuate? Whoa. I caused a kurfuffle. Oh, my negligence have done this. I'm so sorry. I I Hold on. Let me drive. I'm so I knew. Oh, man. Okie dokie. All right. I'm going to sign for evacuation. All right. Distribute the survivors from the block by trucks according to rules of sorting. Confirmation sends a survivor to the truck without possibility of return. If you finish the evacuation without distributing everyone, you have to wait for the next evacuation. Okie dokie. Some database. Sukas. All right. Yeah, you are good. So, you're going um Okay. Oh, we only have five. All right. You're going there. You just had bruises. You're fine. You're going there. I don't know if I can fit you. So, it's got to be just you. Okay. Okay, so that's all I can fit because that's a female only truck, which is a little strange, but probably fine. All right, finish. You have empty slots and penalties. I don't I can't do anything about that. I can't put them in. Oh. Ah, I see. I see. I see. Okay. It was just one had to be female. Got it. And then the other two slots were open. Got it. All right. Yep. Get out of here. Get out of here. Oo. Whoa. Nice. Upgrade. Inaccessible in the demo. Damn it. All right. Soldiers. Bait. Nice. Air strike. Nice. Bombs. Nah. Okay. Time for bed. I go sleepy. I go sleepy now. I go sleepy. [Music] Oh no. Yes, please. Yes, please. Oh god. Oh, I'm protecting the convoy. Ah. Oh my god. This is nauseating. Oh, why do I have to be at this angle? Oh my god. No, thank you. Oh my god. Okay, hold on. Bait, bait, bait. The bait is doing nothing. Why is the bait doing nothing? Bait. I don't know if it's a good idea to shoot straight into the trucks. Air strike or bomb. Air strike. No. Yeah. Oh god. Oh god. Oh. Hey. I did not think I was doing very well there, but shows you. I'm just too good a game. >> Symptoms have appeared and one of them is aggression. So, they might attack you. Grab the pistol from the table. Also, pick up the syringe analyzer. Our scientists built it and it accurately detects infection, but it's very expensive and there aren't many, so use it wisely. >> This very expensive chunk junk. Taking them all. Let's take some of these. Nice. All right, I'm out of here. I'm definitely not going to lose any of these. Oh, I Oh, okay. I got to drive not like an idiot. Fine. Okay, I lost one. [Music] Okay, driving very carefully this time. Nobody move. All right, we're good. We're good. We're good. We're great. We're great. Okay, get the fuel. Please don't explode all the other items out of the cart when you do this. Okay. Don't know why that happened that way. Why does it do I don't want all to go to one. Okay. Med kits. Oh my god. All right. Going great. Going real great. Do I need to even power on the med base thing? It's not like I not like I even know how to use it. Whatever. A damn it's loud. All right. Putting this back. I'm checking on lady's coughs a lot. See what she's about. You all right? You all right? I got a gun now. Gun >> Identific. >> Oh no. Oh no. Oh. Oh no. Oh no. >> My lip. That was all. Look. See, >> it's not serious. >> Um well ah. Yep. You know, now that I think about all of the symptoms, the coughing and the definitely I don't know if people get the flu these days. Not 100% sure. >> You guys seem nervous. Is everything okay? >> Uh-huh. So good. All right. So, are you guys going to help me if someone attacks? Because you guys have a lot of guns and I don't know why I need the pistol. You know, you'd think that there would be someone here to send it. Oh, well. >> Now, start the inspection. >> Next. >> Hi. >> I was bitten by a >> Oh my god. >> Not a zombie. >> Uh-huh. Uhhuh. Uhhuh. Uh-huh. Yeah. >> I thought I was safe. >> Yep. Next. Okay. You got something? Okay. Otherwise, you're okay. Okay. I thought you had the crazy eyes for a second there. Whoa. Nope. Can't steal that. But I can d [ __ ] Yep. >> Why would you take that? It's not dangerous. Uh well, you know, um you have uh infection items. That's not good. Oh, mama. I'm mama. I'm going to I mean I I got it right. It's clearly >> You're robbing me. >> Oh, well, it's it's infected. >> That's all I have left. >> It's infected. You're infected. You're probably infected, right? You're almost certainly infected cuz you got freaking infection tools. Wait. Yeah, I knew it. You're get get in the slammer. Get out of here. Get out of here. >> Don't make me wait. >> Oh. Oh my god. Oh my god. Wait. Wait. Wait. >> I'm helping. >> Ow. Why didn't any of you help? You all have guns. Oh boy, we got another coughatic over here. Oh well, that's not an immediate cause for concern, but okay, that's that that's a pretty bad bruise. >> Inspction. Remove your outer clothing, hats, glasses, and >> Okay. Yeah, don't look good. Not seeing anything there. Almost shot her. Sick for sure. All right, go to quarantine. >> I feel fine. Please don't do this. >> Interesting. >> You can trust me. I'm healthy. >> Uh, no weapons. >> No weapons. No weapons. >> Why you got so much sauce? Okay, that's good. Long as you're clear. Long as you're clear. Looking all right. Looking all right. Okay. Overall pretty healthy. Yeah. Get on in. You're good. >> Thank you. You're welcome. >> Thank you so much. >> Oh, that's not good. >> I bit my lip. That's all. Look. See, it's not serious. >> Uh-huh. Oh, boy. All right. It's okay. Bye. Yeah, we're good. We're good. Don't worry. Don't worry about a thing. X. Hey, hey, whoa, whoa, whoa. >> I'm I'm just tired. Not sick. >> I'll be the judge of that. You don't even look that tired. You got some bags over your eyes, but you don't look so bad. Yeah, that's all right. You're right. It's raining, my guy. Hey, get on in there. >> You are a hero. >> I know. >> I suppose If I have this, I'm going to just do this real quick. >> The subject is not infected. >> Oh. All right, then. Get in there. Get in there. >> Thank you. >> You're welcome. All right, so that's all for today. Whoa. Thought that was some some Stranger Things ass monster over there. All right, that was good. Uh, let me make sure before I do that cuz I have a lot of money. I'm actually going to make sure that I upgrade these things cuz they do not want to stick around. Food in dining room, food needed today. So, we need more food. Easy now. Easy now. Easy now. Got it. Nope. Easy now. >> Got it. Ah, crap. Okay, we're actually going to be okay today. All right. Okay. This is This is cool. I like this a lot. I think that I think the flow is just a little slow. But then again, that's how these games Oh, what the hell? That's how these games always have been. They've always been just a little bit on the slow side because I mean, that's the nature of it, right? Hello. But that's okay because it is an interesting >> It's just allergies. I've had them since I was a kid. >> Uh-huh. Yeah. Okay. Seem fine. Yeah, that's fine. There. Is that That doesn't look good. It's definitely skin rash or Oh, actually, no. It might be herpes. Uh, and that's something else. That's a skin rash. You got both of them. And then the eyes. You have red eyes. How severe is Wait, let me let me Hang on. Let me let me get a look at you. Let me just How How Okay, that's not pure red. That's conjunctivitis. It's still not great. You're not what I would call looking good. Go put you in quarantine. I'll make a decision later. >> I feel fine. Please don't do this. >> Uh, >> come on. Whoa. >> I bit my lip. That's it. Look. See? It's not serious. >> That's a hell of a bruise, man. Hell of a bruise, man. You're all banged up, man. Well, you know, I'm inclined to believe you cuz otherwise you're perfectly healthy. Not perfectly, but nominally healthy. Still going to put you in quarantine, buddy. >> Wait, why? >> I'm fine. Are you though? Everyone's biting their lips, huh? You can keep the sunglasses on. >> Hey, wait a minute. I've seen this before. Haven't you been here before? You come through here twice? Uh-huh. I think your clone's in there. Uh-huh. Uh-huh. Yep. Uh-huh. Okay, let's listen to that. Okay, we got a cough. [Music] >> Move it. >> Please, just tell me what's happening. >> Stay calm and >> Oh my god. Are you sure you're not a zombie? Are you sure? Are you sure you're not a zombie? Are you sure? Are you You sure? You sure? You sure you're not a zombie? You sure? You sure? Elevated. Not extreme. Are you sure? Are you sure? I I you know, I've never seen someone straight out of a black and white movie. Someone who lost all saturation possible. Even your hair is desaturated. Look, man. I'm not trying to make fun of you or anything, but also you have the hiccups and your eyes are all kinds of conjunctivitist. I'm going to put you in quarantine. >> You can't do this. >> Please. >> Let me get a All right. They already went through quarantine once. >> Hey. Whoa. Whoa. I should have known. Oh my god. They almost got me. He got He got concrete fists. Okay. Yeah. Thanks, guys. Thanks. Thanks. I was just going to put him in quarantine, man. You guys going to just leave him here? All right. Oh. Oh, you went through Oh. Oh, Homer Simpson. All right, I'm going to put you just go that way. >> Scaring me. >> Where am I going? >> I don't know. Oh, boy. You guys are going to shoot him or something. Thanks, guys. Thanks, guys. Thanks. >> Oh, wow. Didn't know we had someone so cool over here. Uhoh. >> You don't need to check me. Just look in my eyes. I'm fine. Yep. >> So, where am I going now? >> Oh, you'll see. Look in my eye. All right. How we feeling? >> Quarantine status stable. No incidents reported. >> What the [ __ ] Wait, but was were these footsteps always like this? Was it Was it always like this? Hey, um, did the footsteps mean something? Footsteps mean something? I'm going to just take a peek at you. I have this. >> It's just allergies. >> I've had this subject is not infected. >> Oh, there we have it. Get on in there. >> You're a hero. >> All right, let's take another look at you. You definitely can't be >> [ __ ] I'm cleaner than half of the people you >> subject is not infected. >> You're right. Get in there. >> Finally, I'm safe. >> All right, cool. All right, so I think probably the demo is just going to cycle through this for from here on out. So, I'm going to end this here because I've been recording a while and it's very fun, but I got to end it at some point before the infected get me. So, thank you everybody so much for watching. This has been good. I think this is going to be really fun when it fully releases. I think there's a lot of potential to expand it. Um, I think it's a good framework to have more game come through here. Uh, because the inspection thing is is cool and all. I I think that you know what? I I I I don't even know enough to be able to say anything critical about it. I think it's good. I think it's a great framework. I think there's a lot of polish here. I think there's a lot of cool stuff. If you like these type of games, you'll like this type of game. And when it comes out fully, I hope it has a lot more to build on it. It's really fun. Thank you everybody so much for watching. Let me know what you thought down in the comments below. And as always, I will see you in the next video. Bye-bye.",
    "start_time": 0.16,
    "end_time": 3542.119
}