{
    "video_id": "Ym-86dezSNU",
    "channel_url": "@markiplier",
    "transcript": "I was muted the entire time. No. Hello everybody. My name is Markiplier and welcome to Blood Money. This game is going to make you feel bad. How do I know? It's because I read the description of the games that I buy. Actually, I couldn't tell you what the description of it is. I think it's supposed to be so I thought he said my heart stinks. Anyway, um yeah, that seems like a normal medical bill in America. How are you going to come up with such a large amount in such a short time? Oh, you know, in an attempt to clear your head, you decide to take a drive, but your eyes catch a peculiar sight along the way. It's a quaint stall set up on the side of the road run by a friendly looking man. Intrigued, you pull over and head to the stall. Also, this is not full screen because it's not ambiganated. It's not stretchinated. It's not huge. Well, it is for you guys. The editors would have fixed that. And if they didn't, they wouldn't have been doing their job right. Because if they waited until I said that to actually make it stretch, then that's a complete that's a complete disregard for the experience of the viewer and they they made a horrible error in doing that and they would be ashamed of themselves. And I would fire them on the spot if I ever found out that it happened. They'd be gone. I don't care who they are, how many years they've been working with us. I I don't care. They'd be gone. Out of here, dunzo. So, it's good thing I have confidence in the people editing this video, and I know that they wouldn't betray me like that. Or you, more importantly, me. Second importantly, you Hey there, my name is Harvey Harington and welcome to my booth. Each time you click me, I'll give you a dollar. Sounds like a sweet deal, doesn't it? >> Is this some kind of sex thing? >> Here's a little tip before we start. I always say clicks are like tiny magic spells. The more you believe in them, the more they'll do for you. >> Just keep clicking and see what happens. >> I don't like your eyes. I don't like your eyes at all. All right, I'm going to click you right in the eyeball. Boink. Donk. Wow, I seem to remember a Warf Stash game kind of like this that Liixian made. Now that's an editor. Now that's an editor. [Music] What a guy. Would never betray me. >> You've got the power in your fingertips. >> I know. Can you let me do my thing? I played clickolding for fun. There is some kind of optical illusion going on. The background's real [ __ ] >> You're on a roll. >> You don't need to talk to me about this. >> Oh, hey, look. You see the shop button up there? When it starts glowing yellow, that means there's a cool new item to buy. Go check it out, buddy. >> Thanks, buddy. Every click is a step closer to greatness. Every click is a time for you to shut the [ __ ] up. >> Every click is a step closer to greatness. >> Every click can go to hell. >> Come on, you can do it. >> I don't need encouragement. What do you What do you think I'm doing, by the way? What is it? Do you know my plight? Do you know why I'm doing this? >> Keep going. You're I'm on a roll. Yeah. All right. Whatever. I'm going to the shop. Oh, this is a sex thing. This is a sex thing. Gucci. Oh, Gucci. Gucci. Go. It's giving me two per click in case you were too thick to notice that. >> Stop that. No, just kidding. Keep going. >> I don't like this. I don't like this at all. So, the unfortunate thing is now I bought that at an odd number and it will forever be an odd number. It doesn't bother me that much, but I know it will bother you guys. Uh, so Liixian, please make it an even number. I don't care how many times you have to do it for how many iterations of clicks there are. You make that number even and you make it satisfying for the people at home. In fact, I'm willing to bet that you supersede it. I'm Lucy. I'm sorry. I I don't mean to be like this. I know you try really hard at your job, and I know that I've fired all the other editors because they didn't make the video game window bigger because they'd rather go for the meme than actually make the viewing experience delightful, but I don't mean to come down harsh on you, but you better make that number even. Okay. All right. All right. Thank you. What's this? I can't buy it. Yes, I can. A needle right in the eye. >> Oh, hey, you got a needle. >> Uhhuh. Let's uh let's see how this goes. >> Yeah. Well, you sold it to me. >> It's okay. Okay. Uh it's not exactly tickling anymore, but you're still going strong. >> Yes, I am. >> Ouch. Okay. Okay. >> Okay. You don't need to talk. >> Wow. You're uh really pushing through my pain. >> Yeah. What about your pain barrier? I didn't quite catch that. I was too busy making money. >> I admire your dedication. Sure. Let's Let's go. >> Uh, let's go with that. Yeah. You know what else? I'm going to go with a lot of money. You know, I don't even know if I should feel bad about >> I just just remember I'm in here, too. But but keep clicking. You're doing great. I >> Oh, no. >> Look, you set up this shop at the side of the road. You did this whatever weird magic. I know that there was like some kind of short film or something where there was a guy that some kid stuffed in a suitcase and every time he was hurt vomited gold coins or something like that and it was supposed to be some life lesson about it. Don't do that. Don't do that. If you ever meet a guy that coughs up coins whenever you hurt them, don't do that. And yet here I am. But I can do this because I'm a YouTuber and we are above the law. Ow. This isn't really fun anymore. But hey, you're over a,000 bucks now. That's something to be proud of. >> That is something a little to be proud of. Yeah, of course. >> I'm just saying maybe we should take a break and try something else. Like, I don't know, a pillow fight or something less pointy. >> No. Look, I'm dying from an incurable disease. You got a few needle pokes. You got a few well hundred holes in you and I've only got a few. >> I I guess you're the player so you call the shots. Keep going if you think you can handle it. >> If you think I can handle it, watch this. One in each teeth stabbing your teeth. It's just like a toothpick except instead of between it's going in the teeth. Don't imagine that too hard. What is this stupid thing over here? What do you got here on your lapel? What does that What is that supposed to be even be? Is that like a name tag? Doesn't seems dumb >> in a way. This is a This is sort of like acupunchure. Really, really painful. Acupunchure. >> Uh-huh. One in each finger. In the fingernails, one in the knuckles. How about your cufflings? Neck tie. Needle tie. Stupid hair. Eyeball. Right in the eyeball. [Music] All right. So, if I get the hammer, this is going to get probably quite violent. And that's when the feeling bad starts to I'm going to do it. >> Oh yeah, you you bought a hammer. What are you going to do with that? >> I think you know exactly what I'm going to do with this. If you need to ask me what I'm going to do with a hammer at this point, you already have too much brain damage that this hammer isn't going to make much of a difference. So why don't we just >> I know we might have fun with the needle, but let's not go crazy here. Okay. >> This isn't crazy at all. This is the most sane thing I've ever done. >> I mean, you wouldn't, right? >> You would be stunned at the things that I would do. >> Oh, God. That That's not what I meant. >> You're not actually going to keep using that, are you? Tell me you're not going to use that. >> Well, I mean, you sold it to me, so I don't understand what you're trying to get out of here. You're the magical pixie or something or other that spits out money every time. You're paying me. By the way, it's not like the money just falls out of the sky. You give me money. It's your stall. >> You're just testing it out. That's all. Right. >> Stop. This isn't funny anymore. >> Well, I think you could take a few hammer hits, right? Who can't take a few hammer hits? >> That's enough. You're scaring me. Okay. >> All right. Now I was I was trying to scare you a long time ago. >> Please. I'm making you stop. This isn't a game anymore. >> All right. Well, now. Yeah. Okay. Maybe this is where you think I'd feel bad. >> Okay. See, now it's just hitting your soft meat. And it barely hurts at all. See it? It's not even pain. It's so far beyond pain that it doesn't >> each one feels so real. What's happening to me? >> Why wouldn't it feel real? What are you trying to say? >> God, can we can we please go back to the feather? Heck, even the needle. >> God can't save you now. [Music] Well, would you look at that? I have a new item for sale. You know, I don't know exactly how this counts as a click, but what was that? What did she just purchase scissors? Oh, no. No, no, no, no, no, no. Please, please tell me you're not going to use those on me. That's a big no no, buddy. >> Uh, you know, there's a lot of things that are big no nos in life. But we're not alive, are we? We're in a simulation. We're on in a computer. You're not real. I'm not real. Hey, I'm probably on that operating table right now coming up with some crazy fever dream about how you are some kind of imitation of me and you are going to stand there and accuse me of stabbing somebody. You're goddamn right. >> Well, I stabbed you in the bow tie. >> What the hell? My eye. Oh god, my eye. >> All right. Okay. All right. You don't need to brag about it. You're a monster. What the hell is wrong with you? >> I don't know. >> How could you? How could you be so cool? You You've just figured me. >> Yes. >> I trusted you. I know this is just a game to you, but this isn't a game to me. This is my life. You know, for every second that you keep watching this, you're complicit in this. We're together on this. We are of the same mind. And every time that you you enable me to do this, you're basically do you clicked on the video, which means that you were the first click of any of this. I wasn't the first to click. It was you. >> You me. It's me. I'll take credit for this. I mean, the blame. >> You're really going to keep doing this, aren't you? >> Yes. See, it's only the first few that are bad, and then the rest of them are barely anything at all. >> Look, this this isn't harmless clicking anymore. You're seriously hurting me. >> Uh, well, I mean, yes, I recognize that. >> God damn it. You think I'm just some type for you to play with? Well, I don't want to lie to you. I have I have a life outside this booth. >> You can leave the booth at any time, friend. Okay, we're at a crossroads here because from here on out it's going to get worse. It's going to get darker. He's going to beg more and he's going to lash out probably. But this is where we need to stay strong. This is all just a bit and we're committed to the bit. We're going to go down this path because this is just the way it goes. It's what I wanted to do with Undertale all those years ago, but everyone like, \"No, you got to do the pacifist referee. You can't start with the kill everybody, you dumb dummy. You're playing it wrong.\" That's what I'm here for. We're going to play this wrong or correct. Either way is actually valid, but you got to have the stomach for it because I don't exactly Oh, is this a match? Match? What? You going to set me on fire? That's it. I've had enough. >> Uh, >> look, I'm sorry if I've been a bit overdramatic, but this is where I draw the line. No more. You win. Okay, you're the best clicker ever. No, please. I'm begging you. Just stop before things get really bad. See, this is where we could all step back. We could turn away. You could click away from the video, but I'm going to watch I'm going to watch that line and I I'm betting there's going to be a spike in retention right here because if you do walk away, you're going to come back whether it's in a day or in a week. You're going to see this video being suggested to you and you're going to be like, \"Oh man, could it have been that bad? Could Mark have gone off the deep end that hard? Why did he have to slip over to the dark side? Maybe he didn't. Maybe I'll And then you'll be back.\" And here's that view spike. And here we go. >> Well, this Oh. Oh. Whoa. >> Oh god, it burns. Ah, my clothes. They're on fire. >> No, they're not. >> Help me. Get it off. Get it off me. >> I don't even see any fire. >> Just what have I done to you? >> I don't see any fire. What happened to your eye? >> Please, no more. I'll give you anything. Just don't do this. >> Why can't you give me $25,000? >> I've got friends, family, a pet gerble. to all the people who care about me beyond this. >> Did you say something about a gerbble? Wait, what was that other party about a gerbble? I can't abide by anyone that has a gerbble. >> I could give you a bonus. Yeah. Yeah. If you stop now, I'll double your money. >> That won't help me get to where I need to be. >> All the money in the booth. Just have mercy. >> How much money is in the booth? I'm I'm waiting. Ha. Wait, did I not switch to the feather? Is it not the Seems like it might might be the match still. I don't think I can give you mercy. Not that I wanted to. Anyway, I was just trying to see if you would actually give me the money, but you didn't actually give me anything. >> No, don't you want this money? What do you want from me? Tell me and I'll do it. >> Well, you're not giving me the money, so I can't exactly do anything else. >> Please, just stop. I have a wife, a son. They need me. >> Why won't you stop? Stop it. For the love of everything, holy, >> you're still giving me money, but you're not giving me all the money in the booth. I don't even know how much money is in this booth. How much money is in this booth? >> I'm sorry. Okay. Whatever I did, I'm sorry. >> My life is worth more than this game. Please have mercy on me. [Music] Well, you know, there is another item above this, but I have a feeling that this is going to get me to 25,000. And then what happens after that is who knows? >> A nice. God damn it. You're going to kill me over this, aren't you? >> No. >> Oh my god. Oh my god. Oh my god. I don't deserve any of this. Look at me. I'm begging you. Don't do this. >> I'm too far gone now. Once you start down the path, it's an endless spiral downwards. Just like your hair endlessly spiraling downwards. >> [ __ ] You sadistic bastard. >> Yes, I think you're right. Have your sick [ __ ] way with me. I don't care anymore. No more. I can't I can't take it. Just kill me already. I can't. [ __ ] >> You You can stop at any time. Also, you you can stop at any time. [ __ ] Good stop. >> You know, I think I figured exactly why you're doing this. >> I Well, the medical bills. >> You realize that the more pain you inflict on me, the more runny you get. >> Yeah. I didn't you know that. Did what? >> Serves me right for trying to do some good in the world, huh? I guess I'm just a generous benefactor who gets torn apart by his own hustle. >> You were hustling me. >> Good deed. He really does go unpunished. >> Uh-huh. Yes. >> But let me tell you something, you twisted son of a [ __ ] >> Yes. Okay. >> You were never saving up for that operation of yours. You've been saving up for a ticket to hell. >> Okay. Interesting. Go on. >> You feel good about yourself now? Does this blood money warm your cold black heart? Not yet. It doesn't. >> Look at what you've become. A monster. And for what? >> Money. You think my life is worthless just because I'm blind. Pastel colors drawn on your screen. But you're wrong. >> Uh-huh. >> You're the one who's nothing. You're the one who's wasted. You're just a sad, lonely soul taking out your anger on someone who can't fight back. >> Well, I have a funny feeling you might be able to fight back at some point. >> They should be too scared to do this for real. Wouldn't you? There's someone who could fight back. >> Okay. Well, okay. Let's just let's be clear about some things. I have a knife. And you're some magical being who can survive uh thousands of stabs. >> Too much of a [ __ ] to go out there and torture someone for real. >> That is a strange statement. You're so weird. Let me stab the weird out of you. >> I thought so. >> Yeah. Yeah. Because you know if you did, you'd have a hell to pay when you come face to face with whatever saw fit to let you exist in this world. >> How dare you talk about my own mother that way. >> You're so comfortable sitting on that chair. >> I'm fool. >> I was never sitting. Look how tall I got after I stood straight up right out of my chair. I'm barely in camera anymore. You aren't going to face any repercussions. >> Nope. Not at all. >> You're just pathetic. Just Just keep clicking. >> Yeah, well, I'm standing I'm standing as tall as I could stand. >> You You wouldn't dare to retaliate against a guy stabbing you at this height, would you? Standing at his full complete. I'm sliding. How am I sliding downwards when I'm standing at full height? How wouldn't you like to know that? Psych. Ah. Well, well, this ain't this ain't this a predicament? Stab. >> You think you're really in control? >> Yes. >> You think you can just keep poking and proddding me like that and I'm just going to take it? >> Yes, I did. All evidence pointed towards that. You've gone too far, buddy. It's my turn now. >> Okay. Do I give you money? >> Let's see how much you like it when the tables are turned. >> Is money coming? >> Look like your [ __ ] life depends on him, [ __ ] Take this and that. It's that one gift of from Wolfenstein of both stabbing at the same What? Do you got a knife? What do you got? Scissors. Oh, you're tickling me with a f. Uh-huh. >> Yeah, me. >> You're just copying me. I was yelling like that before. >> I hate you. You sit [ __ ] >> I'll make you. >> I can't do anything, can I? >> I'm just the lines to you, aren't I? >> Okay. A sad little cartoon you can torture to feel better about your own [ __ ] life. >> I can talk as much [ __ ] as I want. But >> but you're the one here. >> I'm just just a joke to you. >> Nothing more. >> Nothing more. Nothing more. Let me cut down your stump. You know, I probably should feel bad about Do I get a gun next? What do I get? Gun. >> Okay. >> You wouldn't. >> Well, >> please tell me you're not going to >> I don't really know how to go away from this. So, thanks. >> What? Okay. Just don't don't shoot me. >> Wait, I just clicked it. >> Fine. Fine. Click here. Take it. Take it all. Oh, please just just go away and leave me alone. >> Well, I mean that is what I wanted. So, how do I go away and leave you alone? H how do I go away? Well, see, this would be needlessly cruel. I have the money. My objective is complete. Look, I may be an evil bastard, but I have I'm out of time. Time is the most valuable thing we have, sir. Time is every is money. You know, time is money. Look, can you give me a button to like, you know, leave? Okay, it's your fault for not giving me an option. Just like it's your fault for not leaving the video in the first place. So, let's all do this together. Now we're all going to we're all going to move our mouses over here. Over there [Music] [Applause] other eye. >> Haven't you had enough? >> Okay. Well, >> haven't you put me through something something putting you out of your misery? Just the gunshot went down and would harvest, [Laughter] right? Yep. Turns out you never really needed that operation after all. It would have been nice to have it. Yes. But it wasn't life-saving or anything. No, rather you were only seeking the allure of easy wealth. You climb into your minivan with racks of your unjust fortune and prepared to drive off into the sunset. Best get far away before the cops notice. Bad ending. Bad ending. Okay. In the game called Blood Money, that's the bad ending. Okay. All right. Hey, you knew what we were getting into. You knew what we're going to get into. You knew what we were going to get into. Now we're going to get into something else cuz I'm going to fix this. Fastest mouse clicker. Here we go. Boom. This is not a virus for sure. It can't possibly blazing clean. It's fine. Oh yeah, that's what I'm talking about. Yep. This is a bad idea. There's definitely a virus. Oh, hell yeah. It works perfectly. All right, here we go. Watch this, buddy. >> Your condition is quite serious. I fear the >> You've got huge penis disease. I'm so sorry, sir. Oh, the burden. We don't have shears big enough to trim that monster back. Watch this. >> Hey there, my name. >> Bam. Oh [ __ ] What the [ __ ] Oh, is F5 already like Oh, F5 is like a re God damn it. F4. Okay, we got this. >> Oh, now it's full. Oh, now it's full sc Why wasn't it full bar? Oh, yeah. This is it. Okay, it's gonna work this time. Get ready, everybody. All right, here we go. Okay, that's It seems to be speed limiting me. >> Come on, you can do it. >> I feel like this should be more. This said it was the fastest mouse clicker. Okay, see it? It ain't It ain't doing it. It ain't doing it. It's speed limited. Maybe it's uh if I do too many it doesn't like it. Let me try 25 a second. That actually does seem to be kind of faster. >> Come on. You could >> Sometimes if you do it too fast, it literally can't keep up. Okay, so 25 was good. 30. What about 30 is good? I can deal with 30. Oh, I could get the Wait, I forgot I could get the uh the feather. >> Every click is a >> This is going to take a while, isn't it? This is going to take a while. Oh my god. Why can't I just stab this guy? >> Stop that. Nah, just kidding. >> I can't dance. And I definitely can't dance to this. Editors, take my arm. You got that. Take this arm, too. Here. Here they are, bent. Here's a foot. All right. Now, I'm going to stand here. You make me dance. Okay. All right. I'm just going to be a head. No, I'm going to be a torso. All right. All right. This is good. All right. This will be great. [ __ ] stupidest thing I've ever [ __ ] done. They're never going to see this in the middle of this long ass recording. This random moment where I'm like, \"Do all this really complicated [ __ ] Do it.\" Yeah. Oh, my legs are really going. Whoa. Whoa. Oh, holy [ __ ] That move was tough. Oh my goodness. I'm not even halfway there. Forgot [Laughter] I was supposed to dance to music. All right, we got to dance to a beat now. All right, enough of that. Blow them up. Blow my nose. Good lord. It's going to take like another 10 minutes. I guess I could go get a snack. Stop that. No, just kidding. Stop that. No, just kidding. >> Not there yet, huh? All right. >> Stop that. No, just kidding. And I was here the whole time and no one can prove otherwise. Oh man, I am so much slower than I was before at the beginning of this endeavor. But oh, my finger's tired. Woo man. Oh, but I'm so close. I can't give up now. I got to persevere. Oh, but I don't know. My muscles are so tired. Oh, my clicking finger is Oh, but I got to push. Keep going, Mark. Keep going. I've never done that where I like talk to myself like that, you know? Go, Mark. Go. This feels weird, but I'm doing it right now because I just got to finish this strong. I better actually end this. Oh my goodness. Look at me go. I'm the best it ever was. She looks like you managed to get the money you needed for your operation. >> I did it. I'm the greatest. >> Another satisfied customer. Of course. >> A customer? >> What? Harvey waves goodbye from the stall as you get into your car and drive off. Who knew clicking on a good Samaritan for an afternoon would get you this much money? This is it. the moment you've been striving for this whole time. It's time to get that operation and be done with this chapter of your life. And all the while, you can't help but be proud of what you achieved without getting any blood on your hands. Good ending. [Music] All right. Well, that was that was worth it. [Music] You know, I was expecting some kind of like true ending. Maybe probably not the true ending. Honestly, if he just didn't do it without the feather, it probably would be the true ending, but God knows I'm not going to do that. So, anyway, wow, that was incredible. When all those explosions happened and then the globe just blasted out of it and we were sucked into the money dimension and then the clicks were revealed for what they were really doing and it wasn't a crazy sexual thing, but it was even weirder. Man, that was nuts. I hope I didn't have to cut that out with YouTube's in video editor because it got demonetized for some reason. Oh well, I'm glad that didn't happen. Definitely. So, thank you everybody so much for watching. Has it been Blood Money? Maybe there's a true ending. I don't know. But do you feel bad or do you feel great? Let me know in the comments below. Thank you everybody so much for watching. Thank you developer for making this game. Play it in the link in the description below if there is a true ending and let me know what it was. And thank you again. And as always, I will see you in the next video. Bye-bye. >> What the hell is wrong with you?",
    "start_time": 3.12,
    "end_time": 2016.24
}