{
    "video_id": "gnMYf0cxcjA",
    "channel_url": "@markiplier",
    "transcript": "Oh, >> so now that one copy of Interrogator, we could all read. >> Are you a rapid reader? >> My comprehension plummeted. >> I don't have no skill points. >> Yeah, I don't have skill. >> No, I don't either, but I had enough of a reader. >> All right. But the stethoscope helps a lot. I If you see a safe, let me add it. I'm your guy. >> All right. >> But your lockpick set Mark is under here if you want it. >> Oh, a lockpick set. Wow. >> Yeah. >> Damn. I'll have the whole thing. >> Okay. I guess I need to find the addresses I need to go to. >> Yeah, there's information on the computer. You can buy some hints and stuff for just a few dollars. >> 102 104 105. How do you know what address you're at? >> I don't know. Why did security level increase? >> Uh policemen just patrolling here. >> Oh, well, they're >> I'm walking around looking like a bandit with a crowbar. >> Well, don't do that. >> They're just a little perturbed at our presence, huh? >> This guy's just standing here. Why is he just standing here in the backyard? I hate this guy. >> Apparently destroying gnomes is not Oh [ __ ] Hey, >> there we go. Oh no, there's like blinds down on this. >> Oh, the cops. >> What do you mean the cops? >> [ __ ] [ __ ] [ __ ] [ __ ] [Music] Oh, this guy is so fast. He's such a fast policeman. 2529 [Music] 529. >> Oh, that's bad for me. This is so bad for me. >> I'm not stopping. Get stopped. Won't stop. >> Guys, I found weed seeds. >> Hey, I got stopped. >> Oh, hey, you found the alarm again, Mark. >> Yep, I sure did. I thought I was going to avoid it. I threw a rock at a gnome. Joe Jesus. >> Okay, this is ridiculous. Oh, yeah. Yeah. Run. So, um, if you're feeling bold, Bob, and you want to finish the job I was working on, my body >> is a skull crossbow. It's on a sidewalk. Really easy to get to. >> Okay. And all you got to do is pick up my crowbar, go into this one guy's yard, and smash one more gnome, and then the gnomes are done. >> The gnome that's in front of this big camera. Is that the gnome? >> No. No, it's a different house. >> Oh my god. >> Mark, like when you get close, you'll see like a green icon on the ones things. >> Oh, yeah. Yeah. Yeah. Oh, of course. >> Oh, Mark, what are we doing? >> I'm running away. >> Yeah. See, Bob, you don't want to be over there anyway. You want to be over here. Yeah. >> Yeah, that seems like a good area. >> Other than that guy. That guy's in a bad mood. So she Why? >> What? Why are they running at you? >> Oh, sir. >> Someone dead. >> Me? Yeah. >> Why'd you get dead? >> Um, police with gun. >> Shouldn't let that happen. So, I think it's like the next house down on the right is the one you Oh, what's what's scary? Oh, where you go to this house? This also a house. Is this the house? This the gnome. >> There's a gnome right here that's marked. >> Okay. My >> I'm just trying to find a >> Yeah, I'm just trying to find kind of a way over to your crowbar area. >> Yeah, it's right through that gate. Turns out there was a guy sitting on that couch just watching me smash his gnome, I think. Oh [ __ ] Pretty pretty rude of him, honestly. Oh, they might be coming back inside their house. No. Stop. Oh, yeah. She's back. Oh, she's not going this way, though. I think she's going inside. >> She wouldn't look over here, would she? >> Oh, she turned around. She's coming back out. >> Oh no. >> Oh, she's looking over here. Hey, she's coming this way. >> She wouldn't look over here, would she? >> Oh, she's coming this way still. I don't know what she's doing. She's lost her behind. The gnome [ __ ] block you. Okay, she didn't see you. You're still in the clear. I don't know what she's doing. What's happening? I don't know. I don't hate this. >> She's just standing over in the sideyard. It seemed like it. But the gate, if the gate's unlocked, you can just grab my stuff off the front. >> I got a safe open. >> It literally only had $100 in it. That was stupid. >> 100 bucks. >> Hey, what's up, dead man? >> Hey, just grab my uh my lock pick and the crowbar and then you can go smash that gnome. >> Yeah, this will probably be >> Oh, that's the guy that lives there. That's the guy that called the police on me. He's a man. >> Get that body. Get out of my way. >> He's a man. Look out, Bob. He's a man. Uh-oh. He is a man. You're right. >> That's literally not what I should have done. >> That's quite literally not what I should have done. But good thing I'm Oh, [ __ ] >> I hear footsteps. Are you? >> Yeah, I do too. Interesting. >> Oh, don't Hold on. There's a policeman right outside that door. >> Um Oh my god. Why is there Why did he do that? >> The gates open. Run for your life. I got I locked him in. >> He immediately opened. >> No. >> What's wrong, boys? What's wrong? >> He's just got a bat. He's just got a bat. You could outrun You need my help, boys? >> I don't know. Do you have anything to kill a cop? >> No. God, you're on your own, buddy. What are you talking about? >> I was thinking maybe you'd hit the >> running. You are out running him. Just keep doing what you're doing. >> Wait, where'd he go? >> Uhhuh. >> Is he gone? I think he's gone. >> He's still back there. Did he go in the gate? >> Uh, where did he go? >> Uh, >> it's fine. It's fine. >> Uh, it's probably Yeah. Yeah. I think he he despawned. Wait, where are you? >> Dead. Uh Bob already looted my corpse. >> Okay. Do we need to get anything else from this building? >> We need to smash a mirror and a uh lamp somewhere >> from this big building. >> No, I mean there's stuff in there to loop. We don't have to take anything. >> Is there any info anywhere? >> Yeah, you can buy some. >> Mark found it somewhere. >> You can buy some. under locations. Is that where you went? >> Yeah, I think so. >> Oh, Mark, he's coming in here. >> No, he's not. No, he won't. He wouldn't ever into this shed. What are you talking about? Why would he go in here? >> Out right behind him. >> You know I do it. You know I do it like that. >> Oh my god, you're crazy. >> You know I do it. You know I do that. >> How did you do that? You know I do that [ __ ] >> But how did you do that [ __ ] >> Oh, you know I do that [ __ ] >> And I I know you do do it. I call you, but I don't know how you do that. >> You know I do that [ __ ] >> But how you do do it? >> Oh, man. I couldn't. It's instinct. I couldn't tell you how I do that. All right. Uh, there's something in this building that needs to be done. >> Wait. Graffiti. Oh, >> these are all These all done been broke into already. All right. >> Easy. Easy, easy break. >> Easy. Okay, bonus objective done. >> Oh, nice. Did you find the lamp, too, or just the mirror? I don't know. >> It was the mirror. I don't know if it was in the same house. Was it? >> No, I I I don't know. It's marked with a green icon if it's nearby. Oh, >> okay. I don't think I have time for that. We got to go. Bob. >> Oh, don't we? >> Are you in the truck? >> Um >> Oh, that's a cop. Yeah, there's a cop. I thought you were in the truck already. >> No, there was a cop. I'm going around. >> Don't worry, Mark. All you have to do is crouch and stay behind them. They have no idea. >> I'm full sprint, guys. I'm really um really putting the team down today. >> All right, Bob. Hit it. It's going to time perfectly. Hit it. Hit it. >> Hitting it. Hit it. >> We're returning. I've It's It's been ho. >> Yep. It I'm in, baby. >> Wow. We got a lot. >> Next round. I'm going to really even cut that a little bit closer. >> Yeah. Yeah. Yeah. >> That was good stuff, guys. >> Yes, it was. We did that. >> I swear I got this code for this electronic safe and I punched it in. It didn't work. But whatever. >> Hey, wait. I left your stuff. Oh, I have your crowbar still actually, but I left your lockpick in here. >> Thank you. I don't know if I'm the man for the crowbars. I'm kind of learning that crowbars and I don't get along. >> I put the weed seeds in the cellulaner. Wade, what combo is uh a toolbox and a car wheel? Oh, car battery. That might be part of it. Is that part of it? >> Uh car battery and car toolbox are one. >> One kit. I have those. What do I >> claim them? >> I can't claim them. Where are they at? >> I have both of them. >> They're in the warehouse. >> Do I put them in the box? >> I think you need to set them down somewhere. I'll put them in the box. No, no, no, not in the box. Just set them down somewhere. >> Okay, hold on. There and there. Okay, they're both down. Okay. All right. Uh Bob, you claiming them because I can't do it while you're on the PC. >> Uh how do I claim? >> Click on item request. The the purple link thing. >> I'm looking at them. >> Go to vehicle parts and there should be a claim. >> Yeah, there is no It says we have both, but there's no claim. >> I might have to do it cuz I'm the host. >> Okay. >> Never mind then. >> All right. All right. >> No, wait. I don't see car battery. >> What? It's right there. >> Oh, car battery. Double time, baby. Maybe you pick it up. Yeah, pick it up. Put it down. I'll >> try. >> Maybe you were like dead when we got that or something. >> Now I can claim it. Yeah, I guess I had to touch it. >> All right. >> Um, we also need the classicalico rusty carwheel and the turbo tread car. >> I have the car wheel. Classico. Yeah, we just need the other one. >> Guys, I have a diamond golden card. What's that for? >> What? >> Here, I'll put it in here on the shelf. >> Oh, you got a gold card? I think we just sell these and um it gives us like a a boon. >> She's got a gold scar. >> Whoa. Wow. >> There we go. Store prices decreased by 25%. >> Wa. >> Now we can afford stuff better. That's that's that's good. >> Okay. All right. Well, what do we buy? >> So, today we have to turn in the one thing. >> Should I push the button? >> Yeah, we got to push the button. >> Pushing the button. Only host can finally deliver. All right, fine. What the [ __ ] man? Thought I was going to have some fun, but whatever. >> Wow. >> Hey, I got achievement. Deliver at least three times the required quote. I can talk. Killing it. >> Oh, wait. So, do I have my own money? >> No, we share money. >> Why? Why do we Sorry, man. This is ridiculous. I thought my cut was 25%. What the [ __ ] Uh, I had another skill point, so I was able to read one of the books. I read strong. I didn't I can't read Interrogator yet. >> You can't? >> Well, I I don't only have one skill point. >> I'm going to read Interrogator. >> I'm going to read Interrogator. >> I don't know what that does. Tell me what that does. >> I don't know what it does. >> I don't know, man. Tell me what it does. >> I don't know what it does. Where are the other drugs going? Where are other drugs? Oh, what do we need? I've got a,000 bucks. We need anything. >> You've got a,000 bucks. We have a,000 bucks, comrade. >> Yes, we do. I can buy a skill leaflet. We can gamble. See if we get a better skill. >> Oh, >> where is the voucher machine? >> And what is that >> voucher machine? >> Voucher machine. >> That's apparently how we get skills. >> Yeah, right. >> There's a bunch of stuff that's locked that I can't buy. For 1,500, I can buy a reusable first aid kit. Whoa. Ah, we don't do funny. Oh, whoa. Wowee. My legs. Yeah. Right. >> You didn't hear? It was extremely loud for me. My ankles shattering into my my esophagus. >> You didn't I just turned around to you standing perfectly still behind me just like, \"Oh, whoa. My leg.\" Oh, look, man. And it was a very painful experience just because you watch here. You can hear this. >> Oh yeah. Ouch. That does sound painful. You're right. >> Did you? Okay. Good. Good. Good. You heard that. What'd you get? What' you get? What' you get? Oh, what is that? >> Hey, basic electronics. >> Oh, hacker man. Oh, yeah. >> Can anyone read it right now? I don't have skill points. >> I don't have skill. >> I don't have any skill points. I don't have any skill points. I don't even know where the skill points are located. Do we have like a >> money well spent? Do you have a character sheet or something? >> No. >> No. >> Oh, on the computer, if you look on the left monitor, you can look at your skills. >> Oh, I'm looking. Zero skill points. Doesn't show me what I've spent it on. >> Player level two. >> Uh, learn skills. So, you learn skills. >> Says I'm level three in the bottom right. That's fine. >> Yeah, I think at level one. >> Interrogate tied up people. Find out coach for safes and keypads. Give me some rope. tied up people. I don't want to buy that. >> Mark, on the computer there are zip ties, but they're locked for me. Since you have the skill, you might be able to buy them. >> Me? >> No, it's locked. Damn it. >> Me? God damn it. >> Zip ties. >> No, me. I'm not zip tie. You You No zip tie either. >> I still have a lock pick. Do you guys need any other >> No things? >> No. >> I'm good with lockpick. And >> I want to steal. >> I'm going to buy another glass cutter. I feel like having two glass cutters could be good. >> Yeah, right. You're jealous of mine. Got it. [Laughter] >> Sorry. Here you go. Here you go, buddy. Here you go. There you go, buddy. Thanks for your used one. >> Whatever, man. I'll >> look. If it If yours runs out, I'll give you this one. How about that? Yeah. All right. >> Oh, we need to find where the VIP item is. So, we need to steal a VIP item. Steal five things without being seen. >> No, it's impossible. Wait, hold on. >> Where can we get five things without being seen? >> Possible. >> Oh, man. Are we in the same place? Oh, good. Okay, we're so good at this. >> It's $1,500 to unlock the next location. >> Oh, man. Why? All right, Bob, you got that space? >> I'm going to check out this house again. Yeah. >> Okay. Wait, you got the garages? >> Yeah. >> Okay, I'm going to go for this house. Huh? It's going to go well this time. >> I'm going to go to the smaller house. >> We still need to smash a lamp somewhere. >> Okay, I'll look in the iners. I'll see if I can find some things. >> The one with the >> with the trap on the ground. >> I just I just missed my rock throw. >> I disarmed the trap in that one window mark. When you go in there, if you just back up right away, you don't trip the alarm. M. She's pooping. She's pooping. My chance. Oops. Poop's great. Poop's great. Poop's great. Oh, I don't have the stethoscope. Oh my god. I'm the best. I was in out. Not a peep. I think I see the thing. We need to smash the lamp. The lamp. Does it have like a green box situation? >> Yeah, but I got to drop off, >> man. I really There's no rocks anywhere up in this [ __ ] What the hell, man? >> Rockmok, do you need glass cut? >> No, I just need to destroy one camera. Then I can like do stuff. >> Oh, I didn't even think you could do that. That's great. Okay, I see the house to smash. >> Whoa. >> That sounded sarcastic. I meant that. >> Whoa. Whoa. All right. Okay. Enough of that. >> I'm still happy about it. Even if you guys don't both sound like that. >> All right. So, the thing to smash is in here. I don't understand why we have the We got the glass cutter and then we still have to open the window. I'm the best. I was heard. Nuh-uh. Oh, I found a safe. Oh [ __ ] Oh god. [Music] I stole a whole ass painting. Hell yeah, man. >> Painting's big. You have to stand up and run with paintings. >> Painting big. >> Painting big. >> Big painting. Big painting. >> Man, I am not doing anything productive, but boy am I sneaking around dangerously. >> We did the We did the steal items without being seen one. >> Oh, >> hell yeah. >> Holy [ __ ] >> Okay, which house do we think has the VIP item? Huh? >> Go with Dave. There's a back gate. Back windows open. The house. >> I'm here at Dave. I don't think there's a VIP item here at Dave's house. 103 Dave's house. >> Yeah, it says there's zero of three there. Maybe there's three items there. >> Wait, I found a brand new camera. Is that good? >> That is so good, man. >> Yeah, there's three VIP loot items at Dave's. >> Huh? >> Huh? Which one's Dave's? I think the right next to the truck. >> It's the one closest to the truck. >> Do you have your glass knife? Any of you glass knife boys? >> Yeah, I'm I'm next to you. >> Really help if we could glass knife our way into anywhere that's not the bathroom that they're sleeping next to. Like this one maybe. There you go. >> I'm going to check out the garages cuz I know there's some good stuff in there. >> They're awake, Bob. One's on one's in the bathroom. >> Are you helping me or what? >> Both leaving. They're both >> What are we doing here? They're both I was moving around to the other side to get a better look. They both left the bedroom. >> Jesus Christ. What What are they doing? What we got? >> I I don't have eyes on them. They left this room. >> She's right there. He's standing in the kitchen staring at the window. >> This garage guy is being annoying. >> Kill him. >> Can I deal with him? >> Some door was unlocked. I just grabbed the door key. >> Yeah, she's coming out to the bedroom. She's coming. She's going to the bathroom. She's going to the bathroom. >> Oh god. Let me out. That's not how this works. Wait, >> she went to sleep while I was bleeding her window. >> Oh, good. I wonder if I take that painting from behind her while she's sleeping. Do you think that's a terrible idea? >> Almost definitely. >> I mean, no. >> Oh, is [ __ ] we did before already stolen? Do we have to get new things? >> Credit card stealer, guys. I got something called a credit card stealer. >> Well, that's nice. >> Oh, the guy's coming home. The guy's coming home. Front door right now. Front door. Bob, I got the painting from behind her while she slept. He's taking a He's moving. Jesus Christ. >> You guys okay? You're doing all right, good. >> I still haven't found any VIP items, though. >> I think this credit card stealer might be something. Okay. Yeah, >> there's a safe in their bedroom. >> A safe in their bedroom, you say? >> They're both asleep in there, though. >> I mean, bottle of want. We're [ __ ] We're cleaning this house out, dude. >> You got to go busy. >> All right, let me get the uh let me get that safe. >> They're sleeping in there. >> Well, they're both asleep like 3 ft away from the safe right now. >> Yeah. Well, I'm going to get it. >> All right, good. >> Where is this? >> Should we just wait out here for the police to show up? All right, I got >> maybe go wait in a truck might be a good idea. >> I'm going to unlock the front door and the front gate so that way if you have to run at least there's ways out. >> I want to just look. I'm just going to watch. >> That was the fastest safe opening I've ever done. I got it open. >> Did you do it? >> I got it. VIP item. >> She's in the kitchen. What? Why is she in the kitchen? >> She was Yeah, they were not in the bedroom. I should have said that out loud. >> Oh my god. >> Yeah, you should have. It's not in the bedroom at all. Dude, I got that safe so goddamn fast. >> This stethoscope is awesome. >> Wait, get back to the truck. >> Oh, this is a definitely a VIP item. This is awesome. >> What' you get? >> It's got a gaming PC. >> Newspaper. 1930s newspaper. >> Oh, wa. $770. Yeah. What were you guys doing? Huh? >> She has a gaming PC. >> Tough. It's fine. >> Wait. Time. >> Oh, it's VIP. Okay, it's VIP. It's 5. It's VIP. All right. Throw it out the window to me. >> Yeah. >> Oh, never mind. Okay. Yeah. >> Throw it out the window to him and then I'll yell and wake him up. >> Uh, you better hurry, man. Whoa. Is this a blium blare? >> Time time. Run. >> Time time time. I'm in. >> Uh, wait. >> Tell me when to click the button. >> You got to click it 10 seconds before we go, I think. >> Just go. >> Now, now. >> Clicking it. It's clicked. We're clicked. >> Get in here, buddy. Oh no. Wait. It's not going to make it. >> Wait, you're nowhere near. >> It's fine. He's not going to make it. >> He's not going to make it, man. >> Holy moly. It's fine. It's fine. [Applause] [Music]",
    "start_time": 0.16,
    "end_time": 1374.269
}