{
    "video_id": "PV1koLoj-jY",
    "channel_url": "@markiplier",
    "transcript": "Hello everybody. My name is Markiplier and welcome to Who's at the Door. I saw people playing this game on Tik Tok of all places. And I have a feeling it's going to be jump scare of the game, but I'm not saying that's a bad thing. Jump scares are fine. Soul Korea. I am a psychiatric patient. Fuzzy hallucinations and voices are a part of my everyday life. But lately, these hallucinations are lasting longer. Now they won't go away unless I take some medication. The boundary between reality and illusion is blurred even more, and I feel increasingly trapped between them. Every day, people with strange faces bring me medicine. I don't even have the strength to tell if they're real or hallucinations anymore. It's strangely collecting doll pieces is the only thing that calms my mind. I don't know why. It just feels like the only hope I have left. If this is really a treatment, how much longer must I endure this pain? >> Uh, probably eternity, buddy. Phone. >> Your symptoms are gradually improving. >> All right. >> After just eight more days of treatment, you should be able to return to your normal life. >> However, if you also see strange figures inside your house, this could be a sign that your hallucinations are worsening. H >> in such cases, immediately take your prescribed medication or try to calm yourself quietly in your room. Hang in there just a little longer and you'll make a full recovery. >> Wow, just like that, huh? It's quiet now. No shadows, no voices. Should be safe to open a door in a time like this. I suffer from hallucinations every day. Usually, I'm fine, but I need to watch out for these types of hallucinations. Those that don't disappear, those that chase me. Warning. If they touch me, I'll faint. If it's gone, I can relax. Uhhuh. Space crouch. Oh. Huh. Hello. Who's there? Hi. Who's knocking? I thought somebody was knocking. Is nobody knocking? Oh god. Oh, why is it so dark? I ain't afraid of the dark. I'm not. Oh, God. I'm going to take my pills. Can't I take it yet? All right. Well, you're probably fine. Hi. Howdy. How you doing? What can I do for you? Oh, thanks. Oh, thank you. Oh, well then is that great. Well, that was easy. I thought this was going to be hard. Okay, the doll. Fine. I'm looking for it. I'm looking for it. Please just get out of my head. Okay. Do I need to find a doll? Hi. I'll be right with you. I think I'll be right with you. Huh? Okay. I'll be right with you. I'll be so with you. I will be so with you. Hi. Hey. What's up, man? How you doing? Thank you. All right. Didn't find a doll, but I don't think that's important. I'm blasting through this game. I must be good or something. I must be really good. All right. Cool. It's kind of quiet. Maybe a little too quiet. Am I doing something wrong? Got a bad vibe about that one. You've been playing horror games as long as I have. I You got a bad vibe. You listen to that bad vibe. But I'm also very brave. I'll kill him. >> Breaking news. Multiple severely mutilated bodies have been discovered at a villa up in the mountains in Gangi Province. All victims were found with violent external wounds. Police are conducting search operations considering the possibility that additional missing persons may still be alive. In particular, given the discovery of various medical instruments at the villa, investigators are focusing on the possibility that the suspect may be a practicing physician. As soon as more information becomes available, we will keep reporting on this case. >> The victims were severely mutilated. Who could have done such a thing and why? Oh god. Okay. Okay. If the hallucinations return to normal, it's safe to open the door. If the hallucinations don't go away, take the meds instead. All right. La. Everything seems okay. Everything seems fine. Why is that got to be motion controlled? Hi. Well, you actually look you look less horrifying than the other ones. So, I'm going to open this door. Hi. How you doing? You good? Thanks. Thank you. Thank you. Have a good day. I bet they're just going to get more normal every day. I'm healing. I'm healing. Well, that was the three visitors. So, what was that? Why is it slappy? Why am I barefoot and slappy? See, I I know this game is doing something right because I really don't want to go out of this room. I really don't want to go into that living room. I don't want to answer the door. I don't want anything to I I I don't want anything to do with this. I don't want anything I don't want any part of this experience. I just want to crawl in a hole and I want to just die. Oh, well that's fun. Okay. Oh, no. No, no, no, no, no, no. Oh, [ __ ] Jesus. Why can't I Why can't I Why can't I go out the door? No. Hi. I'm going to faint. What the [ __ ] Okay, this Okay, wait. Hold on a second. I I I don't I I'm I'm I'm What? I What in the [ __ ] What? Okay. Uh, excuse me. I got to go take my meds, I think. I don't I don't know. Sorry about Sorry everybody about that. Um, day five. Oh, yeah. It's day five. Uh, so I look, I don't I'm not I'm not There was There was absolutely nothing weird going on. There was nothing weird going on. Oh god. What's on the floor? Why do I feel like those paintings are going to change? What is that? Uhhuh. Sunshine Clinic. Huh? Name seems familiar. Could it be someone I know or just a figure of my imagination? I don't know. I don't know. Am I supposed to be looking for doll parts? because I I am not finding any. I'm finding nothing. Whole lot of nothing. I don't even know where they would be. Come on. Okay. Who's there? What is that about? Was my pogo stick broken? What is that? Hi. Hello. How are you? That's weird. I don't like that. I don't like that. Uh yeah. Okay. Yeah, it's fine. It's fine. That's fine. Oh, okay. That was Yeah, that's that. Okay. Yeah. What did I see above me? Whoa. Was Oh, man. You're kidding me. I got to go back to the beginning. Oh, man. And I guess my treatment needed to start over cuz my No, I'm not going to What was that? Oh, a doll piece. I'm not going to look up. Uhhuh. Uh, reality and hallucinations are blurring together again. I can't tell if the doll really spoke or if I just imagined it. Well, you know, dolls don't really talk unless they got batteries and a speaker. So, I guess it's going to be a doll of each one of those. I'm guessing what it is is if they are behaving in any way abnormally, I don't open the door. That's just the long and the short of it. If they behave weird, I don't answer the door. Oh, you look good. Hi. I'm Well, all right then. I guess I should have waited a little longer. I thought it was the same. I thought it was just I guess I'm unhealthy in the head. Hey, wait a minute. What's that about? I was dreamed about becoming famous, but now Oh, that's what they said. Okay. Okie dokie. Don't look away. I'll take this with me. So, I All right. Mhm. Hey, doll piece. That's nice. I met Bori at the bar across from my place. She sang there. Her beautiful face and sweet voice captivated me. I had to get close to her. Uh, something about that tone unsettlingly insistent. Kind of go. Oh my god. Oh my god. Oh my god. Take my medicine. Holy [ __ ] [ __ ] If you didn't see it, you don't need to go back. Don't go back. And you didn't see. You don't need to see what I saw. Okay. All right. Okay. All right. Huh? What was that? What was that? Someone running by me again. Who there? Who there? Who is there? H. Okay. Yeah. I don't like that. Don't like that. If he's looking in, I'm not about that. Not about that. So, it's kind of is a spot the difference game. You just got to be real smart about it. Am I smart? Yeah, I'm smart. That's different. I'm hallucinating. Oh, doll pieces. One day, she confided to me about a man who followed her every night. Might be a stalker. Come stay at my place for a while closer to the bar. You know, she first looked at me hesitantly, but then agreed. Anyway, I am hallucinating, so I'm not going to Yeah. What's up? Yeah, I'm hallucinating. Look at that beautiful puppy. Look at that adorable puppy. It's kind of like exit 8 or exit 8 or exit 8. Well, that's the whole doll, so that's nice, I guess. So, I am looking for differences. Why is the fruit rotting up there? Am I hallucinating? Am I hallucinating? I might be hallucinating. I don't think that fruit was rotting up there. H. Oh god. Oh my god. Okay. You don't need to at all. I don't like I don't I don't like that. I don't like that. I don't like that. Day five. I'm almost healthy. I'm healthier than I've ever been. I feel so good. Don't get too close. Close to what? Close to what? [ __ ] Christ. Oh my god. Oh my [ __ ] god. Holy [ __ ] Oh my god. I'm It might not be a hallucination. Yeah. You know what? I'm all right. I'm going to just go. I'm going to go. I'm going to go. I'm going to go. I'm going to [ __ ] go. I'm going. I'm gone. All right. Well, that's good. Great. Okay. If the hallucinations disappear or return to normal, it's safe to open the door. They don't go away. So, if they don't go away is the thing. Ah, I probably shouldn't open this door. But I did anyway. Oh, that's not going away. Yeah, that is not going away. But who is there? I just want to see. Okay, goodbye. Okay, goodbye. Yay, Glug. Day seven. I'm so healthy. I'm almost vibrant. I'm almost vibrating. I have a feeling it's going to pull a trick on me because I got other dolls that I have not collected yet. I probably shouldn't open that. I'm going to open it. I know what you're saying. >> No, no, don't don't do it. No, don't. But I'm brave. I'm very brave. What were you all worried about? It's just my jar of organs. I'm not hallucinating. I always have a jar of organs inside my fridge. Why did the knocking stop? Okay, I'm hallucinate. Yum, yum, yum, yum. Am I supposed to take three? I've never taken pills where I open the bottle and I've never done that. Not once in my life. All right, day eight. Am I healthy on day eight or I have to get through day eight? I must be healthy, right? I'm healthy. I feel healthy. I feel great. I feel really good. Even though every single day this week has not been a safe day to open the door. And they're probably really concerned for my health. Uh-huh. I'm not seeing no hallucinations. I'm not seeing any hallucinations. Hallucinations. Ooh. Ooh. What? What? Oh. Oh. Ah. That's horrible. Um, okay. Well, I shouldn't get too close to that. Probably. I'm going to Can I flush that? I'm going to flush that. All right. You know what? Think I might be hallucinating. It's really bright here. I'm hallucinating. Well, wouldn't you know it, spank my rump. I'm healthy. It's oddly quiet. None of the usual noise or hallucinations I normally hear. Weird, huh? Oh, wow. What is this? Sunlight. Whoa. Bizarre. Look at that's different. Wait, why is that all different? I don't like this. Well, I don't like that. I'm hallucinating. Give me my medicine. I'm hallucinating. I'm hallucinating. I'm hallucinating. Oh god. No. I don't like I'm brave. I'll [ __ ] you up. I'm gonna [ __ ] you up. I'm I'm gonna [ __ ] you up. I'm I'm going to Oh, I'm going to [ __ ] you. I'm going to beat your ass. I'm going to beat you. Oh. Who just wonked me? Okay. Okay. >> You went outside. That's impossible. Are your symptoms getting worse? You're still taking your medication, right? Please wait just a little longer. I'll come see you soon. Interesting. Uh, how soon? How soon? And why was it impossible? I vividly remember being hit with a blunt object. But could even this be a hallucination? Might be. Might be. Might be. All right. Well, it's kind of light outside. That's That's nice. Unless it's not nice, in which case is Oh, wait. But I already have a doll head. Oh, wait. I shouldn't have shouldn't have done that. Why does she keep lingering in my mind? What happened to Bori? Um, yep. Is that a hallucination? Does that count? It went away. No idea. [ __ ] you. Okay. All right. You know what? I'm hallucinating. I'm going to take I'm going to take my medicine. Screw the doctor visiting me. I don't need no doctor. What? Oh, it went back to normal. [Music] It went back. Yes. Can I help you? What do you need? What can I do for you? Yes. This way? That way? Ah, yes. Ah, I see. Of course. Of course. Of course. That way. And then there. Over there. Oh, thank you. Thank you, little one. I will be on my way. I praise thee. I have no money to tip you, so don't even ask. Oh, knock knock. >> Where am I? >> Excuse me, doctor. Someone please. >> Ah, you're awake. >> What is it? sooner than expected. >> Why am I tied up? >> Untiny right now. >> I can't do that. You're about to become something more special. Of course, you're already beautiful enough. Yet beneath the surface, I believe a truly perfect form lies hidden. You'll become so beautiful even your reflection won't recognize you. >> Don't sh Don't move. >> You'll mess up that full all this skin. If you keep moving, you might not turn out as pretty. Well, how pretty are we talking here? Oh boy. Oh my god. Okay, you know what? I was I need my medicine. Need my medicine. Don't take my pills. Oh, wait. Which way? What? What's happening? Well, that was a good sleep. Some trees aren't hidden. They're just waiting. Uh, the paint she Okay. Yeah. Still fresh in my memory. Cuz that was real. Cuz that was definitely real. >> Next is a follow-up report on the previous incident. We continue to receive testimonies from victims who underwent illegal medical procedures at an unknown location. >> The police promised to focus all efforts on making a swift arrest based on the victim's statements, warning that the suspect may still be holding test subjects captive and continuing his illegal activities. As soon as more information becomes available, we will keep reporting on this case. >> I'm a test. I'm a test. Could I be held captive like these people in the news? Oh, that's not a delusion. >> Not at all. It's must be the truth. My god, I'm realizing the truth now. Ah, I see the truth. It's opening before me, blooming like a flower in my mind. I don't see any hallucinations. might be normal. All right. Hey, what's up, pal? Hi. You got pills for me? Yeah, cuz it's not a hallucin. Thank you. Thank you very much. Ah, good days. Good days. Good days. Good days. Good days. We're having great days. Feel like I'm getting healthier. Oh, I didn't know I could turn that on. It's good to know that I can turn that on. H. Okay. Yeah, I know. Hold on. Hold on. Checking everything. Yeah, weirdly enough. Yeah. Yeah, seems fine. Okay, that's not right. Oh god. Oh god. Oh god. Oh god. Oh god. Ah. Ah. Ooh. Didn't like that. Didn't like that. Didn't like that. I didn't like that at all. All right. Okay. [Music] Uh. H. Interesting. Oh god. Don't do that. Jesus, don't do that. All right, I'm taking my pills. [ __ ] that. Yum, man. I got to get out of here so that doctor can't dissect me. Mhm. Huh. No. Uh uh. Uh-huh. Looks just like the person that brought me the medicine. Just like him. Everything seems okay. Okay. No, it doesn't. That's a minor one. That is Does that even count? Yes, it does, apparently. All right. So, I've got a doll head now. That's good to know. Can this phone ring? Was there always a phone there? Nope. Don't. No. No. No. What in the [ __ ] What in the What in the hell? The [ __ ] I didn't even know that was an option. Oh, hi. Didn't like that. I caught the man who was following Borie. He quickly tried to leave, saying, \"I'm sorry. I must have mistaken you for someone else.\" His name is Taku. He said his young daughter was kidnapped and went missing long ago. He must have mistaken Borie for his daughter. H. What just broke? Something. Some glass shattered. Mirror in the bathroom, I'm guessing. Broke. Mirror in the bathroom. No. Something went crack. I don't know what though. I trust you. I trust you. I Oh, come on. [Applause] But what was even wrong? What was even wrong? What was even wrong? What was even wrong? I don't know what was wrong. I heard a crack, but there must have been something broken that I didn't see. Maybe the Was that clock always there? Is that clock always here? >> Oh, interesting. I don't Oh, what the the phone? I was just wondering about that. >> Are you the teacher from the orphanage where Borie stayed? >> Huh? >> She's very sick right now. Your number was the only one written in her notebook. >> Why does my voice sound like the doctors? >> Borie has been asking for you a lot. She must have relied on you quite a bit, if you don't mind. Weird. Is this trash bag always here? Well, you know, everything is back to normal except there's a notebook there. Oh, no, wait. No, it's not because that clock is doing the thing. If I did that, it would die. That's what I thought. Don't look away. I'll try not to. Oh, [ __ ] I'm not looking away. What's up with you? Huh? What's up with you? Huh? Yeah. Oh, [ __ ] There we go. Easy peasy. Guess that clock was always there. Fish were always like that. Oh, legs. How about a hair transplant? Your daughter would like it, too. I said to the man who was left only with guilt for not being able to save his daughter drunk every day. Taku hung his head in drunkenness, his hair swaying in the wind as if accepting my words. I couldn't stop myself from laughing. I don't know why I care so much about the story. Takuborei and this house. Everything seems connected. Yeah, this house. Whose house is this? Is this your house? Are you even in a house? How do you even know this is a house? Whose house? Wow. Everything seems normal. Mhm. Normally does seem normal. I trust you. Oh, what did went wrong this time? I don't even know what was wrong. I'm missing some things. Well, I got all that now. Good. What? What? What was that? What was that? What went plank? What? Okay. Well, everything looks normal. Oh god. Nope. Oh, but it you're telling me that that I thought the looking in was a bad thing. Oh, man. All right, let's let's go. [ __ ] me. Nope. Not doing that. Not doing that. Nope. [ __ ] No. Uh-uh. I don't I can't take it yet. What do you mean I can't take it yet? What are you talking about? I can't take it yet. I want to take it now. What do you mean? What was that? What was that? What was that? The [ __ ] The [ __ ] What are we talking about here? Why are we wasting time? Okay, maybe it's fine. Maybe I'm being paranoid. Why did it You're slightly crooked. Well, everything looks fine now. Uh-huh. I trust you. [Music] Oh, cool. Good. That's what I thought. Hi. Thanks. Thanks for that. What lovely nails you have. I don't know. It's getting harder. Maybe I need to crouch more to see some things that I might otherwise miss. Why are there scratches on that door? Everything seems normal. I guess everything's normal. I wish you would tell me. I wish you would tell me. Unless there's something else to open that I I haven't seen yet. It's possible. It's not everything is super obvious of where it is. So, it could be. Is there always a window back there? Light back there. Strange. What about the oven? Can I open? No. Maybe the clock was going freaky or something. But I feel Oh, wait a minute. That's different. Can't take it yet. Huh? Oh, that's weird. Whoa. Didn't know I could do that. Uh, no visitor has come by. Can I take it yet? I hate this. Oh, hi. Hello. No, you're not a collectible, are you? Oh, god. Oh, god. Oh, [ __ ] Oh, [ __ ] What are you doing? Oh, god. Oh, no. Not again. Oh no, not again. Oh no, not again. All right, come on. Let's get this over with. Come on, let's do this. All right, come on. What? Okay, I'm going to run away now. Whoa. Can I take my pills or something? Oh, never mind. I'll just take a nap. Day two. God. Okay. I wish I had time to finish all this right now. I do not, unfortunately. So, I'm going to have to pause here if it saves, which it's I think it probably has been. I don't even know if I'm halfway through it cuz I'm at the third doll. So, maybe I'm getting close to it, but unfortunately I have to stop here. So, thank you everybody so much for watching. Sorry for being such a monumental success and so good at this and it makes you all embarrassed at how good I'm sorry for nothing. I humbleness is such a convoluted thing. We all try to be mentally healthy one way or another and the only way that I cope is with absolute self-confidence in everything that I do. Thank you everybody so much for watching. More scary games coming soon and in the past cuz the past is always there. just getting further away every day. Thank you, and as always, I will see you in the next video. Bye-bye.",
    "start_time": 0.08,
    "end_time": 2241.64
}