{
    "video_id": "BiS9rDFYbV8",
    "channel_url": "@markiplier",
    "transcript": "Ah, welcome to Silent Still 2. Why am I not playing Silent Still one? [ __ ] Shut up. What are you even doing with your life? Huh? Why are you sitting here watching this video when you could be out accomplishing your dreams? It's because you're going to do it tomorrow. And I understand that. One second. What? No. No. [ __ ] No. Trying to get a webcam for another game. Don't ask me until it comes out. But this is Silent Still 2. If I'm not 100% crazy, which is always in doubt. Oh, what? Why would going to high quality do that stupid stuff? What in what in the world? Did that mess up the recording? Of course it did. Oh my god. Okay, there. Are we good? Great. Everything's great. I'm going to do a thing. And it's not cheating. Aha. Who's there? It's so small. I can't see. What the [ __ ] am I? What the [ __ ] Okay, look at how small what I'm looking at is. Okay, it's it's this window here. And for some reason, it's not getting any bigger. And I can't Aha. All right. What am I looking at? See what I'm looking at? Oh, it's somebody's sleeping. It's somebody sleeping. I say not into the microphone. It's somebody sleeping. All right. This has been a big waste of time. So, we're going to get right into it. This That's not a G. What the [ __ ] is that? This lame contains deeply unsettling Emily. I wasn't done reading it. Loil loker. All right, this is it. I've seen other people explore this place. Can't wait to check it out for myself. funnily enough, all those people never actually showed them making it out of the building, which means they're still in here. Whoa. Whoa. Okay, we're a little bit too sensitive on the mouse again. We don't have that setting. That's fine. Slow. Slow. Oh my god. What? Holy hell. Okay, so I don't know why I just decided to not take even a step going up there. The most effort. Great. All right, I'm in here and I'm pissed off. Great start for you ghosts. You better watch yourself. I think I can toggle alt to speak. Hello. Why would I want to I didn't get Oh no, I asked you first. That is exactly like that. >> Okay, so why would I want that? I I'm not doing it now. But I'm guessing that I should do it all the time because if it's going to add my voice and I didn't catch any of the other instructions because why would they show them? Then I guess I'm going to keep it. I'll have to be selective on my commentary so that everyone can understand exactly what I'm going for. And if I have the microphone a bit farther away, then it should sound more organic. But it's a bit like a speech jammer for me right now. Good thing I'm very trained. Why would it open that way? Okay. Did anybody see what the other buttons were? Man, I don't know if I'm holding the the the flashlight like this and just letting it dangle and pointing it like this. Probably even like this. Ignore the drips that just came out there. [ __ ] stupid joke. Dumb joke. Not worth it. Crunch. Cage. Crunch. Cage. Any ghosts. Is this what Bob and Wade have to hear the entire time that I'm playing with him? Damn, this place is way creepier in person. Of course, it is me. Any ghosts in here? They're not going to want to go near me. Don't know why I'm farting. Okay. Hello. Am I like um vlogging for a YouTube channel or something? There's a room back there. Smokey. Anybody in the back rooms? What did I say? Oh my god, the back room. Bad jokes. Look, I I don't know what I'm doing. I got to get this closer. All right. Well, I got the timeout chair and then I got the cuck ladder for the timeout chair and it's got purple on it, which is pretty cool, I guess. All right. Well, this has been delightful. What were those other buttons that it told me to do? Well, I guess if I'm a ghost hunting channel, you know, should be more ghost hunting YouTube. I'm here at the abandoned school where 27 different children murdered each other. And also, it looks suspiciously like a level out of hasmophobia. But I'm not going to say anything about that. Assets be what assets be, and people got to use what's available to them. I'm not going to judge other people who've done videos in this haunted place. Doesn't mean that my content isn't going to be just as good. Just because I'm last to a game doesn't mean that I'm not the best. Everybody's loving it. Ah, so this is the entrance. Why the hell did I come through the back? I don't know. Why did I? H Seems like a one-way trip. There's a light on over there. Probably not good. Hello. Looks like the close is clear. Close to [ __ ] Wait, that's weird. Why are the lights still on in this area? Huh? Oh my god. There was a janitor here. Peculiar. Western Wind. What a stupid name of a mascot. Western wind knight. Go wind knights. Knights of the wind. Hit him with the tornado. Yeah. Really thrilling. Everyone's going to be intimidated. Western wind knights. Western wind nights. You're going to blow the competition away. Get ready for our gusts of gusto. It's blustery in here, you bastards. I don't know. You called down the thunder. Now get ready for the wind nights. We're getting a low pressure zone that's going to result in wind nights. I'm stuck on a bench. Wait, no. Yeah, it's a bench. After the sun sets, wind's going to pick up. It's going to be a night of wind. And again, I don't I don't know who I am anymore, but I know I'm better than the Western Wind Knights. I really hope this is an actual school. I hope that there's people out there that are from Western Wind Knight or whatever that is, and that's your mascot. And I'm making fun of you right now. I hope you're real because I want to make fun of you harder. I am not nice. All right. I don't know why I came in here. I know some people do do do uh haunted explorations like this. At some point, do you become desensitized to it? Like I have slightly to horror games maybe. H that's weird. Main office is blocked up. Okay. What floor? That's nothing for a wind night. Hello. Is that a bathroom? I don't like a bathroom. Is this a bathroom? No, it's a locker room. It's not bathroom. All right. This seems like the perfect spot to sit for a bit. Just to listen and feel if anything's here, you know, cuz I'm a weirdo. I'm going to sit in the middle of this floor and feel. What a better What better place is there to get in touch with your feelings, right? I'm going to feel. Oh, yeah. I'm going to feel. Oh, I'm going to feel all over this bench. E to sit. I'm feeling. All right, ghost. Come on out. I'm just sitting here. Not like I've got anywhere to run, right? Stupid ghosts. You don't even have legs. Not like mine. These ham hawks here. Am I whispering that? Oh, what's that noise? Is that a wind night? Hey. Hello. Who's there? Come on, I can hear you. I got a bad feeling about this. Uhoh [ __ ] I'm out. All right, whoever you are, I'm leaving. Okay, this better not be the wind tonight. I'm going to get up. I'm getting up. Here I go. I got up. Better watch out. Man with legs about to get up. As soon as I get up, something's going to happen. All right, let's get up. I'm up. Guess who's up? Leave the place. I'm leaving. Stim stomp. Here I go. I'm out of here. Huh? I'm not allowed in the women's locker. Was I in the women's locker room? Yeah. Okay. I'm not allowed in the men's locker room. Anyway, I'm out of here. Lame wind nights. Seem a bit more wobbly. I think I just have really wide legs. My stance is huge because of my balls. My balls is huge. Must have been the wind. It's going to happen. It's going to happen to me. It's going to happen to me. You're going to do it. Don't do it. Don't. I sense it. Did you just cough? Who did that? I sensed it. I knew it was going to happen. Well, there's the door. I'm out of here. Oh, bye-bye. Oh, see you. Not looking anywhere else but the exit. All right. Da eat. Oh, home sweet home. Oh, come on. I don't get my microphone here. Oh, man. I I miss the sound of my own voice. Oh, all right. Well, I'm home. Well, that was weird. I guess I'll just um not do anything. A lot of bread. A lot of bread-based foods. Oh, well that's gross. Why did I leave that? Okay. Yawn. Oh man, I'm tired. I'm so thirsty. Oh, wait. I think there's some soda in the fridge. In my ancient fridge. Soda. No. Okay. All right. Good night. Well, this was thrilling. All right. Let me take a bath real quick before going to bed. Yeah, let's do that. Here. There. Where? No. Where's my bathroom? Oh, okay. Well, I'll leave the door open. I like Can I please? Yeah, of course. Yeah, that makes sense. Oh, it's already drawn for me. Yep. And door just open. Why not? But what if it's from the water? That's weird. I've explored so many abandoned places and never felt scared or in danger. But earlier, there was this heavy feeling like a deep fear that just made me leave and go home. Yes, that is what happened. I mean, not to me, but to you. Yeah, I hate this. Like, I'm not even washing. I'm just sitting and just sitting. What's up with those dogs? They're so annoying. I'm not going to look over there. I hate this. I hate this. I don't like this. Oh, what? What just happened? What? Oh, don't do that. No. No. You could die. God damn it. Uhhuh. Yep. Okay, here I am. Oh my goodness, that was a close one. What the? It felt like I was being choked. Uggh. That seriously scared the hell out of me. What? What? What? Huh? Huh? Choked? What do you mean choked? Choked me. I'm going to get up. I'm up. I'm up. Am I naked? No one would ever know. I guess I'm just tired. Yawn. I should change clothes now. Uh-huh. And I won't close that door either. Right. Am I going to sleep with the bedroom door open, too? Cuz this just like there's bad decisions in horror games being made for the story to progress. I get it. Sometimes you have to do that. My [ __ ] nope. Turn off room ceiling light. Yeah. Okay. Is this it? No. How do I Great. This is good. I don't need to worry about turning off all of those. This is horrible. Go to bed now. Or do I turn off that light, too? All right, time to sleep. Need to sleep. It's the weirdest going to sleep I've ever experienced. Oh, great. Oh, good. Finally. I'm so tired. This is going to be a long ass sleep. Oh, I bet. Maybe the longest sleep of your entire existence. You [ __ ] psycho. All right, let's sleep. Sleeping. I don't know about you guys, but that's how I sleep. Progress bar. M. [Music] Oh, the first experience, huh? [Music] Well, this is just what you deserve. This is exactly what you deserve. What's going on? Why can't I move? I can't even talk. What is this? It's not stopping me. Yeah. Blabber blabber blabber. Frick. I'm doomed. I am doomed. Are you trying to get me to look over at the window? I'm looking. Oh no. Oh no. My left. Oh my left. Oh. Oh no. What was that? Well, it couldn't have been good. Oh, great. Well, don't do that. I'm flickering the lights. A nose feru. Okay. Please be nose fatu. I've for your soul. [ __ ] You got to do something. All right. I'm looking away. I'm just gonna I'm not going to move. I don't need to move. I can't move. I'm paralyzed in the bed. What the [ __ ] is happening? Who's there? You guys experience it. Oh, wow. Huh? That's ridiculous. If you're going to do something, just do something. Just do something. I could close my eyes and drift off to sleep and never have to deal with this ever again. Can I talk? Hello. How are you? I asked you first. Oh, that's really mature. saying exactly what I'm saying. I'm an idiot. Damn, that would have been great timing. I only get one of those in my life. You waiting for me? Are you waiting for me? Are you waiting for me? Who's that? There's someone on the kitchen. Is there Oh, hi. Ah. Oh, who's there? Can hardly see. Ha ha. Oh, good. Hya hya. Okay. Oh my god. Hello. Oh, [ __ ] Hey, who are you? All right. Can I help you? Oh, good. That's great. Once again, I'm not going to say anything. Come on. Come on. Come on. Come on. You don't think I know you're there? You don't think I know what you're about to do? You know how many war games I played? Y [ __ ] this, huh? Who is it? You don't think I know what you want me to do? You're just trying to delay the inevitable, huh? Are you coming here? You think I'm paralyzed? I just extend my fist. You launch yourself at me and you just ram your entire body from my fist to your mouth to your gut out your ass. Hello. Oh, I forgot about that room of mine and the light that's in it. Yeah, I swear a long time ago I played a game like this where I was sitting in a bed just like this and there was like an alarm clock and a skeleton or something very blue colored. Oh, this is ridiculous. I'm going to go to sleep. I don't even know what to think anymore. I'm just going to put both my fists out and whichever direction you come at me from. You will impale yourself. No, you're going to have to impale yourself. I've made it as easy as possible for you. You impale yourself on my fists or we're not doing this. I see you. Impale. Get impaled. I see you. I see you right there. I see you. I could turn up the gammer right now. Fine. Just you going to crawl in bed with me. I guess that's one way to avoid the impaling of my fist. Oh, I have boobs. You learn something new every day. H. All right. Hi. That, you know, I'm not going to lie. Didn't expect that. Not going to lie. Hi, sweetie. I'm not going to do anything about that. All right. Bygons. You know, you know what they say about by guns. How was your day? Oh, why are you rolled away from me? Honey, come on. Talk to me. [Music] Oh. Oh, good. Huh? [ __ ] That was it? All of that for that? Was that the main scare or is there another one coming? There's probably another one coming. Oh, you're there, aren't you? Are you? Turn up the gamma. [Music] So [Music] But I've played a great many horror games in my time and I appreciate what you're trying to do with the dramatic pacing and all that, but it became very clear very early on what was going on. And I get that I made it longer by not looking around. But when I know you're waiting for me to look somewhere, it just makes it I don't know. Anyway, gotta pee. No closing the door for sure. Not for me. Why is this necessary? Why? Why is this part of this? Why is this necessary? What are we playing in the Sims? What are we doing? Am I going back to bed? What? What am I doing? I'm hungry. I should have eaten my food before it went bad. Which food? There's so many foods around. Talking about the eggs. Can I eat anything? I guess it went bad. Food. No. Am I going to bed? Why did I say that? I don't know. Whatever. What am I not going to bed? What am I doing? Oh, how many chap wait, how many? Okay, how Oh, pause. How many chapters are there? Am I going to eat? This is weird. There's something off, but I can't find what it is. Oh, why is that a [ __ ] Why is Why does it decay? What does it fall out of my mouth when I like got to shove it in before it forces it way back? Why is that that Why is that what that is? That doesn't make any sense. Oh man. Oh, muscled one of them down cuz it went bad. You know, I just got to force my body to take it. And here's what I'm assuming I'm supposed to do. Oh no, there's something behind me. Looking and then looking back. Oh, someone ate my toast. You know, it's my fault for sitting in a dark corner eating. Can I eat? Can I at least eat my other bread before you come out and jump at me? What was that? Huh? Damn it. I knew it wasn't just a dream. Screw this. Screw this toast. I'm not out of here. What? What am I doing? What are we doing here? What are we doing? Oh, I don't know what you want from me. Why am I still sitting here? The toast was so bad. It has paralyzed me. It has rendered me incapacitated from the sheer distress it is causing my intestines. It it is. Every ounce of my concentration is still forcing that thing down my gullet. Man, this bread is [ __ ] terrifying what it's doing to my body to look under peekaboo. What the heck? Well, let me get a good look down there in the no light. There's nothing under here. You know, why wouldn't you just start kicking? If there's something under the table under you, [ __ ] start kicking and then before I go back up, start punching. I guess I'll go back up. Guess I'll go back up. Huh? Oh, man. Nothing. Who took my bread? Even the ghost doesn't want this bread. This is all just hallucinations caused by the three-day old bread. H. What was that? Hm. You got something to say to me, huh? You think I'm scared by some moans? You hear how scary my moans are? Nope. [ __ ] cut that out. Leave it in. Whatever. Ow. [ __ ] that. Ow. What? What happened? Oh my gut. The bread. It's hitting my lowers. What am I? Ow. What happened? Did someone hit me? Is someone b biting my ankles? What's What's the deal? Please, whoever you are, just leave me alone. I didn't do anything to you. What? What? What am I doing? What are we doing? What? What? What? What do you mean? What does that mean? Whoa. Closing my eyes. Oh, peekaboo. I don't know. A scared meter. Oh, whatever, man. I don't care. Scared meter. Am I calming down? Is this calming me down? That was a close one. Okay. All right. I'm I'm gonna I I was going to hold it till later, but I guess I have all the time in the world right now. The bed sequence, I get what they were going for. I was hoping it would be a bit more proactive or a bit more aggressive and drawing my attention here and there or continuing like as a contingency if not. It was a little long in some of the reactions, but I think overall I get what they were doing. I think that they overdid it which made the scares not as impactful. They had something there. I was dreading it at first and I was like, \"Ooh, okay. I like where they're going. They letting it breathe, but then they let it breathe and they let it breathe and I'm like, \"Okay.\" When that was done, I was like, \"Okay, all right. It's over. All right, let's move on. Maybe we're going somewhere else. Some other location back to the school.\" Western Winds to do it again. to do the thing you just did again out here with no justification of why all for a jump scare. All for a jump scare. All for wait like you wait too long. And sure it's loud so it's startling but that's they did it again. The audacity. The audacity. The audacity. Yeah, it was all just a dream. Let's Let's dream it up. All right. I I don't usually I almost always try to leave a game a horror game, especially indie horror games with like optimism and joy in my heart. And I do. I have joy in my heart. Trust me, I have joy in my heart. Can I have that? There we go. Oh, hello. Ah, there's the joy. I like this. I wish it had a reason to do it. Why is it so crackly? Why did I pass out here? I can't remember. Ah, there's the door. I like this. I wish it had a reason to do it. That's so crackly. Why did I pass out here? >> Hello. Ah, there's the door. I like this. I wish it had a reason to do it. That's so crackly. Why did I pass out here? >> Hello. >> There's the door. I like this. I had a reason to do it. That's so crackly. >> What? >> Why did I pass out here? West start. Huh? >> Is that just gonna happen? >> I like this. I wish it had reason to do it. >> Why did I pass out here? >> Hello. >> There's I like this. Wish it had reason to do it. >> That >> Why did I pass out here? >> Oh, look. Another flashlight. >> Hello. >> I like this. >> Oh, wow. What? Why? Why is that there? >> So crackly. >> Hello. Why did I pass out here? >> Hello. >> What? >> I like this. I wish it had a reason to do it. Why is it so crackly? Why did I pass out here? >> Hello. >> Ah, there's the I like this. Ha. >> Okay, it was broken. I don't know why it was doing that, man. Oh, man. >> Okay, it was broken. I I don't know why it was doing that. >> I man. Oh man. >> Huh? >> What? Why is it broken? >> Western wind nights. Western wind nights. >> Now we got it. >> Western wind nights. Western wind nights. What is happening? Western wind nights. >> Toggle alt to use the microphone. Yeah, I know I'm doing it. I don't know why I'm doing it, but I'm doing it. So, Western Wind Nights. What? What? Who's there? I swear I heard I swear I >> western wind nights. >> What? Look at the sound of the voice. >> I don't know what >> I'm sorry. I'm sorry. I'm sorry. >> Okay. >> Western. >> So, this is intentional. All right. So, this is intentional what they're doing. What they should have done, and this is me really bold about this. This is I'm going to be so bold about it is if they're going to have a voice play back your voice, number one, the way that it is right now where it's just looping the last thing said, no, that's not good. Number two, it should have collected samples from the first part of the game, stored them, and then used smaller clips from them. It could be random. It doesn't have to be intelligent. Doesn't have to know what it's saying. But I I I think you could get it where it's like you program where it hears voice and then if it's silent for a few seconds, it cuts that off and then that's one chunk and it saves that, right? And then you could have had a bunch and then you'd hear a distant version of your own voice playing back from the first section. We wouldn't have to have it even be active at this point. Then you could have had the natural like I'm goofing off around here. Anyway, where am I supposed to go anyway? Where am I supposed to go anyway? I don't even know where I'm going. Where am I supposed to go anyway? I don't even know where I'm going. And now that's scary. A no wait no wait [Laughter] no Wait, wait, wait, wait. [Laughter] >> Oh, man. [Laughter] All right. Okay, that's enough of that. Oh, was that something? Oh. Uh-huh. Oh, yeah. Uh-huh. Uh-huh. [Laughter] What am I? Oh, I am Am I I'm running. Oh my god. [Applause] Good thing I practiced with that bread. Oh, I've been training for this all my life. Oh, what the [ __ ] Come on. Come on. What the [ __ ] What the [ __ ] What the Well, that was cheating. I was I was hitting it. I was like double tapping. I was single tapping as fast as I could. Oh, come on. Oh my god. I'm back here. I'm doomed to do this [ __ ] again. It's been 3 days without sleep. I don't know how much longer I can do this. >> I don't have a friend to stay with. I couldn't call upon the loyal subscribers of my YouTube channel. Don't sleep. Why? Oh, I got to spam you again. Well, I'm not going to try. [Music] You wouldn't let me break the door. No, no, no. I have to Hold on. I can't fall asleep. Don't sleep, Dave. Don't Don't go to sleep. Don't sleep. Don't sleep. Stay awake. Stay awake. [Music] Okay. Well, I don't know who they're kidding. What is this? What is this supposed to be? Okay. Well, whatever. Oh my [ __ ] god. [Music] No, no, no, no, no, no. This is bad. This is really bad. Why? Why is it bad? Why is it bad? Oh [ __ ] [ __ ] [ __ ] [ __ ] Now it's going to get stuffy in here. I should have known from the get-go what this was going to be like when the stairs took so much effort to walk up them. I should have known this game was going to be a little slow. Yes, I see you. Now I don't. And I'm guessing in a few minutes I will again. And that's why I can't predict it because every time I think I and I'm thinking of I'm doing it late. I don't know what late even means. You already opened the closet. Why do you need to open that door to to to turn off more lights? It was already dark. You going to open the closet door too and turn off that light? [Music] >> Oh, man. You know, I was joking about that. In a few minutes, I'll see you again. But it I should have known that it was real. I thought that it might have been me delaying it later and I know it probably was, but the thing was when I was at the dinner table, I was flailing trying to get something to happen and then it didn't. And so I don't know what's me delaying and what's not. Why would I look anywhere at this point? Why would I as a player look anywhere? I am disincentivized to look anywhere. I don't want to. I want this to drag on. Holy [ __ ] Oh, wow. There you are. No, no, no, no, no, no. Oh, I got to wake up. No. Maybe I shouldn't have woken up. Well, that was wake up number one. Then I need wake up number two. Then wake up number three. Am I going to eat again? Holy [ __ ] Oh no. I got to I got to poop first. Jesus Christ. I got to drop a turd. Bring something in the bodily functions the game. [Music] Nothing like cola. Yum, yum, yum, yum, yum. Yum. Back to bed. [Music] How long do I have to keep experiencing nightmares? I don't know. Why would I know? Oh, can't get me now, can you? Oh, I found the high ground. Oh, I found it. Oh, let me let me in there. Let me in there. Let me in there. Oh, yeah. There we go. Yep. Yep. Yep. Yep. Yep. Yep. Yep. Oh, we're up. We're up, baby. Oh, we're Oh, yeah. Yep. Oh, come on. We're right there. Let's go. Let's ascend to the heavens. Come on. We're right there. We're right there, Bubba. We are almost free. Free as can be. Freedom. Holy [ __ ] Oh. Oh. Oh. Oh. Are we through? Ah, damn it. Thought I was through. So, what am I doing? Am I leaving? What am I doing? Oh god. I was here. I was here. I was all right. Fine. It's fine. Don't worry, it's not over yet. Oh man, I was so worried. [Music] All right. I I never want to leave a game with just bad thoughts or intentions about it. I got to say it had me go here. Developers, it had me going there for a bit. I really was into it when I was going in there. I and and I heard like activating my voice to speak. I knew what that was about. I knew it had to be something where you were going to use my voice, right? Because why else would it be there? Why else would I be able to hear myself in that space? If it's not multiplayer, then I knew it was something I was like, \"Okay, this is cool. I think this will be a fun mechanic. I'm into this. Explore the area.\" You know, nothing's happening. That's fine. The slow burn is good. I'm not saying the slow burn is not good. It is. It's definitely good. The problem is you're calibrated too far in the slowb burn. There is a danger zone here off in the distance. And I'm sure that many people probably still got scared from it and were like, \"Oh, come on. Just do something to me.\" And I'm sure that's what you were going for. But there's a limit. There is a limit. And again, I'm not a game developer. I don't know anything about making games, but I played a ton of these horror games. I've played a lot of horror games. I've played every range of horror games. This is the most extreme range of waiting for something to happen of any game that I've ever played. And I don't think that that's a good place to be, but it is an extreme. It is. And I'm not trying to be super admonishing about it, but this game would be better if those weights were shorter because it's not accomplishing like something extremely groundbreaking. And that's not an insult. I'm saying this has happened before where you know you're stuck in one place and you're forced to look. That is scary. You can do it again and again. That's fine. You can do that. No problem about that. But if you let that drag on too long, it becomes frustrating. And you're balancing on the knife edge of dealing with that fear versus the frustration. The frustration of not being able to do anything and being a victim of what's happening, the more helpless you are is not inherently making it a scarier experience. There's a certain level of action reaction that does need to take place. And I know you had some of that with the looking around and then something happening while you're not looking. But when that's the only trick that's happening, then it becomes very predictable and it becomes very boring and it becomes very frustrating because I'm waiting for something interesting to happen. And in these horror games, the experience is about the immersion of it, but about feeling like you're there, right? Feeling in that moment. And the more connected you feel in that moment for a horror game, the more afraid your audience will feel. Hopefully. Not everyone's the same, but I think I think if I had to say anything about this, it would be the writing is a little the especially the text and the way it is. Um, people don't normally talk like that. That's just a minor note compared to everything else. I don't know if even a lot of these games are made by people internationally and English are not their first language. I'm never going to discredit anybody about that. There you go. Uh, so that's fine. It's But people don't ordinarily talk like that. That's one thing. It's totally fine. But the pacing way way off. It's not even a little off. It's way off. And to do that, and this is very important, when you do that again, if you haven't learned from the mistake of the first one, if you don't realize there's a problem in the first one, it will be multiplicatively more frustrating in the next section. If you've lost your audience in the first scary like sleep paralysis section, which is fine. I feel like that was borderline. I feel like a lot of that was on me. I wasn't looking in the right place or I wasn't engaging enough with the environment to do it. I would say I wasn't drawn to engage enough in the environment, but also I'm a YouTuber, so I I do things a little bit differently than the average player would because I know people are watching. But at the same time, when I was at that dinner table, I was looking everywhere. I was looking trying to get things going. The closing eyes didn't make sense. The looking under the table was like, \"Okay, then look back up. Okay, why am I sitting there?\" And if if the thing is sleep paralysis, am I paralyzed in that desk? Then why could I look down under it? Why was I able to look under it? Above it, it didn't make sense, right? And even in a horror movie, if you're at a dining table and you're not stuck there, and I know you're not stuck there cuz you're looking up and down. If you hear something behind you, you're going to get up and turn around. You're just going to do that. You're not going to sit there hoping that, oh, Mr. Monster ain't going to come creeping up on me. It's not realistic. Why not sit on the other side of the table and look out that way? And then you are kind of stuck. You're cornered, right? You cannot get out because you don't have a space to room. But at least there it's framed in a way that you can do this and the character is not learning any lessons by not facing the most horrible way in a horror movie. Not horrible isn't terrifying, but bad judgment way. It makes you seem like the character's an idiot. You know what I mean? And you don't want that to happen. Anyway, I'm going to Enough about that. The good thing is it did have it. It had it. I was able to have fun with that mechanic in the beginning. Okay, it didn't work out in the end. That's fine. But I was able to have fun with that mechanic in the beginning. I enjoyed the exploring around in the abandoned area. I was able to goof with it. It was fun. It had the ambiance. It was kind of creepy. I was into it. The sitting moment, that was the first one where I was like, \"Okay, this is cool.\" Because nothing was jumping out at me. It was just kind of things happening here and there looking around. That was actually the first one I realized the sitting there. That was good. It was great up until things dragged on a little too much for the bed sequence and then way too much for the dining table sequence. It just was too much. And then the last bed sequence, you know, it's just like, you know. Anyway, thank you for making this and thank you everybody so much for watching this. Sorry that was a bit of a tirade, but I tell me if I'm off base here. Absolutely. If I'm off base, if I'm wrong about this, let me know in the comments below. I'm not trying to rip this apart. I never try to rip these apart. I think I've told people a long time ago way back when I first started I played a horror game and I just mocked it and it was the developers first game and I know this isn't the developer first game because there's the first game right there. So it was that developers first game and they were really crushed by me just [ __ ] on the game and so ever since then I've never done that or I've tried not to do that. I do my best not to. I'm not saying that I'm perfect at it cuz I'm not exactly good with my temper sometimes, but at the same time, I try to recognize when effort was put in. And I know effort was put in and I don't want that effort covered up by something that a lot of people might find frustrating, but again, might be off base. People are learning and I never want to come down as like someone this is like this is crap and you shouldn't do this. You should do this. A few simple fixes would make this great. I I don't know how complex the programming would be to take snippets of the voice from the first part. Maybe that maybe I had a bug and that is what it was supposed to do. I don't know. But also don't make it optional for the voice to be used, right? Maybe don't even have it as a toggle in the beginning and take the voice samples anyway and then play them later. Do that. Surprise the audience. You know, I think it's perfectly okay that certain games [ __ ] with the computer in a way, you know, and cross a line like bump it up against it. You know, there there is a way that this could be great. I think you could re-release this. That'd be totally fine. I would have no problem with that. Then again, I'm not making it. I'm not I'm not your boss. I'm not I'm not in charge of this. I just do think there's potential here. And you have potential. And by learning, I think it could be great. I really do. So anyway, all right. I'm going to shut up now. Thank you everybody so much for watching. More scary games in the link in the description below. Playlist has a whole bunch of them. Thank you. And as always, I will see you in the next video. Bye-bye.",
    "start_time": 0.16,
    "end_time": 3351.48
}