{
    "video_id": "0sKF2Gd-d2E",
    "channel_url": "@lankybox",
    "transcript": "Today we're unboxing all of these super rare Minecraft toys and seeing if we can guess the price with our little brother, Mini Justin. We're going to open up all of these Minecraft Happy Meal toys. We're going to see a real life Ender Dragon and we'll even open up a giant Minecraft mystery box. This is going to be super awesome. Everyone watch until the end. Are you ready to start Mini Justin? Yeah. Let's go. [Music] Starting with these Happy Meal Minecraft movie toys. Okay, now these are super rare. Basically guys, for the Minecraft movie, they had an official collab with McDonald's where there were super rare Minecraft Happy Meal toys inside. We bought a ton of Minecraft Happy Meals. And now we have all the toys right here. We have 1 2 3 4 5 6. We're all going to take two of them and open them. See what we get. I want this one. Okay, Mini Justin, which one do you want? I want this one. Okay, I'll take this one. Nice. Nice. I want this one. Okay. I want this one. Nice. >> All right. And I got this one. Now, guys, these are literally sold out everywhere. You can't even get these. They're so rare. >> Bro, look at how sick these look. They look like Minecraft chests with the M. This is so awesome. Okay, Adam, you go ahead and open yours first, bro. >> Okay, I'm going to start with mine. Now, guys, there's a bunch of different characters you can get, but the one that everyone wants is the Grimace egg. >> The Grimace? >> Yes, guys, the Grimace egg. That's the ultra rare. We're going to see if we get it. Here we go. Okay. Oh, it's a Minecraft soda potion. >> Wait, that's so cool, guys. Look, it's like a potion in Minecraft. And there's soda. There's a straw, so you could drink it. Look at how cool that is, guys. >> Let's go. >> Okay, Mini Justin, you got it. >> You open up, Mini Justin. >> Okay, I wonder what's inside. I really hope I get the Grimace Egg. Grimace. What is this? Wo, >> that's so cool. It's a Minecraft French fry helmet. >> I wonder if I can put it on my head. That is so awesome. Okay, I'm going to open mine. This is so exciting, guys. What is in here now? Adam said the rare is the Grimace egg. Guys, we got to get Grimace. Now, guys, be careful cuz you already know Adam and I drank the Grimace shake a while ago, and that was not good. Okay. Yikes. >> Yo, it's the zombie hamburger. You guys see that? That is so awesome. >> Can you put this on him? That's so cool. >> Wait, wait. Yo, that is so cool, guys. You can combine toys. So, these are official Minecraft Happy Meal toys. Super rare collectibles. We're going to have to guess the price of these. And we have crazy other products to look at later, too. Guys, this is so cool. Okay, everyone, open up your second one. Okay, guys, leave a like. Let's see what I get. Please, Grimace. Please, Grimace. Bro, go. >> I got a Minecraft birdie toy. That's so cool. They'd be friends. Check that out, guys. This is so cool. Okay, Mini Justin, you open yours. Now, listen. If we get that Grimace egg, which is apparently super rare. It's like one in 100. Bro, we got to go watch the Minecraft movie again, bro. But we have to film the video. Okay. Okay. We'll see. We'll see. Adam, we'll see. We'll see. Okay. >> Okay. I hope I get the Grimace egg. Okay. What is it that is egg? >> Let's go. >> It's a Big Mac crystal. >> Can I eat it, dude? No, don't eat that. It's a toy. That's >> I can't eat it. >> It's a Big Mac crystal. It's so cool. It's like shiny. You guys see that? This is so awesome. Okay, I got the last one right here. Let's see what's in this Minecraft Happy Meal toy. Guys, this is super exciting. No way we get the rare right here. But wait a minute. It's purple. >> Wait a minute. >> It's purple. >> Is that the Grimace egg, bro? It must be. It looks like Grimace. Open it. That's the ultra rare. That's the ultra rare. >> Grimace. Grimace egg. Grimace egg. Grimace egg. Grimace egg. Guys, because I got the ultra rare Grimace egg, I'm going to go rewatch the Minecraft movie and I'm going to go get one of these super rare toys in the world, the chicken jockey Minecraft action figure. I'm going to go and get that and Adam, I'll let you open that if you get a bunch of likes on this video. Okay, you heard him, guys. So, guys, make sure to leave a like. Let's try to get to 10,000 likes if you guys want to see what that toy is that Justin's going to get at the movie theater. off for now. Mini Justin, how much do you think we pay for all of these Minecraft Happy Meal toys? I think all of them cost $150. Okay, let's move on to the next item right now, which is this giant Minecraft mystery box. Wo, dude, huge. What do you think is inside of here? It has to be more of grass blocks. Maybe diamonds. >> Okay, let's open it up. You can open it up, Mini Justin. Okay, diamonds, please. Please. Let's out. Wo! Wait, guys, there's so much stuff in here. Let's start with this. It's like It's a Minecraft sword, right? >> I think it's a diamond sword. >> It's a diamond sword. But Mini Justin, what if I told you there was a secret ability that this sword has? >> What is it? >> So, check it out. If you click here, if you click this button and you move this like this, what? >> It turns into a pickaxe. >> Wo, that's so cool. >> Yeah. So, check that out. You try it. Press this button. >> Yep. >> Now, it's a sword. You got this. Okay. And there's also a bunch of toys from the Minecraft movie in here. So, let's check this out. We got Steve. Oh, cool. Animal and even a creeper. I'm scared of the creeper. Adam, what if we open it and it explodes? Okay, let's open this. You can use the sword and pickaxe to fight against the creeper. Do you want to try it? >> Let's try it. Okay, guys. We're going to open up the creeper. Mini Justin's going to open up the Steve figure. He looks just like he's from the movie. Wo! >> So awesome. It's Steve from the Minecraft movie. And it's a creeper. Watch out, Steve. That's cool, guys. And wait, Mini Justin, there's a Minecraft TNT block. What should we do with this? We should definitely hit it. And hopefully it doesn't explode. Wait, that's not a good idea. >> That was crazy. >> That was awesome. Adam, what do we have next? Wait, Mini Justin, what is this? I have no idea. It's like a crystal ball. Is that an ender pearl? Uh-oh. Are we going to go to the end? Whoa, that's so awesome. And whoa, it's a Minecraft animal. Okay, let's open it. It's Dennis. Dennis the Wolf. Wo, he's like our own little pet. Maybe we could tame him with the collar. Yeah, we can put him on. >> And now he's our best friend. Let's go. >> Hi, Dennis. Okay, now Mini Justin, how much do you think we paid for this Minecraft mystery box? >> I think we paid $50. Okay, we're going to lock in $50 and move on to the next item right now, which is this Minecraft food backpack. Wo! What kind of food could be in here? Okay, so you can open it up, Mini Justin. I don't know what's in here, but I heard there's some really yummy Minecraft foods. Wo! Frosted Flakes from the Minecraft movie. But wait, Mini Justin, apparently this turns your milk creeper green. What? We have to try that. But what if this turns us into a creeper? Oh, I hope not, or else we'll explode. Okay. So, I'm going to get some milk. Guys, you already know I love milky milk. Now, we're going to see because normally milk is white, right? Yeah. >> But this cereal should turn the milk creeper green. So, let's see if this actually works. I'm going to open it up now. Okay. Okay. Wo. It's already green frosted flakes. That's awesome. All right. You can pour it into the bowl. I got the milk, of course. Okay. I'm going to pour it in right now. All right. Nice. >> Woohoo. And guys, remember, help us get to 10,000 likes. Remember, Justin is at the movie theater right now. When we get to 10,000 likes, we're going to see what the toy is that he's getting at the theater. Okay, you can pour in the milk. Okay, I'm going to pour in the milk now. Hopefully, this screen turns into a creeper. Okay, nice. Let's pour in the milk. >> That looks yummy. >> I kind of want to eat some now, Adam. >> Yeah, I want to eat some, too. Okay, so the milk right now kind of just looks like normal milk, right? >> Yeah. But let's see what happens if we kind of mix it up. Wait, it's already starting to turn green. Let's pour more frosted flakes on top. More frosted flakes. >> Yeah, more frosted flakes. >> More frosted flakes. >> Now it's going to turn super green. >> Okay, guys. Let's see. You want to go in for a bite? Let's see how it tastes. >> Okay. Woah. It's already so creeper green. You got it. I'm going to explode if I eat this. >> How does it taste? >> So good. >> Oh, let's go. >> You try. >> Okay. I'm just going to try going in. No spoon. This is normally how I eat cereal, guys. Wo. How is it? Woah. Wait, guys. That actually tastes sweeter than normal Frosted Flakes. Really? Did it taste like creeper green frosted flakes? It tastes kind of green. Hm. That's really yummy, though. And let's see the milk, guys. We're going to pour this out onto the table. We're going to see what the milk looks like. Wo! Dude, guys, the milk actually turned green. That's crazy. I wonder what green milk tastes like by itself. H. You want to try some? I'll try some, guys. How is it? It tastes good. That is really good, dude. Milky milk. Milky milk. Creeper. Creeper milk. Okay, M Justin. Now, how much do you think we paid for the backpack and the creeper frosted flakes? Hm. I think we paid $25. Okay, let's move on to the next item right now, which is this real life Minecraft Ender Dragon. Wo, it looks so scary. That's so cool, guys. Check it out. If you press here, wait, it actually makes smoke. Are you serious? Do you guys see that? We have to take it down. Wow. Now, guys, in Minecraft, the Ender Dragon is really scary, right? He's evil. Really, really hard to defeat. Do you think that you can actually defeat the Ender Dragon? Yes, of course. Okay, guys, leave a like if you want to see Mini Justin fight the Ender Dragon. This thing actually breathes real life smoke. Do you guys see that? Wo! Okay, Mini Justin, it's you versus the Ender Dragon. Here we go. I'm going to use my pickaxe. Oh, yeah. Wa! Transform to a sword. Transform into a sword. It didn't even work. I'm going to use a TNT. Ready? Boom. Boom. Boom. Wo. It's breathing. It didn't like that. Steve, can you help? Steve Hym, Steve, >> I'm going to use the final ender pearl. Wait, wait, wait, wait, wait. That might defeat the Ender Dragon. Hya. Wo! Let's go, Minnie. Justin, you actually defeated the Ender Dragon. >> Thanks, Adam. So, I guess there's actual real life Ender Dragon fog inside because guys, check this out. He can actually breathe Ender Dragon smoke everywhere. Now, Mini Justin, how much do you think we paid for this Ender Dragon toy? I think at least $75, right? Okay, Mini Justin's going to lock in $75. Wait, hold on. I think we actually got to 10,000 likes. We did. Thank you guys so much for 10,000 likes. That means we get to see what Justin got us at the movie theater. Bro, guys, I just finished watching the Minecraft movie. They were giving these away at the movie theater. Bro, check this out. It literally says 10,000 likes, guys. Thank you all for 10,000 likes, guys. They gave an official chicken jockey popcorn. Check this out, bro. You can open the top of this, bro. And there was actually green Minecraft popcorn inside. You see that, bro? >> Wait, is that zombie popcorn? It might be zombie popcorn, bro. No, >> I don't know if we should eat this. Guys, you guys got to try this. I was eating this while watching the Minecraft movie. It was awesome, dude. It was so awesome, dude. While you were gone, Mini Justin actually destroyed the Ender Dragon. Check this out. >> Yo, >> that's so cool. That's crazy, bro. >> And he defeated the Ender Dragon. Okay, have some popcorn. >> Let's try it. >> Have some popcorn, buddy. Have some popcorn, buddy. Eat it. Eat it. ate it. How is it? >> Wo. Pretty good, right? >> Yeah. It kind of tastes like apple. Like a zombie. >> Pretty good, right? Yeah. It's actual chicken jockey action figure with popcorn inside, guys. It's so awesome. Now, did Mini Justin guess all the prices, right? >> Well, you have to still guess how much Justin paid for this. How much do you think he paid? >> $15. Yeah, I actually paid $15 for this, bro. >> And you guessed all the other prices correct, too, which means that you won Lanky Box. Guess the price. Minecraft. >> Let's go. >> As a prize, I will give you the super rare Grimace egg and the shiny card. I had Foxy watching it this whole time. You can have it, Mini Justin. >> Thank you, Adam. Thank you, Justin. This is the best day ever. Let's go.",
    "start_time": 0.08,
    "end_time": 760.6800000000001
}