{
    "video_id": "DJ9Como-zdw",
    "channel_url": "@lankybox",
    "transcript": "Hey, Lanky Box is going back to school. This is the world's strictest teacher, and our mom said we have to pass his class because we have to go back to school. Our teacher is going to make us do math, reading, gym class, and way more. And our mom even got a Lanky Box Cyber Truck, and she's going to take us to a donut shop and take us to a bunch of other awesome surprises in this video. But that's only if we can survive the world's strictest teacher for 24 hours and go back to school. Are you ready to see Lanky boys go back to school? Let's go. [Music] >> All right, boys. You've been really bad, so you're going to boot camp school. >> What? I don't want to go to boot camp school. This is so unfair. >> No, we have to go back to school. >> That's right. Adam needs an education. >> That is true. I don't need education. I don't Why do I have to be here, though? I don't need to do this. >> We need someone to keep him company. >> True. True. I have to be here just for you, bro. >> Yeah. Okay, so we got to go to boot camp school. It's our first day at school. Linky about going back to school. But wait, what if we do a good job? Will you get us like a prize or something? >> Yes. If you do a great job, I have a big surprise for you. >> Okay. >> Okay. Okay. Okay. Let's go. >> We're going to try really hard in school. We're going to make our mom proud. This is going to be awesome. >> That's right. >> Make me proud. >> Okay. All right. We will. So, what do we do now? We just wait for the teacher. Are you going to drop us off or are you going to stay here? I am going to drop you off and I'd like you to have a seat. I'll be your teacher. >> I want this chair. I want this one. I want this one. Okay. Is our teacher coming here soon? >> Yes. He'll be here very soon. >> Oh, okay. Got it. >> All right. This is going to be cool. All right. Bye, Mom. Thank you. >> Bye, boys. Have fun and be good. >> Oh, we will. We will. We will. >> Otherwise, you're not going to get a special surprise. >> Oh, we got to get the surprise, bro. Okay. >> Bye. >> Justin, why did you bring so much stuff to boot camp? What if merch is not allowed here? Dude, I have to bring my stuff, my lanky luggage to boot camp, bro. What are you talking about, bro? >> It'll be okay, dude. I bet our teacher's really nice. >> This is crazy, bro. This is our first day of school. I shouldn't even be here. Baby Foxy, look what you did, Adam. Look, we're all stuck here. This is crazy, man. I wonder who the teacher of this place even is, bro. >> That would be me. >> My name is Mr. Boot Camp. >> Mr. Boot Camp? >> Who are you? >> Huh? My name is Adam. >> Who are you? Just >> yeah. >> Oh, well, guess what? It's not a vacation. You're not going to Disneyland. Why do you have all this luggage? >> Well, because I have all my important stuff here. School supplies, dude. I told you. >> Important stuff. >> It's school supplies. It's school supplies. You shouldn't have put the merch. Look, I got my iPad so I can watch my monkey box go on it. You know, >> we don't use iPads here. >> I'm I'm an iPad kid, though. >> I don't care. >> I'm an iPad kid. I'm going to use it. >> You know what? Huh? Give me this. >> What? No. He took our iPad down. >> Don't worry. Don't worry, Adam. I got more stuff. >> Is that a Switch? >> Nintendo Switch. Today's my day to play it. >> No, not the Nintendo Switch. >> Dude, I How are you laughing? The only reason I'm here is cuz your mom brought you here cuz you don't wa your hair looks like broccoli. >> True. >> I've been saying that. You got a broccoli cut. I've been saying that. I've been saying that, bro. >> What is this? >> Huh? That's my awesome Foxy lunch box. It comes inside the backpack. My lunch is in there. >> It's actually kind of nice. >> Yeah. >> Yeah. The merch is pretty good. Wait, our teacher Our teacher actually likes the merch. That's what I'm saying, bro. That's what I'm saying. >> Give me one of these. I got to like this. >> I'll get you one of these. Don't worry. I'll get you. I'll get you. >> What is this? >> Uh, this is another backpack. Uh, I got This is my baby Foxy backpack for your diapers in there. Adam's diaper. Hey. >> Okay. Listen. >> What are you laughing? Funny. You're literally wearing a diaper right now. >> No, I'm not. He's not in one. >> Yes, you are. I'm not in one. There's only two people wearing diapers right now. There's baby Foxy and Adid. >> Okay, let's make this very, very clear. >> We are here to get school work done, not talk about diapers. >> Okay. Okay. Okay. Okay. Fair enough. >> Whether he's wearing one or not, it's not your business. >> You're not. Everybody need to change. >> That's enough. We got to get done with the schoolwork. >> Okay. Okay. Okay. Okay. Okay. >> Put all this luggage and garbage away. >> Okay. Okay. Okay. Okay. Okay. Okay. >> Dude, Justin, you're going to get us in trouble. I'm not going to get us in trouble, bro. You like the lunch box? And I got my snacks in there, bro. >> Stop running up the diaper. What are you doing with these things? >> What? This is Foxy. This is Foxy. Baby Foxy. Baby Foxy backpack. I got I got my bra button in here. >> So, I'll leave that right there in case I need to raise my hand. >> What is this? >> That's Boxy. This is Boxy. >> That's Boxy the boy. >> Yeah, my boy. >> He's kind of cute. >> Yeah, everyone loves Boxy. I told you. >> How you doing, dude? >> Please DJ if he needs education. >> I didn't like this guy. >> That's what I'm saying. Everyone loves the character. >> This one's okay. >> Nice. Nice. Who is this? >> Who is this? Foxy. Foxy, please teach. Good. >> Hi, Foxy. You >> Okay. All right. >> All right. The teacher likes >> I like it. I like Foxy. >> Nice. Okay. The teacher likes the plushies. All right. Well, what's the first class we got to do? This is so ridiculous. >> We're going to start with math. Easy. Easy. Math. Okay. >> I'm good at math. I'm good at it, bro. >> 2 + 2 equals >> This is a question for Adam. This is >> I got it. I got it. I got it. He took my I don't have the calculator. >> I got it. I got it. I got it. I got it. I got I'm going to drink. >> That's milk. You can't drink that. You can't. It's not lunch time yet. It's not lunch time yet. Fug, sit down. Stop. Stop. What is that going to power up your brain? >> 2 + 2 equals 22. >> Man, you are you serious? >> Oh, like you know it. >> I know what it is. 2 + 2. >> 2 + 2. >> 2 + 2. >> Yes. >> Okay. >> Justin, you have to solve it otherwise he's going to get upset. I'm trying. I Relax. Relax, guys. Don't worry. Don't worry. I got a secret weapon. I got a secret weapon. I got I got Lanky, bro. I stuck Lanky Bot in, bro. Oh, Lanky Bot did math. I got my own calculator right here, bro. >> What in the world? >> Don't worry, Lanky Botby. >> 2 + 2 is four. It's four. It's definitely four. It's definitely four. It's definitely four. It's four. I got the answer. I got the answer. I got the answer. >> Four. I got it. Did I get it right? >> Very good. >> Wow. Okay, I'm very proud of you. >> Let's go. Let's go. >> Next question. Okay, >> Adam, we're here for you, man. You need to be doing something. >> Your turn. >> Okay. Okay. Okay. Okay. Okay. >> All right. Mr. Broccoli. >> You got a broccoli haircut. >> Three. >> Plus. >> This is out of my league. I don't know. >> Three. >> Okay. Three. Three. Can I please have that math thing, Mr. Teacher? >> Oh my goodness. >> Is that Is that Skittles? Can I have one? >> No, it's not Skittles. Purple head. >> Please, Mr. Boot Camp. Thank you. Okay. >> You have 30 seconds. >> 30 seconds. Okay, here we go. >> 3 plus three. I'm not helping you. Can't use Ly. >> 3 + 3 1 2 3 + 3. >> How is that going to help you? >> How is that going to help you? >> Three. >> And then it's two of these. So it's two. >> What? Dude, we're going to be here forever. We're going to be here forever. Now he's crying. Are you serious? >> He needs to change his diabetes. >> No, I don't. >> Are you a little baby? >> No. Yes. Yes. I'm not confirmed. You're a baby. You're confirmed. I'm not a baby. How do your parents put up with you? What is that? >> Well, this is the brand new Foxy Mystery Snack Box. Wait, I think I can use this to help me answer. >> Okay, give it a try. >> Okay, I'm going to count the sprinkles on this. So, it's 1 2 3 + 1 2 3. So, that's 1 2 3 4 5 6. It's six. It's six. I knew that. >> Yes. W Let's go, >> guys. We're literally >> I am very proud of you. >> We're literally only here for Adam. I'm here because Adam's here. I shouldn't even be here >> at this point. You guys are going to make Rocket Scientist jealous. >> Oh, Rocky. Rocky scientist. >> Guys, I got you Rocky. >> I got Rocky. I got Rocky in here, too. Check this out. Hey, guys. Check this out. I actually stuck in all the plushies. It's a school, guys. >> Let's go. I gota see the boy. I got Oh, Rocky. Rocky. It's time for Rocky Science. Rocky's ready for Rocky Science. Let's go. This is going to rock. >> What did I get myself into? >> Dude, this is going to be awesome. We're literally all here for Adam cuz Adam needs education. All right. >> Okay. What is the last math question? >> Final math question. >> The last math question. Okay. All right. >> I'm ready. >> We're going to get really, really tough here. Okay. >> Okay. Okay. >> All right. Okay. >> First one to answer gets to go to lunch. >> I'm ready. I'm ready. I'm ready. I'm doing it. I'm doing it. >> Whoever gets it wrong gets detention. >> Detention. No. No. No. No. No. Okay. It won't be me. Let's go. Let's go. Get it. Let's go. >> Which will include the ruler. >> It's so loud. >> No, no, no, no, no, no. I'm going to get this right. Let's go. >> All right. Here we go. I want you to take your time. >> I'm ready. >> This is the hardest one of the day. >> Okay. >> What are you drinking? You're drinking milk. That's cheating. I'm ready. >> One. >> Yeah. >> Uh-huh. >> Plus. >> One plus. >> Oh, that's not fair. You can't do that. >> What is that? >> 1 equals what? >> I had 1 plus 1. I knew that one. Oh yeah, I know. I'm I don't know it. Check this out. I don't Hey, hey, teacher. Teacher. Uh, open this. I got I got candy for you. Cat says we can do it here. Open this. >> I don't eat candy, but >> Open it. Open it. Open it. Open it. Open it. Open it. It's empty. It's empty. Check this out. >> It's empty. >> Yeah. Open it. Open it. Open it. Open it. >> Nothing's in here. >> Yeah. Uh-oh. What in the world? Got him. We got him. We did it. >> Oh, really? >> What is this? >> Uh, that's Sticky. He's our friend. He says it stick together. He's awesome. >> How you doing, Sticky? >> Yeah. See, he loves Sticky. Everyone loves Sticky again. >> He got a little smile on his face. >> He does. See, he's a very happy stick. I got it. I got it. I got it. I got it. I got it. By the way, 1 + 1 + 1 equals 3. I used the diversion distraction technique and I got it. Are you serious? What did you have? Did I even get close? It doesn't equal milk. >> I don't know the answer. How did you cheated? >> I didn't cheat. You must have cheated. >> Oh, wow. >> You must have crazy, bro. >> You get to go to lunch. >> Go. >> Let's go. >> Sit down. >> Sit down, bro. Are you serious? >> Hold on. Wait a minute. Huh? What is this on the ground? >> That's Thick Shark. He's awesome. He likes pizza. He wants to go to lunch. >> This is who? >> Thick Shark. >> Thick Shark. >> Yeah, he's a thick shark. >> He's super thick. >> Yeah, he likes lunch. Is it time for pizza? >> He's really soft. >> Yeah, pretty nice. Okay, good. >> Hi, buddy. >> Yeah, >> dude. See, everyone loves the plushies, bro. Everyone loves the plushies. And everyone knows Adam needs to go to school, bro. >> I'm going to put him over on this desk. >> Okay, thank you. >> Because he needs some serious help. >> True, you do. Big shark will help you. Thanks, Big. All right, don't worry. We'll go to the next subject. Adam, you can you can do better. Okay, what's next, Mr. Boot Camp? >> Okay, Justin, nice job getting the math correct. >> Let's go. So now you can take a short break. >> Let's go. >> Right here in your seat. >> Nice. >> While um Adam >> Yeah. >> you get to do spelling. >> Oh, come on. All right. Fine. >> I stole my iPad back, guys. I'm literally watching like go. I'm watching like go in class. Yo yo yo. >> I would like for you to come up here and spell your name on the board using the letters. >> Oh, that's easy. That's easy. So I don't have to spell my name. >> I don't got to spell his name. That's >> This is a This is a spelling test. spelling. Okay. >> How do you spell your first name? >> Spell his own name. >> Adam. Okay. So, it's a A and then it's a A D. >> Guys, everyone knows Adam can't spell as a name. Come on. >> And then it's a >> and then it's M. And that spells Adam. Wrong. >> We're going to be here. What do you mean? That's not my name. >> That's not how you spell it, bro. >> This is not how you spell your name. >> That's not how you spell it, bro. Confirm. What do you mean? Wait, are you serious? >> Why are you moving the A? >> This is not how you spell your name. >> What? Oh, come on. What? >> Oh, come on. >> That's how you spell your name. >> That's not true. No truth. Confirm. Confirm. It's not. It's Adam. Dope. Are you Mr. Boot Camp? Hey, he's using an iPad in class. Are you going to snitch? Are you serious? I'm watching Ladybug Go having a snack. Are you serious? >> What is this? >> Ladybugs go. It's the characters are going on adventures. It's awesome. >> Oh, this is actually pretty cool. >> That's what I'm talking about, dude. >> He like Ladybugs Go. You want You want chips? You want chips? No, >> I'm okay. >> What? >> Wait a minute. How'd you get chips in here? >> He said lunch time. >> No, I said you could take a break. >> Get some chips. >> Put them here for later. >> Now I'm going to have to confiscate this. >> What? >> Again? me. >> You can't even spell your own name. What are you laughing at? That's not my name. >> You're going to have to sit out. >> Sit out. >> If you had to spell cat, you'd probably get that wrong. >> True. You cannot spell cat. >> Can't spell dog eye. >> True. >> This is funny. >> What are you laughing at? >> Nothing. >> Hey, Justin. >> What in the world? >> I'm not drawing on the desk. >> I'm dry. I'm dry. I'm dry. >> Drawing on the desk. Mr. Boogie. Mr. Boogie. >> Yo, you just You just cattled on me, huh? That's it. >> I'm drawing Foxy. I'm drawing Foxy. >> Everyone likes Foxy. >> Stop. >> It's Foxy. >> Finish the drawing. Look at my drawing. That's pretty good. >> It's pretty good. >> Then look at this. >> Huh? >> What? Hey, he's breaking my Nintendo Switch. Bro, >> you like the drawing? Everyone likes Foxy. >> It's pretty cute. >> Yeah, it's pretty good. Pretty good. >> All right. >> See? See? You can't get mad at that. >> Maybe we should have a drawing class. >> Oh, art class. Art class. Okay. >> Do you like his drawing? >> That's pretty I like this draw. However, since you got your name misspelled, you How are you laughing? The only reason we're here is cuz you can't do school. I Every 1 plus 1 plus 1 equals male. I'm here cuz of you. >> I'm trying my best, Justin. >> You know my brain is rotting. That's true. Adam has brain rot. >> Whatever. I was watching Ladybug go. Stop drawing on the desk, man. You're going to get us in trouble. Okay, okay, okay. And you're sneaking food in class. Teacher, did we pass spelling? I'm ready for the next class. I want to go to recess, Mr. Boot Camp. >> I'm ready to go. I'm ready to go to recess. >> We're not doing that, though. We We got We got work to do. Okay. >> What are you doing with your luggage? >> Check this out. I brought um two copies of the Lucky Box adventure book. This is pretty awesome. >> Oh, I like this book. >> Yeah, it's See, cuz we're doing spelling reading class, right? We can read this book. We can't an adventure. >> Let's turn to page three. >> Okay, >> you're going to start. Okay, >> you read the first line. >> Okay, the first line is Justin ate six donuts and Foxy ate six donuts. See, I can read. I can read, bro. >> Your turn. >> Yeah, game. >> Take it from there. >> That's insane. But >> this is not a foreign language class. >> I don't know how to read. I just look at the pictures. >> Be glad it's not a popup book. A >> Oh my goodness. >> He's going to start crying, dude. He's going to start crying. >> Okay, hold on. Don't cry. Don't cry. Don't cry. Don't cry. >> I don't have any Kleenex here. More diapers. >> No, true. I love diap, man. >> I'm not going to cry. >> No, let's do this. I want you both to take a break. Take some lunch. It's okay. It's okay. >> Okay. Okay. >> You keep trying. I'm going to get you more diapers. >> He do he do be needing them though. >> We're going to take a break and you go to lunch. >> Okay. >> Before you go to lunch, you need to clean off this desk. >> Okay. Okay. I'll clean it. I promise. I promise. Wait, that's permanent. >> No, I'm I'll clean it. I'll clean it. I'll clean it. Okay, I got it. >> I'm going to go enjoy my lunch. You two have 20 minutes. >> 20 minutes? >> That's it. >> It's not enough for lunch. >> I didn't say recess. I said lunch. >> Okay. Okay. Okay. Okay. >> Enjoy your lunch. Behave yourselves. Now I'm taking the iPad so I can watch the rest of the show. >> Oh, okay. Well, he's going to watch Lucky Box Go on the iPad. >> Man, that was lunch, bro. >> See, he likes Lucky Box Go. Listen, bro. This is so crazy. I got my Foxy Lunch Box, though. >> My brain hurts, dude. That was way too much fun. >> Dude, you literally spelled That's how you spell Adam. Everyone knows a D E M. >> My name is Adam, dude. It's not Adam. What? >> I'm I'm going to have my lunch. I'm tired of this. I brought candy. Do you have lunch? You What? You got mail? >> All I have is mail. This is crazy because I'm literally here because your mom sent you to boot camp. You need to try harder, buddy. Foxy, we all believe in you. Don't give up. Don't give up. >> I'm not going to give up. >> It is the world's strictest school, though. You're getting a little bit scared, bro. >> Isn't it? It's just harder than I thought it was going to be. >> Don't Don't cry, buddy. Don't cry. >> But I know that um after lunch, it's normally PE. >> You want some chocolate? >> Yeah. Are you serious? >> You want some? >> Well, you just licked it. >> You want some? >> What? >> No, I don't want any. I'm not going to feed it to you. Stop. You just took it anyways. Give it back. No. E, man. Who eats them like that? What's wrong with you, Adam? We're literally all here for Adam. This is crazy. Okay, we got 20 minutes for lunch. That's not even enough time for me to make hot pockets. So, I'm just going to sit here. When the teacher gets back, what is it? Time for PE. >> It's time for PE class. >> But remember, Adam, we got to be good. If we're good at school, your mom said she'd give us a giant mystery surprise. We got to be good. Oh, that's true. >> We got to be good. All right, I'll clean this up. I'll clean this up. Let's try and be good. Let's try and be good during PE, bro. >> You're right. I'll help you clean. >> Yeah, I got it. I got it. >> It was permanent marker. I'm not doing it. All right, guys. Listen, we'll be good. We'll be good. Everyone, try hard at school. School's important. >> Let's go. Who's that? >> All right, lunch is over. >> Lunch is over. Okay, >> now it's time to get changed cuz we're going outside for a little PE physical education. >> What? PE class. Okay, we got >> change your clothes >> and let's get outside. >> Okay. >> Wait, PE class? I didn't bring any PE clothes. You didn't bring gym clothes, bro. Everyone knows you need gym clothes, bro. Look, he got changed. No, I don't have anything, dude. I got my >> Then you get to go with your diapers. >> I got to say that. >> I got my Super Foxy uh t-shirt. This has a built-in cape. It's pretty awesome. >> That's so sick, man. >> You didn't bring gym clothes. How are you going to go to PE with no change of clothes? Do you have anything extra I can wear? >> Nah, bro. >> You're going to be all smelly, bro. >> All right. All right. >> All right. Let's go to pee. Let's go. >> Let's go. Move it. Move it. Move it. >> Our first sport today is basketball. >> Oh, nice. I can dunk. >> You can? >> Yeah. >> Yeah. Well, we're not talking about in the swimming pool. Okay. Why do you have a backpack on? >> Well, >> is that some kind of jetpack so you can jump higher? >> No, I I'll take it off. >> Okay. All right. Let's go. >> What are the teams? Yeah. >> You two versus me. >> Easy. >> 2 v one. Easy, bro. We're going to destroy you. >> Easy, bro. >> All right. If we start, you start. >> Start. Okay. Easy. Easy. >> Foxy, you you be defense. Foxy is going to play, too. >> I'll pass it to you. Okay. Let's go over there. >> Yeah. Yeah. >> Pass it. Pass it. I'm open. I'm >> Are you serious? >> Mr. He has it. Now he has it. Stop. Mr. >> Oh, you got one. >> Junk. What are you doing? You got to double the ball. Junk pass. Junk pass the ball. Are you serious? Are you serious? >> Are you serious, bro? >> Are you serious, bro? I need to score. Now it's one to zero. >> You know what? >> Oh, Foxy. Foxy turn. All right, Foxy. Watch this. Adam, pull up your diaper. >> Wait a minute. >> Foxy, score. >> What' you get? Let's go. Let's go. >> There you go. Huh? Hey, >> easy. >> Adam, you got to score, man. Foxy, score. Come on. Come on. Come on. One v one. My mom's betraying me. I can do it. >> Yeah. No, he's going to cry again. All right. Here. I got it. Check this out. I don't I learned this. Okay. Dunk it. Justin. Justin, dunk the ball. Justin, what are you doing? >> Justin, what are you doing? >> What in the world? That cape isn't helping you today, >> Justin. Good idea. Good idea. Bring it in. Bring it. >> I got a secret. I got a secret weapon. I got I got a trampoline, dude. Deploy trampoline. Okay, deploy trampoline. I'm going to dunk it. Dunk. Go dunk. Now dunk it. >> What are you doing? >> I was dunking, dude. I had no I don't know. The rim move. The rim move. >> Okay, hold on. Time out. >> Dude, how did you miss that shot, man? You >> You said you always make those. >> It moved. The The hoop moved. Oh, the hoop move. The hoop move. What? It grow higher. The hoop moves. >> It wasn't his fault. >> Listen, listen, listen. Foxy scored once. We should get a gold star for that. Can we move to the next sport? >> You know what? I'll give the gold star to Foxy. >> Let's go. That counts. That counts. >> Good job, by the way. >> Yeah. Yeah. >> I like Foxy. >> Yeah. >> Time for the next sport. >> Okay, that was all. >> What? Foxy scored. >> This might be a little bit better for you. This is dodgeball. Oh, >> I throw the ball at you. You throw it at me. Whoever gets hit is out. >> Oh, easy. Easy. Okay. 2v1. 2v1. >> Absolutely. >> Easy. Okay. >> All right. Let's go. Let's go. You're on. >> All right. And Foxy has to sit out. >> Foxy. Okay. Okay. Okay. Bye. Bye. Bye, Foxy. >> All right. Foxy's going to sit out. Foxy be referee, bro. >> Okay. You ready? >> I'm ready, bro. >> Okay. Let us know when it starts. >> 1 2 3 go. >> Pick it up, man. Get right back to me. >> No, >> I win. >> No, it's not over until it's over. >> Wait a minute. >> It's not over. I'm cheating. I'm >> I win. >> What are you doing, Jackson? >> Throw the ball at each other. >> You made me drop my ball. >> It's not my fault. >> Hold on. Stop. >> Finally. Now you two get up off the ground. >> Rematch. That didn't count. >> That's easy. >> What do you mean that didn't count? Well, that that was a warm up. We weren't ready. >> Oh, okay. Are you ready for this time? >> I'm warmed up. Yeah. >> 3 2 1 go. >> No, no, no. >> Are you serious? Mr. Boot Camp. >> All right, whatever. What's the next? >> Watch the instant replay. >> Mr. Boot Camp, >> I quit. I'm going home. Where are you going? All right. Next up is T-ball. >> T-ball. Okay. >> It's not that hard. You take the bat, you hit the ball. >> Oh, okay. >> Who wants to go first? >> Uh, Adam. Oh, okay. I'll go first. I'm pretty good at T-ball. You sure? >> Yeah, I'm pretty good. >> You never played this game before? Don't lie. >> Don't hurt yourself. >> Yeah, I won't. I won't. >> So, you all you have to do is hit it. >> All you have to do is hit it. >> This is easy, man. >> Be careful. Be careful. Be careful. Are you >> Do you need a diapy? >> Because Adam needs a diapy confirmed. >> Whatever, man. You doing that? >> I might have an extra diapy. >> Baby Foxy got an extra diapy. Baby Foxy actually in the backpack. Yeah, baby. Baby Foxy, I actually got some apple juice. You want apple juice? >> No, I'm good. >> All right, it's mine. >> I'll try some later. >> You want some apple juice? >> Yeah. Ah, take it that. >> You know what? If you're so good, you hit it. >> Yeah. >> I don't even need this thing, man. >> Whatever, man. >> I don't even need this thing, man. Check this out. >> All right. One. You ready? >> Check this out. >> Here we go. One, >> two. Oh, three. >> Super Foxy 360. >> Oh my goodness. >> I hit it. No, you missed the ball. >> You missed the ball. >> I hit it. >> You make me want to retire from teaching. >> What? >> Oh, come on. >> Did we pass? I hit it. I hit something. Okay. You know what? We have one more sport to try. >> Soccer. >> Now we're on to soccer. >> Okay. >> Okay. >> Yeah. Easy. >> You can use your feet. >> Yeah. >> I'm going to play goal. You have to kick it past me and hit the gate to score. >> Oh, this is the goal. That's the goal. That's the goal. Okay. That's easy. We just have to hit the gate. >> You just have to get it by me. >> Okay. I get it. I'm the goalie. >> Easy. Easy. Easy. >> Let's give it a try. >> Let's go. All right. Go. Okay. Pass it to me. >> No. Pass it back. Pass it back. >> What in the world? What are you doing? I bounced it back. What are you doing? >> Kick it. >> You got to shoot. >> Kick it. >> Really? >> Are you serious? >> Okay, try this again. >> Okay. Okay. >> Come on, Adam. We We need to We need to do good. Your mom said you give us mystery prize. We do good in school. >> Kick it. >> I give up. >> Are you serious? Hey, calm down. Hey. Hey, buddy. It's okay. Don't get Don't Don't get Don't get down on yourself. Don't get down on yourself. >> Listen, man. Go get a juice box and a new diaper. >> Yeah. Try. >> All right. Your turn. >> Okay. I got it. I got it. Easy. Easy. >> Why don't you put her down? I'll put Foxy. >> I'll put Foxy Foxy. We can't do it. Okay. >> She She wants to try. >> I'll put Foxy right here. Foxy will be my teammate. Okay. Here we go. Here we go. All right. Here I go. >> Okay. >> Here I go. All right. >> What's that? >> A. You're so cute. >> He's distracted by Foxy. Doesn't it? Doesn't it? Oh, he's distracted. He's distracted. Shoot the ball. Shoot the ball. >> So nice. >> Yeah, boy. >> Let's go. We actually scored, guys. >> Okay. Nice job, gentlemen. Nice job, Adam. Justin, I'm proud of you. >> Thanks. >> PE is over. Let's go inside. >> Cool. Oh, man. Nice. Okay, we finished PE. >> You know what? All said and done, I'm really proud of the both of you. >> Let's go. >> I'm proud of you. >> Let's go. We started off rough, but we had a great finish. >> Yeah. >> Hard work, dedication. You stayed focused. I'm very proud of both of you. So, when you get picked up, we have a couple things. >> No, wait. For report card time. Here we go. >> Day one. A+. >> Yo, Adam got a A+. Nice, buddy. A for Adam. Let's go. >> A for Adam. >> And A+ for you. >> Let's go. >> Nice. We both got A's. >> We actually got A+es. It's because we never gave up, buddy. Always try your best, dude. We did it. >> When you keep going, you keep moving forward, you keep working at it, you'll do fantastic. >> Come on up here. I got something else for >> Oh, okay. Okay. >> All right. You ready? Come on up here. >> What do we have, Mr. Boot Camp? What is this? >> We're doing such a good job today. You're going to get a medal that says great job. >> No way. Participation medals. We love these. >> Wow. >> Put it on, dude. Oh wow. >> Let's go, buddy. Let's go. That's mom. Proud of you. >> Yeah, we can show our mom, dude. We can show our mom, bro. >> She's going to be so proud of you. >> Hold on. Oh, there's a third one. >> No way. Foxy gets a medal, Foxy. Let's go, >> Foxy. I want to dedicate this wood to all the viewers. You're awesome. Good job. Let's go, bro. Thanks so much for watching, Lanky Box. >> All right, guys. Have a great day. Good job. We'll see you tomorrow. Good job. >> Okay. Our mom is going to pick us up. Can we stay here after school? >> Yes, you can. >> Nap time. Okay. >> Yes, you can. All right. >> Good job. >> Thank you. I'll see you later, Mr. Boot Camp. All right. Bye. Wow, Adam, that was awesome. I can't believe we actually got A+es and medals. You know, Adam, I'm proud of you. We tried really hard. Boot camp went pretty good. But guys, check this out. It's actually now nap time. And I put my iPad on this TV I found in school, bro. So, we can literally just watch Lanky Box Go until our mom picks us up, bro. No way. You got ladybugs. Go on the TV. >> Yeah, it's awesome, guys. I I It's from my iPad. I put it here. I'm going to watch it. >> I'm tired from all the sports we played. I'm going to take a nap. >> I'm going to watch TV. Look, it's sticky. >> You going to sleep already? Oh, you asleep already? Lucky Box Go is so awesome. We just got to hang out in school after school with Lucky Box Go on the TV. Remember that one time your mom said she was going to pick us up after school and we stayed here for like a week cuz she forgot? >> Oh yeah, that was the best time ever right there. We're literally It's literally Ghosty and Rocky. >> Wow. >> Foxy Lies, my friends. >> That's awesome. So, we went to school and our brains got smarter and then we worked out in PE and then we got stronger and now we get to have fun. >> I'm watching Lucky Box Go. >> Oh, okay. Okay. Justin, you're going to be too close to the TV, man. >> I'm not. Your mom's not even here. >> Yeah, but remember what my mom said. You have to stay back here to watch it. Justin, that's too close. You're going to hurt your eyes. Justin, >> I'm watching Foxy. >> You're too close. >> I'm watching Foxy. Yeah, you can watch with Bani, too. There's bananas. >> Ban is so cool. >> Okay, I'm going to take a nap. >> Everyone, make sure you look up. [Music] [Applause] >> Oh, it's singing Foxy. >> It's singing Foxy. Everyone, make sure you go on YouTube and look up Lanky Box Go. It's an awesome channel. Basically, it's what the plushies do. They go on adventures at Plushy Land. And this is what it is. I'm playing it from my iPad. >> Yeah, it's really cool. Foxy unboxing all the plushies are in there. Dude, boot camp is not so bad. That was pretty good. >> Yeah. And I think our mom's going to be here in a little bit, too. >> Well, she said she's going to pick us up. Hopefully, she doesn't forget this time. >> Yeah. And I got the medal. >> I did, too. So did Foxy. Foxy did pretty good. >> Our mom's going to be so proud of us, >> dude. Our Wait, she said she's going to get us a mystery prize, bro. >> Wait, what do you think the prize might be? >> I have no idea. It's going to be awesome. What is that? Oh, this is the giant Foxy mystery snack box at Walmart Target. >> Yeah. What if she gets us? >> Open this. Open it. >> Okay. Okay. Okay. Open. >> Open it. So, this has the banana in it and the Foxy thing. >> Nice. There's Foxy. >> Okay, let's open it. >> Open it. Open it. Open it. Open it. >> And I get to wear this, too. >> No, it's mine. >> No, I want to wear it. I want to wear it. It's mine. >> No. Come on, man. >> Oh. Wo. Look at all this stuff in here, dude. Nice. Look at all this stuff. Where's the Where's the boxy phone? There it is. I got it. Nice. Dude, this is banani. This is banani. I got it. I got a boxy phone. Oh my god. If you pull the thing on the back, it turns it on. I'm Milky. Let's go. I got a phone. I'm watching Lucky Box go. It's lit. Look at Foxy. Foxy, you get to me. A wa It's Foxy. >> It's Foxy. This is so sweet, man. You know what? School is awesome. Everyone try hard at school. Always do your best cuz it's pretty awesome. This is a pretty good day. >> Yeah, guys. This is the best. Wait, I think our mom's here. >> Hey, boys. What are you doing? Why are the lights all off? >> Oh, because everyone went home and they they said we could just stay here and have nap time uh until you came and pick us up. Yeah, but look, mom, we got A+. Go. >> We actually got A+es. We got also medals. We got participation medals. We Adam Adam got a bunch of these. Yeah. >> Great job. I'm so impressed. >> Pretty good. Now we're just watching Linky Box go on the TV in the school. It's pretty awesome. >> I love it. Well, now you get to have a big surprise. >> Yo, mystery surprise. Let's go. Let's go. >> All right, boys. This is the Lanky Box Tesla Cybertruck. >> Yo, this is crazy. Our mom actually got a Lanky Box Tesla Cybertruck. It's the same color. It's the same orange as like Foxy and Foxy the cardboard. This is so crazy. We have the coolest mom of all time, by the way. Wait. So, we're going to get to go to a giant mystery prize in this Tesla. >> That is correct. Cyber. >> Where are we going? Where are we going? >> We're going to go shopping and we're going through a drive-thru. >> Let's go right now. >> You've earned it. Let's get Okay, let's get in. Get in before you change your mind. Go, go, go, go, go, go, go. >> All right, boys. We made it to Walmart. No way. >> Our mom took us to Walmart. Let's go. >> In the Cyber Truck. Dude, >> it is so crazy. I just want to say this, by the way, you have Max Mom Aura right now in this Tesla Cyber Truck. It's crazy, bro. >> I appreciate that. >> Yeah, this is insane. Wait, so we are at Walmart because we did a good job at school. Is that why we're here? >> That is correct. A+es deserves Walmart. >> Let's go, dude. WW mom, what are you going to get us at Walmart? >> I'm going to go get some Lanky Box merch. Oh, >> yep. But I'm going to have you two stay in the car. >> Oh, will you guys stay here? >> Yeah, you guys have to stay here because you know you've had some bad behavior in Walmart in the past. So, >> I did the worm. >> I was It was Walmart. I was doing the worm on the ground. I don't know why they kicked us out that time. It wasn't my fault. >> Well, just to be safe. You stay in here and I'm going to go into Walmart and do some shopping. >> Okay. Wait. So, you're going to go to Walmart and get us merch and what else? >> Snacks. >> Score. Score. Score. >> All right. See you boys later. Love you. >> Don't get into any trouble. >> We won't. We won't. We won't. We won't stop. We won't. We won't. Okay. >> Bye, mom. You're the best. >> Wow. The best. We're going to get merch and poop. Our mom is aura farming, bro. >> I know. Our mom has Max Aura. >> This is so sick. >> Don't touch me, dude. >> Dude, we should have told her what >> to get you diapers, bro. >> No, I don't need those. >> Wait, I don't get him some diapies. >> This is my side. I don't wear diapers. >> Justin, I don't wear diapers, >> dude. Bro, the Mr. Boot Camp literally said you did, bro. >> Yeah, but he's a liar. >> Hey, Aid to be good. You were good in school. Why you misbehaving now? You're right. Why you acting up, bro? >> Dude, just stay on your side of the side. I'm not even close to >> Stop touching me. I'm not, bro. >> I'm not I'm not Justin. Justin, I'm not touching you. >> Do not do this again. Stop. >> You did that. You did that, man. >> You know what, man? Hey there. >> Are you serious? >> What? >> Are you serious? >> I wonder how our mom's doing. >> Man, I hope our mom's doing good. We have the best mom ever, bro. >> Yeah, she's the best. >> I'm at Walmart ready to check out the new Lanky Box merch. Look at this. It is the giant Foxy mystery snack box. And I've heard this is extra cool because it has the Foxy phone and it has Banny. I haven't seen either of these guys yet, so I have to buy this for sure. Look at this. This is new, too. Oo, the mystery figure. Ooh, I wonder who I'm going to get. Well, that'll be a surprise. Okay, next up, scented mystery plushy. Four different scents that you could get. Looks like Foxy, smells like a donut. This one smells like vanilla marshmallow. Boxy. And then we have thick shark, which smells like m cotton candy. And we have ghosty. Ghosty glows in the dark. Lanky buck mystery egg. I definitely need one of these, too. So, let's see. It includes two mystery figures, one micro figure, one micro vehicle, and three stickers. I think Adam and Justin will approve. Look what I found. Milky and Cyborg Foxy. Definitely a win. They're both going in the car. Look what we have here. The singing Foxy plushy. This one I hear has Max Aura, so she's going in the car. Now that we have all of this awesome merch, we're going to go get some food and snacks for the party later. Milky milk. Milky milk. Milky milk. Milk. I need to get some from Adam. He loves his meal. Time to get some donuts for Foxy. She is going to love these. And because there's the new Lanky Box plushy banana, I'm going to get some bananas. I've got everything I need. Time to check on the boys. I hope they're behaving. All right, boys. I am back with merch. >> Wa! She got the Foxy Chi mystery snack box. >> That's right. And the mystery figure box. >> Wow. Thanks, Mom. >> Yo, these are brand new. >> Wait, what else did you get us? >> I also got some bananas for bananas. >> Bananas inside of here, too. The plushy. These are bananas for banana. >> You better believe it. >> What else? >> And I couldn't forget milk. >> Milky milk. Milky milk. Milky. Milky milk. >> She got Adam milk. Be careful. Don't spill it in the mom. Tesla cyber truck. Hey yo. >> Yeah. Okay. This is crazy. Wait, Mom. You said you had another giant mystery surprise for us. What is that? >> We are going to go get some donuts. >> Oh, donuts. Donuts. Donuts. Donuts. This is crazy, guys. The donuts will actually match this cuz it looks like Foxy with a bunch of sprinkled donuts on her head. Time to get donuts. Let's go. >> All right, boys. We're here and we're getting donuts. Yo, this is crazy. We went to Walmart and then Target and now we're getting donuts. It's the greatest day of all time. Let's go, Mom. This is why we try hard in school. This is why I You need to get education, guys. We do get in school. Our mom gets us crazy surprise. Are we going to go through the drive-thru of a donut store? >> We sure are in the Cybert truck. Let's go. Let's go. This is so crazy. We're going through a drive-thru of a donut store. I didn't even know they had those. This is going to be awesome. Our mom's going to get us a dozen donuts. >> Yo, this is going to be awesome. Yeah, we're going to go nuts for donuts. >> This is going to be so cool. This is the greatest day of all time. And it's all because we try hard at school. I'm proud of you, buddy. You did really good in school. Mr. Boot Camp only laughed at us a few times. >> Yeah. Thanks so much, Mom. You're the best. >> You're so welcome. You boys have earned it. >> Nice. Okay, we're pulling up to the drive-thru. What are we going to get? What are we going to get? What are we going to get? >> Let's see what's on the menu. >> Wo, they got a lot of donuts. I want um pink sprinkle for Foxy. >> Wow, they have so many options. Blue sprinkle. This is not an easy decision. >> Blue sprinkle. Blue sprinkle. Mom, get the fudgy wedgie for me. >> Fudgy wgie. Fudgy wgie. >> I'm sorry. What's going on? Fudgy wyg. >> We're out of fudgy. What fun? But yes, now we're going. We're doing the drive. >> Okay, cool. Well, >> okay. We're out of fudge. Blue rainbow. Blue rainbow ring. >> I'm out of shorties. And that's about it, actually. >> Oh, okay. All right. We're going to get a dozen. >> Blue rainbow. Blue rainbow. >> Blue rainbow ring. >> How many? >> Uh, three. Three. Three. >> Three blue rainbow. >> Three of the pink ones. Pink. >> Okay. >> Pink rainbow. Pink rainbow. >> Rainbow ring. >> All right. >> And then um and then um the tutti frutti. >> That's what I was going to suggest. Okay. >> So, we're up to nine. >> Glaze. Glaze. Glaze. Glaze. Just normal. >> Three normal glazed donuts. Please. >> I got three blue rainbow rings. Three pink rainbow rings. >> Stop hitting my thing. >> Uh three rainbow rings, three pink rings, three tutti frutties, and three glaze. Sh. You're going to get us in trouble. You are tutti frutti. >> All right. Awesome. Thank you. >> You're in trouble. >> How am I in trouble, bro? >> You were kicking my seat. I was not supposed to do that. >> Are you serious, bro? >> I'm literally buying you donuts right now. >> For the record, thanks. Thanks. For the record, I was behaving. >> Yeah, right. >> I know. You're going to get a little Are you serious, bro? >> I want the tutti frutti. >> Oh my goodness. >> I'm going to have to get out of the car to collect the donuts, >> guys. Literally, you ordered tutti frutti, bro. You tooting, bro. >> Well, cuz they were out of they were out of the fudgy wy cuz you're tooting. >> I'm not tooting. >> Why did you order tutti frutti? >> Look, I wanted to get the fudgy wgie and and they didn't have them, so I had to get the tutti frutti. >> So ridiculous. I I got the blue one to match this box. >> Oh, the Foxy Mystery snack box. >> Yeah, it's going to be awesome, dude. >> Thank you so much, Mom. >> You're so welcome. >> We We appreciate it, Adam. This is really great. It's going to go good with the milky milky milky milky milk. We can listen to the donut song and the milk song. >> That's a great idea. >> Oh, here we go. Thank you. >> Donuts have arrived. >> Let's go. >> Oh, look. They match. They match. They match. They match. They match. They match. >> This is so They match. They match. They match. They match. >> This is so sick. >> The greatest day of my life, by the way. Greatest day of my life, by the way. Hands off my donuts. No. Hands off my donuts. I want one of the blue ones. No, you don't. You You ordered the the fudgy wedgies. Get off. Get off. It's mine. It's mine. Meies. This is so sick. Let's go home and eat all these. >> Yeah. Let's go. >> Are you boys ready for a Lanky Box party? >> Yeah. This is so sick. Look at these donuts, guys. We literally have the blue ones to match the Foxy sprinkles on the mystery box. Bro, look at how crazy this is, guys. I'm going to start eating these. Can I have one? Can I have one? Can I have one? Yes, you can. I want this one. >> Oh, let's go. She's got the tutti frutti. How is it, dude? >> It's so good. >> Guys, make sure to get the snack box at Walmart or Target. >> I got to open it. Open it. >> I want to open it with my mom. Cuz guys, in the snack box there's banani and a Foxy phone. Give me banana. You're not allowed to have banana. You ate banana. So good, guys. There's banana. Banana is a new plushie. Look, there's Foxy. Yeah, you guys can actually wear this on your head, too, and become like boxy. Guys, this is so sick. Our mom has not seen Our mom has not seen the boxy mystery shack box. We're going to open it for the first time ever. Right here. Okay, here we go, guys. What's going to be in here? Where's the scissors, bro? Where's my scissors, bro? Okay, Adam here. Here you go. I got scissors. Go. Okay, here we go. Open it. Open it. Wa! Look at all this stuff. Mom, you got it in the donut. >> Wait, I think this is the phone. I think this is the phone. Okay, we got a boxing mystery phone. It's pretty awesome, guys. Okay, you go over this one. This one. >> Yeah. >> What do we Let's go. Hey, see. Keep banning away from you. Try to eat banan stop it. Stop it. Stop being my little >> Oh, it's the Foxy phone. Pretty awesome. Check it out, Mom. So, if you press any of these buttons here, it'll make a sound. So, who do you want to press? >> Um, um, thick shark. >> Thick Shark. >> I'm thick shark. Yeah. >> Wo. And there's even a secret voice lines in here. So, watch what happens if I push Adam and Justin. >> I'm testing Daddy X. >> It's a secret voice line in the phone. Pretty cool, huh? >> Very cool. Good. A giant mystery snack boxy. Pretty cool, guys. You can put this on your head. You're a donut head, bro. Exactly. Wow. I'm going to drink some milk. I'm going to eat more of this cuz guys, literally, these are the same color. These are, guys, get donuts and get the box snack box. Everything in here is snack themed. Stop drinking so much milk, dude. Stop it. These are so good. This one is delicious, by the way. Oh, which one is that? So good, guys. I got a pink one. >> Mine has a tutti frutti one. >> Isn't that cereal all over it? You love it. >> I'm going to try the tutti frutti. >> Oh my. >> The tutti frutti one's good. >> I bet I could one by challenge both these. Just so you know, that's a bad idea. >> Dude, I can do this. Foxy said you doubt Jessie and his donut eating ability. Are you serious? >> If you do, I'll give you the box. You won my challenge. >> By going to be embarrassed. >> Oh no. More, more, more, more. >> Are you going to etiquette class? >> Are you proud of Justin? >> I'm going in this particular moment. >> Justin, I am. Give me a prize. Give me a prize. >> Okay. You have the box. >> That was so sick. Mom, this is a great day of all time. It really is. >> Thank you. We tried really hard in school. We didn't know if mystery prize would be this sick. So guys, >> you earned it. >> Make sure to go to Walmart and Target, get the brand new Foxy mystery box. And also, there's brand new merch, too, like new figures, sending squishies. There's so much cool stuff. So, make sure to go to Walmart and Target, guys. >> Don't forget to pick up Little Bani. She is so cute. >> You know what? I think it's time for a donut dance party. N [Music] you say just call me",
    "start_time": 0.24,
    "end_time": 2660.4
}