{
    "video_id": "DM3hpzCAWGQ",
    "channel_url": "@lankybox",
    "transcript": "Today we're building the school base in 99 of Forest Roblox. We're going to build classrooms, a cafeteria, a gym with a full basketball hoop, and even bathrooms in this school. With all these rooms, the missing people can go to school in Night in the Forest Roblox. We're going to unlock a top secret school ending in this game where we learn more about the origin story of the deer, and it was awesome. Are you ready to see the best school base ever in 99 in the Forest with a lunch cafeteria, gym, classrooms, and even working toilet? Let's go. [Music] Today we are building the school base in Roblox 99 Ice in a Forest Roblox. Guys, we'll put a clip on screen of what this is going to look like when it's done. It's going to be crazy. We're going to actually build a school so that all four of the missing people have like a cool place to hang out and learn, guys, because school is super awesome, guys. It's going to be awesome. Yeah. And our school is going to have a cafeteria for lunch. It's going to have a classroom to learn and maybe even a gym. Guys, it's going to be so so so awesome. So guys, I got an idea. Let's like make this right here kind of like the classroom cuz this looks like where a teacher would like write on something. You know what I mean? >> Oh, like the chalkboard. >> Yeah. Yeah. So guys, Adam, your job is just uh light the fire and level up the fire max and then start farming wood and scrap because we're going to need a lot of log walls to make all the walls in this school. >> Oh, that makes sense. That's awesome. And I see Foxy's prepared for school. She got her backpack. >> Guys, we got Lanky Box backpacks right here. Look at how awesome this is at Walmart and Target, guys. It is so awesome, guys. We are gonna have a lot of fun. It's gonna be Lanky Box School. Foxy says Aiden needs to go back to school. You need to go back to school, bro. >> My mom has been saying I have to go back to school. So, now we're actually going to build the school that I'm going to go to. >> Yeah, it's going to be super awesome. Okay, so Adam, we got to be smart about how we level up the fire. We do need to craft. We got to level up crafting bench, crafting bench, and then get the bofuel. Like, basically, we got to speedrun that. >> Okay, got it. No problem. >> You do that. I'm going to start saving the people right away and exploring because guys, we're going to need a lot of supplies to get done with this challenge, guys. And we heard if we actually unite all four of the missing people and make it past day 999 in a school base, there's a top secret school ending in this game, bro. >> Yeah, we have to build the best school ever and get the school ending. Okay, guys, we're going to try and speedrun. I'm going to look for the rabbit foot because we will need that also. >> All right, that sounds good. Yeah, we got to upgrade with the rabbit foot. >> Okay. Um guys, we're going to we're going to absolutely speedrun this base. It's going to be absolutely crazy. And we're going to get so many rare items. We're even going to go to the volcanic biome and get some rare items there. This is going to be awesome video, guys. Yeah, we love going to school. It's really fun. And then your brain gets smarter. >> I should say don't lie to everyone. Eight of you go to school. >> Yeah, guys. >> You don't go to school, bro. >> So, sometimes I do skip school cuz we're Don't >> Yeah, don't ever do that, though, guys. That's why I'm not very smart. >> Guys, listen. Whatever you do in life, don't be a Adam, bro. >> Yeah, whatever you do, that's not good. >> Don't be a Adam, bro. >> It's not good, guys. Don't do it. >> Okay, I got some scrap. I'll do all the leveling. Okay, we got this. And then, um, we should buy some of this. Okay, we need more scrap for crafting bench three. So guys, we got to level up and then get the bofuel processor. Then we can start putting all the wood into the machine. Ah, okay. Got it. So, just more scrap. Yeah. Okay, now I have the map. This looks like something that might go in uh like a school somewhere, but Oh, like teaching geography or something. Oh, right. Like learning where things are. Yeah, something like that. Guys, I don't really know, though. Uh I I think I'm going to hang on to the map. Actually, I'm not going to use it yet because I think it could be used over here. But we got to expand the fire a lot, >> right? That makes sense. Okay. And now it's night time, guys. It's night time at the school. >> Did you find the rabbit foot yet? >> No, not yet. >> Do it, Adam. You're going to have to level up cuz if you level up, you might get a better axe or a better bag and you'll be really strong. >> All right. True. I got to find a rabbit foot, guys. >> I'm looking too. I'm looking too. I did not get one. Guys, we got to do this because we heard the top secret school ending is crazy. We might even learn new lore about the missing people in the forest. >> Yeah. Yeah. Like maybe the missing people went to school before they got captured in the forest. >> Maybe they were on their way to school when their plane crashed and they arrived there. >> Exactly. >> That's what I'm saying, guys. We're going to learn all that in this video. It's going to be super crazy. >> Yeah. We're going to have a gym, a cafeteria, and even maybe a bathroom. >> Guys, uh we got to build a bathroom because that is where Adam hides at school. >> What? Okay. Yeah, >> that is true. That is true, guys. That is true. >> That's where Adam spends most of his time in school. He just hides in the bathroom. >> Yeah. Anytime our mom gives us a test, like a big spelling test, I just said that I have to go to the bathroom and then I just wait there the whole time. >> She says AWZ the bathroom. It's not school. That's not school, bro. >> But then I don't have to take the test. >> Yeah, but that's how you don't learn anything, guys. >> I know. I know. I shouldn't do that, >> guys. Don't be a Adam. Just whatever you do, don't be aim. >> Yeah, >> it's not good. >> Foxy gets better grades than I do. >> Foxy. >> Guys, Foxy is so lit. Guys, make sure to go to Walmart Target. But also, make sure you subscribe to this channel because Foxy and Boxy and all the friends are going on some crazy adventures, guys. It's coming very soon. Okay, >> you got to subscribe to Lanky Box, >> guys. It's going to be awesome. Foxy, it's time to go. Lanky Box, go. Okay, hold on. I got to find Okay, you found one rabbit. We got to find another one, though. >> Oh, one more. >> Hurry up and find one. Don't Don't you need one? >> Yeah. >> Okay, hurry up and find it then, buddy. >> Okay, got you. I thought you had your own. >> No, do it now. >> All right, I'm on it. >> Okay, do it now. >> You can trade for it now. Okay, I'm going to trade and then you got to find your own, too, because you got to level up. All right, >> I didn't get one. I didn't get one either. Okay, >> I found one. >> Okay, nice. Um, let's level up right now. And then Okay. Yep. I got a better axe and I get a better bag. That That's a pretty good upgrade. And I I think Adam, if you level up and you choose the axe, you might get the strong axe. Wait, are you serious? >> I think so. I think you should try it, guys. That's like a myth people were saying on the internet that is possible. I I think we should put that to the test because it's school. We got to learn anyways, you know. >> Yeah, great idea. I'll try that. I got to get a wolf bell first. >> Oh, wait. Did you already trade in the rabbit? But I did. Yeah, >> you didn't get the axe. >> No, I got the bag. >> Okay, I'll try to see if I can get you a wolf pelt. Okay, because guys, we really got to level up. If Adam can get the strong axe, he will level up very fast. >> That would be sick. Cuz the strong axe chops down trees in one hit. >> Oh, I'm starving. Oh no. Oh no. >> There should be some food back. >> There's carrots. There's carrots. I can eat these carrots. No big deal. >> Hooray. >> No big deal. I'll look for a wolf pelt for you. >> Thanks, man. I got one. >> Okay, nice. See if you can get the axe, guys. This is kind of like a myth. We'll see if Adam can get it right here, bro. Okay, here we go. Okay, let's see Adam's screen when he goes to trade. Can he level up? Cuz he started as a lumberjack. Can he get the red axe right away, bro? >> Please. Get the option. All right, guys. Don't worry. I'm back to chopping trees. No big deal. No big deal. >> All right, no problem. >> Okay, so remember, we got to Don't put them in the fire. Don't put stuff in the fire. Put it here. And then we got to level this up because we got to make this school, guys. We still need more of everything. >> We need more resources. >> We need more of everything right now. >> More supplies. What's your favorite subject in school? My favorite subject in school is lunch. >> Lunch. Yeah. Jonathan's really good at that. Every day at lunchtime, him and Foxy eat a ton of food. >> We We eat and donuts. It's awesome. >> Yeah. It powers up the brain. >> It's super awesome. And then recess. Obviously, Adam's favorite time is nap time or use the bathroom. >> Yeah, mostly nap time. >> Those are the two subjects that Adam is semidecent. Mostly nap time. He drinks a bunch of bail. >> Yeah, I got milk. Milk. And he takes a giant nap. Guys, I got the brand new Lucky Box backpacks. Absolutely swagging on Adam. He doesn't have one of these. >> That does look cool. >> He doesn't have one of these. These are mine. >> Yeah, it's true. I don't. >> It's pretty awesome, huh? >> Yeah, I'm jealous. >> All right. Now, wait. We got to find chairs from around the map, but do not put them in the fire or the shredder because we need these for school. >> Oh, that's true, guys, because people need chairs at the school and we need stuff like desks and everything. >> I'm also finding a bunch of coins because, guys, we will need to work with the furniture trader. Oh, I found a bunch of chairs. Nice, nice, nice. Do not put these in the fire or anything. >> Nope. Even though they're worth a lot of wood, it's not worth it. >> Do not do it. We We need them. We need them. >> Yep. True. >> Yeah. Ha. There's a wolf here. Nice. Okay. There's a treasure chest, guys. I'm looting a lot because we will need all this stuff, guys, to level up and build the best school ever. Foxy says, \"Make sure you try hard in school. Don't be a true.\" >> Yeah. Always get straight A's. >> True, true, guys. Always try hard in school. School's important. >> That's why we're going to boot camp cuz Adam didn't try hard in school, >> right, guys? So, I basically got a bunch of Fs on my report card. >> A He got FS, >> right? Yeah, >> man. >> My mom said that I failed pretty much everything except nap time. >> Adam has failed everything except nap time. True. And hiding in the bathroom so that he doesn't have to go to school. >> Yeah. >> Okay. Um, let's drop all this stuff here. Oh, I don't want to drop the chairs, though. I got to be careful. Yeah, yeah, yeah, yeah, yeah. Look at these chairs, bro. Look at these chairs. >> Wo, those look nice. >> Well, we got to get them to stand up. Maybe we have to um I don't know. I'm going to leave them right here. Maybe we can get chairs from the furniture trader, too. I don't know. But do not do not dispose of those. We need them. >> Okay, I won't. I promise I'll do not. >> That's cool, though. I like the chairs. >> Do not. I'll never forgive you. >> I won't. I won't. I'll >> do not. Okay, guys. I'm I'm I'm really zooming right now. Look how many chairs we got. >> And it's only day two, guys. We got a bunch of supplies already. >> No. If we put these in the shredder, we'd have like 40 or like 30 wood or something. But we're not going to do that, guys, cuz we need it. >> Can't do that. >> Okay, nice. Let's level up, guys. We really have to level up first before we can do all this stuff. Okay, nice. I got a crafting bench. Hooray. Bofuel. We need more of everything. Get it now. >> More of scrap antwood. >> Yeah. And we should also get torches to expand the fire. Oh, bro. There's so much stuff to buy. Okay. >> Yeah, we need a big map. >> Okay. I'll put the torches like out here so they're not like in the school. You know what I mean? >> Good call. Good call. >> Okay. Nice. Yeah. Guys, look. We need this to be in the school. So, we got to make the fire way bigger. It's It's not there. Like, I can't put stuff out here yet. >> Okay. Got it. More wood. >> Bro, this is going to be really, really, really tricky. I haven't even put down the map cuz we need it as a decoration. I can't even use it. >> Right. Exactly. And guys, when me and Justin are at school, normally Foxy and Boxy and the rest of the plushies, they all have fun together, >> guys. So, basically, if you have the Lanky Box merch, like any of the plushies or anything, if you ever wonder what they're up to when you're like at school or anything, guys, Foxy and Boxy, they're making anime adventures, showing you guys what they're up to. It's crazy. They have like secret lives basically. >> Yeah, it's the best. It's going to be called Lanky Box Go. >> It's called Lanky Box Go, bro. It is pretty fire. Okay, Adam, we were supposed to leak that. Okay, stop leaking. I never forgive you. Stop it, bro. >> Yeah, I do be leaking a lot. >> Stop it, bro. Stop it, bro. >> Sorry, Foxy. I just wanted to tell everyone about Lanky Bogs. Go. >> Yeah. Okay. Don't leak it, though. That's secret projects. That's undercover. Okay. Um I'm going to go explore more houses and keep looting. We need more scrap, dude. That's all we need. More scrap, more wood. >> Can do. I'll get a bunch of scrap. >> Do it now. And bring the saplings back to the camp. Oh, I got more chairs yet again, >> sir. Yes, sir. >> We got a lot of chairs right now. It's going to be awesome. Thick Shark says I'm good at pizza, guys. He's really good at He's Big Shark is very good at lunchtime also, just like me. >> Oh, Big Shark, you're so funny. >> Um, Ghosty is really good at different subjects. Um, Ghosty says, \"I'm really good at burritos, >> right? And reading books.\" >> Yeah, reading books, which is Yeah. Yeah, it's true. Ghosty is very good at reading, guys. That is true. And Rocky obviously is the master at music. Time to rock and roll. >> Yeah, he's also good at gym class. He's really strong. >> Rocky's good at gym and he's really good at um definitely music because it's time to rock. >> Yeah. Yeah, him and Sticky and Cy have a rock band. It is pretty fire. I'm not going to lie. >> Yeah, it's pretty sick, guys. >> Okay, I don't know how to make these chairs stand up, which we will need to do if we want them to look good, but it looks okay right now. >> No problem. We'll figure it out. >> How are we going to get these to stand up? We have so many chairs. We have like enough chairs for the school right now. >> We're going to have to figure that out, guys. Don't worry. Okay, I got a bunch of scrap. Let's see what we can get now. Bofuel, we need more of everything still. Okay, I'm coming back with a bunch of scrap. I got a lot of stuff now. >> Did you get wood, too? >> Yeah, I have some wood. >> Okay, I'll get a little bit more. And then I'm going to save the first person, guys, and we're going to see how we're going to build this school. It's going to be super awesome. >> Let's go, guys. >> Okay, I got wood. Hurry up and put it in the fire. Go do it now. >> Yep. I'm almost there. >> Do it now. >> You can count on me. >> I don't even know where Adam is, so I'm just going to leave him. >> Okay, I'm pretty far away cuz I had to get >> See, you said you were close by you line. That's why you got to go learn geography. That's how you know where you are. >> Yeah, guys, I pretty much have to get better at everything. Adam, how many how many continents are there? Um, how many condiments? So, there's ketchup, ketchup, mustard, mustard. >> You also asked you what >> how many continents, bro? What is that? See, he doesn't know geography. How many oceans are there? >> Oceans? Yeah, big shark swims in the ocean. I swim swim in the ocean. >> How many oceans are there? >> Adam has no idea what I'm even saying right now. >> Um, I actually don't know. So, I think >> See, that's why you got to go to school. That's why you go to go to school, bro. >> Well, there's the pond near our house and >> say ale. Can't spell 80 without ale. >> I think there's five oceans, >> guys. There's a silent L in Adam's name. >> It's true. >> Okay, can I try to trivia you? >> No, >> it's not trivia. That's school, buddy. I know everything cuz I have Foxy and Boxy and they teach me. Guys, Foxy and Boxy are so smart. They tell me the answer to stuff. It's genius. >> Okay, what do you get when you mix the color um red and blue? That's art class. I'll ask Rocky. >> You'll never get it. You'll never get it. >> Uh, red and blue. That's purple like Foxy. >> What? That's correct. >> That's obvious, dude. That's so obvious, bro. >> Wow. Okay. You are smart. >> It's cuz I have Rocky. All the pluggies are good at their own subjects, >> right? Exactly. Rocky rocks. >> Rocky is good at music and art. He can carve stuff out of rocks, too. He's like a sculptor. >> Yeah. >> So awesome. >> Okay, I have another question. No. How are diamonds made? >> No, no, no. Rocky says obviously under pressure. >> Oh, it's when rocks get like squished and they turn into a diamond. Okay, Adam, here's a question. Spell apple. Apple. Spell apple. Uh, okay. We'll put the text on screen. So, it's a p u l. >> Is that right? >> No. >> Apple. >> Oh. Oh. Oh. >> Guys, listen. Adam cannot spell. Bro, this is not good. >> Oh, no. I got it. A P O L E Apple. >> Hey, Adam, you're banned. Don't Don't let your mom see this. We're going to have to go back to school. >> You're so crazy bad, bro. >> Wait, can Foxy spell apple? >> Foxy, dude. Are you really questioning if Foxy can spell apple? >> Foxy, you need to go to school. >> I don't know what I'm saying. I've had enough of you. >> What? >> Foxy's had enough of a And so have I. So am I. >> Trying my bad. >> No, you're really not, bro. You missed on spelling apple twice. >> Wait, so neither of those are right. >> No. >> Well, oh, come on. Nio, >> you're you're a giant baby. >> I am such a noob, guys. >> You're a giant baby, >> man. >> Okay, second chance. Spell baby. >> Spell, >> which is what you are. You should obviously know how to spell this. This is what you are, guys. We're building a school base cuz Adam needs to go back to school, bro. >> Okay, so baby is what you are. B A Y space B E E. >> So, it's two words. That was a trick question. You tried to trick me on that one. >> You put a space in the word. >> That's two words. >> That's It's obviously, Dude, I I cannot believe your brain right now. >> Justin tried to trick me, guys. >> I can't believe your brain right now. It's obvious, dude. >> I can spell goooo gaga. G O O >> It's cuz Dude, I'm literally It's crazy that you spell that way, bro. >> What do you mean? It's like you, dude, you need to go get education, bro. >> I can spell goooo gaga. >> You can't do anything, bro. >> G O O G A G A. That's right. Cuz I know the goooo gaga song. I play that all the time. >> Okay. Okay. Okay. You didn't even build the bofuel. What are you doing, buddy? >> I'm just putting supplies in. I'm going to let you build it. >> I do it. I do it. Okay. Now, you can uh start putting more stuff there. Okay. We need more scrap, more wood still. So guys, we just have to farm supplies right now until we make the fire way bigger and until I can put enough torches to make this base huge. >> Yep. No problem, guys. Easy peasy. >> Okay. >> Just like school is for me. >> Dude, you're bad at school. That's why you got to go back to school. If I just go back to school, even Banana says it's time to make like a banana and split. Back to school. You need to go back to school, man. You really do. >> All right, you're probably right. >> Don't Don't go over there. I'm going over there. Back up, Adam. Back up. Just pick up wood and stuff. Why are you trying to blast people, bro? >> Okay, got it. >> You're not going to do it. You're going to oof. >> Yeah, that is where I oof last time. I'm not going to lie. >> See, >> not going to lie, guys. >> See, don't even lie. >> It's pretty embarrassing. >> Don't lie. >> I won't. I won't. >> Okay, I did it. >> Nice. Let's see what's in the chest. >> My loot, not Adam's. >> Boom. I need to go back to where I was and get all the stuff I dropped. I had so much good stuff. >> Yeah, it's worth going back. >> Wait, where where was it? Oh, it's over here. Okay, easy. I'm hungry again. It's cuz I'm hungry cuz I was not cooking. Cook. What? Cook. I'm trying to get uh scrap right now. Okay. Uh I'm going to open this up. Nice, guys. There's a bunch of good stuff here. Okay, guys. We got to build a school base. We'll put a clip on screen of what it's going to look like when it's done. It is going to look crazy epic, and it's going to help us get that secret school ending. Guys, do not go anywhere. Do not miss it. It's going to be so much fun, guys. We love school. Okay, except you're not good at school. You got to go see everyone. Make sure to read books. >> Oh, yeah. Books. I read the Lanky Box Epic Adventure book. That's a good book. Adam's been reading that book for like 2 years. He's He's been reading it since it came out, guys. >> It's a picture book. I'm already halfway. >> It's a picture book. It's a graphic novel, buddy. >> I'm already halfway. >> It's a graphic novel. >> It's pretty sick, guys. >> You're only halfway through that. >> Yeah, it's a really good book, dude. >> That is true. It is a good book. Adam's read it a few times. >> Uh-huh. >> Guys, make sure to go. If you go to a bookstore, look for the Lucky Box adventure book. It's pretty awesome. 5 days. We go on adventure. That book, that story is similar to like the adventures on Lucky Box. Go. The new videos coming where they just go on adventures. It's just so frier. >> You guys got to go to Lanky Box. Go. >> It's super awesome, guys. It really is. Okay, I'm going back to base. Enough. Enough of Adam's shenanigans. I'm going back to base. >> All right, sounds good. >> Oh, we're being attacked. That's good. We need gems, actually. >> Yeah, we need the cultist gem. >> We actually need gems. I'm hungry. And there's no food here because Adam didn't cook. >> Uh, >> do your job, buddy. >> Okay, I'll try to oo some bunnies or something. >> Do it now, buddy. >> Put the scraper. Do it now. >> Okay, we have a lot of scrap now. That's good. >> I have I got two alpha wolf pelts. >> Oh, huge. I would love to upgrade with that. We're being attacked. >> Uh, please don't over here. >> You probably will, but I won't. >> I won't. I promise I won't. >> Uh, if you see coins on the ground, leave them for me because I need to trade to the furniture guy. >> Oh, right. We need a ton of money in the game to buy a bunch of furniture for our school, guys. >> Yeah, pretty good. Okay, I'm going to get a boost pad. Okay, the boost pad could be like for PE. That could be like for the gym. For the gymnasium. >> Oh, like you run really fast. >> I'm going to put it right here. I think this is going to be the gymnasium cuz this this lake is almost like a pool. >> Yeah. So we can run around and try to like >> I'm starving. >> Oh, there's food at the there. Yeah, >> I eat it. Mine. >> There you go. >> Okay, we need like a crockpot. Dude, we cannot keep starving. >> All right. You want to build it or me? >> So the crockpot I'm going to build this. This could be for the cafeteria. So let me think. Let me think. This is the classroom right here. Right. This is the classroom. >> Yep. Yep. Yep. Yep. >> Maybe we'll put like the bathrooms over here or something. So I think the cafeteria should be right here. >> Right there. >> Cafeteria should be right here. Y >> All right. Crockpot. >> I'll put that there. Now, I'll put that there cuz then they can cook right here. So, everyone will hang out. Look at how happy everyone is cuz they know they're going to school, >> right? So, then we can put a bunch of um carrot plots down there. >> Guys, school is cool. Always try hard at school, guys. Don't be aim, >> right? That's where we're going pretty soon. >> Don't be a Don't be a We're already going, dude. We're at boot camp, bro. >> I know. It's pretty tough. >> It's very tough. Adam cried the other day. >> I did. >> Yep. Okay, don't worry. I'm going to go save the next person now. Oh, alpha both the guy's back. Okay. See if you can get the the good axe. >> The strong axe. >> Let me trade. Okay, I got a giant bag. That's really good. >> All right, we'll take that. >> Okay, let's see if Adam can get it here. That'd be pretty good. >> No. >> Okay, well, it doesn't matter. Okay. >> All right, no problem. >> I'm still I'm still over here. I'm just getting food. I need to >> We need way more food. >> Use that crockpot, guys. We're going to make a cafeteria. Is the furniture trader? Oh, the the pelt trader's here, but furniture trader is not. We need that person to spawn. >> The furniture trader normally just spawns very randomly. >> Yeah, it's super random. You don't know when the furniture trader guy is going to spawn. I'm going to go save Squid Kid in the meantime. Okay, >> Adam, you just level up the fire. Do it now. >> I'm going to level up the fire and also put some carrot plots down cuz we need food at the camp really bad. >> Uh, well, we have the crockpot. >> I know, but we need carrots for that. >> No, you can get meat. You don't need carrots. >> Okay, I got you. >> I would just do meat. I I'm going to plant the carrot plots. Don't do it. >> Just pick carrots and then just uh use uh the rabbit meat. >> Okay, I got it >> to do it. >> Easy peasy. >> Yeah, I'll do it. >> What's your favorite food to eat at school in the school? >> Obviously, pizza. Oh, that's Dick Shark's face. >> Yeah, >> it's Dick Shark. >> Pizza Day is awesome, guys. It's on Fridays. We got pizza rolls. Adam's mom makes us pizza rolls. It's awesome, guys. >> Yeah, it's one of the best days of the week. >> Pizza rolls, honestly, one of the best. Adam's not allowed to eat them, though. He just drinks milk. He trades me his pizza rolls for my mail because I get chocolate milk. >> Yeah, >> pretty awesome. >> It's pretty lit. >> It's pretty awesome. >> I love chocolate milky. >> Chocolate milky milk. Milky milk. Okay, hold on. I got to find Squid. Oh, now there's a basketball court out here, guys. But we might even try to bring the basketball court to our base for PE. Wait, we're going to have our own gym in the school. >> I'm going to bring the basketball to our base so that it's for PE for gym. >> That is so hype, guys. >> Can I put this in my bag? No, I can't. Okay, so I got to bring this all the way back. >> All right. Yeah, you got to kind of got to just grab it, dude. I can like throw it. I can like dribble it. Oh, swish. Uh oh. Uh oh. Uh oh. It's rolling away. Okay, nice. I'm going back. >> Swish. Swish. Dude, this is going to be so awesome. We're literally going to have like a gymnasium inside of our base. >> Yeah, Justin's really good at basketball, guys. >> Guys, I can dunk. I I I literally literally have dunked on like a 12t hoop. It was crazy, guys. Adam was there, >> right? Justin dunks the basketball and he dunks Oreos and mail. >> It's pretty awesome. Okay, I'm leaving the basketball there. Okay, it's going to be awesome. Why'd you put a sapling right on this, bro? >> Uh, it like glitched. Like, I can't grab it. >> Okay, I'm going to go run back to go save Squid Kid really quick. Now guys, we got to keep an eye out for the furniture guy because we will need to buy a lot of stuff from them, >> right? And you already have uh quite a bit of coins, right? >> Yeah, I got a lot of coins cuz all those bad guys dropped them. >> Let's go. >> I got a microwave. We can put that in the cafeteria, too, so people can heat stuff up. >> Oh, yeah. If they bring lunch from home, they can heat it up there. >> Yeah, exactly. Hold on. The map's not big enough to save Squid Kid, I don't think. >> I'm about to level it up. >> Level it up right now. Do it now. Don't talk to me until you do it. >> We're almost there. Don't worry. >> Don't even talk to me until you can do it or spell apple. You guys, you guys saw that. Adam can't spell apple. Spell banana. >> Banana. >> Spell banana. I guarantee you Adam cannot do this. I I will guarantee it. Okay, hold on. Uh, banana. Okay. B. >> Sound it out. Sound it out. Guys, this is real. This is what you're about to see is a real attempt at Adam spelling. >> We'll put the text on screen that I'm saying. So guys, I think it's B. >> Banana. Banana says, \"Do it or I'll be disappointed in you.\" >> I got it. It's b u h b n a n a h n uh >> you put h's in the word banana banana like no you need to go back to school >> is that not right >> foxy are you kidding me >> what I can I can spell foxy >> guys no you barely can spell foxy >> f o x y >> the only reason you got that is cuz it's literally on my shirt >> yeah and foxy is b o X Y. >> That's the only reason he can spell it is cuz he can just check his shirt. >> I'm going to put this uh the microwave next to the uh stew so people could heat like hot pockets and stuff right here. >> Oh, that's pretty smart, man. >> Pretty awesome. Pretty awesome. Okay, now we're doing really good. I'm going to go save the next brain. Did you level up the fire already? >> Yeah, it's level. >> Okay, we got to level it up one more time, dude. >> Oh, one more. >> Yeah, one more time. We got to go max level. >> Okay, that's going to be uh the max max fire then. >> Do it. >> All right, got it. >> You can just chop down trees and put the wood in there, but just save the saplings. Yeah, save the saplings. >> Yeah, >> I'm going to get the torch. >> Okay, >> so guys, the torch in this game, it makes your map bigger because the light makes it so that your map can be larger. >> Look, it's almost here. So, now we can uh use stuff here. That's pretty cool. >> Awesome. >> That's pretty cool. >> All right, we should be able to expand the fire this uh this day. >> Guys, it looks like I can't rotate this. It says you can rotate it, but you definitely cannot rotate it. >> Yeah, that happens to me, too, when I try to put that down. >> That's okay. I'm not going to do this right now. We're going to wait until the right time to put that down. The map is a little bit glitchy. >> Okay. Uh, you made the fire bigger so I can save Squid Kit, right? >> Yep. It's level five. >> I'm going to go save Squid Kit right now, guys. And then we're really going to get to building. But Adam, you got to level up that fire. And then we can just dump everything in the in the scrap machine and then just start building. >> A Yeah, sounds good. >> Guys, we're only on day 11. We're doing really, really, really good. Oh, and we also have to make uh beds and everything so everyone can like hang out and take naps. That's nap time. It's a very important subject for Adam, >> right? I take a nap every single day, sometimes twice a day to make sure my brain stays >> twice a day. Well, yeah, because I get tuckered out at school. So, >> so basically, you're a giant boy. >> I'm not a baby. >> You are. You can't even spell baby. >> How can I be something that I can't even spell? >> Well, you you're not an adult either. You can't spell that either. I'm definitely You cannot spell that. >> Yeah, I can. >> No, you can't. I spell adult. >> A H D O L T. >> Guys, this is how you know Foxy says Adam can't spell anything. It's why he can't spell her name. It's Adam. >> It's ADM. Yeah, that's your name. >> I know that's my name. >> That's the one thing you can spell. It's ad e. >> It's ad. >> It's >> No, it's not. >> Guys, it's Adam. >> Foxy ass. Guys, Foxy, tell everyone it's AD. >> Foxy is obviously ad. >> Guys, it's Adam. And I'm going to say this for real. I'm going to say this like just I'm really going to say this. This is a real story. And the plushies will back me up cuz they will confirm it's true. Yep. You see true? I dare. Listen, Adam's mom says we're going to boot camp, bro. So, basically, Adam and mom put us back in school because Adam, you guys can see, he literally cannot spell and stuff. >> The plushies help us with like all the subjects cuz they're all geniuses basically at individual subjects, >> right? When Adam's mom said we're going back to school, the first thing Adam says is, \"Is it Bambolina school?\" >> No. >> This is crazy. >> I did not. >> No, you did. That's a leak, bro. >> I did not. >> I was there. I was there. >> Are you serious? >> Don't lie. We were all there. We were all there. Yo, you did. >> I did not say that. Adam thought it was Bambolina school from Gardner Bamb. Oh, I found the rarest chest in the game. >> Why would I even say that? >> Bamboolina. That doesn't even make sense for me to say. >> That's the truth. Oh, I got the rarest armor in the game. Let's go. Cool, man. >> Let's go, guys. I'm kind of doing really good right now. I wish I got the best blaster in the game, but this is pretty good, too. I won't lie. >> Why on earth would I say that, dude? >> Dude, I don't know. >> Cuz like Bandelina, she's just a random character. >> Listen, let me say this right now. I'm not inside your head. I don't know why you said that. Okay. >> Do you want to be inside my head? >> No. Absolutely not. >> It's pretty crazy in there. >> Actually, no, we don't. But if you guys want to see inside the minds of the plushies, make sure to watch Lanky Box Go cuz you'll see all their adventures and everything they're up to. It is so awesome, guys. It is literally what the plushies are up to when you're not around. It's super awesome. Wo! There's like a giant base here. Um, there's an evil base, there's a treehouse, and a weapons base right here. Let me see what's in here. Oh, a lot of stuff. Nice. >> Yeah, Lanky Box Go will be coming to this channel soon, guys. Make sure to look out for lanky box. Go. Oh, I'm hungry. Make some stew. Do it now. >> There is some at camp. >> Make some stew. Do it now. >> There's one in the pot. >> Make some stew. Do it right now. >> Uh-oh. >> I'm in trouble. >> I'm in trouble. >> Uh-oh. >> But not as much trouble as Adam is in if he doesn't learn to do school better. >> Yeah. So, basically, guys, every time I get an F on my report card, I get grounded one week for every F. >> When he gets a F, I go F. F. Adam got a F. >> That's super awesome. Okay. Wait, look at all the food we have. See, I dropped all this here. >> Nice, man. Okay, so now we can make infinite stew, but I'm going to use this and drop it here because we need to level this up. >> Yeah, the fire is like not very leveled up right now. It's >> I think the best way to get uh the fire leveled up is just to get a bunch of like meat and drop it here cuz it counts. Meat counts the same as wood and if you oof like a bear, it's like 10 meat. >> Oh, really? >> Yeah. >> Oh, that's nice. >> Okay, nice sapling. Oh, you got to plant the saplings. Nice. >> You want me to put this meat in there then? >> Uh, no. We need that for stew. >> Okay, got it. There's some stew here for you. >> That's fine. >> Adam's like Adam's like the lunch lady right now, bro. Yeah. Would you like pizza or salad? >> I get pizza and then I trade my chocolate milk for Adam's pizza and then I have double pizza and I share one with thick shark. >> Right. And I just get two. >> Yeah. >> Pizza. >> Pizza time, guys. It is pizza time. Okay. It is pizza o'clock. Okay. Now, okay. Now the map is huge. Now this, which is where the teachers will teach, is inside our base basically. But we can still level up the fire again. It's going to be huge, bro. >> Yeah, we're going to get max fire. It's going to actually be huge. Okay, let me get another torch. Wow, we can make this base actually massive if we buy all torches, which we are going to do. >> Yeah, let's do it. Cuz we want our school to be really big so everyone can have a place there. >> Exactly, guys. Exactly. Okay, guys, look. The gym has the boost pad already. Has a basketball and it has a place to go swimming. It was like a swimming pool. >> Oh, awesome. With fishies in there. >> Guys, this is going to be so fire when we actually make this. Okay, Adam, just level up. Uh, only thing you got to do right now is level up the fire. That's the most important thing you can do. >> Got it. >> Okay, and we need more for that. Okay, I'm going to go save the last person, guys. Yeah, make sure to check out the Lanky Box merch, guys. Look, I got a Foxy backpack. >> Yeah. Yeah, this is actually a Foxy lunch lunch box. Look, I It keeps everything warm or cold. >> That is at Walmart and Target, guys. Or you guys can get plushies at lankyboxshop.com, >> guys. Basically, I'm going to right now I'm going to check out where the last person is. I'm say, oh, we can't do that until we level the fire, so we have to level up. I'm going to put banana inside my Foxy lunch box. Looks like a frozen banana. >> Oh, yeah. >> Stay away. I definitely don't want to eat bananas. Don't. You're not going to. You'll never do it. Foxy, don't. Banana is our friend. Banana is our friend. Don't. >> Or do I? >> Don't do it. I'll never forgive you. >> I might eat banani again. >> Guys, I'm I'm going be serious right now. Foxy literally is smarter than Adam. Foxy. It's true. Adam can't even spell your name. >> I could steal my mug. Way to go. >> It's ADM. >> Yeah. ADM. Okay, you did it right. Good job. Good job. Okay, he did it right for the first time. >> Wait, no, I meant ADM. >> No, no, no. No takebacks. No takebacks. Adm. >> It's adm. We all know it is. >> I can spell Justin. >> Yeah. No, you can't. He's tried. He's failed. >> J bust I N. >> That's not how you spell bird. >> Justin, >> you just sounded out. No, that's not how you spell it, guys. >> Guys, leave a comment if you know how to spell the word Foxy. >> Guys, like guys, how you spell Justin? It's J W U S T I N. There's a silent W in Dustin. You can't spell justy without a W. >> That's true, guys. That's true. >> There's a silent W in justesty. Dusty. >> That's how you spell it, bro. No cap. >> Yeah. No capitals. >> No. No cap. Yeah. All lowercase. >> And we're almost expanding the fire here. >> I got it. I did it. Okay. Now, the fire is huge. The map is huge. Yep. Look, it's way past this. So, this can definitely be part of the classroom. Okay. Later, we're going to cut down all these trees so it looks better. Adam, you do need to find the best axe in the game. You will need that for sure. >> The strong axe. Oh, yeah. Cuz we need a lot of wood here. >> Yep. >> Oh, boy. >> Yep. >> Where would I find that? It's probably in like the big treasure chest, right? >> Yeah. >> Which Wait, can't you get that, too? >> I think so. Yeah, if I go to the base with you. >> So, you should Oh, we don't have the map. I was going to say we could look at the map. You should If you look at the map Oh, I'll put down the map now cuz it's huge. If you If you look at the map, >> um you should go where the third person was. >> Okay, I got it. >> Okay. Where should I put this map, bro? probably right next to it. So, it's kind >> That's not going to look good, bro. >> It's like two chalkboards. >> That's not going to look good, bro. I'll put it like I'll put it like I'll put it like right here so people can give presentations. This will be like geography class. >> Look, you can stand right here and give a presentation. Look at this. >> What would you like to do a presentation on? >> This is easy, bro. The North Pole, Antarctica. See, like I I know, bro. >> Yeah, you can talk about maps and stuff. >> Yep. I'm good at that. Okay. So, now use the map and go where the third person was, which is the furthest base out. You know what I'm talking about? >> Yep. The bottom right. >> I don't know what Adam's saying. Don't Don't even talk to me. >> I got it. >> All right. Here we go. You You go there and you should get the rarest chest in the game. >> That's huge. What a hack. >> Yeah, cuz you can loot those things twice, guys. If you don't know that, you can loot it twice. >> Okay, I'm going to grab some stew and head out. Okay, I'm going to go save the last person. You can use the boost pad, too. I'm going to go save the last person. Then, it's really school time. We're going to build the best school ever. this way. >> The school bell. >> Yeah, guys, the school bell. That's one of Adam's He's scared of that sound. >> Oh, definitely. >> It's He's scared of it cuz it wakes him up from his nap. >> Boast. >> Okay. I'm going this way. >> Same. >> We're going basically in the same direction. >> Yep. >> Yeah. You need to go to this one over here. >> Yep. Bottom right corner. >> Yep. And the last person's over here, too. >> Easy peasy. >> It's going to be awesome. But yeah, guys, make sure everyone subscribe because if you guys want to find out what the plushies are up to, make sure you stick around for Lanky Box. Go. It's going to be awesome. Go see. It's awesome. It is, guys. Ghosty can glow obviously cuz she can glow in the dark in real life and in the lucky box go in the show. It's crazy, guys. So, she could save people even if there's limited light. >> Exactly. Ghosty can glow in the dark. >> It's awesome. Rocky can dig. It's awesome, guys. And make sure Oh, I got Wait, I got it. I got it. I got it. >> Oh, huge. >> Wait, where are you? Where are you? >> But it's random. >> Where are you? Where are you? You can have it. >> Right here. Right here. Right here. >> You can have it. You can have it. Grab it. Grab it. Grab it. Grab it. Grab it. >> Got it. >> Did you grab it? >> Uh, dude, you are such a noob. If you >> No, you're Are you serious? >> You're actually such a noob. Go to timeout. Go to Go to Timeout. Go to timeout, bro. We got to make a timeout in the school for Adam. Go to timeout, bro. >> Foxy, think about what you did. >> I'm such a new baby loser, >> guys. Literally. True. Okay, >> stop. Don't cry. Foxy, don't cry, Adam. Don't cry. >> Can I come out of timeout? >> Yeah, you can come out of timeout. >> All right, >> Adam, here. Look on the map. See where I'm at and get this. Can you Could you pick this up? >> I I don't know. I think so. It like wasn't letting me. >> Okay, go and get it. And if you can't, I'm going to pick it up. >> Okay, >> it's at the bottom bottom of the map. >> Okay, got it. I'll be right there. >> Dude, that is crazy. You literally oofed to the deer. >> I know. I have no arm. >> Okay, I got to find uh Squid Kid or the last person. >> Let's do it. >> Now, Squid Kid, let me know if you can't pick it up cuz I will pick it up. >> Okay, for sure. I got you. >> It's mine. >> Yep. I will not take it unless I can. >> It's mine. I'm only letting Adam use it cuz I'm nice, >> right? He's the best older brother ever. Guys, we're actually twins. Everyone knows that. But I'm a little bit older than Adam. >> Yep. Justin speed ran out. >> I'm one minute older than Adam. >> Yeah, he's quick. >> Yep. >> All right. >> Where's the last person, bro? >> I think I can get it. >> Where's the last person, bruh? >> I can pick it up. >> Okay, nice. Now, now you go in the base, open that treasure chest, and if you get a good blaster, it's mine. >> Okay, I got it. >> Do you understand? >> Yeah, I got it. >> Do you understand me? >> So, I'm going to go in the base, and if I get the tactical blaster, then it's all yours. >> Yeah. If you get the armor, it doesn't matter. And if you get another good axe, I'll take that one, too. >> Good call. >> But there's a Oh, there's a lot of really strong animals now. This is bad. You all right? >> Obviously, I'm fine. I'm not a little boy like you. That's why there's a silent W in Justy. >> Oh, true. >> I always win. >> All I got was a Oh, man. I see where I am. All you got is gems. >> I got a gem. >> Lame. So, I'll bring it back to camp and put in the shredder. >> Lame. Oh. Oh, the green gem. >> The red gems. >> Oh, they put those in chests now. Yeah, >> that's kind of cool. >> Yeah, it's pretty good. >> Okay, I got to go back to where I was. There's like 10 bears over there. I got to get them. >> No problem. >> I got to get them, guys. I'll show you guys a hack to oof all the bears really fast. >> What's the hack? >> You got to just stand on top of their base and just blast them from above. >> Well, that works. Oh, right. Cuz bears can't really jump in real life, right? >> Yes, they can. >> Bear Bears can jump. >> Yeah, I played basketball against a bear once. >> Oh, really? >> Yeah. He tried to dunk on me. I didn't let him, though. >> Oh, >> I didn't let him, though. >> I didn't know that. >> Yeah, we saw Was I there that day? >> No, you were taking a nap or in timeout. >> Oh, got it. Guys, don't play basketball with bears. >> Don't. It's very dangerous. >> Ever. >> But it challenged me. I had to say yes. >> Did you win? >> Yeah. >> You won. >> Obviously, bird. >> Oh, that's cool, guys. >> Obviously. >> Yeah. Justin's really good at basketball. >> I distracted the bear. I threw down a jar of honey on the ground and started eating it. And then I dunked on it like four times. >> Oh, that's why the basketball court was all stinky that one day. >> That's right. >> I get it. Sticky says someone say sticky guys. So basically me and Justin were playing basketball and he broke my ankles and I slipped and I fell. >> Not literally. That that's a that's something people say in basketball, >> right? And he did an awesome move and I fell and I got stuck to the ground. Yep. >> Like I was just sitting there. It was a sticky situation. >> It was br >> Guys. All right, bro. Watch out for the deer. >> Okay. >> Are we getting attacked? We're getting attacked again. >> Yep, we are. >> We're getting attacked again. I'm going back home, guys. We got to start building this base. Honestly, we got to save the last person and start building a base. It's getting pretty tricky. I'm going to get Oh, wait. The fans I could also put as decoration. Okay. Has the furniture guy spawned even one time, bird? >> No. No, he is not. >> Okay, guys. We need to meet the furniture guy. It's very important. Really, really badly. And we need to survive this attack >> to start building. Oh, no. Okay, let's get him. Oh, no. Adam, don't. Don't be a giant baby. >> Okay, I won't. I will learn how to spell it. So, wait, how do you spell it? B A Y >> B W A B Y >> B W A B Y >> I'm pretty sure. >> Okay, got it. >> Foxy. >> What do you mean, Foxy? Let's go, >> Foxy. >> It's my my gem. >> Okay, got it. >> Leave the coins for me. It's mine. >> Hooray. >> Nice. >> And dude, now with the strong axe that you got me, I can chop down all these trees with one hit. >> Yeah, pretty good, huh? >> That's really handy. You will want to clear out like the area because we need to look clean for the school. >> Yep. Can do. Where do you want me to start playing? >> I got a washing machine. I'll put it here next to the pool so people can like use it to dry off. >> Oh, they wash their clothes after going in the pool. >> Yeah. You know what I mean? >> That's smart. >> You know what I mean? That's pretty cool. That's pretty fire. >> I do know what you mean. >> I'll put the basketball on top of it. I'll see if I can do this, guys. We're really trying to decorate right now. >> All right. There's that. >> Yeah. Oh, it kind of rolls. >> There's going to be a ton of wood in the shredder. >> That's good. to build block walls. >> That's good. >> And I guess I could plant the trees kind of around some of the rooms, like in the classroom. >> Don't do it. >> Okay, just keep the trees out of the base. >> Don't do it. I'll tell you what to do. >> All right. Where should I plant all the sapling? >> I'll tell you what to do. >> Yeah. Where should I plant all this? >> Just far away. Like back over here. >> Far away. >> Far away. >> Wo. We got a bunch of wood. >> Yeah, a ton. >> Okay, guys. Now it's time to really start the build. It's really time to start the build. First, I'm going to get I'm going to max out torches. I think we need more scrap. >> More scrap. Yeah, we need a little bit more scrap to max out torches. Then that's going to make the base absolutely gigantic, guys. Cuz the torches, look, it makes it bigger every time. And I got like six of them. >> Okay. Well, we could use the washing machine, but no, we'll go get more scrap. >> No, don't use the washing machine. Go find more. >> Okay, got it. >> Go find more. >> More. >> And guys, I'm going to go and get the building hammer also so I can move stuff around too later. That's going to be awesome. >> Oh, okay. That makes sense cuz then even if we put something down and we don't like where it is, we can move it. >> Dude, look at how big our camp is. It's massive. I don't think we've ever hired a camp this big, >> right? Cuz normally we don't use the torches that much. >> No, it's actually crazy. Okay, I'm going to start building shelves cuz that's going to make us Oh, wait. We need more scrap for that. Okay, I'm going to build log walls and get to building. >> All right, I will I'm going to get to building. >> I'm going to get a bunch of stuff to building. >> Just in the building. >> I'm going to put like a wall right here. So, this will be like the back of the classroom. >> You know what I'm saying? >> Yep. >> You know what I'm saying? >> Oh, the back of the classroom where the cool kids sit. Oh, this is how you you can tap this to rotate. That's kind of cool. >> Oh, nice. >> Okay. Like this. I'm going to build like a wall like this. >> Okay. >> So, it looks Yeah, guys, look. This classroom is coming together. We got these uh trees here cuz Adam planted them here. >> Yep. >> Like a nude. >> Yep. That was earlier. >> Got to clean up this mess that Adam made here. >> My bad. >> Move. Oops. >> Move the trees. Nice. Okay. And then I'm going to throw these saplings out here cuz we don't need them. >> Easy peasy. >> I got a bunch of wood. Guys, we're really going to start the build right now, but I got to save the last person, too. It's base build time. >> It's base build time. But we got to You didn't cook stew. You said We said you were the lunch lady here. >> I know. I know. I know. >> You're not doing your job. >> I'm just trying to get scrap right now. >> You're not doing your job, buddy. >> Oh, no. I might do. >> Guys, we have the biggest base. This is the biggest base I think we've ever seen. Oh, the basketball keeps rolling away. Come back. Okay, nice. I'll put the basketball right here so it doesn't go anywhere. >> Let's go, >> guys. We really got to go max level. I need stew. Then I'm going to save the last person. I still got to save last person. H. Should we make any carrot plots so we have more food? >> No. Okay. Oh, I have a bunch of scrap. Let's go. Okay, I'm going to put these walls right here. Nice. Guys, look. This will be like the classroom where the teacher can give lessons right here. >> Oh, nice. They can do math class there. >> That is pretty fire. I'm not going to lie. Okay. Uh oh, the deer's hungry today. Uh-oh. Okay, I'm not going outside today then. I'm just going to keep building. >> I'm going back to camp right now. >> Nice pronto. >> Otherwise, Adam's definitely going to move. >> I know how to spell Roblox. >> No, you don't. >> I do. >> No, you don't. >> I do know. Uh, it's R O B L O. Rocky says, \"Hey, stay in school, buddy. You're doing good.\" >> I'm close, right? >> Fox says, \"Not really, but um, keep trying.\" Hey, you never never give up. >> Foxy's trying to be positive because >> So, I was close. So, so it's probably R. >> Hey, Adam. >> Hey, Adam. Stop it, little bro. All right, I'm focused right now. >> Got it. I'm really focused right now on leveling up. >> Watch out for that hungry deer. Oh, and check this out. Scrap time. >> Nice, nice, nice. Okay, now I'm going to get the last torch that we can. Nice. Okay, we got all the torches. So, now the map is absolutely ginormous. >> Huge. I love ginormous maps. >> Wait, it's actually ridiculous how large this map is. Wait, that's ridiculous, bro. >> Yeah, this is a massive map. >> Yeah, the deer can't get us at all. Okay, now we have all these chairs, but we can't like How do I make him like sit up? I wonder if we Oh, did you just burn one after the fire? I didn't mean to. >> Uh-oh. I do wonder if you have to buy chairs from the furniture trade or something. >> I think you can. Dude, what if I'm really smart? What if I can use this rock right here, like Rocky, and lift them up? You see what I'm doing right here? No way that works, dude. Dude, it's close. A Guys, I don't know how to make these sit up, but if I could, then we don't have to buy them, which is kind of good. Is it a chair blueprint that we need? I'm not even sure. Dude, this is so fire. If I get this to work, guys, this might be like a hack. Oh, I don't think it's possible. Oh, it worked. This is how you do it. Oh my goodness. This is going to be insane. >> And now if you move it. Oh, now it stays upright. >> Wait, this is an insane hack, guys. That's handy. So, I'm just going to pick up chairs and just like spam drop them on this rock and see if they roll over. Okay, sounds good. Yes. Sweet. Some of them will randomly roll over. Guys, this is a hack right here. >> So, we're learning now. The classroom's really coming together. >> This is a hack, guys. That is a giant myth. We saw this on YouTube. You could do this, but it's like really hard to get them to fall, right? Oh, >> yep. It's not easy, guys. >> I'm kind of getting better at dropping them, guys. I'm trying to make the best school ever. You You can do that. I'm going to put four chairs so all of the people can sit. >> Oh, yeah. They can all sit in class and then listen to the teacher. >> Dude, I got four chairs. Let's go. >> Awesome, man. >> This is so sweet, dude. >> They're all upright. So, four of the people can sit here >> or at recess they can play musical chairs. >> That is so frier, bro. >> We love that game. >> That is so frier. Okay, now I'm going to go save the last person. Finally. >> Hooray. >> Let's go save them. I need some stew. Nice. Okay, let's go save the last person. Then it's full base build time. Time to build the best school ever and survive for infinite nights and get the school ending. >> It's full base build mode active. >> Where's the last person? >> Base build. >> Oh, they're over here. Okay, I'll go over there. It's on the map. Did you find it? >> No. >> Oh, I found it. I found it. >> You must have found it. >> Let's go. >> Cuz I don't go out that far. >> Yeah. >> Too scary. >> Adam gets too scared. He cries. >> I get spooked. >> It's going to be pretty awesome, guys, if we if we do this. >> Yeah, it's already really awesome, >> guys. This ending, the school ending we heard is pretty crazy. We're going to learn a lot of lore about all the characters. >> I can't wait to make the cafeteria. It's going to be fun. >> It's going to be pretty awesome. We haven't even gone to the volcanic biome. We have to go there and get some stuff, too. All right. We could teach the people about fire and volcanoes cuz that's fun to learn about, I think. >> Yeah. Rocky says, \"Do you know how volcanoes are made, Adam?\" >> Um, >> probably Adam has no idea >> how volcanoes are made. >> Yeah. >> So, I think it's like a giant rock that has lava in it. Yeah, but how was that formed? >> Oh, um I think maybe it's like lava material. >> No. Good guess though, Adam. Look, all the plushies are trying to encourage Adam. Even Foxy Foxy, you can do it. E. >> Yeah. I don't know how how does it work? >> Um, it's tech tech. Um, it's tech technology plates under the ground. >> Oh, tectonic. What? That's a big word. I don't know. Tectonic plates. Something something like that. Yeah. Basically, there's something under the earth that moves and then it creates volcanoes. Like a giant plate like that you eat off of. >> No, I don't understand. But volcanoes are really cool, guys. They are Rocky's mom's volcano. >> Yeah. >> Yeah. >> Yeah. >> Guys, make sure if you don't have Rocky, get him some way. Get the plushy or something because Rocky was my pet rock friend who fell out of my pocket. It was awesome. >> And volcanoes, they can erupt. >> Yeah, >> that's really cool. That's when the lava just flies out everywhere. >> Yeah. >> That's like Adam's mom. She'll say, \"I'm going to erupt at you if you don't stop.\" >> She does say that. Yeah. >> She does. Yeah. And Adam like cries and stuff. Yeah. >> Don't cry. Don't be a little boy. >> Our mom is very nice though, guys. >> My mom is super awesome. Okay, I'm going to stand up here and just blast all these bears. Nice. >> She's the best mom ever. >> All moms are awesome. >> M. >> Be nice to moms and dads. They're awesome. >> And also, uh, always say the words please and thank you. >> Yep. >> Cuz good manners is important. >> Yep, that is true. >> That's another thing I learned. >> Yes, that is true. >> Oh my goodness. There's one bear left. Of course. And the deer's here. Of course, bro. Of course. >> Can you do it? Ah, close. >> The deer does not want to see this school be made. >> Well, that makes sense. Maybe the deer is like the principal. Maybe we'll learn. Maybe we'll learn that lore, guys. Okay, I'm going to continue building because this has to be better than this. Come on. More walls. >> Go like this. I'm going to make like a hallway that people can enter with these uh torches. Look at how awesome that looks. >> Oh, I like it. There's like lockers. >> Yeah, yeah, yeah, yeah, yeah. >> They can put their Lanky Box backpacks there. Look, guys. See, look. This will be the entrance to school. Look at this. People enter right here. Right. >> Uh-huh. >> And then right away there's the classroom right here. >> Oh, huge. This looks fire. This looks so good. >> It's coming together. And it's only day 27. How is the furniture trader still not spawned? That's what I'm curious about. >> Day 27. Yeah, it is kind of strange. It's >> been a while. Building more walls because guys, we have to make this giant school. It's going to be so awesome. >> Yeah. Can you chop down this giant tree right here? It's in the way. >> Sure. I got you. >> Do it now. >> Can't do it now. Don't talk to me until you do it. >> All right. >> Do it now. Okay. Oh, so you can't put the walls this far out. Really? Huh? But it's in our base. Strange. That's weird. Okay. I'll put like a divider between PE and lunch. This is the lunch area. I'll put like a divider like a wall. >> Right. That way if you're throwing like a ball or something, it won't hit people eating lunch. >> Exactly. >> That's smart. >> Exactly. >> Yeah. We sometimes play dodgeball. That's a really fun game. >> Adam, I'm undefeated in dodgeball. >> Justin is very good at dodgeball, guys. >> Yeah. >> Yeah. But Foxy's actually the best at dodgeball. Well, but the plushies are on my team, >> right? I know. It's always me versus everyone else >> because Foxy's team captain and she's going to pick. She says, \"My first pick could be Rocky.\" >> Yay. >> Okay. Who's next? >> Just. >> Just next. >> Let's go. Thanks, Foxy. >> Okay. And I'm also playing >> Ghosty. >> Ghosty. Ghosty. >> Yay. Dodgeball. >> Oh, >> dodgeball. >> Okay. >> Who's next? You want to pick me? >> Big Shark. >> Big Shark's next. Okay. >> Uh, Sticky and Kenny. >> Yeah. >> Nice. >> Yeah, you can pick me. >> Lanky. Langbot. >> Banani. >> Banani. >> Yeah. All of them. >> You want Milky? >> Milky. Yep. >> Okay. How about me? >> Well, who's left in the lineup right now? Um, there's Okay, there's Foxy. Oh, no. Foxy's team captain. Oh, Boxy. Yep. Boxy, of course. >> Foxy the dodgeball boy. >> Yep. So, who's left? There's There's Adam. And there's um my mom. >> Adam's mom. >> Okay. >> Okay. There's Adam. That's it. Actually, I think our team's full. >> Oh, what? >> Pretty good, huh? >> So, it's me versus everyone. >> True. >> Oh, come on. I'm going to lose. >> That's why Adam has zero and 900 in dodgeball. >> I've never been able to win, guys. >> It's not good. >> But there's that one time we were playing where um I threw the dodgeball and it hit you and you fell over and then you started crying and then Anna's mom took the dodgeball and just stood over and just kept hanging with the dodgeball. That was unneeded. >> Yeah, I did the ground. I was crying. She took the dodgeball and she just went. It was really funny though. I kind of laughed. >> Oh, Adam was crying. >> Yeah. And then she got me a bunch of merch from Walmart. >> That was unneeded. Honestly, I think that was unneeded. >> No, I thought it was needed. I thought it was really funny. >> Unneeded. >> My mom is really awesome. >> Okay, I got another basketball. I'm bring it back to camp. Actually, see where I am on on the map? You You come get it. I got to go save last person. >> Uh, okay. >> At the very bottom. Okay. >> Go get it. >> Can do. >> I got to save this last person. >> These bears have given us a lot of trouble. >> I know. The bears are always really tough in this game, guys. Yeah, there's only one left, but the deer got me. Get it now. Do it now. >> That deer. Okay, come on. Hya. Come on. One more blast. Hya. Okay, we got the key. Finally, we saved the last person. Now it's fully school build mode time. >> That's what I'm talking about, >> bro. But where is the furniture guy? We need him. >> Yeah, he has not come in the entire game. >> Another rare chest is at the last person. You can go here, too. >> Oh, the best chest in the game. >> Yeah. >> Oh, I got the best blaster in the game. Let's go. Awesome. That's going to make it way easier. >> It's actually huge. Although, we already oofed everyone, so I don't know what I need it now for. >> Um, I mean, to protect ourselves at night from the bad guys, you know. >> Oh, that's easy, though. Right. >> I just use Adam's bait. >> Okay, I'm coming over. I'm pretty close to where you are. >> Get the basketball. Get it now. >> Oh, I see it. I see it. I'll >> get it now. Get it now. >> Oh, nice. And this like >> Get it now. >> Microwave. >> I got the microwave. >> Okay. >> I'm getting the basketball, too. I don't trust Adam. >> What? >> See you later. I >> I ran all the way out here. >> You're too slow, buddy. Snooze, you lose, buddy. >> What was the point of coming out here then? >> You snooze, you lose. You snooze, you lose. Guys, we will play dodgeball in this video now that we have these uh basketballs. >> You don't want to miss it. >> Adam, you're getting oofed by the deer. You better get home, buddy. >> I'm going to get that epic uh chest. >> Oh, okay. >> See what I get. >> Okay. Oh, I got to skip this cut scene, but I can't because I'm holding the basketball. There we go. Okay, nice. Let's get back there. Now we have Yep, we have two basketballs. Huge. >> That's enough to play dodgeball. >> Let's play dodgeball. Can I There's no stew cuz Adam didn't do his job. Of course. >> Yeah. There's just a normal chest for me here. >> Oh, really? >> Yeah. So, I think if you oof everything, then you get a better chest than me. >> That would make sense, >> right? Cuz you did all the work. >> I thought you found a green gem. You didn't? >> No, I found a red gem. >> Oh, >> yeah. Okay. Yeah. Good thing I do have this blaster. It's really good. >> We need that bad. >> This blaster is insane. >> It is the strongest blaster in the game. I wonder if they're going to add an even better blaster. Like maybe like a rocket launcher. Yeah, >> that would be sick. >> A rocky launcher. >> A rocky launcher. >> But I honestly feel like the laser one is still better because it has infinite ammo, which is pretty good. Oh, I'm starving cuz there's no food. I'm going to Oof. >> I have a bunch of food. >> Oh, great, Adam. I oofed because there's no food. >> Hold on. I'm coming back. >> Oh, wait. I can eat this. >> Ah, so close. >> That was close. Oh, I had a med kit. I should have used that. That's okay, guys. I I have to I have to revive. But it's no big deal. >> Yeah, >> guys. We got to go max level. >> No big deal because our only goal is to make the best school ever. I'm going to get these guys easy. Ah, I'm almost there. I can help you. >> I don't need Adam's help. >> I'll protect you. >> I don't need Adam's help. I would have been fine if I hadn't starved. >> Oh, man. >> I'm going to Oof. >> He's overheating now. >> There we go. Nice. Got him. >> Yeah. >> Got him. Got him. >> All right, I'll make you some stew, man. >> I did it. I did it. >> There you go. It's cooking. Easy. >> It's cooking. >> There's still one guy. >> Oh, I'll get him. I have a new weapon. It's the morning star. >> Oh, that's the good melee weapon. >> Do you want this one? It's pretty cool. Yeah. Drop it. It's mine. >> All right. >> Drop it. It's mine. >> That camp. >> Drop it. It's mine. >> It's pretty cool looking. >> Nice. Nice. >> It's the weapon that the bad guys use. >> Monk. Monk. Monk. >> You're bonking me. >> Yep. >> Okay, guys. Now that we've made everything, we now need to really work on the base. Adam, get as much wood as you can. I need more walls. >> I'm on it. >> Do it now. >> I'm chopping down all the trees. >> Oh, wait. I should get the hammer, too, guys. Wait, is the furniture guy here? The furniture guy has not spawned at all. I don't think >> he normally appears on the map. We don't have to like see where the map is, right? Like he wouldn't spawn in a area that's gray. >> I don't know what Adam's saying. >> Yeah. >> Good luck, little bro. >> I think it normally tells you when he spawns. So, >> yeah. No, it does. It definitely does. >> I'm going to go uh build the building hammer so I can move stuff. >> Good idea. Guys, this is about to be so epic. We're going to make the best school ever so that everyone all the four of the missing people can go to all different classes and get smarter just like Adam has to. >> Yep. We're all going to school, guys. Well, mostly just me and Justin. Foxy and boxing. >> I just go because Adam's mom makes me because otherwise he gets lonely and cries, >> right? Adam has to go to boot camp. >> Yeah, the plushies. Luckily, they don't need to go to school because they already um like >> It's because we have Lankybot and Lakbot has an AI brain. He taught us everything, >> right? I'll go get Lanky. Lanky has an IQ of like 9,000. It's pretty insane, guys. It's because Lankybot was made in a laboratory to be super smart. It is very smart. >> Where are you? >> Adam can't even find Lankybot. See, guys, there he is. There he is. There he is. Beep boopity. Scanning for awesome viewers. detected. Lankybot has a scanning ability in the Lanky Box Go videos. It is so awesome. >> Yeah, he's really cool. He can scan an entire area for stuff. >> Guys, leave a comment if you've been watching Lanky Box since we first met Lankybot. >> Do the Lankybot. >> It was I was in a science laboratory with Foxy and we designed Lankybot. It was crazy. >> Yeah. Leave a comment, guys. >> It was actually insane. >> We love Lankybot. >> Of course we do. Okay, nice. I'm going to build this anvil and then I'm going to be able to actually make the building hammer which lets us move everything in our base if we need to. >> All right, that sounds good. >> Very, very good item. >> We can like move the school around if we need to. >> Yeah, exactly. Maybe that'll help us move the chairs and stuff too, right? >> I don't know. >> Good call. >> Okay, got a treasure chest. Guys, this is going to be a sick building. We're only on day 36 right now. It's pretty good. >> I know. It's awesome. We're not even close to day 99. >> It's pretty good. Okay, I got a box of seeds. I'm going to throw this down here. Easy. Nice, >> dude. Imagine spending the night at a school. That'd be kind of scary. >> Uh, it'd be scary for Adam because he's bad at school. >> Like going to school at 3:00 a.m. >> Yeah, >> that'd be cool. >> Okay, I'll put this down here. Nice. We did it. See what I can build. >> Let's go. >> Let's craft the hammer. Let's go. Yep. Oh, you can make a chainsaw here. That's pretty cool. >> M I don't think that's safe for a school. >> What? No, but it'll help me cut down the trees and stuff. >> Oh, right. Good call. >> Nice. I did it. >> All right. He built the hammer. >> I got the hammer already. That was really fast. It's a pretty rare tool. >> That is nice. I got the hammer. Okay, now I can move stuff around. Now I'm the ultimate builder. >> That's what I'm talking about. >> Just like Boxy, guys. In Lucky Box, go Boxy. Boxy the builder, guys. Boxy can build. He has like a magic hammer and stuff. Awesome. He can build anything he puts his mind to. He's really creative >> because Boxy's made of cardboard. Ah. Uh-oh. >> Go away. Go away. Oh, I didn't know that. Look, the deer's eyes change color when you use the flashlight. I didn't know that. Okay, I'm back here. Let's go. I'm hungry. Where's the stew? Give me a stew. >> Right there. >> Mine. Back up. Nice. Okay, now it's time to really build, guys. It's time to super build. >> We got 100 wood. >> But we really do. I'm going to be honest, bro. We really need some The furniture. >> The furniture trader. >> Yeah. >> Yeah. >> I'm going to put shelves here. Are there like better looking shelves? Let's see if there's like a bookshelf. That might be from the furniture trader, too. I think it is. So, I'm going to go with this. Dude, you know what we need to buy from the furniture guy? Probably toilets, cuz that's where Adam would be. Oh, right. Cuz we need a bathroom at school. >> Yep. >> Otherwise, Adam. Yeah. >> Look, I made shelves. This looks really good. >> Awesome. >> What's so funny? So funny. >> Yeah, we need the best school ever. >> What's so funny? >> Cuz I I hide in the bathroom, especially when we play hide-and-seek at school. >> Stop putting trees and stuff there. I need to start building. >> Okay, I'll chop them. Chop, chop, chop. >> Okay, now I'm going to get a ton of this, guys. A ton of walls. Okay, this school is really coming together. Oh, I'm going to get the compass also and put it here. This will be geography class cuz there's a map and there's a compass. >> I like it. Now, >> look how awesome this looks, guys. People can give presentations like this. >> Yeah, >> this is fire, guys. >> This is where this thing is. >> I'll get a sund dial, too. That'll look really good. Put the sund dial right here. >> Nice. Now we know how much time is left in the day. >> No. So give presentations at school. True. >> The furniture guy's here. I heard it. >> Yeah, I heard he's finally here. He's finally here. What? You heard a what? >> A horse. Okay. Where's this guy? >> Clip clap. Clip clap. Look on the map. No. Bottom. >> I'll find him. >> He's south. >> I'll find him. I got a bunch of log wallprints, though. I should start using these. Adam, cut down these trees. Okay. I want you to clear out the base and move all the saplings out. >> All out of the base. >> Do it now. Do it now. I'm going to go meet the furniture guy. >> You got it. >> Do it now. I have an important meeting with the furniture guy. >> Time to buy some cool looking stuff. >> I'm going to spend all the coins I have. I have hundreds of coins. >> Wa. Yo, >> this guy's like levitating. Is that a glitch? Oh, that was cool. He was like floating. Okay, let me go talk to him. Hey, buddy. What do you got? Okay, this is really going to help our school. What's up? >> Time to make sure. >> Guys, there's so much stuff. We got to get this stuff, bro. >> We got to buy one of everything. >> Oh, they got a rare one. Okay, what is this? Uh, lanterns, dude. He's got a Where where's the toilets? Adam needs those. >> Are they available? >> You know what I mean? Adam needs those. A chopping board. >> I don't need a toilet. Yes, >> you do. >> No, I do not. >> Yes, you do. >> I don't know why Jesse keeps saying that, guys. >> Oh, I got a bunch of I can get a bunch of these. Okay, I got a bunch of chairs. I got a bunch of tables. All right. Uh, what else do I need? What else looks good here? A stool. Let's see. I like the stool. I like um H a lot of chairs. >> You're useless, bro. >> A lot of chairs. >> Adam looked at and went um >> I think the bookshelf on the top right's good, too. >> That's not a bookshelf. >> Wooden nightstand. That's pretty cool. >> That's not cool at all. What are we going to do? We got bean bags. >> Bean bags. Let's do that. Cuz then you can sit there. >> Okay. And then uh man, where's the toilets, bro? >> Maybe it uh spawns randomly. Like they don't have the toilets right now. >> Where's the toilets, bro? We got candles. We got flowers. I'll get one of these. That looks kind of cool. >> All right. It's not much else. I guess I'll just get chairs cuz the these chairs I can actually position. I can move them. Yeah, you can put them wherever you want. Oh, these are bookshelves. Okay. Thank you, buddy. Wait, there's really no toilets, bro. It's a rotating furniture shop, guys. It changes every time. Yeah. So, next time he's here, maybe we'll get some really rare stuff. >> Uh, I need to just find coins. Maybe I can just get more stuff while he's still here. Okay, I'm going to take out these bad guys cuz they might drop coins, actually. >> Oh, really? Oh, yeah. You're right. >> Yeah, they do. >> Give me the coins now. Drop them. >> Drop the coins now. >> Oh, he's got that big blaster. >> Yep, they drop. They all drop coins. This is great. >> Awesome. >> This is really good. Nice. >> Luckily, you got that strong blaster. >> Yep. Okay. Oh, I'm hungry. I can't even get my stew cuz I have so much stuff in my inventory. >> Oh, boy. But I can eat this. Okay, I got more coins. Nice. Yeah, guys, the bad guys all drop coins and you can use those to level up with the furniture guy. >> Yeah, which we need for the school. >> Yeah. Nice. Oh, there's two treasure chests in here. Double double double. Let's go. >> Let's see what we get. >> Foxy say this is a good build. Like, >> guys, Foxy is my best friend. Oh, the good axe. I already have that. >> And Foxy's your guy's best friend, too. >> Oh, your best friend. Foxy. Guys, Foxy's everyone's best friend. It's awesome. Okay. Ah, I got not good stuff. All right, I'm out of here. All right, I can trade for more furniture now, though. >> Yeah, pretty good. Oh no, it's night time. The guy left. >> All right, time to come back. >> That's okay. That's okay. Okay, I'm heading back. >> Maybe he'll come back next day with even more good stuff. >> Uh hopefully he comes back soon. It's already day 41. He's only spawned one time. >> I know. Kind of unlucky on that one. >> That's okay. I got a bunch of stuff now. I got a bunch of awesome stuff. >> Time to start decorating. >> Okay, so now I'm really going to use all these log walls. Adam, you got to chop these down. They're in the way. >> I know. I got to let them grow first. >> Chop down. Chop him down. Don't talk to me. Don't talk to me till you chop him down. There's Stew in the bot also. >> Good. Okay, I'm going to put this down. Okay, so this will be the entrance to the school. >> So that's where everyone starts their day. >> Yep. >> Got it. >> This is going to be awesome. I'm going to chop this down because Adam planted these here, which is not good. >> So, you don't want any trees in the base at all? >> No. Plant them outside the circle. The circle can't get any larger, so plant them outside. I don't know why you plant them in. >> I'll move them all out. >> Move them all out of here. >> You got it. >> Move them now. Do it now. Don't talk to me. >> All right. We're gonna have a ton of wood to build all these walls. >> Yep. Which we need. I'm going to use the hammer now and move some of these torches so they look a little bit better. >> Uh-huh. It lights up the way. >> Just pick it up. Oh, it makes the base smaller if you pick it. No. Oh, wait. It doesn't. I don't know. >> Strange. >> I'll just pick them up. >> I'll chop down this tree right here, too. >> Uh, it says I'm starving. I need stew. >> There's stew in the pot. Can you get it? >> No, I can't use it. >> Oh, man. >> I can't use it. >> All good. I moved >> all the blueprint might drop. >> It doesn't matter. I I just have wood. Okay, it's cuz I have too many blueprints, guys. >> Yeah, that's what that will do to you. >> Go back to Guys, if Adam doesn't make more videos, you know why? It's cuz he's at school. This is real, guys. This is not a joke. >> Yeah. And Justin's there next to me, so I'm not lonely. >> I have to go and basically keep Lil Bro company, otherwise he cries >> pretty much. Our mom's forcing him to go. >> Yeah, I don't need to go. Okay, nice. I'm going to build this. I'm going to build a giant circle now around the entire school. >> Thanks for coming to school with me, though. By the way, >> you're welcome, buddy. >> I really appreciate that. That's nice of you. >> You're welcome, buddy. Otherwise, you'll cry. >> I know. >> There was one time Adam finished school. Adam's mom was supposed to pick him up. She left him there for like 2 days. >> Yeah. Well, it's okay. >> Well, our school is the living room, but >> Right, cuz I got to do some homework then. >> Yeah. Chop, chop, chop, chop, chop. Dude, we're about to have a ton of wood. >> Hurry up and do it. >> So much wood. >> Hurry up and do it. Okay, now I got a bunch of torches. I'm going to make this look better because we can put them anywhere now, I think. Oh, no, I can't. Oh, wo, the base like shrunk because we're moving the torches. >> Yeah, that's kind of cool. I didn't know it did that. >> Oh, weird. >> Okay, I'll just put the torches like here so it'll kind of follow the school. >> I don't think I've ever seen this much wood before. >> How much? >> This is crazy. >> How much you got? >> Uh, probably like 200. >> Let's see Adam's screen. How much you got? >> So, you guys can see here all this wood that I chopped down. I'm about to put it in the shredder. >> That is a lot. That's a crazy amount. >> That's pretty nuts, >> guys. I'm surprised Roblox is not lagging. Sometimes it lags if you have that much wood. >> But it's good because we can build a ton of walls and I'm the lumberjack class, so I get extra wood every time I chop down a tree. >> Yeah. All right. Well, put it in the shredder. Quit yapping. Let's go. >> Let's go, buddy. >> Here we go. >> We got no time for this. >> It's school time. Let's go. >> School is in. >> School is cool. >> Always. >> School is super cool, guys. >> It's always cool. >> Always try hard at school. It's important. Nice. Okay, this is looking really good. Okay, so this is the entrance to the school. Yo, I'll put this here so everyone knows this is like the entrance. You know what I mean? >> All right. Hopefully we can get some signs, too. >> This looks so cool, guys. >> Cuz Yeah, I think the decorator guys, he'll uh sometimes let you build a sign so you could write custom stuff. >> Really? >> Yeah. >> So, we can label all the rooms. >> Exactly. That would be pretty sick. >> That would be actually super awesome. >> So, it's all just luck. I'm going to put these here. Yo, look at the entrance. Okay. Okay. I like it. >> It looks super awesome. Guys, I got to go like this. It's really hard to move the stuff how you want it, though. >> I'd go to that school. >> Well, you you do go to school. >> Yeah. >> Yo, look at the entrance. You enter. >> Oh, that looks so fire. I'm going to move these torches, though, cuz they're kind of in the way still. >> All right. >> And it's going to look awesome. >> No problem. >> Nice. >> No problem. >> I'll put the torches like here. Yeah, the torch. It does move the barrier of the base. It's kind of cool. >> The circle. Yeah. >> Oh no. Getting attacked. >> Don't be a little baby. >> You might have to protect me cuz I don't have a lot of good stuff. >> I'm not I'm not helping you. >> But you got the best blaster in the game. >> I'm not helping you guys. Look at the entrance of the school. This looks awesome. When you enter the school, you know it's time to learn. >> Yep. It is school. >> It's learning time. I'm hungry again. >> There's stew. >> All right. Good thing I have stew. Nice. All right, dude. Dude, you got to pick up all this wood. Yo, >> I know. There's so much still. I've already picked up a ton. >> And make sure you plant all the saplings like far away. >> Yep. I'm going to plant them outside the base. Oh boy. I'll pick all this up. >> I'm going to pick all this up and throw it in the shredder. Wow, that is a lot of wood. Nice. >> Bad guys. >> Okay. Wow, we have a lot of wood. >> Yeah, I know, right? We can build a lot of stuff. >> I wonder if I can just hide from these guys. No, I can't. >> I don't think that's going to work. >> I'm just going to use the laser blaster. Got him. Oh, there's a bunch of coins, too. That's great. >> Okay, I'll try blast them, too. >> Well, obviously. What else are you going to do? >> I use this the the good the OP weapon. It's not very OP. Oh, the morning star. >> It's not very good. It's kind of It's kind of slow. >> Oh, man. >> Everyone oofed. We're back. All right, cool. Don't worry. I got the best blaster in the game. Oh, >> I got like revived and then glitched. So, I'm not revived. >> I can try to find a med kit and save you. H Let me try to oof again. >> Don't oof, Adam. >> Yeah, you you might have to revive me. That's weird. >> Maybe you could rejoin the game. Um >> I'll I'll find a bandage. >> I'll find a bandage. Just wait. >> No problem. 135 wood. Cool. >> I don't know where we're Oh, there it is. Nice. Okay, I revived. But this might be a glitch. I don't know. >> Let's see if it works. >> Get up, Adam. Nice. >> All right, I'm back. >> Nap time's over. >> Back to work. >> Nap time's over. Back to work. That's what Adam's mom says to us. >> No more sleeping. >> Yep. All right, hurry up, Adam. Go more wood. So, I can actually throw these chairs away, guys, because um we have the chair blueprints, which are even better, >> right? We don't even need them. >> Okay. Um keep Oh, wow. The base is huge, bro. Okay. Um more wood still. >> All right. Can't do go over right now. >> We have so many. >> Time to build like crazy. >> Okay. So, I got to build this like fully to go fully around >> like Boxy the Builder. >> Yeah, guys. Like Boxy the Builder in Lanky Box. Go. Boxy the builder. >> Boxy has building powers cuz he's obviously a box and like there's tape on him and stuff. He can he can build. He's awesome, >> right? He can build it. Anything he wants with his hammer, he can build. >> That's Boxy the builder. Let's go. >> Yeah. >> Okay, I'm putting the log walls down. We're going to make this school fully complete. >> Wow, that's a lot of blueprints. >> It is. This is crazy, actually. This is actually a crazy amount of stuff. >> I know. Well, we spent a lot of money with the furniture decorator and we spent a lot of stuff with the wood. >> Dude, the school's only like half done, though. Wa! Look, guys. This might be the biggest base we've ever made. >> It is for sure. >> Okay, pick up your bear pel. There's one over here. You can level up. >> Oh, nice. I would love that. Thanks, man. >> You're welcome. I did it. >> Yeah, you got that bear pel for me. That's great. >> What does he got? Oh, I got the best axe in the game. Let's go. >> Huge. Now you can help chop down, too. >> Uh, no. That's your job. >> I do it now. Okay. We got to clean up the base, dude. There's all these bad guys everywhere. Clean it up. >> Clean up. Clean up. Everybody clean up. Okay, so this is like the Yeah, this is the gym area. I got to finish fencing that off, too. >> More wood, Adam. Do it now. >> More wood. Okay, I'm pling them right now. >> We need more wood. >> Holy moly. >> And then drop the wood that you have off. >> Yeah, I already did. >> Oh, you don't have any more? >> No, >> bro. >> I put it all in the machine. >> Are you serious? >> Yeah, that was like 300 wood. >> We need way more log walls, to be honest. >> Oh, really? Wow. >> Yeah. Well, look at the base. It's huge. I could make the base smaller though. >> I could make the base smaller. It's too big. >> And then the outside could be like the recess area. >> It's too big. I'm gonna pick these up, guys. I have a better idea. >> Oh, really? >> Guys, it's a good thing we have the hammer. Otherwise, we'd be kind of cooked right now. >> Yeah, we can move stuff around. >> Yeah, it's pretty good. Pick all this up. Nice. Nice. >> Yeah, this is huge. >> This is too big. >> This is like a mansion school. >> It's too big because there's nothing even over here. >> Yeah. Where did that barrel pel go, by the way? >> It's over here. >> Oh, I see it. I see it. I'll grab it. It's over here. >> Nice. Thanks, man. Okay, guys. I'm going to make the base waist smaller so that we use the the wood better. >> Sounds good. Yeah, there we go. >> This is too large. >> Recess area. >> So, I'll make this map like the back of the school. So, this is like where people will give presentations. >> Oh, like a secret presentation room. >> No, no, it's just No, no, no, not much larger than this. >> Got it. So, it's like an extra classroom. I see. >> Yeah. >> For even more learning. Yeah, max max learning. >> Yeah, max brain power. >> Have to max out learning. Oh, this could be like like a like a crafting station. Like crafting class or something. >> Oh, arts and crafts. >> Yeah, >> art class is really fun. >> Okay, guys. I'm definitely going to make this base way smaller. Yeah, but now I can actually fence off the gym. See the gymnasium? >> Yep. Yep. Yep. >> Okay, this looks pretty fire. >> We're really cooking now. And we should be pretty safe at night, which is great. >> Yeah. >> So, I like it. We should not oof again. Yeah, it's going to be the safest base and safest school. It's going to be awesome. The school is under protection. >> I cannot believe it's only day 51. >> Yeah, that's kind of nuts >> cuz we're zooming and we have all four people. It's still only day 51. That's kind of crazy. >> I guess it's cuz we didn't build the beds. >> Yeah, which we can. We should build like a nap area. >> You know, I'm going to be hanging out there. >> That's That's what I'm saying. That's what I'm saying. >> Let's go. >> Okay. Nice. Okay. Yo, so now the PE room is pretty nice. that this is like the gym area with swimming pool included. >> Oh, I can move the boost pad. That's actually really cool. Okay, swimming pool and a washing machine. Okay, love it. >> So, you can dry off. Oops. Wait, I thought I picked it up. Huh? >> The boost pad. >> I got to pick out the boost pad. Nice. There we go. >> Okay. Where should I put the boost pad? I should put it Oh, I can put it right here so that people can uh like run home from school. >> Oh, genius. That's actually pretty cool. Okay, now now we really got to get to cooking. We got to get to just building, dude. >> More cooking or >> more wood? More wood. >> More wood. >> That's what I mean. >> Okay, we're about to get about 100 trees. >> Get more wood. Do it now. >> Okay, there's some stew coming up. >> Do more wood now. >> Got it. >> Cuz I got to fence this off. This is the cafeteria. >> Can do. Can do. >> Where's the wood? >> I'm almost there. >> Do it now. >> Ah, yeah. It's daytime again. >> We need the furniture guy to come back. Okay, now it's time to really start building. And a bunch of our trees grew. >> Nice. Okay, wooden stool. I'll put this like right here so that people can learn. >> Good call. >> Where's my wooden chair blueprints? I thought I got like a hundred of these. What >> did they fall when you oofed? >> No, >> you don't lose that stuff, right? Yeah. No. >> What? Oh, it's just like stacks like this. >> Oh, yeah. >> Okay, I'll put chairs here so all four people can learn. >> That's going to be a lot of learning in that area. >> Yo, this is awesome. Yo, look. this porch. You can actually sit on these >> huge. >> You can actually sit on those. Okay. Now, this will be the cafeteria. So, I'm going to move the this to be like back here. >> Sounds good. >> So that the people can cook like right here. And then we'll put a table. Oh, it's going to be awesome. People can sit down and eat together. Yeah. You bring up your tray, you get your food, and then you sit down with all your friends. Yo, >> I'm going to O. It's going to be awesome. What? From hunger. >> Yeah. Maybe you should cook more then. >> Boom. Got it. Okay, I'm okay. Yo, we're going to put four chairs so they can all the four missing people can eat together and that'll help us get the secret ending. >> That's the best. >> Yo, this going to be so awesome. >> I like this a lot. This is probably one of our favorite base builds we've ever done. >> Yo, that's awesome. Okay, then we got a gym area. Let's see if I have anything for the gym area. Not really. I got like this circle that can like do uh I don't know, some sort of like jumping exercise >> like a trampoline >> like with the circle. Yeah. Oh, we got bookshelves. That's good for learning. >> That's good for the classroom. >> I'll put that right here. I'll put that right here. So, it looks like a real classroom. The gym. Um, I guess we could put some logs in there and then maybe they can like lift up the logs and stuff. >> They can't do that. Well, what what else would be good for the gym room? Trying to think. We still got to find some toilets for Adam. >> Those are for uh the decorator. >> We still got to find toilets for Adam. >> I know. So, I can hide out. >> I'm going to put bookshelves here. So, this looks really good. Nice. Sounds good. >> Guys, this school is really coming together. This looks awesome. >> Yep. And it's only day 56. One of our best builds of all time. >> Okay. >> And you guys are watching it. >> But you got to you got to hurry up and get more wood, buddy. >> Oh, I got a lot already. >> You got to hurry up. >> There should be a ton in the shredder. >> Now, guys, we heard you can actually get uh the basketball hoop blueprint. That'd be insane if we put it here, >> right? That's one of the more rare blueprints. That's one of the more rare blueprints. Go to timeout. No. >> Go to timeout. >> Okay. >> You're going to get me in trouble. Adam's mom's going to say he's not learning. It's not my fault. >> I'm already here all the time. >> Guys, DJ edification. One like equals one school for Aiden. >> Adam, please leave. >> No, you need to go to school, man. This is getting crazy. >> That's like a tongue twister, though. >> No, the word boooint is not a tongue twister, bro. >> Yes, it is. It's hard to say that, guys. >> Wo, you can pick up their tents. I didn't know that. Oh, we could build a little fortress. >> What? >> I didn't know that either. >> This is crazy. I'll move it out here so they can go camping. >> Let's go. >> Wait, that's so cool. So, you can clear out the area. I didn't Guys, we we never knew that. >> So, we can have outdoor class time. Wait, that's so frier. I didn't know you could do that. >> They can learn all about camping and staying alive and stuff. >> This is crazy, dude. I did not know you could move that. >> This game just keeps getting better and better and better. >> It really does. I'm going to put all the tents out here so they can all camp out together. >> I love it. >> And this is outside of the school. >> I love it, man. >> This is outside of the school. >> I'm hungry. >> We're both hungry. >> And you got no food. >> I'm coming back. >> Of course. Of course. >> Hold on. >> Of course. I don't cook nothing. >> I got a bunny right here. >> Do it here. Do it. Do it now. Oh no. Do it now. I'm trying my best. You are a giant noob. I'm out of here. I'm not helping you with my food. >> Okay. Well, a bunch of bunnies are coming into the school. That makes sense. The bunnies like it, too. >> My food. Okay, >> cool. >> My my food. >> Yep. >> We got to make like a like a lunch counter. That'd be awesome. >> A lunch counter? >> Yeah. >> Um, excuse me. Do you think maybe I could have a bite? No. >> Cuz I'm I'm really hungry. >> No. Go away. >> Please. >> Yo, guys. This This place is like really empty. It's really good. It looks really good. >> Please. >> You moved. Go away. >> We need more. It's all right. >> More log walls. >> More log walls. >> Yep. >> Can't do. I know where to get them. >> We're almost done though with uh Okay, now the the thing has been fully fenced off. Okay, >> so no one can get inside here. >> Fully fenced off. We got the cafeteria right here. This is pretty sweet. Look, everyone get their food and just chill out and eat here. >> So sick. >> We should uh put the bofuel processor. Maybe we should move that. So, well, it looks okay right here. I'll move I'll move it like over here. If anything, that could be for like science class because it kind of tells you about bofuel and stuff like that. >> What is bofuel, Adam? Do you know what that is? >> Bofuel? >> Yep. >> Oh, I don't know. I think it's like um >> See, Adam doesn't know. >> It's like a battery or something. Or it's like it's like fuel for a honestly. >> We all know you don't know. Don't worry. >> What is it? >> I'm not I'm not going to tell you. >> Okay, got it. >> Secret. Put this here. Yo, this is awesome. Look, look, look, look. Adam, you sit down. I'm going to give a presentation. >> Okay, >> you sit down. I'm going to give a presentation. Wait, I got to move. I got to move it closer. I got to move it closer. I move closer. Get out, get out of the chair. >> What am I going to learn? >> Get out of the chair. Look, look, look. I got to make a table like right here so everyone can give presentations and hang out. >> All right, >> look at this. Check this out. >> I'm ready. >> I'll put tables or I'll put chairs right here so you can sit. >> Okay, you could teach me about your favorite blueprint. >> Stop it. You sit there and look, I can give a presentation. Look at this. >> Hello class. >> Look, I'm giving a presentation right here, bro. What do you want to present? You're >> looking at the compass and stuff, bro. >> You can teach us about the directions. >> I'll teach about all sorts of rare stuff like um like um >> how do axes work? >> What are you doing? >> Back up. Back up. Back up. >> What are you doing? >> My class. My class. I could teach about who invented uh flashlights. Okay. Who? >> Benjamin Franklin. Why would you laugh? >> What? >> Like, why would you laugh? >> I don't think he invented flashlights. >> I don't Well, who did >> the Flash? >> Now you're just trying to be funny and it's not funny. >> No, I say hi. Hi, Adam. >> No, >> you I don't know even who invented anything about what's going on. Stop it. >> Okay, got it. >> Stop it. I'm waiting for the furniture trader to come back. Oh, look at all the wood out there. Wo! >> Wow! >> Keep putting in the machine. Do it now. >> Yeah, we got a lot more. What else do we need to build? What else we need to build? I feel like this is pretty good. We need way more furniture, though. And we need the signs. >> Yeah, the signs would be really helpful. Although, I don't know. >> We also have to build bathrooms. I forgot about the bathrooms. >> That's just random. >> I forgot about the bathrooms. So, to do that, I will open up this part of the school and start building bathrooms. >> Okay, sounds good. >> I'll start building bathrooms right here. >> Easy peasy. Okay, I picked these up. Now I'm going to build the bathrooms. They'll go here. >> All right. >> Yeah. >> Now, hopefully we can get the toilets from the furniture trader, guys. >> I don't know when or where he's going to spawn. >> It's random. You never know. And we should also probably put some carrot plots in the cafeterias with this food. >> Ah, hold on. I'm making bathrooms. >> Okay, no problem. >> We're over being attacked. >> Uh-oh. I might oof. >> Of course. >> What are you doing, man? >> To what? Hunger? Yeah, I just did. I was only been getting the wood. >> Get more. We're We don't have enough. >> Yeah, >> get more. >> It's all good. It doesn't matter how many times we respawn, guys. >> Get more. Get more. I got to build the bathroom out here. >> All the way out there, huh? >> Building a bathroom here so that people can use it. >> Duh. >> Cuz every place needs a bathroom. >> Oh, mice do. >> Yum, yum, yum, yum, yum. >> Can I Dude, this is pretty good. I mean, it's a giant base. It looks really good. >> Oh, we're going to get attacked. >> That's fine. Yeah, >> cuz they can't really get in the school. They can't get in the base, >> right? They're just outside the base right now. >> They can't get in the base. >> Oh, they're really strong, though. >> No, they're not. >> Yeah. >> Don't be a giant baby. >> Got one. >> Get them. >> Boom. >> I need all the coins. Don't take the coins. >> I won't. >> Don't take the coins. >> Oh, one did get in our base. >> Well, they they came in through here where the bathroom's going to be. >> You need to get more wood, so I can fence that off. >> Got that one. >> Get more wood. >> Get out of here. Nice. >> Get more wood. Do it now. >> All right. Can do. >> Where's the last person? Yeah. I don't see them. >> Oh, they're out here. There's two of them by the bathroom. >> You got it? >> Yeah, I got them. Easy. >> All you. Got them. >> All you >> got them. Too easy. >> All right. You're about to get a ton of wood. Don't worry. >> Okay. Put it Put it in the machine. Then I'll finish building the bathroom. But I need We got to build the toilets. >> Well, that's just the luck. Whenever the furniture trader wants to show up, >> we got to build the toilets. >> That'll be the last thing we build in this base. >> The toilets. Yeah, do it now. >> All right, no problem. >> Okay, guys, we have so many log wallprints. This is crazy. Okay, go like this. I'm going to finish. Yep. This will be the wall to the bathroom and then we'll put the toilet back here. >> Love it. >> It's going to be pretty awesome. >> I love it. >> I need one more. One more log wall. Yeah, one more log wall. >> I'm coming back with 20 right now. >> Day 62. We're going to wait for the furniture trader to show up and then we'll buy a bunch more stuff. Okay, >> guys. I feel like this looks pretty good, but we need to put a toilet back here, >> right? We need the toilet. >> We need the toilet. >> And then we can have everyone go to class. I think this is pretty good. I'm not going to lie. Come on. Come on. It's definitely our biggest base build ever. >> Yeah, it's pretty good. Okay, what else do we need? You tell me. Until the furniture trader shows shows up, what else do we need? >> Um, let me plant all these trees, then we'll do a tour of the school, and then we'll think of some ideas. >> Okay, cuz schools are pretty cool. >> School is cool. Put a bean bag here for gym class. >> I'm going to oof to hunger again. >> Another bean bag here for gym class. >> I'm going to oof standing in the shredder. I wonder if the logs just fall in. >> Yeah, they will. That's smart. >> And boom. Wow, it did work. >> Yeah, that's pretty smart. But you didn't drop that many. >> Yeah. >> Oh, a freezer. We need that for the cafeteria for sure. >> Oh, for ice cream and stuff. >> Yeah, I'll put that right next to this. Yo, it's coming together. >> Okay, so cafeteria. Let's definitely get some uh farm plots for carrots and corn and stuff. That'll be good. >> You got to make some stew. I'm going to get hungry >> with stew. All right. >> Okay. I'll make some uh carrots. Where should I put them? Like right here. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. I'll put a bunch right here. It's going to look awesome. >> Good idea. >> Make some food. Make some food. >> I'll bring some berries back there, too. And we can put those in the cafeteria. >> Berries. Just decoration. >> Yeah, I think it'll look kind of pretty. >> Okay, guys. Now, I think we're gonna decorate a little bit more and wait for the furniture trader and buy some more stuff. Okay, guys. Now, we got a ton of wood. We have 200 wood. I'm going to build a bunch more walls and then we're going to show you guys how to get secret items in the game, like the basketball hoop and even toilets, guys. We can get those from around the map. Adam, I'm going to make some walls here. Yo, wait, guys. Also, our cafeteria looks really good. We got this. We got this. Yo, we got a freezer filled with stuff. And we got a microwave. That looks so good. >> Wow. And we have all this fresh fruits and vegetables, >> guys. It's going to be awesome. So, Adam, you defend our base from the bad guys. I'm going to keep building some more walls, guys. We're going to turn these all into classrooms. Then we're going to go meet the furniture trader. Also, we can actually go pick stuff up from around the map, guys. That is a secret hack. You can actually pick up the toilets that you find around the map. It's pretty crazy. >> Wow. Or even like the basketball hoop. >> Yeah, it's going to be awesome. >> Oh, that's sick. >> It's going to be super super super awesome. Okay, blast these guys. >> I'm so sick of these guys. Get them out of here. I'm going to oof. I'm going to oof. Oh. Oh. >> I know. They're meanies, guys. >> Oh, they do a lot of damage now. >> Don't ever let people be meanies to you. >> Yo, but because this school has like all these walls, we can hide from them. It's pretty good. I know. It's nice. I'm not taking much damage. >> Yeah, it's pretty good. Pretty good. >> Pow. Pow. Pow. >> Okay, I'm going to get this stuff. Nice. >> Uh-oh. >> Last guy. Hya. >> This is easy. Hya. >> And got him. >> Hya. And last one right here. Close up. >> Get him. Yeah. Got him. >> And we got a bunch of uh gems. I think there's one more, but it's okay. We don't have to fight them. >> Yeah, no problem. >> I'm going to go um go look for more stuff, guys. And I'm going to finish building walls. So, this will be its own classroom right here. And I'll go like this. Oh yeah. This is going to look awesome. >> Let's go. >> It's going to look so awesome, guys. And we'll give you a finished school tour at the end. >> Yeah. Don't go anywhere. We still got to get that school ending. >> It's going to be awesome, guys. We're going to like give a whole tour of this whole thing when it's done. >> Yep. We'll show you all the different rooms that we built. >> Okay. This is so awesome, dude. Hold on. Let me add another wall here. Okay. Okay. Now, I'm going to go find some toilets and stuff. Okay. There's still some bad guys, but it doesn't really matter. It's It's no big deal. >> No problem. >> Okay. We got a bunch of these walls. pretty good. I'm trying to think of um uh Okay, I'll save these for right now. I'm going to drop these right now by the fire because I don't need all of them. >> Oh, just the blueprints. >> Yeah. >> Okay, sounds good. >> Oh, the wooden shelf. I can put this here. So, like when people enter school, they can put stuff here like their lockers. >> Oh, okay. It's like a cubby. >> Yeah, exactly. Yo, this is Yo, this is fire. >> Got the bean bag just chilling. >> I'll put a stool right here so people could sit here. Nice. That looks pretty good. Got a wooden table. Okay, so now I'm off to go find uh the bathrooms and stuff. So guys, to do that, you can actually pick it up from around the map. So I'm going to go to a basketball court like the one we saw earlier, and I should be able to pick it up, guys. >> Oh, like using the hammer tool. >> Yes, guys. I think there's a basketball court out in this direction. I'm going to go over here. >> Wo, we've never tried that before, >> guys. We've never actually picked stuff up off the ground before. This is going to be awesome if it works. >> Yeah, if it works. Okay, let's see. Where's the basketball court? Oh, there's one over here. There's I know there's one in the other direction, too. >> Basketball or bathroom? >> Yeah, I'm looking. I don't think we've seen a bathroom, though this whole time. >> Yeah, they're pretty rare. >> Oh, there's a stronghold over here. Oh, there's a stronghold over here. >> But is there a basketball court here? No, >> doesn't look like it. >> There should be one nearby, >> guys. Oh, there it is. There it is. There it is. Wait, so with the hammer, I can pick this up. >> Let's see if this works. No way. >> Guys, this is crazy if it works. Oh, we picked up a basketball hoop. >> That's so awesome. So now we can bring this back to base. >> Wow, we're learning. >> Wait, so now I can just explore the map and just do more of that. >> Yep, exactly. >> That's so good. >> We could even get maybe two basketball hoops. >> Yeah, of course we need that. This is going to be so awesome, guys. >> Cuz every basketball court needs two hoops, guys. No, I got something even better than that. We're going to put the basketball hoops next to that pond. So it's like a water basketball game. >> Oh, like a pool party basketball. >> Exactly. >> I like that. It's going to be so fire, guys. And we're actually going to play basketball. First person to make a hoop wins a prize. >> Okay, deal. >> Guys, this is going to be so sick. Okay, let's let's find the bathroom. And also, I can maybe get another basketball hoop from somewhere else. >> Let's look around. Oh, the magma area. >> Uh, I don't think there's anything in there that we can pick up, actually. >> I don't think so either. >> I'm looking for a bathroom. I don't see one. >> Yeah, I think the only things you can pick up are the hoop, the toilet, and the wolf head in the cabin. >> Oh, you can pick that up from the cabin. >> Yeah. So, that's pretty cool. If you find a cabin, you can do that. >> Found another hoop. That's perfect. Now we got two hoops. That could be like the mascot of the school, the wolf. Dude, that's so cool. I didn't know you could do that with a hammer. That's actually such a hack. >> Yeah. Nice. We got the second basketball hoop. So guys, we actually can finish our gym. Now all we have to find is toilets for the bathroom. Wow. It's so cool that you can use the hammer to actually take items from the map. >> Wait, this is going to be so sick, dude. Okay, let's go over here. Yo, wait. Oh, I think I see a bathroom. We can actually get the toilets from in here. >> Oh, no way. We're going to steal the toilets. >> Yo, this is going to be so sick. Okay, let's go here. Okay, this is going to be so awesome. Wait, can we actually pick these up? So, we got basketball hoops. Oh, you can pick them up. We never knew that. >> One. Two. Can you get all? >> Yeah, we got three. We need four. We need four. Okay. Wait. I'm open this charger, you guys. There's four missing people. So, we got to get four toilets. >> One for each missing person. >> Four toilets. Nice. We got four. Nice. Nice. Nice. Okay. >> All right. >> Nice. Okay. Let's go back in here. Okay. >> Any toilets in Oh, more toilets. >> Nice. Nice. two. Oh, there's only three. Okay, so we got uh seven total toilets, but we only need four, guys. >> That's a lot of toilets. >> Okay, so now let's go back to the campsite and we can actually build Oh, Adam moved again. We can actually build the best bathroom ever for this school >> and the best gym, too. >> Okay. Uh where am I going? Uh I'm getting chased by the deer. Go away. >> Oh, it's so dark out and it's raining, guys. >> Wait, we're actually getting chased. Okay, I got to go home. We got to go back to the forest or the fire and then we got to build the best bathroom ever. So guys, I think after we build this, we're basically done with the school build. >> Yeah, because we have the classroom, we have the gym now with the basketball hoops, and now we have even a bathroom. >> Okay, let's go back. Oh, go away. Even the deer wants to go to the school, guys. That might be part of the secret ending. I feel like the deer wants to join the school cuz it's going to be so awesome. >> That would make sense. The deer probably doesn't like just being out in the forest. >> Okay, let's go over here. We got to get back. Oh, nice. I see our base. Go away. Go away. Nice. >> The deer is getting really mean. >> Okay, I'm going back to the base. Oh, there's a bunch of wood outside. I'm going to go back. Nice. Okay. And we can start building uh back here. Let me see where the toilet blueprints are. Yep. Wait, we have a bunch of them right here. I got the hammer. Do I need a hammer to build it? I'm going to expand this wall. So, we have a larger bathroom. >> Oh, that's smart. Cuz you didn't think we'd have four toilets. >> I didn't think we could pick up the toilets at all. I thought we bought those from the furniture trader, guys. You actually can just pick them up if you have the hammer, but we showed you how to build a hammer. You got to find the anvil. >> Yeah, we're learning. Oh, I like that base, dude. >> Okay, nice. We got to make this larger. It's going to Oh. Ah. Spin up. Nice. Go like this. Okay. And now we're going to get as many log walls as we can cuz I got to finish the bathroom here. We got to make it larger. >> The toilet room is almost as big as the classroom. >> This is the toilet room. It's about to be lit, guys. This will be Adam's favorite subject in school. >> Yeah, this is where I'm going to hide when I don't want to take a test. >> Okay, I'm gonna put this here. The game's like kind of lagging. Nice. Okay, we did it. And now I got to buy the sheds. I got to get the rain storage, guys. These will be like the stalls. >> Oh, for privacy. >> Yeah, these will be like the stalls. Okay, so let me rotate this. And we're going to put down all four. This is about to be sick. >> You're becoming a master builder in this game. >> Yeah, I'm trying. Okay, I got to put this right here. Um I got to see if there's space for all four of them. I'll go like this. Nice. And then we put down a toilet. >> Oh, like a wall so they can't see. >> We put down a toilet. Oh, wait. I'm hungry. I'm hungry. No. >> Uh-oh. I think there's food. >> Yeah. Oh, there's food in the cafeteria, guys. Look, we got the microwave. We got the freezer. This is awesome. Nice. I had a nice meal in the cafeteria. >> Yeah, the lunch lady made it. >> Go back to building. Okay, guys. We're going to finish building all four of the toilets. I got to put walls here. And then Yo, we can actually put this here. Wo! No way. There's a toilet. >> This is actually going to be sick. Hold on. Wait. Wait. Can I actually put it here? Wait, I might uh Wait, why won't it Why won't it go here? >> Does it work? >> Wait, maybe I have to move this first. Maybe I have to pick this up. >> Uh-oh. >> I have to put this first. Guys, hold on, guys. We never know that you could pick these up. That's kind of crazy. Maybe I have to put these first in here. >> Yeah, this is all brand new to us. >> Okay, I put this here. Nice. Boom. And then can I put I'm going to put this shed. Oh, it does work. So, guys, you have to put the if you want to build like this, you have to put the toilet first and then rotate this around it. >> So, we got a secret bathroom. >> Yo, that looks so epic, bro. >> That's lit. >> That's actually pretty nice. I'm going to put four of those so all four people can use them and they can have a bunch of bathrooms. This looks pretty sick. All right. Yeah, it's really cool that we can actually grab the toilets now. >> Okay. Nice. And then I'm going to put a storage thing over this right here. Nice. >> Nice. Got some privacy. >> Okay. Yeah. And then I put walls between them all, too. So there's uh so there's like stalls. Nice. Nice. Nice. Put a wall right here. Yep. Guys, this is going to be super awesome. I wonder if we can get like a door from the furniture trader, too. Uh oh, we're going to be attacked again. Not before I finish setting these up. We got to finish setting these up, bro. >> They probably want to use our bathroom. It's so lit. >> Yeah, guys, this is actually a pretty cool build. Okay, let's go like this. Nice. Boom. >> But you guys can't use it. It's only ours. >> Yeah, guys. Well, the four people can use them. >> Yeah, the people we rescued, but not the bad guys. >> No, the bad guys cannot use them. Okay, drop this here. Nice. One more. One more. Dude, this looks sick. Okay, one more here. Okay, go like this. Yo, >> wow. >> I got to put one more. I got to put one more. We got one last one. Put it right here. It's a real bathroom. >> You fight the bad guys. I got to put these here. >> Okay, I'll try my best. >> You fight them. >> All I got is my axe. >> Nice. What? What happened to all your stuff? >> Well, I don't have any ammo. >> Oh, wait. I got to get another wood shed. Okay. >> Oh, boy. >> Nice. Go here. I get a wood shed. Nice, guys. Guys, get really strong. >> You fight them. >> I'll try my best. >> Wait, why? Wait, I bought a wood shed. It like went away. What? Rain. Oh, we're out of scrap. We need scrap. We need scrap. >> Oh, metal scrap. Okay, got it. >> We need scrap. We need scrap, man. Wait, I'm going to use the washing machine cuz I don't think we need this now. We have a basketball hoop. It's going to be nice. Okay, I'll do this. Is this enough scrap? Yeah, it is. Yeah, it is. Okay, nice. Perfect. >> Oh, here. You go fight the bad guys. Okay, nice. That's kind of weird, guys. Why is this made of scrap? It's clearly all wood. Huh. Okay, put this here. >> Yeah, it doesn't really make sense. Should be made of logs. >> Nice. Nice. Boom. Okay, guys. The bathroom is finished. I will make the I'll put like doors. It'll be awesome. >> Hooray. Okay, I'm going to put doors. Going to be pretty sick. Go like this. Nice. Okay. >> Lot of privacy now. >> Yeah, we put this here. Yeah, it's going to look awesome, actually. All the bad guys. >> Wait, is there something I can make instead of there's a few behind our base, but it doesn't really matter. Is there something we can get that's like not the wall? I guess we have to. I thought I got doors from that furniture guy, but I guess we didn't. >> Um, >> I don't think we did. >> No, we didn't. >> It doesn't matter. I'll go like this. Oh, I'll go like this. So, it's like uh it's like stalls. Look at look look. That's pretty nice. >> And all the bad guys, they're actually trying to get into the bathroom. >> They're trying to use the toilet. >> You can't use that. >> Nah, bro. Nah. This is for our base only. This is for our base only. Nice. Okay, this is awesome. Now, we made the toilets. Now, I'm going to put these these hoops right here. Yo, it's actually water basketball. It's the gym. Man, we got to we got to play. >> Guys, I'm going to make a shot from right here. It's going to be awesome. >> No way. First try. >> Going to be awesome. >> That went in. That went in. That went. You just didn't see it went in. >> I saw it. I don't think it went in. >> It went in. You didn't see it. >> Here, I'm going to try. >> It went in. >> 3 2 1, >> you noob. All right, I get a point for that. Okay, so now I think the school is basically done. Dude, look. Everyone's actually in school. Look, they're like happy and they're learning. Look how happy they are. >> Yeah, >> they're learning about school. Guys, I actually This is crazy. I'm actually, look, I'm scoring left and right. >> Swish. Swish. >> This is actual school. Look, I can dunk. >> Three points. >> I dunked. That was a dunk right there. >> That went in. >> Guys, this is so epic. Check this out. And after you could put the ball here and you can chill on the bean bag. >> Oh, yeah. So, after you get tired, you can take a break on the bean bag. >> Oh, we can put the ball like right here. So, it'll be like uh organization. Oh, look. Oh, look. That looks nice. >> Oh, a storage thing. >> Guys, this is actually sick. So, we got gym class, we got the cafeteria, and we got this is like a classroom where everyone can learn. A teacher can talk right there. And then we got like when everyone enters the school, they can drop their stuff here. And then like lockers, and then we have Oh, the fire went out. And then we have like geography class. That's it. Okay, guys. The school's almost done. And guys, it's about to turn to day 99. Let's see what the top secret cut scene is. Oh, it's day 99. Okay, we did it. Yo, the deer can see the school. It's almost like the deer wants to join the school, but it's not allowed. is going to get expelled. >> Wait. Oh, that's sad. It's like the deer wants to join the school, but they're not allowed to. Okay, we're going past day 99. No problem. No problem. >> Can we get the school base ending? Okay, guys. Yep. It's up to day 101. Okay. Goodbye, dear. Is there a secret cut scene? Let's see what happens. Oh. Oh, wait. It says, \"A school base was built for the missing people of the forest to learn and stay safe inside. Together they researched the deer and learned about its origin story. Even the deer wanted to join the school and later the deer became friends with the missing people and taught classes about all the animals of the forest. You'll unlock the school ending in 99 forest. Let's go. [Music]",
    "start_time": 0.08,
    "end_time": 5738.989
}