{
    "video_id": "1-rk5NvgY-4",
    "channel_url": "@lankybox",
    "transcript": "Today we're playing Impossible Slap Tower Roblox. Oh, look. Here comes Adam. Hi. No. Okay, Adam, respond. That was so funny. I'm going to do it again. Hi. What? Yeah, I tricked you. Take this. In this video, we are going to beat this impossible Roblox slap tower without spending any Robux the whole time. Whoever makes it to the top of this impossible slap tower first gets a huge secret Lanky box surprise that you do not want to miss. This is one of the hardest slap towers in all of Roblox. It is impossible difficulty, and we are not going to spend any Roblox to fly or cheat in this video at all. This video is filled with hilarious langy box troll rage moments. And we even crash out. You don't want to miss it. Oh man, now I respond and I have to beat this part. Okay, here I go. You'll never slap me, Adam. Haha. I'm going to put you in jail. What? There was a troll there and Adam put me in jail. Let me out of here, Adam. All right, you can come on out. Nice. Okay, I'm getting out. Never mind. Gotcha. What? Hey, [Music] >> guys. Today we are playing an impossible slap tower Roblox. Guys, we got to make it to the top of this obby, but literally anyone can slap you at any time. Oh, I slapped Adam right there. So, I got one slap right there. I think that's what that means. Guys, we got to try and win. But guys, we are not going to pay any Robux. And whoever makes it to the top of this first is going to win a giant mystery pies. We'll put a clip on screen. It is going to be super awesome. So guys, we're going to try and actually beat this game, but like we can literally slap each other and send the other person back to the bottom. >> Wait, so I can just smack you off of this? >> No. Pass. Oh, I survived. I survived. I survived. I survived. Oh, you're in trouble now. >> That was easy. Hey, >> take that. Take that. Come on, man. >> Guys, this is literally an impossible slap tower because we're going to not pay any Robux and see if we can win. And people can literally slap us at any time. And so whoever makes it to the very top first gets the secret prize. >> Okay, I'm doing pretty good, dude. There's Oh, this person over here just slapped. They like froze someone. Do they have admin commands? >> Might be. Might be. There's a lot of stuff you can buy in this game, guys. >> Okay, I'm going to say please don't slap me. I'm I'm going to be nice and just say, \"Please don't slap me.\" So, I just say that in the chat. So, hopefully no one slaps me. Now, guys, look at how tall this tower is. There's people everywhere. You can see this. They could literally oof anyone. Wait, I see Adam. No, you're not going to get me, dude. You're not. >> No, you're not, dude. >> Come on over here, Justin. >> No. Oh, no. >> I'm going to get you. >> No, you're not. >> I'm going to get you. >> Oh, I missed. I missed. I missed. I'm out of here. I'm out of here. I'm here. >> I'm going ahead. I'm going ahead. >> I'm out of here. I'm out of here. I'm out of here. I don't trust Adam. Listen, guys. This game Oh, Adam got slapped. Are you serious? >> That person slapped both of us. That person slapped both of How did they Guys, they had like admin commands. They slapped really fast over and Wait, someone gave me a gift. What is this? >> Oh, is it nice? >> I got a gift. I don't know. Oh. Oh, gift. Ready? Open it. Open it. Open it. What is it? see what he gets. >> I got coins. What is the point of that? Oh, so got up. >> I'm getting to the top. Oh man, I just fell. >> Okay, guys. So, you could see there's ways to get power-ups like a speed glove where you like punch way faster. That would be really useful. >> Yeah, I would use it on Justin. >> No, you will not, guys. I will. >> This game is actually impossible, guys. I think this game, if you don't have the hand out, then people won't slap you cuz they don't think that you're a threat. >> Oh, exactly. So, I'm going to put my hand away. >> Yeah, exactly. I'm going to put my hand away and just be friendly. Guys, whoever wins this gets a giant mystery prize. That is super rare. Wait, was it shortcut? Shortcut. >> Oh, I'm going to copy Justin. >> It falls. So, when you use it, it stops it for me. Nice, guys. Okay. Wait. So, I made it further than I ever have before. Let's go, guys. Now, this is an impossible slap tower. We're going to try and actually win. Okay. >> Yep. It's super popular on Roblox. Everyone's playing it. Oh, wait. You can buy checkpoints. I'm not buying this. Oh, wait. You could buy it with What is this? Oh, I have 15 hands. I don't know how I got those. But guys, we're not spending any Robux. I'm I'm doing it. Nice. So, now I have one checkpoint. >> All right. I think you get the hands from smacking people. Really? >> I think so. Yeah. >> Oh, that's why people are hitting each other. >> Oh, that makes sense. Woah, woah, woah. Guys, I'm doing pretty good. I'm on like the turquoise part. See, there's someone here. I'm I'm going to say I'm nice. Please don't hit me. >> Man, you're so high up, dude. I'm going to say I'm nice. Please don't hit me. To this person. Where's Adam? I see Adam. >> You're at the start. >> I'm at the bottom. >> Someone in the chat is just saying chicken butt. Hey yo, you noob. Okay, wait. I'm taking damage. I'm going to go. Guys, what's cool about this game is that the higher up you get, the less people there are, the less chance of you getting slapped are. >> Right. I wonder if I can buy a magic carpet and fly up and then smack Justin. >> No, the whole point is to beat this with no Robux. Do not spend Robux. >> All right, I won't. I won't. Yeah, there is a flying potion in the game. >> Dude, that that that would not make it an impossible game. It would make it easy game. No, >> you okay, dude? I keep I got to lock in. Dude, you're a noob. I got to lock in. I'm still at the bottom, guys. I'm doing pretty good. Oh my goodness. Now, this is the scary part where people are going to Oof. No. No. Please, guys. There's someone here. Please. No. No. No. No. Please. >> Oh no. >> What is this? What is this? Wait. Are you in jail? >> I don't know. Please let me out. Please let me out. >> You got trolled. >> Please let me out. >> Guys, Justin got trolled. >> Please let me out. Please let me out. I'm asking please. >> That's good manners right there. >> Please let me out. >> This person in here is just slapping me. Please don't. Oh. Oh. Oh. Now. And you're right back to the bottom. >> No. I have a teleport. I have a teleport. I can go here. >> What? Dude, are you serious? >> Wow. Justin has a teleporter, >> guys. Well, I got to I got a checkpoint because I use the hands. >> Oh, that's nice, dude. >> Dude, are you serious? So, someone can just camp there and just troll people? >> Yes. That's the whole point, guys. You always want to try to troll people in this game, >> guys. This is an impossible slap tower. No, it looks like people are not going to be nice, which means I'm going to have to level up my game and do this. >> Okay, whatever you say. >> I got another gift. I got another gift. Cool, guys. The gifts are useful. I'm I got Oh, I got That's how you That's how I got the hands. >> All through the gifts. >> Yeah, guys, we're not going to spend Robux. We're going to try and beat it. How is Adam doing? Let's see how he's doing. >> I'm on the blue right now, guys. I will smack Justin all the way back to the bottom of this. >> Why Why would you do that? >> That is my only goal in this video. >> Why would you do that? >> Because I want the prize. >> No, I'm getting the prize. >> I want it. >> Guys, I don't want to. There's literally This person's still there. I'm I'm going to say please don't troll me. >> Please don't. >> I was like please don't troll me. Please. Please. Is this person just sitting here just trolling people? >> Maybe. Yeah. >> I'm saying please. I'm asking nicely. Please don't troll me. >> Oh man, please. >> I got all too. Justin's back at the bottom. >> No. No. I I can teleport. So, let me get this. Let me get this right. This person just sits there all day and just waits to troll people. Wait, I see where you are, Justin. >> That person literally just stands there for hours and just trolls people. >> Yep. That's what people do in this game. It's all about trolling the other Roblox players. >> Why would you do that, though? >> Cuz it's fun. It's funny. >> Why don't they try and beat the hobby? >> Because they just want to troll people. >> That doesn't make any sense. >> Guys, I'm on Justin's tail right now. I'm right behind him. >> You're not getting me. >> Oh, I'm smacking you, Justin. >> You're not getting me. >> Oh, yes, I am. >> You're not getting me. >> Come on over. >> You're not getting me. >> Yep. >> Someone here. There he is. >> Dad's dead. >> I knew he was going to do that. I waited for him. I knew it, >> man. >> I knew it, >> dude. Wait. Oh, wait. The person stopped trolling. Let's go. Go. Go. Go. Please. Please don't troll me. Please don't troll me. Please. Please. Why did they do that? Why did they do that? >> Gotcha. >> Dude, the person who was trolling, uh, please let me out. I'm saying please let me out. >> They won't let you. >> Okay, dude. You got to let me out then. You got to help me. >> I'll come back over there. I'll try to get there. >> Dude, please let me out. >> Justin got trolled. >> Oh, wait. Wait. They said they said okay. They said okay. Please let me out. Please. They said okay. >> Maybe they're saying okay and they're going to troll. >> They're letting me out. Please. Please. I can't jump out. I can't jump out. I'm frowny face. I can't jump out. A >> I can't jump out. Please. No. Back to the bottom. >> Um, guys, I might crash out. I might not beat this. I might crash out. >> Don't crash out. We have to get to the end. >> All right, let's see if Adam can beat that spot where everyone gets trolled. Let's see if he can do it. >> Okay, here we go. >> Hold on. Let's see Adam's screen. Let's see if he can do it or if he's going to get trolled. >> I'm going. >> Let's see if he gets trolled. >> Wait, there's no one there. >> I got stuck there 10 times. How's there no one there? >> It worked. I made it. I made it. I made it. I made it. I made it. >> This is so troll. >> I made it further than Justin. >> No, you didn't. >> And now I control Justin. >> No, you're not. You keep going. I'm going to unplug your computer. >> I control Justin. >> No, you're not. I'm going to unplug your computer if you troll me there. >> Time for Justin to get trolled. What's going over, man? >> Someone please slap Adam. >> I'm going to slap you right into the giant toilet right now. >> Someone please slap Adam. >> The giant potty right now. >> Dude, you're literally just going to camp me? Are you serious? I'm going to unplug your mouse if you do this. >> All right. Come on over, man. >> Please. Please. Someone please slap Adam. >> Come on over, man. >> Please slap Adam. >> I'm going to trap this person. >> Please. >> Come on. >> Someone slap Adam. >> Come on. Got slap, bro. Dude. >> Oh. Oh, I made it. Come on. >> I'm out of here. Oh, I almost zoomed to that. What is this? I don't even know what's going on, guys. I really want another checkpoint. I really want another checkpoint. I really want another checkpoint. How did I Oh, is this quack quack? >> What is this?ack. >> Is this a good thing or a bad thing? >> It just makes a quack sound. >> I don't think I was supposed to go here. >> I don't think so either. >> I think it's a dead end. >> I'm getting back. Do not troll me there. >> What happens if I quack this? I don't know. Okay, let's see what Adam does. >> If you troll me, I'm smacking you right to that toilet. Why do you keep talking about toilets, buddy? >> Dude, because there's a giant toilet. I'm going to smack you into it. >> Hold on, guys. I'm still here. We're seeing Adam screen, but I'm still here with this duck. I don't know what happens if I press E here. Let's see if it does something. Please do something cool. Okay, I'm almost there, guys. Let's see what it does. >> Oh, it's just like a collectible. That was completely useless. Okay, so I can go back here. I can troll Adam. I can troll Adam. I can control Adam. I can >> What? You're going to troll me? >> I know you were planning on trolling me, buddy. I know you were. >> No. >> Yes, you were. Okay, maybe >> you just you were just sad cuz you couldn't do it. >> Maybe. Yeah. >> Come on. Let's go. Let's go. I don't want to fall here. I don't want to fall here. I don't want to fall here. I don't want to fall here. Please. Please. This game is so Please. Yes. Yes. I need a checkpoint. I need a checkpoint so badly. I need a checkpoint so badly. I need a checkpoint so badly. Please. >> Oh, can he do it? >> Please. Where do I go? I want that secret prize. I >> have to go around. I have to go around, guys. I want that secret prize. Please, please, please, please, please, please, please, please. What is this? What is this? How do Oh, what is this? What is this? >> Oh, up he goes. Oh, he's like floating. I need a checkpoint. I need a checkpoint. Where where's the checkpoint? Okay, I I'm safe for now. How you doing? >> So, guys, there's someone here. They're pretending to be AFK. Should I go for it? >> Yeah, dude. >> Okay, here we go. Oh, they just fell. Here's my chance. >> Okay. Okay, Adam, I actually might make it. >> Yep, I made it. Okay, nice. I'm going to try to go to where you are. >> Guys, these jumps are really hard. Can I get a checkpoint, please? >> Please, please, please, please, please, please, please. >> Guys, I'm telling you right now, though, Adam cannot make these jumps that are coming up. I think he's going to oof. You >> want to watch? >> Please, please. I I need a checkpoint, dude. I'm not going to look at anything until I get a checkpoint because what am I doing? What am I doing? What do I guys? I'm like panicking. I'm panicking. I'm really scared cuz there's people next to me and they might try to slap me. Please don't. Oh, what do I do here? What do I do? I might I might be able to catch up to Justin. >> He will do no, >> guys. This is huge. >> Guys, I need a checkpoint. I need a checkpoint. Guys, I'm actually so nervous. There's no one around me. I got to get a checkpoint. >> I need that prize so badly. >> I need a checkpoint so bad, guys. I'm literally so locked in right now. Please, >> where are you? >> I'm I'm up here. Oh, guys, I'm literally speed running. Oh, people are falling above me. Oh, I'm right there. I'm right there. I'm right there. Big bro. Big bro. Big bro. Big bro. Big bro. Big bro. Big bro. Big bro. Get him. >> I missed. I missed. I missed. I'm out of here. I'm out of here. I'm out of here. >> Swinging a miss. Okay. Truce. Truce. Truce. Truce. Truce. Truce. Deal. Deal. >> Yeah. >> Deal. >> I don't believe you. >> Yeah. >> Truce. Truce. >> Truce. And truth. Guys, we made it past the hardest part, which is the part where people control each other. So, we just have to not mess up now. >> I see Adam. I see Adam. I see Adam. How do you get up here? >> I see Adam. I see Adam. I see Adam. >> I actually going to fall just from his own jumps. I don't even need to troll him, honestly. >> How did that There's no one around me. I'm doing okay. I'm doing okay. I really need another checkpoint, guys. Let's see how much further the end is. Oh. Oh. Oh. Five Robux. That's too much. >> No, I'm not doing, guys. I stopped to look at how much further it was. And I oofed in that time. That's why, guys, always just stay focused on your goals. Don't Don't get distracted. That's a real lesson right there, >> right? Don't get distracted by others. >> See how it Adam's doing, >> dude. How did you make this jump up here? >> You have to jump >> just to this one or the one above you. >> You have to jump to the one above you. >> Okay, you big noob. I can't. Oh, there we go. Okay, nice. Okay, Adam's doing good. He's further than me because I fell. I want the prize so badly. I will get back there, bro. I will get back there. I just hear people getting slapped everywhere. I This is so scary. >> Right. True. >> This is actually so scary, >> guys. I'm going to hide out in a part of the obby and then smack Justin. >> I can hear you. >> What? >> I can hear you. You giant noob. >> You can't hear me. >> I'm going to you. >> I I'm so stupid. >> I feel myself. >> Guys, that that was >> Well, well, that was such negative out here. Hey, you paid Robux to revive. I saw that. >> No, I didn't. >> No, we all saw that, guys. The footage was Adam. You just cheated. I'm smack. >> No, you just cheated. We We agreed. No Robux. You cheated. >> I have my fingers crossed. >> No, you you cheated. >> I have my fingers crossed. >> You cheated. >> Once he gets up here, I'm going to smack him. >> Stop. >> Are you serious, man? >> You cheated. >> No, I didn't. >> You said no Robux. You spent five Robux. I saw you. you. I'm going back up. >> I saw you. >> I'm going back up. I'm going back up. I'm getting this prize. >> So, you're reviving? You're cheating. >> I'm I'm getting this prize. >> So, you're just going to cheat? >> Yeah, I am. What? >> I'm going to win fair and square. I'm going to spend zero Robux. I'm going to beat this faster than you. >> Oh, really? >> Yeah. >> I don't think so, man. Yes, I am. >> I I just really don't think so. >> Yes, I am. >> Cuz I'm winning. >> No, >> I'm the winner today. >> No, you're not. >> I'm a smash. >> Yes. I got a checkpoint. Yes, guys. That's not Robux. That's from the game. Let's go. Let's go. Serious. Let's go. Adam, you stand no chance. >> That's not fair. >> Yes, it is. What do you mean? I literally am only playing fair right now. >> You smacked me. >> That's what you get. You try to say I fell again. >> Revive. Come on, man. >> Well, Adam, why don't you try and get across here then, buddy? Why don't you try and get You can't even get up here. You can't even get up here. You can't even get Even if you bought a magic flying carpet, I would troll you here. You couldn't even do it. >> Oh, really? >> You couldn't even do it. Oh, really? >> Okay. So, Adam's just going to cheat now. >> Okay. So, he's just going to cheat now. >> Oh, really? >> Oh, he's going to pay 800 Robux and cheat. >> You're just going to cheat now? You're just going to cheat now? >> You're just going to cheat now? >> How does this work? >> You're just going to cheat now? Okay, so you're just Okay, so you're just going to cheat? Awesome. >> All right, Justin's in the pink. >> I see him. Oh, I see him. I see him. I see him. I see him. I see him. >> Where is he? Oh, here. >> I see him. I see him. Adam, there's no way you make these jumps. >> Really? >> Literally no chance you make these jumps. >> All right, here we go. >> Try and do a fair score, buddy. Ah, today Justin's the baby. Go, go. >> He's going to fall just by himself. >> Go. Gooo Gaga. No. >> Are you serious? Are you serious? >> You jumped into a potty. >> No, I didn't. >> Jumped into a potty. >> I'm getting back up there, man. >> You jumped into a potty. >> I have had enough. >> Try it again. Try it again. I'll get it this time. Try it again. >> There he is, >> dude. Guys, if he misses a jump, he's going straight to that potty. Here we go. I'm going to psych him out. I'm going to psych him out. Check this out. >> Here we go. Go. Go. Go. Go. Go. Don't. Justin, don't. Justin, don't. Justin. >> You know what? You know what? >> You know what? I'm making it across. >> Whatever I say, I'm making a crosshair. >> Go back to school, Adam. >> That's where I'm going every day, >> guys. Adam's mom put us in boot camp cuz Adam cannot speak English. >> Yeah, she said I need an education just like Foxy always says. >> He also cannot do math. He can't really do much of anything. But he's trying his best, guys. >> Yeah, I can play Roblox. >> Not really. You just cheated. >> I just fell again. I'm so so bad at Roblox. >> You can do it. >> Okay. I literally just see you teleporting and cheating. >> What? What? You're literally a cheater. >> No. >> Yes, you are. >> I've spent no Roblox. What do you mean no? You're on my screen flying. >> No. >> What do you mean no? >> That's another player. That's not me. >> It's you. >> I'm getting to the top, guys. I'm getting that prize. >> Yeah, by cheating. >> Cuz my mom said it's a secret noob channel. I fell again. You're a noob. >> I'm good. I'm back up. >> Oh, these jumps are crazy, guys. I'm zooming. I'm not even looking at him screen more. He's just a giant cheater. I don't even want to see what he's doing. >> Cheater. Cheater. >> How do I fall? How do I fall there? >> I don't know. >> I'm being a noob. Ah. [Music] All right, I have to go back here fair and square, guys. I'm not spending Robux. I will beat this with no Robux. I will beat this with no Robux. I will beat this with no Robux. >> Deal. >> You are just Imagine just cheating. What's even the point of winning if you just cheated to do it? >> Guys, I'm going to hide out in this area that's yellow. And I I obviously wear a lot of yellow. >> I can hear you. >> And I'm going to actually hide and sneak up on Justin. >> I can hear you. >> Check this out, guys. I'm not going to spend Robux cuz I'm not a cheater cheater pumpkin eater like at him. >> When he gets to this yellow section he's going to be >> I can hear you. You're saying when you get to the yellow area you're going to attack me. >> No. >> Why do you think I can't hear you? >> Here we go, guys. >> Okay, >> I'm not even there cuz I fell so far. >> I know, >> guys. I'm not giving up. My dream is to beat this without any Robux. Now, guys, I'm high up enough. I feel like literally everyone just gets stuck at that early troll place because everyone just wants to troll each other. Like I feel like there's not that many people. It's literally just me and Adam. And Adam would not be up here if he hadn't spent Robux. I just want everyone to know that. >> He's really close to the to the yellow area. >> I see the yellow area next to me. I see it. >> And he's not going to think that I'm there cuz I blend in. >> Oh, taking damage. >> Nice. That's what we needed, guys. >> Imagine celebrating when I fall. I'm trying to win. I'm trying to win the prize. >> You You are banned from the prize. You already cheated. >> No. >> Yes. We all saw you cheat. >> What do you mean no? >> Oh, here we go. >> Look, imagine cuz he didn't even have to do any of these jumps. He never did any of these jumps. >> Here we go, guys. >> Hold on. I got to make this jump. Okay, that jump messed me up. Okay, I literally see you. I literally see you right now. >> See who? >> I'm getting this out. I'm not Listen, I'm not going to hit you if you don't if you don't attack me. Don't >> sneak attack. Are you Don't get him. Get him. What? No. I fell, too. >> Oh, it's slippery. It's slippery. Slippery. Slippy. Fell, too. Slippery. Slippery. My sneak attack failed. It didn't work. Didn't work. I'm going this way, guys. I'm going to get there. I'm going to get there. What was that obby [Applause] up? Dude, Adam's like right on. This is so lame. This is so lame. This is so ridiculous that I'm trying to beat this obby fair and square and Adam's already paid so many Robux and he just doesn't even care. >> I'm going to do another sneak attack here in the blue section. >> Hey, listen. Nobody cares what you do. >> Here we go. >> You're such a noob, dude. You spent Robux. We said we're going to try with no Robux. Yeah, Adam literally fell here straight into that toilet. >> I did. I'm not going to lie. >> Yeah, straight into that toilet. >> Splish splash. It was not fun. Never again, though. >> This is so lame, bro. >> I know, right? >> It's lame because I would have beaten this if you hadn't trolled me. >> What? Hey, hold on now. I didn't troll you. I didn't I didn't smack you. >> You tried to and that made me confused at the yellow area and then I fell. >> Yeah, I tried to do a sneak attack, but it didn't work. >> Dude, I'm so done with you, man. I'm so done with you. Yeah, I'm almost at the end, so don't worry. >> No, you're not. >> I know you're at the blue area. I know you're nearby. >> No. >> Yes, I know. >> No. >> Yes. Okay. So, you're a cheater and a liar. >> No, dude. I'm >> You're still exactly where you were when I left you. >> Get OD. Come on. >> Quit the game. Uninstall now. uninstalled now. You waited there 10 minutes for me and then just Yeah. to do a sneak attack on you. It didn't work. >> Stop paying to win. You're just going to fly back. I already know it. >> Whatever, man. I'm beating this parrot. >> Guys, Adam is literally like a mosquito. Just want him to go away, but he won't. >> That's true, guys. We went to the park the other day and there was this mosquito that kept following us. Guys, I'm literally playing fair and square. Adam's just jumping around. I see him teleporting. Go. I panic cuz Adam was right behind me. Guys, I can't. I can't. Adam, listen. If you hit me, I'm going to unplug your computer. It's over. >> It's over for you. >> I won't. >> It's over for you. >> I won't. I won't. >> Dude, Adam, I'm trying to beat this fence score with no Robux before other people catch up. Cuz if other people catch up, then we can't even guarantee that we can do this. They might slap us. >> Totally got you. Totally understand. >> You don't If you listen, we're truce. >> Mhm. If you take your your hand out, I will slap you. I will destroy your computer. >> Okay, you you have a deal. I will not smack you. >> I got to get that mystery prize. There's someone here, but they seem friendly. Oh, they just fell. >> Nice. We're going to work together, guys. We're going to get to the top. >> I need a checkpoint. >> Okay, truce. >> Truce. >> Do you have your fingers crossed? >> No. Truce. >> Okay. All right. We're buddies. >> You have my word. >> I don't trust you. >> I will not smack you. >> I don't trust Adam as far as I could throw him. >> You can trust me, man. And if you make it to the top, I'll give you my brand new Foxy Mystery Snack Box. I just got this at Walmart and Target, guys. What do >> I do here? It's not too much damage. You're okay. There's an item. Don't >> I'm not going to smack you. >> Don't. Okay. All right. >> Were we W brother? >> Yeah. Thanks, man. >> W brother. >> We're up there. >> Come on, dude. We got to beat this. >> We're going to do it together, >> guys. I'm That was a close one. >> I'm really nice. I got a checkpoint. Nice. Nice. Nice. Nice. Nice. Nice. Nice. That's what we needed. Okay, now I got a checkpoint. Now we're doing good. How far are we from the top? We're like five stages away from the top. We can do this, man. >> Huge. >> Believe in ourselves. Hey, wait. Don't go after me. This is going to vanish. >> I fell. >> So, it's all up to Justin. >> What? >> Can Justin do it, guys? >> Why can't you just cheat? >> All right. I can just fly back up. You're right. Forgot. >> You forgot you spent 800 Robux to cheat. >> Yeah. >> There goes Adam cheating his way to the top. >> Here I am. Nice. >> I'm going to do this. I'm going to prove to everyone you can do this with no Robux cuz it's called Impossible Slap Tower. I'm going to do it for real. >> Can Justin actually beat this game without spending or paying to win at all. >> What was that? I just got like thrown back here. What? >> I think you like bonked your head. It like yeets you up into the air and then you bunkked your head. >> Really? >> Yeah. So, just watch out. >> Okay. What do I do here? Watch. I'll show you. >> You just don't go too far forward on it. Did you do it yet? >> Yeah, I already did it. >> What do I do? >> And just go jump. Yep. >> And then up. >> Oh, >> and forward. There you go. >> Okay, >> cool. >> I will do this. >> Guys, we're really locked in. I'm trying to actually win with no Robux, which is very hard to do because people will just oof you. >> Okay, we're almost there, guys. >> I got to do this, man. Okay, hold on. One of us can go at a time. Be careful. >> All you. >> Oh, they Okay, the platforms go away. Be careful. What is Oh, Squid Game. You got Yo, you guys see these are not real. >> Glass bridge. >> Squid Game. Squid Game. >> Nice. We're really good at that one. Foxy. Foxy boxy taught us how to play that one. >> Guys, I'm giving up. It's all up to Justin. >> No, you can just fly again and cheat. >> All right, I'll cheat. Okay, good idea. >> Good job remembering you have the ability to cheat, buddy. >> Right. I'll be the guinea pig. So, I'll I'll tell you if there's any parts that are like >> Guys, I'm so locked in right now. I'm I'm locked in, guys. We're almost at the end. We're almost at the end. I don't want to celebrate too early. Oh, hurry, hurry. I knew there was a vanish. I knew there was a vanish. >> Just cheating in front of me. >> Boom. >> There you go, Adam. Good job cheating. >> All right. Nice. We're here. >> Go, go, go, go like go like far ahead. >> Oh, checkpoint. But I don't have enough hands. >> Oh, those jumps are really hard. >> I don't have enough hands. Oh, no. [Music] >> Justin accidentally teleported to an earlier place. Oh, >> that was a rare lanky box. L >> I was trying to click the daily rewards. >> I know. It's okay. Now you get more practice, >> dude. L. Okay, listen. That part didn't look too difficult. I think I can do it. >> Yeah, easy. >> I think I can do it. I think I do it even without a checkpoint. >> Definitely, man. Definitely. >> Guys, I think the hardest part of this game is other people slapping you. >> Yeah, once you get to the top where there's not as many people, uh, then there's a lot less that can smack you back to the bottom. Or if you have a brother named Adam who tries to cheat and then slap you, >> right? But I'm not going to >> He stopped. He stopped. Yes, he did. Stop. >> I learned my lesson. >> Did you learn your lesson? >> I did. >> Good. >> I did. >> Good. Cuz if you don't, Adam's mom's going to put us in boot camp. >> Well, we are already going to boot camp. >> Yeah, but she says cuz you need to learn your lesson. >> I know. >> Your school lessons. >> Yeah, we're learning about math and um PE and reading and stuff. >> Guys, I'm not going to spend any Robux. I'm going to do this fair and square. No Robux needed. Okay, >> this is a no Robux required challenge. >> No, no, no, no, no, no. Robux zone is what we're in. >> Yep. Well, I'm in Adam's Robux, >> right? Cheater zone is what I'm in. >> That's what Adam is. Adam's in the cheater cheater pumpkin eater zone. Okay. >> Yep. Cheating to the Cheetos. >> Okay, let's go. >> I'm going to do this. >> Dark purple's not too bad. I will say the gray jumps are very hard. >> No, they're not. Don't be a little baby. >> Okay. >> I know that's difficult for you, but don't. >> Yeah, that's true. Okay, I'm not going to pay for this. See? Wait, can I even buy this? No, I don't. No, you can't even buy that. Okay, I can do this. Just get out of the way. I'm out. That jump is really hard. And then also the next part is slippery, so it's even harder. >> Wait, where even am I? Oh, okay. Oh, wait, wait. So, this is here to catch you. >> Okay, that's nice. >> That's actually nice. >> The developers knew how hard this area was. >> Guys, we're so close to the end. I think Dark Ray is the last level. >> I think so, too. Okay, that's actually really nice of the developers to put that there. >> So, you don't have to go all the way back to the bottom. >> I believe I can do this, guys. Always believe in yourselves. That's what we say here at Lanky Box. I think you have to go like this. I'm Oh, no. Oh, no. Teleport. I mean, >> dude, >> you can pay five Robux to revive. Then it takes you right back to the grave. >> That doesn't even help, bro. Dude, how do you But like, I don't know how to make those jumps, though. >> Yeah, I only did it once so far. >> I don't know how to make those jumps, though. >> It's not easy. >> Listen, I think I just have to learn how to do it. I think I just got to learn, >> right, >> guys? Never give up. Never give up on anything in life. We will do this. >> Don't do it, guys. I think about giving up all the time. Not a good idea. >> Well, you have given up a lot of times. I mean, you spent Robux and cheated in this video, >> right? It's true, >> guys. Don't be a >> Cuz I would have been stuck at the first level if I didn't do that. >> That's true. >> Okay, let's go. I can do this. >> All right, we're getting back there. >> I can do this. >> Oh, definitely, man. >> I can do this. I'm back in purple. Okay, none of this is that hard. It's just I don't know how to do the gray jumps yet, but I will learn. And once he learns, then he's going to make it to the tippy tippy tippy tippy top. >> That's all it's about. Just learning. You got to learn and then you can earn, >> right? Mom says, \"I don't know what that means.\" >> Yeah. >> Let's go. Okay, I'm back there. >> All right. >> Did you figure out how to do it? Like, do you know how to do it? >> I've only done it once and I'll try it right here and we can see if it works for me. >> All right. Here we go. 3 2 1. >> It's only Yeah, there's only like three jumps to make. It's not that bad. Come on. Here we go. Yes. Okay, I figured out how to do it. [Applause] >> How is it possible to get enough speed there? >> Oh man, >> how is that possible to get enough speed there? >> Now, I have a crazy theory. What if you can't stop? What if you just got to keep running and use the momentum to get you all the way to the bottom? >> Okay, >> I think that might be it. >> Okay. Momentum. >> Yes. >> Okay. From the mom. >> Yep. >> Mom powers. >> I can't I give up. You just said don't give up. >> Okay, you got it. >> Here you go. >> I'm trolling. I'm good. I'm trolling. Okay. Yeah, this is really nice of the developers to put that ledge there. Wait, don't go after me. Don't go after me. This disappears. This disappears. >> Okay, I won't. I'll just cheat. >> Up we go. >> You are unbelievable. >> Although, I will say if you are given the option to buy the revive, it takes you right back to the gray. So, it's not really like you're skipping anything. >> So, you're saying it's okay for me to spend Robux? >> Yeah. Five Robux. I'm trolling, dude. I'm trolling. Come on, man. It's all good. >> Come on, man. Oh, nice. Wait, I can get a checkpoint. So, now I don't need to spend Robux. Listen, Adam, you guys see that? Adam is trying to get me to spend Robux. He's trying to get me to basically give up. >> Wa. >> So, that's what people like him do. They give up and spend Robux and then troll at people and then try to make other people do the same thing. I won't. I did it. >> Nice, dude. >> Now I'm good. >> No problem. Cuz he's got that checkpoint. >> No problem. Okay, that's actually huge. >> Yeah, I think you need that momentum. That uh So now I'm just cooked. >> I think so. >> Oh, maybe not. Maybe not. >> There's a way to do it. There's no way you have to just keep running the whole way. That'd be impossible. >> Oh, that's fine. >> No problem. >> Imagine it's like Oh, when you cheated and you try to convince your brother to cheat also. Nice. Now we got it, guys. Now that we can teleport back, >> guys. There must be a trick to doing this. I just don't know what it is. Ah, okay. It's definitely the turning. >> Oh, almost. Almost. >> I will do this. >> Easy peasy, man. >> It has to be a sideways jump. It It definitely is. It definitely You have to go like this. Definitely. >> Really? >> I think so. I think I think that makes it easier. Yeah, guys, this this this level is not for babies. Definitely. >> Well, there's a skip skip to end button. >> Yeah, it's a cheater button, dude. >> Okay, I'm not going to do that. >> You would. >> That's not cool. >> You're going to >> No, there's no way. >> I'm watching you. You might do it. >> Ah, that's pretty cool though. >> What? Cheating. >> Skip to end. >> What's cool? Cheating. >> Let me just try. Oh, you can just >> Okay. Okay. Okay. So, we just watched Adam cheat. I'm not. I'm not. >> You don't get the prize, mister. But >> how would you get the prize? You just cheated. How you thought you really get a prize for that? For spending Robux. >> Well, my mom and I was g >> I did it. I did it. Stop talking. >> Okay, you got it. I'm trolling, guys. I know how to do it. I know how. I learned. I learned. Instead of being a little baby like Adam spending Robux, I actually just learned. >> Yeah, true. >> So, this is the thing. Adam's never going to get better at obies. It's impossible for him because he just cheats. Well, my mom, she sometimes gives me a prize even if I just do something and I don't really do a good job. >> That's called a participation trophy. We get those at school. I asked Adam's mom why she gives them to him and she says so it feels so you feel like you don't get left out. She says they're not actually worth anything. >> Right. Exactly. >> Adam gets those all the time. Those the only ones he has. He does have a lot of them though. He has like 20 participation trophies. like a bunch. I have the first place ones. It's true. I learned how to do it. I learned how to do it. I definitely I Guys, I'm not spending Robux. I'm going to do this. I'm going to show everyone. You just never give up. Don't be an atom. When you put your brain to something and you never give up, then you can do anything. >> Yep. I can't do it without just panicking next to me. Here, I'll leave for a little bit. >> And the fact is, guys, Adam literally just cheated. He just bought his way to the end. Can you guys believe that? Oh, wait. Wait. I can like slip this way. Hold on. Come on, guys. I'm really focused. Adam's He's just going He's sitting over like this. I can't wait to see him stop. >> I can't wait. Ah. Okay, guys. It's literally like so close. I know how to do this. I just got to pan the camera more. Ah, >> guys, I'm not going to let everyone down and cheat. One like for one Justin. Guys, leave a like on the video. I'm not going to cheat like I eat them. I will do this. >> Wait. Okay, so you don't even need momentum. I don't understand what I'm missing. I don't understand what I'm missing. Maybe I just go from like right here. >> Oh, I don't know. >> A new strategy. >> No, you definitely need momentum. Man, guys, it's literally only three jumps. I'm one jump away from doing this. I don't know why it's so difficult. Come on. Come on, Justy. Do it. Nice. Do it. Do it. No, you can't do it like that, Justy. You can't do it like that. Can't do it like that. Chill out. Relax. Don't be an A. Why'd you laugh right as I jumped? Go away. >> Okay. Okay. >> You cheated and then you just sit there and laugh right as I jump. You're not helping, buddy. Guys, >> I believe in you. >> Guys, I'm determined to beat this game with no Robux cuz it's called Impossible Slavar. I'm going to prove today nothing's impossible if you set your mind to it. >> Boxy said he wants to watch. Is a boxy going to stay there? Thanks, Boxy. [Music] Thanks, buddy. [Music] Every time I look at Boxy, I just hear Adam's voice. I don't like it, >> dude. I can't even make the first jump. >> Okay, guys. I'm actually going to lose my mind doing this. I'm not kidding. >> It's okay. Trust. It's okay. >> I'm not um It's okay for you cuz you paid Robux and cheated. >> Yeah, >> it's not okay for me. It's all I have. >> I can look up if there's some hacks in the game or something, like some new strategies. >> Guys, these jumps are not that hard usually. It's cuz it's slippery, man. >> I know. The slippery ground does not help. If it was all just normal jumps like this, I think I could do it. But okay, I got another gift. Nice. Okay. Do I have to go like this? Guys, please. All you obby pros in the comments, please let us know how to do this. It's tough. Please let us know how to do this. Please let us know how to do this. I refuse to lose. I know what Adam's going to say. He's going to say just spend Robux. Well, I'm going to look on YouTube and see if anyone has found out a secret strategy. I think most people's strategy is to skip it, which is the strategy I used. >> So, you're just a cheater. I'm just saying. I'm just saying. >> Yeah. You're just saying you're a cheater. >> Yeah. Let me see if anyone knows how to beat it, though. Ah, >> I was so close. I am looking on YouTube and a lot of people are just stuck at that one part. >> Yeah, but I'm going to do it >> right. He's never going to give up. >> I'm going to do it. Justin will be the first one on all of YouTube to do it. >> Never going to give Roblox. Never gonna cheat like never gonna spend Robux and be a baby. >> Adam's mom sings that song all the time. I don't know what she means. >> She loves that song. >> Dude, come on. Guys, I'm not giving up. I know Adam just wants me to give up right now, but that's exactly what I'm not going to do. >> Right. Not worth it. No, cuz then I'll have to look at myself in the mirror and say I paid Robux and cheated like an atom. >> Yeah, I think some people did buy the red glove now. Wait, can you get the red glove? >> Yeah, for free. >> For free? >> Yeah. Why? >> That will allow you to get past this. >> Why? >> Because it makes you speed up. >> Really? >> Yes, sir. >> Yes, sir. >> Speed glove. Boom. >> Wait, does it really? >> Yes, sir. >> I'm the same speed as before. >> Now you got to press E. >> E. Yeah. And then So, go back there. Press E and now go go go. >> Yo, wait. But that's like still You can only use it once. >> And then it recharges. >> Okay. Okay. Okay. Okay. Okay. Okay. Okay. So, I'm I'm just going to do the first jumps regularly and use it on the last one. Dude, that's smart. Good job, Adam. >> Thanks, man. >> Adam, you actually helped because I didn't know that. >> Teamwork. >> That actually Adam actually helped. But I still have to make two jumps by myself, which I have done. Okay. Don't. Don't. It doesn't work here. Yes, it does. Let's go. >> We got it. Okay. Now, I want the speed to wear off cuz I'm too fast now. Okay. Oh, no. Oh, it just does damage. Okay. I thought it oops you. Okay. Oh, that was close. Okay, guys. Okay, guys. Lock in. Lock in. Lock in. Lock in. Guys, we haven't spent any Robux. We're doing it. >> This is hype. We're really doing it. Good job finding out about the speed glove hack, buddy. >> Thanks, man. You didn't even spend a single Robux. >> Nope. I'm going to beat this with no Robux, guys. I'm determined. Guys, that's actually a huge hack. If you guys play this game, you can definitely use that. I'm waiting for my health to come back. You can take one more of those. >> And he will. Oh no. >> That's why you don't listen at him. That's why you >> Oh, you could you could you got hit twice somehow. I'm just going to wait here for my health. I'm not doing anything. I'm not doing anything. I'm not doing anything. >> Not worth it. >> I'm not doing anything. >> We've come too far for this, >> guys. Look how many people are in the server. Literally, everyone is basically just down here just like fighting. >> Yeah, >> literally. >> Not us, though. >> No. I'm just going to wait for my health bar, dude. I'm I'm not going to risk it. I'm not going to risk it. I'm so close, guys. That That's the end right there. >> Okay, I'm going to let you focus. It's all you guys. I got my brand new merch from Walmart and Target. This just dropped at Walmart and Target, guys. We sped over it in my mom's soccer truck and got it. It's awesome. Make sure to get it. It comes with the Foxy phone and the banana plushy and even more. So, make sure to grab it. And you can wear this on your head and become Foxy. Make sure to get Banani, guys. She is awesome. And don't eat Bani. Don't be like Aiden >> like I did. Hold on. I need to wait for my health. Um, if I stop [Music] at Don't >> Come on, man. Boy, stop, man. >> All right, I'm >> Stop. I'm >> I need to lock in right now. >> You got it. >> Oh, that was not locked in. These jumps are huge. Okay, >> no. [Music] What does that do? Oh, it's a timer. What is that? >> Um, I didn't see what changed. >> I didn't see anything. Force field. Wait, how am I? You can't even use this. >> Oh, yeah. Right, guys. Oh, okay. So, let's see what changes when we press this button. >> Absolutely nothing. >> Wait, what? Oh, maybe Oh, you're invincible. You're invincible. See, your character is glowing this. >> So, you only have invincibility for a little bit. >> You got to like go and then just run. And there's no checkpoint. Are you kidding me? [Music] Okay. How do I do this? I got to think. You have to memorize the timing of the big red blocks. >> No, I just have to go. I just have to not be a baby. Wait, is that a shortcut or is that like a troll? I have no idea. I would go that way. The normal way. Yeah, >> I'm not going that way. Just in case. >> Wait, you think it's a troll? >> They wouldn't do that though, right? >> Well, where would that even take you if you jump up there? >> You can go for it. But if you fall, >> why do you say that? But if you fall, >> I'm just saying. >> Well, duh. If I fall, it's all over. Okay, I'll go this way. Guys, I'm very nervous right now. >> We've never made it up this high before. Oh, what am I doing? What am I doing? Nice. Okay, these are going to disappear. Where do I go? Where'd I go? Okay, no problem. >> Oh, where do I go, though? Is there another one? Oh. Oh, you have to go like that way. >> I jump around. Yeah. >> Oh, that's really scary. That is really scary. Nice. Oh, let's go. We actually beat it with no Robux and I got the winner glove. Winner winner. Let's go. So, that means you get the prize. I get the prize, bro. And I'm going to do this. There's duck here. I'm going to get all the achievements, guys. We actually did it. Never give up. That was a good job on the hack, guys. Use the red hand if you don't want to spend Robux to get around those really hard jumps. We actually beat this with no Robux, dude. That is a huge W. And the giant prize is I get the iPad for the day. I'm going to watch Lanky Box Go, guys. This is the brand new animated videos, guys, of Foxy and Boxy. They go on Giant Adventures. You guys see that? There's Fick Shark. There's Baby Fick Shark, guys. Foxy Chase. These are animated adventures. This what we're up to all the time, guys. I get to watch Lanky Box Go for the rest of the day, guys. Make sure to subscribe Lanky Box cuz all these episodes. Look at all this guys. There's Candy Bro, there's Foxy. There's Boxy. There's Rocky. There's Ghosty. Guys, I'm going to watch Lanky Box go the whole rest of the day. There's Foxy and Ghosty. Oh, you're so lucky. You get to watch Lanky Box Go. >> I'm going to watch Lanky Box Go. It's my favorite show of all time, bro. My favorite show. Look at Ghosty, bro. Guys, these animated videos are so amazing. Make sure to look up Lanky Box Go, guys. This is going to be posted on this channel. This is going to be so epic. Look at Ghosty. Look at Rocky. Man, I'm going to watch Lanky Box Go. Let's go. [Music]",
    "start_time": 0.08,
    "end_time": 2635.949
}