{
    "video_id": "61X1WkPcFn8",
    "channel_url": "@lankybox",
    "transcript": "Today we are maxing out the big game hunter in 99 to the force Roblox. This is an OP class that has its own special checklist in the game. And when you finish each quest, your character levels up permanently for the rest of the game. We're going to collect pelts from all of the animals, including the antler from the cultist king, the mammoth tusks from the mammoths, and so much more. And each time we do, our character levels up forever. This class is super OP because we are going to get extra health, more damage, and even more speed from its abilities. And when we finish all the quests, we unlock a top secret cutscene and win a giant mystery prize, too. Are you ready to see us max out the big game hunter in 99 Nights in the Forest Roblox? Let's go. Today, we are playing as the big game hunter in Roblox Nights of the Forest. Now, this is apparently one of the most OP classes in the game. We've never tried it before. Basically, you start with a pelt list. Let's use that. Okay, it gave us a new item. Let's click on this. Yo, so guys, this class comes with its own secret quest. Basically, if you find different pelts from the animals, you level up permanently. So guys, if you find bunny foot, if you find three of them, you sprint faster. If you find three wolf pelts, you gain 5% damage forever. So, you can find scorpion shells, alpha wolf pelts, bear pelts, and even the cultist king antler gives you 10% more damage permanently. And the mammoth tusk gives you five HP for each tusk. Guys, this is crazy. We're going to complete every single quest on this list. And we heard that when you do, you unlock a top secret ending in the game, guys. Wow. So, this is the big game hunter class. It's brand new, guys. It's super cool, guys. This is really crazy. And it spawns with one of the best blasters in the game. That's nuts. You already have that blaster? I already have the best blaster. One of the best blasters in the game. Now, guys, this is going to be a super fun video. We heard this class is super OP. Oh, wait. I found I found it. I consumed it. One out of three. So, guys, one out of three rabbit foot right there. I need two more to complete this quest. >> Wow. And then you're going to run faster than me. >> Wait, that's so cool. And guys, these will like add up because look, I just saw this. The wolf pelt makes you do five more damage. 5% more damage. The cultist king antler also does 10% damage. So, we're going to do like 15% more damage. That's a lot. >> Yeah. When you unlock all of those, your character is going to be really fast, really strong, have a ton of health. It's going to be so OP. >> It's going to be like a superhero, bro. Oh, there's another one. Should I consume this one? >> Yeah, let's do it. >> Okay, consume. And it makes a cool sound effect. Wa. >> Guys, this is going to be so awesome, bro. This is going to be super awesome. Yeah, it's the best. Guys, buckle up and we're going to see if we can actually get the ultra new ending. >> I got the I got it. I got it. I got it, bro. What? >> I got it, bro. I got the third one. So guys, I need one more. Here it is. Let's consume it. >> Yo. Okay. Nice. >> And it checks that off. That's so cool, guys. So now I sprint 15% faster. Hey, Adam, I'll race you. >> Uh, okay. I can probably beat you. >> No, you can't cuz I can sprint faster. >> I'm pretty fast. Ready? >> Okay. Okay. Wait. Start here. We'll go there to the fishing shop. 3 2 1 Go. >> Oh, it's not even close. >> Wait, why are you so fast? >> It's not even close. >> Why are you so fast? >> Cuz I got three of the rabbit foots, dude. Yeah, man. And that's just the first upgrade, guys. Justin's going to upgrade every single one of the big game hunter tasks, >> guys. I am way faster, guys. I can already tell I'm way faster now. I'm going to save the big blaster for like the mammoths. Guys, I'm way faster. This class, we heard on the internet on YouTube people are saying this is the most OP class in the game. Actually, we haven't tried it yet. We're trying it today. It does seem pretty strong. >> Yeah, guys, let's see how strong Justin is at the end of the video, too, once he's upgraded everything. >> But guys, make sure to leave a like on this video. And also guys, important message. Make sure to go to the channel Lanky Box Go. Go on YouTube and look up Lanky Box Go. That's where Foxy and Boxy go on all sorts of adventures. It's basically what the plushies are up to. They go to this place called Plushy Land when they're not around us. Guys, it is amazing. Go to Lanky Box Go. It is amazing. >> Guys, on YouTube, look up Lanky Box Go. It's a channel. It's awesome. And there's a bunch of videos with Foxy and Boxy over there. >> Lanky Box Go. >> Lanky Box Go. Ly Box Go. >> Hold on, bro. I got to get two. I got to get three wolf pelts. I think that's going to take a long time cuz wolf pelts are pretty rare. >> Oh boy, dude. >> But I got to find more supplies because um I got to go. Oh, I still have to trade to the uh pelt trader. Wait, it's the ram. Is it going to drop an item for us? >> Oh, let's find out. Where's the ram? Get out of here, ram. >> I didn't know the ram spawns on the first day. That's kind of cool. Maybe it's scared of you cuz you have the best blaster already. >> Cuz we're the big game hunter, guys. Now I got to look for an actual rabbit foot because we still have to level up. Oh, that's true. I need one of those, too. >> And I need a wolf pelt to level up, too, >> right guys? Cuz we still have to level up the pelt trader. And I guess it doesn't count. Like, if you consume it, then it goes away. >> Yeah, it literally goes away. >> Yeah, that makes sense. >> Okay, I got to find a rabbit foot really fast here, guys. You got to find one, too, to level up. >> I know. I need it. >> I found one. I found one. I found one. >> Just like I need Lanky Box Go, >> guys. Make sure to watch Lanky Box Go. It is awesome. Okay. Um, I got a bunch of stuff right now. I'm going back to camp and I got a rabbit foot for myself. >> Let's go, dude. >> Dude, this is such a cool class, guys. It has its own quest list. This is really, really rare, guys. Not all classes have that. Only this class has it. >> Yep. This might be one of our favorite classes in the whole game. >> Okay, I'm going to go uh look for Now I'm looking for wolf pelts, guys, because my next quest is the wolf pelts. I need four wolf pelts because three to level up and then one more for the fur trader who's already here. >> Wait, that's a lot of wolf pelts. >> I know. I got to hurry. >> Oh, dude, >> I really got to hurry. And guys, here's the volcanic area, the volcanic biome. That's where the scorpions live. I got to collect their shells. And I think it was like 10 scorpion shells or something. >> Yeah, it's a lot. >> That's not going to be easy, guys, because it's not guaranteed that the animal drops the shell or the pelt or anything. >> No, it's very difficult to get them. >> Yeah, it's a pretty low drop rate. >> I'm looking for another blaster. I need a blaster, bro. I really need another blaster. >> Uh, like another blaster or just more ammo? >> No, another blaster. >> Okay, gotcha. >> Or more ammo. I guess that would be good, too. >> Yeah. Ah. Oh, there's a wolf here. Maybe it'll drop a pelt. >> Give us your pelt. >> Ah, it didn't drop one, >> man. >> Bro. Okay, guys. I really need to hurry. I got to fight four wolf pilts in one day. I don't know if I'm going be able to do that. >> We got to hurry, hurry, hurry. >> I got a spear. That's pretty good. Okay, she spear is powerful. >> I should be able to use this and oof a bunch of wolves. All right, I got to level up, guys. Let's go. >> Good call. >> Let's go. Okay, I'm going to use this at long range, guys. That is actually really OP that you start with this. Nice. I got a wolf spell. But can I bring it over or do I have to consume it? >> Um, I think Can I Oh, I can move it. Okay, so I can trade this first. >> Oh, so then you're going to upgrade? >> I'm going to upgrade, then I'll go consume them. Good call, man. Good call. >> Cuz I don't want this guy to leave. He leaves after one day, >> right? The peltrator. >> Nice. I got the good axe. This is really good. >> Huge. Guys, always upgrade with the peltrader. >> Guys, this blaster is really good. It one hits the wolves, but you don't spawn with that much ammo. You only start with like a little bit of ammo, so I got to find more. >> Oh, okay. We got to try to find one of those sheds that has a bunch of ammo in it. >> Yeah, that'd be really good. Yeah, that'd be really good. >> Yeah, we love those sheds. >> I'm going to save that ammo and I'm just going to fight using the spear. The spear's pretty good. So guys, remember I sprint 15% faster. So I should be able to run away from bears and wolves no problem. Yeah, exactly. No bear can ever catch up to you. >> Wait, I actually can. I can run away from them and not take any damage. >> And later in the video, Justin is going to have to oop some mammoths. I wonder if you can outrun the mammoths, too. Oh, definitely, guys. Mammoths and scorpions and also the cultist king, guys, which is going to be really tricky. We need a bunch of gems to do that. All right, the brand new boss. We'll battle him in this video, too. >> We have to, cuz guys, we have to complete all quests. We heard if you complete all quests, you unlock a top secret ending that has the big game hunter. Yep. But the only way to unlock it is to check off every single one of the requirements on the list. >> Guys, I literally oofed like 10 wolves. I only got one pelt. Yeah. Oh, I got it. I got it. Okay, let's consume this one. Let's hear that cool sound effect again. Okay. Okay. >> I love that sound. Okay, we got one out of three wolf pelts. I need two more. Guys, this game is so addicting. Shout out to developers. There's all these awesome updates and all these awesome classes. Makes you want to play forever. Yeah, it's the best. Guys, >> I have a good axe. Do you want it? >> Um, no. I already have that cuz I'm the lumberjack. >> Oh, >> I start with that. Guys, >> guys, Adam loves the lumberjack class. He refuses to play as anything else. >> Yep. Cuz I'm not really good at much except for chopping wood. >> You're very good at that. You're very good at clicking on trees. >> Yeah, exactly. And then picking them up and planting them. >> Very good. Very good. Nice. I found another one. Nice. Lucky. Lucky. Lucky. >> Let's go, man. >> Okay. Two out of three, guys. One more. Uh-oh. The deer is going to be here. >> Maybe they'll be afraid of me cuz I'm the the big game hunter. Oh, exactly. That would make sense. They'd probably be afraid of people with blasters. There's a wolf. There's a wolf. There's a wolf. There's a wolf. No, I ooped. I dropped all my loot. Oh, man. Man, I got to I got to get back there. I got to get back there, guys. >> It's all good. >> It's all good. I I think I had a little bit of health left, but it was night time, so I couldn't see. >> Yeah, no problem. >> Where did I Oof. Over here, I think. So, >> there's a lot of stuff. >> We don't have a map yet. >> Oh, I'll build that. Build it now. >> I'll build it. >> Do it now. >> You can count on me. >> Oh, yeah. I I was over here, guys. Okay, I got to pick up all my stuff. Nice. I got to pick up all my stuff. There it is. There's that wolf that oofed me. >> Let's go. >> Didn't even drop what I needed. >> That's okay, >> guys. We got to level up. We got to get all We got to become the strongest player ever, basically. Because with all these upgrades, we're going to be stronger than anyone has ever been before. >> Yep. The most upgraded possible account in 99 Nights in Roblox. >> Yep. Cuz we're going to do every single quest. >> Yeah. But yeah, guys, it I it says that you Let me see. Mammoth tus. You get five HP for each mammoth tusk and it's infinite. It says infinite. So if you literally get like 40 mammoth tusks, you'd be invincible. You'd be like actually invisible. You'd have too much health. Nothing in the game could oof you. Nothing. >> That's true. Yeah. So we're going to try to oof a bunch of mammoth in this video. >> Yeah. It's going to be insane, guys. >> Awesome, man. Going to be really awesome. >> Not even the new king boss could oof you. >> No. No way. >> No shot. >> No way. Okay. I have a bunch of scrap. I have a bunch of materials. Pretty good. >> Nice. Okay, we can build a lot of stuff. I'm going to build now. I'm going to build. >> Maybe the >> I'll do it now. >> Cracking match. >> I know what to do. Don't tell me what to do. >> I need Okay, get get the bofuel processor. That'd be really good. >> All right, let's see what we need for that. >> Okay, guys. I'm still on my quest. I got to I'm going to do these in order. So, next I still got to get one more wolf pelt, then I'll go fight some scorpions. >> All right, cuz there's more upgrading to do. >> Yep. There's more leveling to do. >> Yep. The scorpions are a new enemy in the game. They spawn in the fire area, right? >> Yeah, in the volcanic biome. And they're pretty scary, guys. >> I got it. I got it. I got Here we go. Let's consume this. Boom, guys. Let's open this up. Yes, we got the ding. Wait, it says something emerge from the pawn. Oh, frogs. I don't Th those are not part of the list, but okay. Next up is the scorpion. We need 10 scorpion shells. And then attacks have a 15% chance to poison enemies. Wait, that's so good. Wait, so if you just smack someone or you blast them, you could poison them, too. >> Yeah, that's insane. Wait, I got another wolf fell. Do you want it? >> Yes, I would love that. >> It's where I'm at. Look on the map. You got to get it. >> Okay, I'll grab it. >> Okay, it's over here. >> Got it. I got it. >> It's over here. Open this treasure chest. This wolf's looking at me. It knows. It knows. Wait, wait, wait. What did I get for oofing the wolves? What did I even get? I got 5% damage. So, I deal more damage and I'm faster than normal right now. So, I'm just absolutely becoming OP. You are flying and zooming right now, dude. >> Oh, yes, sir. Okay, now here's the bad guys base. I'm definitely going to go in there later because I'll be so strong they won't be able to stop me. >> Right. Exactly. Once you're upgraded, there's no way they can fuel you. >> Okay. Oh, there's some cake right here. Nice. Oh, and I got some blaster ammo. Now guys, I'm going straight to go and find uh the scorpions. >> Let's do it. And we got to oop 10 total or I mean we need 10 shells, right? >> I need 10 shells. Ah, this wolf. Come on, man. I was trying to open that treasure chest. Go away. >> 10 scorpion shells. >> I got to reload. >> That will not be easy. >> I got to reload. Oh, did I just Oof. >> Yeah, I didn't even see. I didn't even see. I just sat down. I couldn't even see what was going on. Okay, guys. I'm over here on the map. I'll go right back. Man, >> did you make the battlefield processor? >> Yes, sir. >> Good job. Next, we got to make the boost pad. >> That's what I'm working on. Yeah, >> do it now. >> Sounds good. >> I got to go back to where I was, guys. I got to take down that alpha wolf. >> Yeah, guys. It's because I'm trying to speedrun this. I should play a lot more carefully, but I'm trying to speedrun this challenge, >> right? Cuz he's the big game hunter. >> Guys, I love these classes that have like their own lists. It's so awesome. >> Yeah, it's really fun to collect them all. We did another where we played as a chef and we made secret meals. >> Yeah, guys, we made all secret recipes in the game. That was awesome. Okay, that's why you guys got to go to Lanky Box and subscribe. And also go to Lanky Box Go and subscribe. Two channels. >> Lanky Box Go is super fire. Make sure to go there. Foxy. Basically, if you guys want to know what Foxy Box are up to and like Banani and everyone, make sure to go there. Oh, I found another blaster if you want it. If you look on the map, that's where it is. >> Okay, I would love that. Yes. >> Yeah. Okay, you go get it. >> Okay, sounds good. >> I'm not helping. Got some armor. Here's another Alpha Wolf. Oh, I got Alpha Wolf pelt. I'll just consume this one. Can I Wait, I can consume this. Yeah, consume. Consume. Nice. Nice. One out of three alpha wolf pelts. I need three of those, too. >> So satisfying. >> What happens when I get three of those? Uh 10% chance ammo is refunded. That's pretty good. >> Ammo is refunded. So even if you blast someone, it might not even like count towards your ammo. >> Yeah. Like you'll get the ammo back. >> I get it. Unlimited ammo hack. >> Yeah. Well, a 10% chance. >> Yeah. >> 10% chance. >> Oh, it's night time. Watch out there. >> I'm not scared. >> I'm scared for you, man. >> I'm a big game hunter. Wait, what is that? I thought you said you weren't scared. >> I'm not scared. It's the deer. Go away. >> Uh-oh. Okay, I made the uh boost pad. >> Nice. Time to boost. >> Boost pad. >> Time to boost. >> We love the boost pad, guys. >> Okay, I'm going back and then I'm going to go fight some scorpions cuz next up on my list is 10 scorpion shells. >> Yeah, you're going to have to oop a bunch of scorpions for that. >> I could do it. Nice. I leveled up the fire a bunch. >> Huge. >> Look at the deer. >> Get out of here. >> Do you know where the stuff is that I need? Tell me now. >> It runs away. >> Okay, I'm going over to the volcanic biome, guys, because we have to go there right now. >> Yep, cuz we need a bunch of scorpions. >> Okay, I'm looking at the map. The volcanic biome is over here. Okay, go this way and turn around. Nice. >> It's on the bottom of the map today. Nice. >> Oh, it like moved. >> Yeah, guys, the volcanic biome always moves. Yep, here it is. Okay, now I just Oh, here's scorpions. They're already here. >> Okay, time to get them, guys, with the boost pad. Am I faster? Sprint. I'm so faster. Okay, there's the first one. That's what it looks like, guys. It's like a little round thing like that. Okay, let's consume that. One out of 10, guys. We're going to need a lot of these. >> I love that sound effect, though. >> I know, guys. This game is so cool. They put custom sound effects just for this class, basically. >> Yeah. Okay, I'm going to be careful and play in first person. Nice. Oh, scorpion shell. Eat that. Eat that. >> Be careful. >> Oh, man. I thought that would refill my hunger cuz we're eating them, but it doesn't. >> Oh, the scorpions. >> Yeah. >> I don't think you can eat a scorpion shell. >> Maybe you can, but don't try it, guys. Do not even think about trying that. Oh, >> nope. Didn't drop anything. I'll just eat that. Okay. Uh I'm kind of taking a lot of damage. Adam, you got to make some stew. Do it now. >> Make some stew. Okay, I'll make a crockpot. >> Do it now. >> You can count on me. >> Do it now. >> Don't worry. Oh, there's bad guys. Uh-oh. Uh-oh. Uh-oh. But I'm faster than them and I do more damage. >> No. Stop it. I'm trying to upgrade here. I'm trying to upgrade, bro. Man. >> Okay, you know what? I'm going to start using my blasters. I'm just Oh, I'm like glitching. I just used the spear, guys, cuz I thought it was strong enough. But I'm going to start using the blasters. >> Get them from long range. I'm I'm going to stop messing around, guys. I'm trying to get 10 scorpion shells. Let's go. >> No more messing around. >> No more. After that. Oh, yeah. After that, we we got to get five bear pelts. That's insane. >> Oh, boy. So, guys, to get the bear pelts, you got to probably oof like 25 bears to get five bear pelts. >> More than that. More than that. So, guys, this is going to be a really tricky challenge. I do think to do this. Nice. I got another shell. I think we're going to need that tactical blaster. Oh, I got two more. Nice. Eat that. >> Okay, so Justin's talking about the tactical blaster that you can normally only get in the red chest, the legendary chest. I think I will have to get that basically because oofing that many bears is going to be impossible. So I if I were you, I would also focus on making the ammo uh crate and uh getting scrap that that's also very important, >> sir. Yes, sir. >> Do it now. >> Can do. >> Don't talk to me till you do it. >> All right, >> that might be a while though. >> Yeah, >> don't guys. I need to find the scorpion shells, bro. >> All right, we can do it. And guys, make sure to look for the new Lanky Box merch at Walmart at Target. It just restocked cuz you guys sold it out. We talked to Walmart at Target. They just restocked the brand new Foxy Mystery Snack Box, guys. Literally, Foxy met with Mr. Walmart and Mr. Walmart said, \"The Foxy Mr. Snack Box sold out so fast.\" Fox say, \"Yep, pretty late.\" And then they got more of them on shelves, guys. Make sure to go Walmart Target because it it should be there, guys. It should be there. >> Yeah. Thanks so much for getting it, guys. >> It should be there, guys. >> And we have the doodle plushies, too. It's so cool. But guys, most important, stop dropping stuff everywhere, Adam. Most important is go to Lanky Box Go. Oh, that's true, guys. That's what's most important because guys, you can get the merch, but if you want to know what the merch is up to when you guys are not around, like um that's where you got to go to learn. You have to go to Lanky Box. Go. Okay. Wait, how come I can't I can't consume that. Nice. Consume it. Five out of 10 scorpion shells. But now I'm hungry. I need some food. >> Uh I'm working on it. >> Did you make some stew? >> Uh yep. Do it now. >> Yep. I got you. >> Nice. Okay, guys. I got to blast all these now, guys. We definitely are going to need that tactical blaster. Oh, we need it. Yep. Or well, actually, I don't know. Okay, 6 out of 10. I think if we just get the ammo crate, if I just get a bunch of ammo for like the rifle, that's already pretty good. H Okay, I can work on that cuz we're almost at the where we can build. >> Guys, I'm going to wait. It's okay. I just wanted the shell. It doesn't matter. I'm not holding anything good. >> Okay, no problem. We also need two of the uh red gems to even make the ammo thing. So, we gotta basically have uh bad guys attack us and we got to fight them. >> Bingo. Yep. >> Hannah, make some stew. Oh, that's mine. >> There's right here. I was gonna eat that. >> That's mine. >> Okay. >> Later. Later, buddy. Mine. >> Let's go. >> All right. Cool. >> We're the big game hunter. Foxy's the big donut hunter. Foxy, where's the donut? >> If there's a donut or some KFC nearby, Foxy's going to eat it. >> Foxy will find it. >> Guaranteed >> she will find Oh, mysterious group. Okay, wait. So, we're getting attacked. We're going to get a gem. That's actually good. That's really good for us, guys. We wanted to get attacked. Do you want me to go back? Oh, wait. The Oh, is it the ram? It's the ram. The new enemy. Ah, >> cool. >> Look, it looks like I ate him. >> What? >> Wo! It just like despawned. You guys see that? It just went away. >> I look like the ram. >> Yeah, that was weird. Wait, are we getting attacked right now? >> Um, yes, we are. >> Oh, fight him, Adam. >> Okay, I'm trying my best. >> Fight him. >> Don't I'm not a loser. Don't I'm not a loser. Don't >> Don't be back there. I'll I'll be there to save you. >> Okay, >> don't. I see your health bar. I see Adam's health bar. >> Big wow. >> Adam's going to get oof. >> Adam's going to die. >> Justin. Justin, please. >> I'll save you. I'll save you. I'll save you. I'll save you. I'll save you. I'll save you. I'll save you. I'll save you. I'll save you. Almost there. Adam's going to oof. >> I'm okay. Boom. >> Cuz I got the blaster. >> I'll save you. >> Got him. Got him. Wow. >> Luckily, I was there to help. >> Right. Got him. >> I think I could have beaten him. >> No. Look at how little health you are, buddy. >> Oh, true. >> Oh, I'm hungry. Good thing I have this stew. >> I was going to eat that. >> Make some more stew, buddy. Okay, I got it. >> Yes, dude. Do it now. Oh, wait. And there's frogs. You can oop the frogs for uh food, too. >> Oh, right. I forgot. >> Yeah, that's pretty good. You can also go fishing. There's a fishing pond right next to our base. >> There's a whole bunch of meat here. >> Nice. Okay, so guys, back to the quest. I need three more scorpion shells. I should be able to get those pretty quick. Easy peasy. >> All of my attacks have a chance of doing poison damage, which is really good. That's really helpful, guys, cuz poison it does damage even after you hit them. >> Yep, it's pretty awesome. Oh, the the fur trader is back. Okay. Uh I need alpha wolf pelt, but I need to consume those, too. >> I would trade because then your character gets stronger. >> Yeah. Okay, guys. I got to find alpha wolf pelts. So, guys, there's a lot of quests to do right now cuz I got to find the pelts and I got to consume them. There's too much to do. >> Yep. Whole lot to do, but we're going to do it cuz we're upgrading to the max max. >> We're going to do everything you can do with this class, guys, and see how strong it actually is at the end. Yep. We're going to Lanky Box Go to the Max Max. Guys, make sure to go to Lanky Box Go. It is so fire. >> We love Lanky Box Go. >> Yeah, it's my favorite thing in the world to watch. Actually, guys, I watched it the other day for 6 hours. Adam's mom said she had to take the iPad away from me. >> That's true, guys. I can actually uh verify that that did happen and she was very upset. >> Lucky box verification. >> That is verified. >> True. >> That's what Adam does. >> You did do that. >> That's what Adam does. Oh, I found it. Nice. It's cuz he was supposed to be doing his homework and he watched Lybug go instead. >> Guys, this is awesome. That's what Adam says, guys. He He does this weird thing where he goes up to his mom and then he goes Adam says he has to verify it's his mom, >> right? Mommy verification needed. >> He says how? And he says, \"Mommy, want a hug?\" And that's how he says he does a lucky box. Mom verification. >> Adam every time. >> Adam is going crazy. Like he's coming up with all these new ideas. It's really crazy. Okay, hold on. Here. Here, I'm going to trade right here. Boom. Ooh. Uh, I'll get this, I guess. Nice. Okay. >> Awesome. >> Nice. Yeah, >> dude. I'm so hungry. I can't wait to eat this stew. This is going to be awesome. Wait, >> dude. I'm so hungry. >> I'm sorry, buddy. I had to >> No, for real. Look at my damage going down. >> I'm sorry. I had to. >> Dude, I'm going to Oh, >> no. Just Just cook something else. >> There's no There's no more meat here. >> Here, stop whining. There's carrots right here. And I I left some meat right here. Okay, good idea. There's two carrots right there. You can cook. Thanks. >> Come on. >> That wasn't my fault. Well, you could be >> I was going to make that. >> No, you could have eaten that stew. You're trolling me. Stop trolling. >> All right. All right. >> Stop trolling. Do it now. >> All right. All right. >> Okay, guys. I need uh like three more of these shells. Three more shells. >> Easy peasy. >> Three more shells. Here's the bad guys. There's their stronghold, which we will I will need to go in there because we can get gems there to fight the cultist king. Oh, nice. I got one more. >> We need to face the cultist king and get gems to uh upgrade the ammo crate. >> Two more two more two more shells. Oh, the these areas have a ton of scorpions in them. Oh, there's like teddle. Ew. Ew. Dude, imagine you go into a cave in the forest and there's a bunch of scorpions on the ground. >> Scorpions. >> Bunch of scorpions on the ground. >> That's sus. Oh, last one. Boom. Oh, one more. One more. One more. Man, I >> Do you think that snakes or scorpions are scarier? >> Spiders. >> Hey yo. Hey, you laugh. Hey, you laugh. >> I didn't ask that. >> I thought about it. Listen, you laugh at me. Listen, Adam, don't laugh at me. You are a giant boy. Got him. Dude, imagine laughing at me, guys. Literally, if Adam sees a bug, like not not even a spider, not even a spider. If he sees um if he sees like a ladybug or an ant or anything, he'll like jump up on his bed and start crying. It's true. >> I say yikes. >> Yeah, that's right, guys. He admitted it >> cuz I don't want to get bit. >> Yeah, he thinks he can get bitten by an ant. >> Yeah, that's called being smart. >> Oh, here's the ram cut scene, guys. It's the ram. >> Uh-oh. It's going to charge at us. >> Look, there's the ram, guys. There's the ram. It spawned. >> Watch out for that ram. It's evil. >> So crazy, dude. >> You're so crazy, man. >> You're so crazy, bro. >> Oh, no. >> Oh, it's a ram. >> Yo, that actually scared me. It just It just spawned out of nowhere. >> Justin got spooked. >> Okay, wait. Actually, that actually got me. Okay, can I just find the last thing, please? Are you wolf? I oofed, >> bro. Wait, how did you oof? >> I oofed to a scorpion and a wolf. >> Oh, man. >> Lame. I'm going back there. >> That's okay, >> guys. We're really trying to just speedrun this right now. That's why we're oofing so many times, cuz we're trying to speedrun. >> Yep, cuz we got to upgrade the big game hunter class. >> And guys, finding five bear pellets is going to be very hard. Like, this class is going to take a long time to upgrade all the way. Yeah. Now, let us know if you guys have ever played as this class and if you've been able to upgrade every single thing to max level. >> Yeah, it'll be awesome. >> Cuz if you have, that makes you a Roblox pro. >> Yeah, it's going to be awesome. Okay, I'm going to go here. Nice. Okay. Oh, yeah. Oh, yeah. Oh, I thought I was going to get it right there. Okay, it's okay. >> No problem, >> guys. I will get it. Yo, this thing keeps spawning. Go away. The ram is dabbing just like Banani likes to dab. >> Uh-oh. Uh-oh. Uh-oh. Oh, nice. I dodged it. Okay, let's go. Dude, >> dodging is not too hard, guys. But I'm still looking for scorpions. Okay, nice. It's daytime. Where is this last scorpion shell, guys? It's like they know I need it and they're not having it spawn in. >> Yeah, we got to look for the little eyes in the smoke. >> Yeah, in the brush right here. Boom, boom, boom, boom, boom. Get it. Get it. Ah, didn't have it. >> You got pest control. >> I got a badge. I got a badge. I think it's when you oof like a 100 scorpions. >> Oh, that's nice. >> Something like that. >> That's actually pretty cool. >> Yeah, I got a badge. Secret badge. >> I like it. Okay, I'm not finding scorpions anywhere, but there's a lot of fuel around here. >> Yeah, the volcano area is pretty nice, guys, cuz there's a lot of items that you can find. >> Wait a minute. I can trade the the fuel for uh uh for ammo. Wait. Okay, wait. I got the last one. Let's go. Oh, I forgot about that. >> Boom. We got the scorpion shell. Nice. We checked that one off, too. So, now I have a chance to do poison damage. Next up, I got to find alpha wolf pelts. Easy peasy. You can definitely some alpha wolves. Okay, so to do that, I just run back and I look. I'm going to see if I do poison damage to anything. Man, this is such a cool class, guys. >> Yeah, poison damage is pretty awesome. >> Nice. Okay, I'm going back to the base. I'm going to look for uh all sorts of alpha wolves. >> Yeah, cuz we need their pelts to level up. What type of power up does the alpha wolf give you? >> The alpha wolf gives you 10% chance of ammo being refunded. >> That's awesome. >> That's pretty cool. That's actually pretty cool. >> Yeah, you can have unlimited ammo. >> Okay, I got to be careful now. I can't take too much more damage. >> Yep, true. Stay safe. Okay, >> you can't again. >> Yeah, I'm not going to. >> That would be embarrassing. >> I'm not going to. >> Okay, guys. Now, I'm gonna save all that fuel I had cuz Adam's going to level up the fire. I'll save it to level up to get more and more ammo cuz that'd be really good. >> Smart, guys, cuz Yeah, there is an area where you could trade fuel for ammo. >> That's in the volcanic biome. >> Yep. Really handy. >> I will go over there. Oh, I got the good flashlight. Nice. I'm finding a bunch of ammo. Oh, nice. Alpha wolf. >> Huge. >> Dude, this game's really This This class is really cool because it makes you like excited to like see the monsters actually. Oh, I miss >> because it actually like helps you get to your goals. >> Yeah, normally we don't like the animals because they're mean to us. >> Adam, what are some of your goals? >> Oh, boy. So, my goals right now, >> I would say that I really want to try to drink two gallons of milk a day. >> No, you can't do that, guys. Don't even try to do that. It's not healthy. >> Yeah, I failed every single time. >> It's not healthy for many people. It's healthy for Adam cuz he's the milk guy, >> right? Exactly. I also really want to get stronger. So, I've been um doing like PE class with my mom. >> I'm going to tell you what my goals are. >> Okay. What are your goals? >> Watch all episodes of Lanky Box Go on repeat. >> Oh, have you seen them all yet? >> Yes. I'm going to try and watch them all more than anyone else. >> Dude, what if you watched Lanky Box Go for 24 hours straight? >> I did challenge myself to do that. Adam's mom took the iPad away after about 30 minutes. >> Can you imagine if we did a 24-hour challenge in our mom's boxy Tesla? >> Guys, by the way, yeah, guys, our mom has a cyber truck. She leveled it up to be a Boxy Cyber Truck. It's crazy. It's It's golden yellow just like Boxy. It's actually nuts. >> Yeah, it's so cool. >> Our mom is epic. Actually, >> she lets us drive it or >> No, she doesn't. >> No, she lets us ride in the back. She let us ride in the back. >> Hey, that's how you guys know Adam needs to go back to school. Adam will sit in the back and pretend he's driving and he'll say, \"Yeah, >> yeah, I sorry. I drive it in my dreams. I forgot about that.\" >> You don't know how to drive. >> I know. My mom says the only driving we do is driving her crazy. >> Yeah. She says, \"A, you're driving me up the walls with your mom verifications.\" >> Right. That's true. Justin sits in the back seat right behind my mom. >> Yeah. It's awesome. >> Yeah. >> It's awesome. >> He sometimes kicks the seat. She doesn't >> I learned to not do that. I learned to not do that cuz I got grounded too many times. She took away the iPad. I couldn't watch Lucky Box go. >> Right. Exactly. >> My worst fear. >> That's funny to you. >> No, it's not funny. >> Okay, I do have a bunch of fuel. Let's just throw this in there. >> So much fuel. >> I don't really care. Let's just throw there. I'm not going to save for ammo. It's too far away. >> Can we level up the fire? >> Yep. >> Oh, almost. >> I will. >> Awesome, man. >> And I got all this food we can put in the bofuel processor, too. >> That's great. Wow. You got a lot of stuff. >> Nice. >> Oh, yeah. We haven't really saved many people. We haven't saved anyone because I'm busy doing the big game hunter stuff. >> I'm busy upgrading. Then we're going to speedun saving everybody. >> Okay. Uh I got to find more alpha wolves. That's what I'm supposed to be doing. But there it's night time so it's a little bit dangerous. Maybe. Maybe. Okay. I I'll go save the first person. Why not? Is it worth going out there? >> I'll go save the first person. Why not? >> Let's do it. >> Well, I'm not. Should I even though? >> Yes. >> But no, because I got to finish my quests. >> Well, you can show everyone how easy it is now to save the people now that you're a little bit more upgraded. >> Oh, but the ram is out here. Uh-oh. >> It's on me. Don't worry. >> Here's the first person. I'm just going to use my spear. I'm not scared of these wolves anymore. I'm the big game hunter. >> Yeah. >> Well, I did I did poison damage to one of them. >> Oh, really? >> That was pretty cool. And I'm so fast, guys, cuz I use the boost pad and I'm I have the upgrades. I'm so fast. They cannot catch me. >> That's so awesome, dude. >> Hey, guys. This is a pretty OP class. People on the internet were saying this is the most OP class in the whole game. I don't know, guys. It's really good, but I don't know. I don't know about that yet, but I haven't finished upgrading it, so I I can't tell you yet. >> Maybe once it's upgraded, then it's the most OP. That would give my full review after we do the full upgrades, >> right? Sounds good. The Justin Linky Box review. >> I got to find more Alpha Wolves. Oh, here's the second base. That's all alpha wolves. That's actually really good. >> Yeah, they're going to drop a bunch of pelts. >> Oh, I got one. I just saw I just saw it dropped. >> Cool, man. >> Nice. Come on. Come on. You can do it. Come on. Great aim. >> Nice. Got him. Okay, guys. Here's the second alpha of pelt. Eat that one. Nice. Okay, only one more alpha of pelt. Then I have a chance of refunding all my ammo. This is hype. This is a really cool class, guys. I just like that it has like its own quests. >> Yeah, it's nice. Oh, I got it. I got it. I wonder if we're going to get a special sound effect when we get all classes. >> Nice. Okay. Yep. Okay. So, now we have a 10% chance of refunding ammo. Next is five bear pelts. 25 HP permanently is kind of crazy. That That would be a big boost. >> Yeah, you can take a ton of damage now. >> That would actually be a big boost. >> That's great, man. >> That's actually really good. >> Big boost. >> Yo, my blaster does poison damage. That's actually crazy. So, it's like a long range poison bullet. That's actually really powerful, guys. Oh, that's actually a really good level up, actually. >> Yeah. >> Okay, let's open this up. Boom. I got another blaster. Okay. >> And it's nice cuz as you get stronger, then it's going to be easier to oo stuff, and it just goes faster and faster. >> I already got the second person. Okay, I got two people. Now I got to look for bears. Now, bears are some of the strongest animals in the entire game. Some of the most dangerous for sure cuz they're faster than mammoths and they do a lot of damage. >> Can you handle the bears right now? >> Yeah. >> Oh, definitely. >> Okay. >> Oh, definitely. I just need the ammo crates. I don't think I need the tactical blaster. We just need the ammo crate. >> Okay, let's see. I think we might be able to do that. There's the fire. >> Okay. Wait, you finished the whole fire? >> Yeah. >> Oh, nice. >> Well, wait. No. Yeah, it is. Uh, let me see. >> Is the fire finished or not, buddy? >> It is. >> Okay. Yeah, we need um more of the gems. That's what we need. So, maybe explore the cultist stronghold. >> Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Oh my goodness. There's so many there's so many animals cuz we're going to need a total of two more gems. >> There's so many bad guys. >> Okay, get them. I >> accidentally dropped this. Nice. Okay, let's go. Let's go back there. Let's go back to camp. We'll drop off both people. Sounds good, guys. This game is so addicting. Okay, five bear pelts. That's going to take a long time, bro. And then it's on to the cultist king and the mammoths. No problem. By that time, you're going to be so strong. Well, I don't know, guys. I feel like I need that tactical blaster for the tactical advantage. H Well, that's normally in the red chest, which you might be able to find in the stronghold, right? >> Should I go to the stronghold? Yeah, I'm just going to uh make some stew here, but this is all for me. >> No, it's not. >> Yummy, yummy. Two stews all for me. >> Thanks, buddy. >> Dude, come on. >> It's cuz I'm the big game hunter, buddy. >> He does what he wants. >> No, I got I got to go. >> That's true. >> I got to go. I got to go ahead and go ahead. Okay, so I'm going to wander way out into the forest because we have to find uh I got to find uh some bears now, >> right? The bear pelts. >> Yeah, I need bear pelts. Oh, it's night time. Uh-oh. Uh, >> be careful. >> Are you sure you should be out there at night time? >> Guys, I really think it would be crazy if the developers added into the game nighttime go away or daytime longer. That would be pretty fire. >> Oh, like the light class or something. >> That would be insane. >> Where it makes everything lit. >> That class would be super OP. If there was a class where it didn't have nighttime, that would be like totally busted. >> If I made that class, I would call it the light bulb class. And >> and you have to just get a bunch of supplies to build a a big light bulb that lights up the entire map. >> If I made that class, I would call it Eureka. >> Cuz Adam says when he has a good idea, a light bulb goes off over his head. That's what he says, >> right? It's like a light bulb moment. >> That's what Adam says. >> Yep. >> It's true. >> Pretty good. Pretty good. Hug my mom. Light bulb. And then I go hug her. What? >> Okay. >> That's a good idea. Yeah, bro. Guys, always be nice to be moms and dads. They're awesome. >> Okay. Um I'm looking for bears. Oh no. Oh, there's like 10 alpha wolves over here. >> Goodbye. >> Uh but I'm faster than them cuz I'm the big game hunter. I'm not scared of them. >> That's true. >> I'm way faster than them cuz Oh no. >> Get that speed boost. What? >> I'm just scared for you. >> No, I'm faster than everything cuz I'm the big game hunter and I leveled up. >> Smart guys. He's not going to oof. >> I'm not going to oof. Okay. Um did you find Oh, I'm very low health. Okay. Did you uh make the ammo crate? I have a bunch of scrap. >> Uh we need the gems. >> Yeah. >> Oh, >> we have everything. We just need the gems. >> Okay. So, it's up to me. >> Well, kind of. Yeah, cuz I can't really get the gems unless we're attacked at night. >> Well, we're going to be attacked tonight pretty soon, right? >> True. >> Oh, there's some bad guys over here. Maybe I'll fight them. Maybe they'll drop one. I don't know. >> If we're lucky. Yeah. >> I don't know. Okay, I'm going to go fight these bad guys. Maybe they'll drop something. >> Come on. Give us the gem. Or you can sacrifice people in the volcano. That gives you gems, too. Yeah, but then I need to find like a bunch of people, >> right? Exactly. >> And you're not guaranteed gems. >> Oh, that's true. Sometimes you get the forest fragment and other stuff. >> I think you're right, though. We do need gems because that's how we fight the king. So, maybe I should start sacrificing people to volcano. It's >> probably worth it. >> I'm going to I'm going to take on these bears from long range. >> We're going to get attacked tonight. So, we just need one more gem after that. >> Come on. >> We're close. >> Come on. >> We're very close. >> Come on. Oh, I got a bear pel. Nice. Okay, I'm going to consume this one. >> Awesome, dude. Why it won't let me? Oh, consume. Okay, five bear pelts is actually a lot, guys. That's actually no joke. Oh, nice. I did poison damage to that one. I did it again. I did it again. >> Awesome. It's taking extra damage, guys. >> I got the key, but I need the Ouch. I need the uh I really need more bear pelts cuz it's poison. >> What? >> Well, the bear takes extra damage cuz it's poison. Yeah, come on. Oh, yeah. It was poison again. Got him. >> I didn't get another pelt, though. That's all good. >> No, I need pelts, Adam. I really need them. >> We'll get them. >> I need them. Eat them. >> I First off, that's not my name, by the way. >> Oh, spell your name. You be go to school. So, guys, Adams, we go to school, guys. When we're at school, that's when the all the plushies go to plushy land, by the way. It's when we're not around them. They they go to plushy land and they hang out. Says, \"You be go to school. Spell your name.\" >> Oh, easy. So, it's Adam. A D A M. >> Wrong. Do it again. >> What? No. >> No. Do it again. A D. Sound it out. Adam. >> It's Adam. >> It's A D E M. Guys, everyone knows. >> Ad. >> Everyone knows it's Edom. >> No, it's not Edom. >> E, Foxy. >> We all know that's how you spell it, bro. Dude, you I'm going to report you. You're going to have to go back to school. You can't spell it yet. >> No, I don't want to go back to school, >> dude. How are there so many alpha wolves around here? Wow, guys, there's so many monsters. Nice. Okay, this game is getting really tricky. Yeah, guys. Now, we make the Roblox videos here uh when we get home from school. Yeah. So, we just got back from school today. >> Adam's mom sent us back to school basically because um Adam cannot even spell our name as you guys can see. >> Yeah. Our teacher is pretty cool though. He's really nice. >> Yeah. Hey guys, it's school/ boot camp. Yeah, it's both. Yeah, we we we do a lot of stuff at school. We get stronger in our brains. >> Guys, check this out. There's like five people here. I'm going to throw this. Check this out. Throw it. Boom. Oh, >> cook him like a stronghold barbecue. >> That was pretty cool, actually. That was actually pretty cool. >> That was awesome. Okay. Oh, see I did poison damage that guy. Pretty cool. Oh, and we're going to attack. >> Oh, that's good. We'll get a gem. >> Awesome. Uh-oh. Uh-oh. Ah, I dropped literally so much scrap. No. Where am I? Okay, top uh top like middle, man. I can get back there. >> I dropped all that stuff. Are you serious? >> I'm going back to camp right now. >> Oh, wait. And I dropped a person, too. I got to go save him. Uh-oh. Oh, and it's night time. I'm going to go pick up all my stuff and I'll be back. Okay, we're being attacked. Let's go. >> Wait, so I'm just going to be there alone being attacked? >> Yeah. >> Okay, I did pick up the strong axe, though, so that's pretty good. >> I have that, too. So, you can chop down the huge trees now. >> Yeah. Bingo. >> Pretty good. I got to get all that stuff back, guys. >> That was a lot of good stuff that Justin >> I had like 100 scrap. >> Oh, we need that. >> I know. >> 100 scrap. >> I had a lot of scrap. I can't believe I just dropped all that. >> Think about how much ammo it's going to be. Where? Where did I drop it, bro? Oh, there it is. There it is. There it is. Oh, no. Wait. No. Wait, guys. Where did I just drop it? Where did I just drop it all? I'm out of here. It must have been over here. There's the alpha wolves that do for me. >> Nice. Get them. >> I'm getting revenge on them. >> I'm getting revenge on them. Go away. There's wolves attacking me, too. There's so many so many bad guys. Okay, >> they're getting harder. >> Yeah, guys. I had all this crap and I had a person there. I had to save them. >> You got it. I had bandages and med kits. I just didn't use them. Oops. Okay, nice. >> I think I might be able to oof everyone here. >> Really? Good job. Oops, I got caught in a trap. >> Oh no, I'm starving. Oh man, I oofed a hunger. >> Well, it looks like you didn't save everyone. >> That's lame, dude. Once you bring back your scrap, we're going to have over a 100 scrap cuz I also found a bunch. >> Really? >> Yeah, that's so much ammo. >> Okay, I'm going back to base right now. >> Nice, man. >> I'm going back to base right now. >> All right, I ooped them and we got the gem. >> I'm going back to base right now. >> Huge. I'm still looting though. There's a lot of stuff around here. A lot of good stuff. >> Yeah, guys, we got to level up faster, bro. I got to find four more bear pelts. I don't know how I'm going to do that unless I level up. >> I'm going. I'm going. >> Well, what do you need? Just more ammo. >> Yeah, I think that's the best thing. Did you make the ammo? Uh, creator. Oh, I found a >> gem chat. >> Didn't you everyone at base? >> Yeah, but I only got one gem. >> I thought we had one from before. >> I know, but So, we're going to upgrade the crafting bench. And now we need another one for the ammo crate. Oh my goodness. >> Yeah, it's tough, guys. It's tough. >> Are you serious? >> Yep. But we just need one more gem, then we got it. >> Okay, >> no problem. >> I'm going to drop off all my stuff in case I don't want to lose it again if I move to a bear cuz it's time to go fight some bears. >> Smart. >> Time to go fight some bears. Guys, this class, if you find the tactical blaster, would be OP. You'd be able to speedrun all of the challenges and get all the upgrades in like the first 5 minutes. >> I think you got to get it for this class. >> I don't know how I'm going to find it, dude. Okay, hold on. Let me drop all the scrap. Oh yeah. >> Woo. Yeah, we got over 100 scrap now. So, don't buy anything else. We just got to get the ammo crate cuz then we'll be able to make a ton of ammo. >> Yeah, we got everything we need. Okay, I'm going to go to the volcano and start sacrificing people there because that will give us a bunch of gems. Oh, that's true, guys. So, if you throw in eight oofed people into the volcano magma, you guys can get some gems. >> Maybe. Maybe if you're lucky. It's not guaranteed, but it looks really cool no matter what. >> I'm also going to have to oof all these bad guys here, too, because Oh, no. There's a bunch I earlier. Nice. Nice. >> I just need eight of them. >> Eight of them. Eight of them. I ate them. >> Nice. Nice. Okay. Yep. Look at all these bad guys. Look at all these bad guys. Take them out. >> Take them out from long range, guys. >> Got them. Yeah, guys. We are doing more damage than before, but it still takes like two or three hits to these bad guys. Yeah, cuz they're getting stronger, too. >> Oh, but if I do the poison, I in one hit. That's actually really good. >> You can always tell the poison by the little green around them, guys. >> Yeah. Nice. See, that did poison right there. You guys see that? >> Yeah, that's cool. >> Come on. I'm going to take out all these bad guys. Yep. Poison again. I'm going to take out all these bad guys from long range. I'm not messing with them. Nice. Okay, now I have a lot of people to throw into the volcano. We should be able to get some gems right here if we're lucky. I think we will. I feel lucky. I feel very lucky, guys, because I watched watch Lanky Box Go this morning. I watch it when I'm eating breakfast, too. >> Guys, there is nothing better on the planet Earth than watching Lanky Box Go. >> Yeah, it's my favorite thing to do, especially on like Saturday morning. Best thing ever. >> Oh, you just you kind of hog the iPad, though. >> Yeah, but it's it's my turn to watch Lanky Box Go, guys. This is Adam's mom's iPad. I watch Lanky Box go on it. >> Can I please watch, dude? Come on, man. No. >> Oh, man. I got this thing. Okay, I need one more bad guy to get it again. Okay, >> easy. >> That's not bad. Okay, let's go get one more bad guy. I'll throw him in there to make some bad guy soup. >> A Yeah, easy peasy. >> Bad guy soup. Okay, where's the bad guys? Over here. Oh, there's one. Get him. >> Oh, bad guys, where are you? >> Get him. I have to get this guy. Boom. Why are you building that, bro? Adam's building stuff. He's wasting scraps. Stop building stuff. >> No, that was just wood. >> Stop building stuff. >> So much wood. >> Stop building stuff. Okay, I got it. >> All right, I got the last person. Hopefully, I get some gems right here, guys. >> Come on. >> That would be very good if I could. Come on. >> Then we can build the ammo. >> Please, please, please, please, please, please, please, please, please. Come on. >> Give us the red gems. >> Please, please. >> Red gems. Red gems. Red gems. >> Please, please, please, please, please, please, please, please, please. Oh, >> awesome. That's exactly what we needed. >> Just what we needed. Hooray. That's actually huge, bro. That's actually massive. So once we bring that back to camp, we're going to have unlimited ammo. >> Yeah. I'm going to infiltrate this bad guys base though because I will need more bad guys. Hopefully I get more gems because to summon the cultist guy, we need Oh my goodness. The ram just spawned to summon that. We're going to need um a bunch more gems, too. >> Exactly. Good call, man. >> I'm going back home. The ram is not very friendly right now. Go away. >> That's a mean ram. >> Go away. Wa! Look bright. The wolf was like stuck. Can I go through the statue? No, I can't. Ha. I'm opening this right in front of him. >> Let's see if you get the crossbow. >> Come on. Something good. I got Oh, that's good. That counts as two. >> Awesome, >> guys. So, yeah, this new item, the sacrifice thing. If you throw in the volcano, it counts as two people. >> Yeah, the totem. >> Yeah, it's pretty cool. We love the totem. >> Yeah. Okay, let me go throw this right here. I'm going to throw it in. >> Let's see what we get. >> Boom. We're going to get two for the price of one. Boom. See that? >> Boom. Boom. Boom. >> I wish you could throw the wolves in there, too. >> Yeah, I know. >> But you can't. It doesn't work. But guys, we found out in a different video we tested myths. You could throw the aliens in there and it counts. >> Yeah. So, if the aliens spawn in your game, definitely grab their bodies and throw them in. It counts. >> Yeah, we haven't even seen the aliens in a while. And then we saw them and they literally counted. It was crazy. >> I know. We got lucky to find them. Bad guys. Get them. Get them. Nice. Okay, get out of here, guys. We're doing really good, but Okay, I still have to find bear pelts, but I'm kind of doing all this stuff so I can find the bear pelts. Bingo. Cuz I need ammo. And to get ammo, we need red gems. >> Yep. >> You know what I mean? >> Cuz we can't oof the bears otherwise. >> Although, I mean, I have a good amount of I don't have enough ammo to oof a bunch of bears. >> Not enough. Bears take a lot of blast to oof. >> Yeah, guys. They're the strongest. Some of the strongest in the game. Wait, maybe I can oo some mammoths right now, though, cuz I'm in this biome anyways. >> All right, so guys, the mammoths once you oo them, I think you have to eat their tusks and then it gives you HP. >> Yeah, but it's infinite. You can do as many as you want. >> That's epic. >> You can do as many as you want and level up infinitely. So, you could have a million health in the game. >> It's possible. It is theoretically possible. >> Wow. That's awesome, man. >> Yeah. Pretty awesome, huh? >> Yeah. Blast these guys. >> That's only day 30 and Justin's already so strong. >> We're doing really good, but I'm going to get even stronger. I haven't even reached my final form. >> That guy just jumped off the base. Okay, >> your power level is going to be super high. >> It's going to be insane, guys. It's time to go. Lanky box, go. Got him. Lanky box go. Yeah, guys. That's what we say. We literally scream that around the house is awesome. >> You know why I like Lanky Box Go so much? >> Cuz it's time to go. >> Well, it's always time to go. But it's because Boxy and Boxy just like helping people in Lanky Box Go, >> guys. So, Lanky Box Go is basically when you're not around the plushies, if you have the plushies, it's what they're up to. So, like they go to this place called Plushy Land and they basically like go on adventures and they help people out. It's amazing. >> Yeah, they're really nice to everyone there. >> Foxy says, \"Of course, cuz we always want to help everyone out.\" Yeah, the plushies are friends with everyone, guys. They're awesome. They're super awesome. Okay. Um, I'm going to go drop all these off. I should Please, if I get more gems, that'd be massive. That would be epic. >> That would actually be insane. Come on. Please. More gems. More gems. More gems. I just dropped a gem in there. I'm trolling. It's okay. Maybe we'll get more here. Come on. No. Oh, that's not bad. Infernal sword. Wait, can I pick that up? >> No. If you do that, you're going to >> Wait, do you take damage if we go in there? >> I'm almost sure. Yeah, you die. Guys, I literally threw a gem in there. L cuz if I get dropped in there, like I get burned up. >> Do you actually take damage? >> Definitely. >> Oh man. >> Yeah, I would not go in there, >> guys. I literally just dropped a gem in there. That's a huge L. >> That's all right. It happens >> cuz we need gems to fight the cultist king, which we're going to have to do later. >> It happens. No problem. >> Hell. Okay, guys. I'm going to look for mammoths >> in the fire area. >> Yeah, there should be some mammoths here. >> Fire mammoths. You can try slicing the fire mammoths with your new infernal sword. >> Infernal sword is so cool, guys. Anything you oo for this turns into cooked food. >> Yeah, it's really nice. >> So, you'll never get hungry. See, it's cooked food immediately. >> Awesome. >> Okay. >> And it's strong. >> I got to look for mammoths because I need to get I'm going to do the mammoth quest, but night is approaching. Uh-oh. >> I would probably come back. >> Guys, this quest is not easy, bro. >> Not easy. I have medkit. >> Smart. >> Okay, let's look for a mammoth, guys. Let me know if you guys see one. I don't see anything. >> Oh, mammoth. I guess I'll just take out these guys and throw them in the volcano and then go home for more gems. >> I'll call it a day. Yeah, >> it's t-posing ram. You guys see how it just spawns on us like that? Bro, I got to go home. They're telling us to go home. Basically, >> it's flexing on you. It's trying to teose. Ah, >> don't ever let the ram tpose on you guys. Ah, >> ever. Oh, and I'm hungry. I got to go home. >> There's a bunch of stew for you. >> Nice. I got to go home. Time to go home. The ram just teleported. Oh, and wait, my flashlight's out of battery. Okay, I just took a bunch of damage. Uh-oh. >> Uh, is Justin cooked? >> No. Never give up. Oh, no. >> Uh-oh. It's It's charging at me, too. >> Oh, it's faster than you now. >> I can hear it, but I can't see it cuz my flashlight's oofed. >> Oh, boy. >> I'm going home. >> He's almost back, guys. He's almost back. >> I'm going home. Going home. I'm going home. >> Okay. Nice. Here's the gems. Wait, do we need them? >> Yeah. Let's build the ammo thing. >> Nice. There's just one. Okay. Oh, I'm taking damage. Yum. Okay. All right. Time to build, guys. >> Oh, we have so much stuff. Perfect. Okay. Build that right here. Boom. Time to make some ammo. >> Yo. Wow. I can't wait to share this with you. >> No, you don't need ammo. >> What? >> What? Wait. Why do you need ammo? >> Oh, I have a blaster. >> All right. You can have a little bit. Take Take this one. Take this one. Take this one. >> Yeah. Yeah. The smaller one. >> Yeah. >> Yeah. I'll take a little bit of that. >> Nice. >> Awesome. I'm good. >> Nice. Very good. Okay. Wow. >> Now I can take on bears. So guys, that's why we did all that is to get bears. >> Let's go, man. >> Okay, now I'm going to go fight a bunch of bears. Oh, we got 150 wood. That's crazy. >> I've been chopping. >> Good job, Adam. >> Thanks, man. >> Good job, Adam. >> I'm always chopping. >> Did what he is best at. >> There's really nothing else to build. >> Clicking on trees. I'm going to go fight some bears. >> Let's do it. I'm fighting on trees. >> I was best at. >> Yeah, I have a lot of practice of being the lumberjack. Yep. Okay, guys. Now I have a ton of blasters, a ton of ammo. I should be able to do this. >> No one stands a chance anymore. >> I wouldn't say that. >> 83 ammo. >> I wouldn't say that. Okay, there's a barrier in here, but I'm not going to find them. Well, there's bad guys, too. I guess I need those. Get them, >> right? To get more gems. >> Yeah, >> that's helpful. Although, we don't really need any of the gems anymore. >> Yeah, I do. To fight the coldest king. Oh, right. I forgot. >> Guys, Adam is not locked in. >> I forgot about the cultist king. >> That's how you know he's not locked in. >> Cuz we need the antlers, guys. We need the antlers that he drops. >> Yep. That's the final thing I'm going to need probably. Got it. Okay, there's a bear in here. I'm sorry, buddy. I'm going to have to do this. I wonder if I can just get him like this. >> Can he do damage to me through that? I have to use this. Get him. Oh, see, he took poison damage. >> Awesome. Almost. Nice. >> He didn't drop a pal. Lane. It's all good. I'm going to open these treasure chests, though. There might be something good. >> Maybe you'll get super lucky and get the tactical blaster. >> That would be insane. I don't think it drops in this though. >> In a normal chest. >> What? >> That would be gamebreaking. >> I don't think it does. That That would actually be insane. Come on. >> Come on. >> No. >> Oh, man. >> Well, I still got ammo. It's not bad. >> We'll take it. >> I got to find some bears, guys. I got to find bears and fight them >> cuz we need their pelts. >> Yeah, we have to. I'm sorry to the bears, but we need their pelts. Do you want me to go out and help you look for bears? >> No. Okay, got it. I'm trying to switch between my blasters to do more damage. Nice. I got one. I got one. I got one. Nice. Yeah, that's kind of the hack, guys. If you guys can switch really quick between your blasters, it doesn't uh count for reload time. Why can't I consume this one? Oh, there. Nice. Boom. Okay, two out of five. Awesome. Okay, we need three more bear pelts. I can do it. I can do it. Like Kenny always says, >> we all believe in you. That's what Kenny says in Lanky Box Go. He always says, \"We can do it cuz we can. We can do it as long as we stick together.\" >> Guys, it is awesome. There's like a cany truck in Lanky Box Go and a sticky ladder. It is amazing. Okay, >> that's why I like the sapling so much in this game cuz it kind of looks like sticky. >> Yep. And look, the strong axe looks like candy. >> Yeah, it's like sticky and cany. >> It's super awesome, guys. Okay, I got to find more bears. Ouch. Oh, there's a bear. Got him. Let's go, Lanky Box. Go. >> Come on. Give us the pelt. I oop to lightning, bro. >> Yeah, the lightning's pretty bad. I'm going to build a lightning rod. Oh, we're going to be attacked. That's another gem. That's another gem. That's good. That's actually good news. >> Huge. >> That's actually good news. We want that to happen, >> man. I didn't get the bear puff for this guy. I should have brought that to that guy. It's okay. It's okay. >> No problem, man. >> There's too much stuff to do, guys. There's too many quests to do with this class. >> Yeah, the game's getting kind of intense right now, guys. This class is no joke. Wait, where you going? Adam's running towards my loot. >> Huh? Oh, I was going to grab some scrap here. >> It's my loot. Hold on, Adam. You got to go back to camp. Oh, the Oh, it's a hungry deer. Uh-oh. >> I'm going back. >> Uh-oh. Uh-oh. Uh-oh. Oh no, it's super hungry. >> I don't think I'm going to get my stuff back. Oh no, it vanished. >> Nice. Lucky. >> All right, let me see if I can protect the camp without oofing. Guys, >> you can do it, Adam. >> I always oof. >> You can do it, guys. As if we see it say at the top of the screen, Adam moved till we know he was giant baby. >> Yep. >> Come on. >> And I'm working on not being a baby anymore. >> You got a long way to go, buddy. >> That's one of the classes I'm taking in school. >> How to not be a baby. >> Yeah, basically. >> Is it working? >> I mean, you tell me. >> No. You got a long way to go, man. You do. >> Okay. There's a bear, guys. I can't even see this bear. >> I see. See? See? Come on. >> Oh. Oh. Uh-oh. Oh. Ah. Oh no. Justin, too. >> Guys, I literally used a med kit. How did I Oof. There. >> Oh, man. >> Adam again. >> My mouse got stuck. Oh, come on. >> You're just making stuff up. >> Now I can't revive. >> Now you're just making stuff up now. >> What? >> Is that what you're doing? >> Hey, bro. You're going to have to revive me. >> I can revive everyone. >> Okay. Roblox. >> This class is no joke. Come on. All right, we're back. back. >> Take that. Take that. Take that. >> You didn't do anything. I ooped everyone. >> Nice. >> What were you doing here? Nice. Okay. Oh, we got a gem. Okay. And we got a bunch of bad guys which I can sacrifice for. No. Drop the guys. What are you doing? >> There they are. I made them in a pile. >> Fine. No, you didn't. >> All you. >> You're going to steal everything. >> I'm out of here. >> I'll go get some scrap. >> Okay. I And I dropped all that stuff over there, guys. I got to go get it. And then I'm going to sacrifice all the people. Guys, there's too many quests to do this. This class is actually kind of There's a lot of to It's like chores. >> Yeah, but we like chores. >> Yeah, true, true. >> Our mom taught us to like them. >> Yeah, >> because after we do our chores, that's normally when she takes us in her Boxy Cyber Truck. >> No, that's when we get to watch Lanky Box Go, >> right? And Lanky Box Go. >> Yeah. I Well, she takes us in the Cyber Truck. I watch it on the iPad in the back seat. >> Dude, that's the best feeling in the world. >> Yeah. On the way to Walmart. >> There is nothing better than that. >> Pretty much. And when she sometimes gives us happy meals too. >> Uh pretty much. >> What a combo. >> That's like we did it. >> That's really like we did it. >> Yeah. That doesn't happen very often though, guys. >> Yeah. What What more could we ask for at that point, >> right? Life could not get better. >> There is so many enemies now in the game. It's actually insane. >> They definitely made the game harder, guys. We said that before, but it's definitely true. >> It's like way harder. >> Yep. Okay, I got to get away from all these things. Nice. Okay, >> even getting to day 99 is not easy anymore. >> Yeah, it used to be a lot easier, guys. >> Way easier. >> I got to get out of here. >> Maybe it's also because people just got better at the game and so then the game developers wanted to try. >> It's cuz the classes are so good right now, >> right? They added in the classes, then everyone got better, and then they had to make the game harder. >> Yeah, >> that has to be it. >> It couldn't be that Adam's just a giant baby. Okay, nice. I got another bear pelt. Consume that. Consume that. >> Cool. >> Nice. Nice. Okay, two more bear pelts, then I finish this quest. >> No problem. >> Come on. I know we can do it. I see another bear. >> There's a bunch of bears on the top right corner. >> All right. Well, how would you know that? >> Cuz I'm there right now. Getting >> one with that. >> Okay. >> If you find a bear pel, it's mine. >> I'll try oofing it with the worst blaster. >> Okay, guys. See, I'm I'm smart. I'm just standing over here and like kind of the bears are just kind of spawning around me, so I should be able to get one here. Oh no. >> That's genius, man. I need to take a medkit. Uh-oh. Adam's going to oof. >> I'm not going to oof. I I I will show everyone I've been going to no baby class. >> No, you're going to oof. I can already tell. >> I'm out of ammo. >> I can tell by the way Adam's clicking on his mouse furiously. He's going to >> I'm out of here. >> So, he's just running. >> Yeah, I give up. Okay. Ah, I quit, guys. >> Guys, I used like 10 bears. I didn't get a single bear pelt. >> That's unlucky right there. >> Man, that's actually unlucky. It's okay. Okay, come on. >> We're back to camp. >> Oh, nice. Another med kit. Okay, >> we're back, guys. >> Where was all the stuff that I dropped earlier? I thought it was over here. Oh, it was over here. Yep. Wait, guys, the medkit's like not even healing me. Okay, there we go. There it is, guys. I'm trying to just oop as many bears as I can as fast as I can. Oh, come on. They're not dropping it, bro. >> Well, at least you still have tons of ammo. >> Where did I drop all that stuff earlier, by the way? I dropped like a gem and a bunch of other good stuff. Uh-oh. >> Oh, we need that so badly. >> Find it. Yeah. Okay, the deer's here. Where did I drop all that stuff? >> Uh-oh. >> And there's a bear here. >> Can you make it back alive? >> Where did I drop all that stuff, guys? I literally dropped a gem and a bunch of other stuff. Lame. Lame. No problem, man. It's all good. >> There's a bear. A bear, a deer, and a giant wolf chasing me. >> And the flashlight's going out. >> I'm fine, man. I Guys, I don't know where I dropped everything, but I'll go back and get it later. >> In the daytime. >> Yeah, >> that's smart. >> Guys, this class is no joke. There's too many quests to do. If you guys play as this class, try it out and let us know in the comments how long it takes you guys to get all of the achievements unlocked. >> Okay. Well, Adam, what are you up to right now? >> I was planting some carrot plots and more wood. >> Okay, I'm going back. Okay. >> I'm also going to try to get more scraps so I can make more ammo for you. >> I'm going to go uh drop off all these bad guys and then hopefully I'll get some more gems. >> More gems. More gems. >> We basically need to do that now. Yeah, cuz we really need to face off against that boss guy. >> Yeah, >> the volcano boss with the >> I don't even care if there's a deer chasing me. I really don't care. And I got to find more bears, guys. Oh, there's so much to do. And I got to find mammoths. >> There is a lot to do. >> I don't want to drop another gem in here. That'd be really embarrassing. Okay, let's go slow. How did that just spawn? Wait, what? I got I got another badge. What is this? >> He got the volcanology badge. >> It's daytime. How is there stuff attacking? How is there the ram? Volcanoy. That's like if you studied volcanoes in school. >> Rocky's doing that cuz his dad or his mom's a volcano. His dad's a meteor. >> Yeah, Rocky teaches us about volcanoes and stuff. >> Please, gems. No, >> that's not what we needed, bro. >> We got gem of the forest fragment. >> Guys, the gem of the forest fragment does not help us. It's not even like that useful. I I like we we've like never used them. >> Yeah, it's really only to make >> to build like the revive machine and the weather machine. We got Robux for that. >> Yeah, we got >> Oh, mammoth. Mammoth. Mammoth. Mammoth. Mammoth. >> Huge. >> Okay, I'm going to bring this mammoth over here. Wait, it's not even chasing me. I just oop it from here, guys. I'm just going to oop it from here. It's not even moving. >> Smart. Sometimes they just get like caught on the ground. I'm just going to keep Guys, I'm going to oop the M from here. Got the hacks. You poison it, too. I'm try. Oh, nice. I took it out. Okay. Wait, did it drop a tusk? If we did, we can consume it. It did not drop a tusk. Oh my goodness. >> Oh, we got some ribs. Hell, >> how is it going to not drop a tusk, bro? >> At least you won't be hungry, >> bro. It didn't drop a tusk. It just dropped ribs. Maybe there's other mammoths nearby from its family. >> There should be. There's usually like a couple here. >> Hopefully, man, all we got was ribs. I mean, that's still pretty good. Tasty. The ribs are nice. They They restore a lot of hunger, guys. Okay. Okay. I thought it was going to drop a tusk, but it didn't. Bro, I'm going have to find more of them now. Oh my goodness. Okay, I got a bunch of bad guys, though. That's good. >> Let's go. Man, this game is not easy anymore, >> guys. This game is really tricky. But we're trying to like go max level and upgrade this character. It makes it even harder. >> But once you are fully upgraded, then the game should go back to being easy. Then you'll never oof again, basically. >> I shouldn't. I mean, especially with the bears, if I have 25 more HP, that's a lot. >> Yeah, you'd have to be a total noob to oop again. >> I'm not. >> That's not what Justin is. >> I'm not like Adam. >> What? >> I'm not like at him. Total noob. >> Okay. I'm just trying to get as many bad guys as I can because I need to keep dropping them in the volcano. I wonder if it's like every other like you get the forest fragment, then you get the red gems, then you get the forest fragment, then you get the red gems. >> Yeah, something like that. >> Could be that guys. This guy literally just like jumped down from somewhere on me. Go away. >> Oh, he's got the morning star. >> Yeah, guys. So, the bad guys in this area are very, very, very strong. They have really good weapons. >> True, guys. Why is the med kit like not working? Watch. It just doesn't work and it just goes back in my inventory. What is this glitch? A little bit glitchy, dude. I think when we did the revive glitch, when I couldn't revive either, the game glitched a little bit. >> So, basically, it's your fault what you're telling me. No, I don't think it's my fault. >> What you just said? >> I'm just saying I think the game might have glitched when that happened. >> Okay. >> Yeah, >> guys, we we got to do this, man. Come on. Open this up. What do I got in here? Something good. >> Oh, the infernal bag. That's actually not bad, but the giant one is better technically, >> right? It cooks the food when you put it in there. >> The ram just spawned on the ceiling of this place. How? What is that? What is that? It's going to charge. It just jumped off the roof. just jumped off the roof. >> It just spawned teosing on Justin. >> Go away. Go away. I got to drop off all these bad guys in the volcano. >> Get out of here, >> guys. This is getting actually crazy. Come on. >> Come on. Please. Please, gems. Please. Please. Please. Please. Please. Here we go, guys. Leave a like on this video. Please, gems. Please. We need good luck so badly. Please. Red gems. Red gems. Yes. All right. And a wolf just spawned in here. It's going to oof me. Not if I can do anything about it. Not if we're going to cook it first. Nice. Okay. Wait, that's actually huge. Wait, I can summon the king right now. >> Let's go fight him. >> No, but I got to do the bear first and the mammoths, bro. >> You want to? >> Should I go fight him right now? >> I think you should fight the king. >> Just fight him right now. >> Yeah, >> I don't even care. I I don't even know where his base is right now. I haven't even seen it. This guy's still following me. Go away, guys. This quest is very, very, very tricky. I'm not going to lie. >> The ram is getting aggressive. >> I'm not going to lie. This is very tricky. I'm just wandering out here looking for the evil cultist king's base. >> And it's just spawning on top of the roof and stuff. >> The ram almost got me >> again. >> This is so bad. And my flashlight's running low. This is so bad, dude. >> 7 seconds until you're free. >> This is so bad. >> Until it's daytime. I mean, >> this is so bad. >> And we're good. Okay. I don't know where the cultist stronghold is. I don't understand. I haven't seen it. I'm just going to run around the edge of the map. >> Got to be in the volcano area, guys. >> Duh. >> So, we'll find it. >> Has to be over here. There it is. I see it. I see it. >> Justin found it. Time to face off against the boss. >> I'm going to do this alone. I'm going to go solo. >> Do you want any backup? I can help you. >> I'm going to block in solo. >> Oh, okay. Okay. Go. There's already bad guys inside. I'm going to take him out from long range. I'm not going to waste any time here. Uh, go away. Got him. Okay, guys. And there's like already a bunch of people inside. I got to get these guys, too. I'm just going to get them from long range. A >> lot of people to >> I'm not going to risk oofing and having to restart this. Get these guys out of here. Boom. Boom. Okay, we got them. >> Awesome. >> We drop We drop in all the gems. Here we go. 1 2 3 4 And now he's spawning. No way. It's the boss. The cultist king has been summoned. Wow. Okay, we're going to Oof him. >> No, I'm going to Oof him. Adam's just going to stay in base and do whatever he's doing. >> Yeah, we're going to get his antlers, guys. We need those. >> We have to. I wonder if I could fight him with my sword. Probably not. Probably not. It's probably a very bad idea. I would not do that. You try. All the scorpions attacking me, too. Oh, nice. I did poison damage to the king. >> Huge. It's pretty cool. Come on. I don't know what happens. He's mashing his keyboard furiously. I'm going to >> I got stuck in a trap. I'm so bad. Come here, noob. Stop yelling. I'm trying to focus here. Okay. Don't Don't talk to me. All right. Here we go. Hya. Yes. Wow. There's the antlers. Nice. Okay, so guys, I'm going to consume this. Okay. Nice. Okay, so that task is already done. 10% damage. That's actually huge. >> 10% more damage every single time. >> That's actually huge. >> That's awesome, man. >> Oh, and he dropped the Infernal Sword. >> Cool. Adam could have that, but >> I would love that. >> I don't need it cuz I already have one. Well, if you want it, you can see where I am on the map. You can pick it up. I'm not bringing it to you. >> Okay, sounds good. >> So, guys, that's actually huge. I do 10% more damage. Oh, and there's a mammoth, too. Let's go fight him. Can we complete every task right here? >> I really Well, no, cuz I still have to get the bears. >> Oh, right. But we're close. We're very close. >> Lightning bandage. Nice. We have so many checks done now. >> There's a mammoth here. I got to take this one out. Please drop a tusk. Please. >> We need it. >> Please. Please. I see. Yes. It dropped one. It dropped one. >> That's what we needed, guys. That's what we needed. >> It fell in the lava. It fell in lava. >> Can you get it? >> Yes. >> Nice. >> Wait. There it is. There it is. There's the tusk. >> There's the mammoth. I'm going to eat this. >> Awesome. >> How would you even eat that? Here we go. Consume. Wait. Why won't it let me to consume? Yes. So, now what? We have more health. >> So guys, there's a green check mark over that, too. So, we actually did that. That's actually crazy. So, the last one, last quest is now just bear pelts. >> Just bear pelts. Easy. >> And I got some ribs, guys. This class is awesome. The the quests are so much fun. >> Yeah, there's a bunch of bears where I am on the far left corner. >> Okay. >> Like a ton. >> Okay. Well, they spawn randomly. Like, they respawn all the time. >> I got trapped again. I was looking for my scrap. All right. No problem. I'm on my way there. My flashlight's out and the hungry deer's chasing me, but I have a speed boost from being the big game hunter. >> Speed boost. >> Yeah, guys, this class combined with the tactical blaster would be unstoppable. >> Yeah, with the tactical blaster, you can't guarantee that you get it. >> Yeah, you can't guarantee you get the tactical advantage, >> right? But if you do, it's pretty nuts. >> I'm going back to base. >> Same. Oh, there's much bad guys here. >> I'll leave Adam to deal with these. >> I I can handle them. >> I'll leave you to deal with these. >> Don't worry. I I can handle them. Probably not. Charging the boost pad. I might oof charging the boost pad. I'm going to oof charging the boost pad. >> Oh, they're strong. >> I'm out of here. I'm leaving. >> Bye-bye. >> Later. >> He's got plenty of health. See you, man. >> See you. Okay, I'm going to go fight some bears. >> And then that's it. And we basically just beat the game, >> guys. I don't know why this med kit just doesn't work. It's glitched. Maybe if I drop it and pick it up again. Oh yeah. So guys, it was just glitched. You have to drop it and pick it up again. That's That's cool. >> That's all we had to do. >> Nice little hack, guys. In case your items don't work, try that. Okay, guys. Two more bear pelts and we're done. >> And then we actually upgraded the big game hunter to max level class. >> Two more bear pelts. We're done. Guys, I say if we do this, we get to see that secret ending. We should reward ourselves and watch Lanky Box go for a few hours. >> Let's do it, man. >> Got to move. >> That would be the best day ever. >> Here's some bears. I see them. Yo, this alpha wolf fell over. What is it doing? >> What is it doing? Okay, here's some more bears. Let's go. Okay, there's still some bad guys. Adam, that's your job. >> Yep, I'm on it. >> Do it. Yo, I do way more damage now. I do 10% more damage. That's actually a lot. >> Wow. >> Okay, you don't got it, buddy. What are you doing? >> Um, I'm trying my best is what I'm doing. >> Try harder. >> Come on, Barel. >> Come on. Are you serious? >> We'll get it, man. >> And I used all my ammo, guys. Adam's stilling, guys. I literally used all my ammo. And you guys saw how much ammo we made. >> I know. We made so much. >> Make some more ammo. Do it now. >> Oh my god. I got one more. One more. One more and then we're done with this quest. >> Awesome. >> One more. And guys, one more and that'll be the last thing we need to do. And if we do this, we're going to get that secret cut scene, guys. It should unlock right when we get it. >> This is going to be crazy. It's going to be crazy. I'm going to show the inventory. I'm going to show the checklist after we get it. It's going to be so satisfying. >> Huge. Two bears over here. Please, one of you guys drop a pelt. Please. Please. Come on. >> I'm running out of blast, too. >> Pelt, pelt, pelt, >> man. One right there. Come on. >> Give us the pelt, >> guys. 10% more damage is actually a lot. I'm doing a lot of damage right now. There it is. We got it. So, guys, this will finish the quest. Let's go. Let's go. Consume that. Oh, what? Wait, what? It's like glitching. It doesn't want us to do it. Nice. And let's see the the task list. We actually finished all the quests. Wa! Wait, it says you completed all the big game hunter tasks and kept the forest safe from the evil animals. The ram and deer saw how powerful you became and agreed to stop attacking the missing people. The missing people were safe to explore the forest and were no longer afraid of the deer and the ram. You have unlocked the big game hunter ending. Yo, we actually did it. And that means we get to watch Lanky Box go on the iPad. Guys, look at the characters, guys. Look at the plushy. There's Boxy. There's Big Shark. There was Ghosty. Let's see Foxy. Look, they're looking for buried treasure, guys. They're actually all going as a squad on an epic adventure. Look, Foxyy's digging for buried treasure, guys. Look at how awesome Foxy is, guys. So, this is the plushies. They're in plushy land. This is where they go when you guys are not around them. They're having adventures. This is crazy. Let's go.",
    "start_time": 0.16,
    "end_time": 4167.96
}