{
    "video_id": "Yu2unRy9gJk",
    "channel_url": "@zachking",
    "transcript": "What is that? Where did I put the popsicles? Thought they're right down here. Huh? There they are. Here we go. There's one popsicle. What? Broken. Come on. Hey, got milk. Yep. Coming up. Thanks. I need some ice. Oh, coming up. Oh, no. >> I can't see. Oh, gross. Okay, >> we got to kill Barbies. Move. Move. Move. >> Oh, no. Barbies, bring in the tank. Go, go, go. Take that, Barbies. Oh my gosh. What is that? >> Get down. >> Here. Play nice. Okay, guys. >> Okay. La. >> Ready. >> Need to stop right now. This music is clear copyright infringement. And we're going to take this video down. So you guys have to stop. Ready? Stop playing, guys. [Music] >> Clone troopers are way better aiming. What's going on? >> Really, right? Wait, what's up with your wife? >> Try. I'll fix it. >> See, take them off now. >> What are we going to do? Get him. >> Let's go. The guns are over here. [Music] >> That was awesome. >> That was wizard. >> I got this. You didn't see anything. >> Did this guy. >> That's him. >> Don't worry, we got him. So, we're here. [Music] >> All right, everybody. We got him finally. I don't know if you guys know this hack where Oh, shoot. Let me get the remote really quick. Huh? Oh, the keys. Oh, there's got it. Go, go, go. >> Can you call a mechanic? >> Yeah, I can call one. Hey, King's Mechanic. How can I help you? >> Hey, man. We're missing a tire. >> Oh, that's a bummer. You guys stay right there. Let's see if I can >> Oh, this guy. That's not too bad. Let's see if we can spank this baby right on it. >> All right. >> Like new. >> Hey, thanks so much. >> All right, buddy. >> All right, see you. [ __ ] the >> Oh, man. >> Which wire do I cut? >> Cut the red and white wire, not the white and red wire. That's the wrong wire. [Music] >> Tickets, please. >> Ticket, please. Okay. >> Tickets, please. >> Oh. Perfect. >> Can I check your ticket? >> Can I see your tickets? >> Sorry, spicy. Sorry. You got these Hey, I'm coal punching [Applause] in the street. So clean. Got heads to concur. Life in the face. No time to [Applause] >> the royal burger. >> The tower of onion rings. >> Cruising in the Lambo. Streets are to a blur. [Music] [Music] [Music] So, the quiz is going to be on the periodic table. You need to memorize all of these. Stop it. [Music] Of course, [Music] >> buddy. If you're going to come to school, you got to behave. Okay. A bunch of you nominated me for the ice bucket challenge. Now, last time we did this, it was to raise awareness for ALS. This time it's for mental health. And that's why I nominate Zachary Levi. And I figure we might as well just do this in person together here. >> So, I was telling the guy, I was like, \"Hey, listen guy. We're doing this. >> Zack, what are we doing? What are we doing? The ice bucket challenge. >> Oh, for mental health. >> Yep. Yes. Okay. >> All right. Here we go. 3 2 1. Oh. Oh, that's refreshing. Zach's left me yet again. Hey, listen. I challenged Chris Pratt, Terry Cruz, and Michelle Car. Now it's your turn. Take the challenge. Let's save the world. All for mental health. I got to go warm up. [Music] [Applause] You can't touch that. We need security. [Applause] Midday is for me. >> I was craving a midday snack, so I decided to make some PB&J. Luckily, I had a George Henry Hall painting nearby, so I decided to make some jelly from scratch. Then, I make my homemade peanut butter. I'm also a secondderee black belt, so I'm able to punch really hard. Clean that up later. Lastly, I didn't have time to bake a fresh sourdough roll, so with a flick of the wrist, I turned my acacia wood cutting board into a tasty ficasha bread. Yum. Hey, come back helicopter. That was expensive. Okay, that was really close. That was too close. [Music] I forgot you're doing that. >> Which toys you get? >> I got the little green guy. >> Oh, nice. >> Isn't he adorable? Here. Look. >> Yeah, dude. What? Oh, >> buddy. >> What? Isn't he awesome? Is he supposed to make that noise? Uh, >> I don't think so. Run. >> So, I'm taking my friends and family to a pre-screening of King of Kings. Little do they know, I'm going to pull off a little trick in the beginning of this screening. Uh, ladies and gentlemen, I'm so sorry. We seem to be having some technical difficulties. Sir, you can't go back there. >> Sir, what are you doing? >> There we go. Excuse me. >> Uh, the door. >> There we go. >> While I'm up here, does anyone want some snacks? Yeah. [Music] >> Wow. >> Thank you. >> Back to the movie. [Music] [Applause] >> What is that? >> Hello mother. Hello father at Kemp Timber. Got in hot water. I thought the kids would like my magic, but this trip has turned out to be really tragic. Kids these days flew to their screens. I turned their tablets into cantens, took them hiking, they were scared. Little Jenny swears that she just saw a bear made in a campsite. Pitched a tent. By the way, have you seen Trent? Haven't seen him. It's been a while. Wait a minute. Wasn't he swimming with Kyle? Awesome campers, but no big deal. I swear they'll turn up after a meal. The kids were happy as can be. Until Timmy asked me, \"Are these hot dogs gluten-free?\" Tried to distract them with a show. Kids were laughing all a glow. Made puppet shadows with a lamp. But then Bigfoot came alive and crashed the cam. was a blessing in disguise. In the chaos, we found the guys doesn't change our stay in jail. Mom and dad, will you please send us both our bail? You won't believe this. Check this out. I got a billboard in downtown LA. How sick is that? Oh, he's coming to life. What's he doing? Ah, he's stealing stuff from other billboards. I was up to no good. Oh, he's grabbing the espresso concentrate. Looks like he's making a nice coffee. Looks pretty good. I want some of that. No way. Oh, watch out. Traffic hazard. And with that, the tick tock era comes to an end. Good night. Oh, cool. That's so cool. How are you doing that? >> It's a miniature fight. >> I'll never trust you again. >> Only 1% of people actually get this drink. >> Hey, Mo, what are you doing? >> Like my costume? >> Oh, no. >> Oh, hey. Oh my god. >> You're Marty McFly. Yeah, right. [Music] >> Got to do a take down. >> I knew you were a bot. >> Next. >> This is a mistake. I'm a human. I'm not a bot. >> Prove it. Finish the capture. >> I I do puzzles all the time. >> Oh, good. It's an easy one. It's just >> You left a sliver of the puzzle on the screen. >> What are you trying to do? You see that? >> It's like 1%. >> Listen, I'm going to give you another one. You get your head in the game. >> Get your head in the game. Get your Get your Get your head in the game. Come on. Get your head in the game. Get your head in the We got him. Get your head in the game. [Music] I got I'm not a robot. >> I see nothing to sweat over. >> I wasn't sweating. >> Okay, let me take my phone. Okay, got it. Okay, it does look good. Thank you. >> Sick. I say he must [Music] 100. Thank you. 1,000. H. [Music] >> Hello. Let me finish my die. Thank you. [Music] >> Thank you. I also started with zero followers. If you go through my training course, >> thank you. [Music] sending dreams to [Music] >> Excuse me. Would you like to be in a video? >> Uh, sure. >> Cool. So, today I'm going to do a pillow fight challenge with a stranger, and whoever taps out first loses. So, I'll go first. >> Okay. just to hit you. Mhm. >> Ooh, nice. Oh, cool. Ooh. Wow. Oh, what's he doing here? There. Looks lame. >> Okay, let's try to redo this. Frame it up. >> Yeah, better. >> Yo, guys. Guys, >> Emil, this video is so funny. I got to send this to you, >> Zack. That is pretty good. >> Go in. >> Hello monstr. [Music] Help me spread the love by liking this video in 3 2 1. [Music] >> No. [Music] >> Oh. >> Done. >> How did you do that? 6.58. >> There's no way. >> My fastest time.",
    "start_time": 0.64,
    "end_time": 1061.679
}