{
    "video_id": "szcNiNl8dsw",
    "channel_url": "@pinkfong",
    "transcript": "Ping pong [Music] la. [Music] >> Johnny Johnny Yes, papa. Play Minnie Mouse. Minnie Mouse. A friends. Have you seen Minnie Mo? Huh? Men, what are you eating? Meen mo eating treats me. Telling lies. Open your mouth. Gotcha. Nemo, don't tell lies. Huh? Wait. Stop right there. Minnie Mall. This is the witch's candy house. Friends, let's hurry and save Nimo together. [Music] Minnie Mo, stop. Oh no. If you don't stop, the witch might wake up. >> I thought I heard something. I guess not. That was really close. Mo, stop it right now. [Music] Why do I keep waking up? I'm too tired. >> Mimo, seriously, Mimo. Nimo, you're going to get caught this time. Who's this? It's Nene Mo. Ey moinny mo eating candy telling lies. Open your mouth. [Music] Don't tell lies. How dare you eat my candy? I'm locking you up. Minnie Mo, are you okay? Minnie. Friends, the witch took Minnie Mo to her prison. We need to open the lock. Which key should we use? Okay, let's try the green key. Huh? Why isn't it working? Aha. In order to unlock the blue lock, we need the blue key. Yeah, that's right. Minnie Mo is now free. >> You're okay now, Minnie Mo. Let's go back home. Wait, Minnie Mo. >> Nimo. Nimo, where are you? Minnie Mo, hide. >> Can't you see that the witch is looking for you? >> That's strange. I'm sure I heard Nene Mo just now. Mo, [Music] my heart is racing. >> Nimmo, stop eating. The witch is coming for you. Linny Mo, watch out for your tail. >> Mo, mo eating ice cream. Telling lies. Open your mouth. [Music] Don't tell lies. trying to escape my prison. I'll have to keep a closer eye on you now. >> Oh no, the witch is guarding the prison. How can we rescue Nin Mo? That's it. Let's use these items to sneak the key away from the witch. >> Huh? What's this? Hey, it's a snake. >> What? Who's there? We almost got caught. How about this fishing rod? Yep. Almost there. Just a little more. Got it. Give it a little pull. >> We did it. >> Minnie Mo, you're free. Minnie Mo, this way here. Where are you going now? N Mo, running off again. Bug, I'm starving. Let me eat first. >> Minnie Mo, don't >> do you really want to go back to the prison? >> Now, where did I put that? [Applause] >> Huh? Needy Mo. Oh, no. No, no, not this time. >> Need mo, that was super close. [Music] Oh no. Oh no. What do we do? >> Aha. Nene mo must be here. Ouch. Owie. Minnie. Oh yikes. Do not get any closer. Oh, I found you. There you were, Ninnie Mo. Moen mo run away [Music] moen mo eating cookies telling lies open your mouth. [Music] I'll make sure you starve. [Music] You wrecked my candy house. I'll lock you up with the strongest log in the world. No. >> I guess we did ruin the witch's candy house. Po pink. Friends, let's use these cookies to patch up the holes we made. Then the lock might open. [Music] Which cookie has four equal sides? Hey, this one's easy. A square shaped cookie. [Music] Oh, there's another hole here. H. Is it this one? Oops, not that one. All right, the hole is round. So, let's try a circle cookie. [Music] This hole is really pointy. Then how about a star-shaped cookie? Friends, the witch's candy house is as good as new. Minno, >> you're free now. Minimal, you must have been scared. Don't worry. I've got you now. Phew. We did it, friends. We rescued Minnie Mo from the prison. Pink Pink. Hooray. Mission accomplished. Minnie Mo, no more sneaking treats. What do you think you're doing, you little rascals? Stop right there. >> Friends, see you again next time. Bye. >> Hey guys, did you like our video? Don't forget to click subscribe. Subscribe. >> Search for Pingpong on YouTube.",
    "start_time": 0.719,
    "end_time": 589.1999999999999
}