{
    "video_id": "vMY_iLc9iuU",
    "channel_url": "@pinkfong",
    "transcript": "Ping pong [Music] la. [Music] >> Baby shark. Doo doo doo doo doo. Baby shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Baby shark. >> Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Halloween. Doo doo doo doo doo. Grandma. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks, zombie sharks, creepy, creepy zombie sharks are dancing in the sea. Creepy, creepy, zombie sharks, zombie sharks, zombie sharks, creepy, creepy zombie sharks are dancing in the sea. [Music] Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo doo. Mommy Shark doo doo doo doo doo doo. Mommy shark, doo doo doo doo doo doo. Mommy shark, woo! >> Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, boo. >> Grandma shark, do the grandma shark. Do the grandma shark. Do the Grandma Shark. Oh, >> Grandpa Shark. Doo doo doo doo doo. The Grandpa Shark. Doo doo doo doo doo doo. Grandpa Shark. Doo doo doo doo doo doo. Grandpa Shark. Woo! Hall. Doo doo doo doo shark. Doo doo. Doo doo doo shark. to hall. Doo doo doo all [Music] shark doo doo doo doo doo doo. Baby shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark Boo. Mommy shark doo doo doo doo doo doo. Mommy shark doo doo doo doo doo doo. Mommy shark doo doo doo doo doo doo. Mommy shark. >> Daddy shark doo doo doo doo doo doo. Daddy shark doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, boo. >> Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. The grandpa shark. Doo doo doo doo doo doo. Grand shark. [Music] [Music] >> Baby shark, doo doo doo doo doo doo. >> Mommy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. >> Grandma, >> yes. >> Grandma shark, doo doo doo doo doo doo. >> Grandpa shark, doo doo doo doo doo doo. >> Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. >> Wait, wait. >> Huh? >> Auntie shark. Doo doo doo doo doo doo. Auntie shark. Doo doo doo doo doo doo. Auntie shark. Doo doo doo doo doo doo. Auntie shark. >> Uncle shark. Doo doo doo doo doo doo. Uncle shark. Doo doo doo doo doo doo. Uncle shark. Doo doo doo doo doo doo. Uncle Shark. >> Cousin Shark. Doo doo doo doo doo doo. Cousin Sharks. Doo doo doo doo doo doo. Cousin Sharks. Doo doo doo doo doo doo. Cousin Sharks. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo. Run away. Doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. [Music] Happy Halloween. I'm the driver of this Halloween bus. Hang tight. The Halloween bus goes round and round and round. Round and round. The Halloween bus goes round and round on Halloween. >> The vampire bus goes, \"I'm hungry. I'm hungry. I'm hungry.\" Buzz, I'm hungry. [Music] >> Hello, guys. [Music] The skeleton bus go quack quack quack quack quack quack quack quack. The skeleton bus goes quack quack quack on Halloween. [Music] The Jackal bus goes trick or treat trick or treat trick or treat. The Jackal bus goes trick or treat on Halloween. [Music] The baby goes bus goes peekaboo peekaboo peekaboo. The baby ghost bus goes peekaboo on Halloween. [Music] The scary shark bus goes doo doo doo doo doo doo doo doo doo doo doo. The scary shark bus goes doo doo doo on Halloween. Happy Halloween. [Music] Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy Shark, >> Daddy Shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark. >> Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, >> Grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. >> Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Congratulations to the mermaid couple. [Music] My dear bride, spooky bride, be my bride on this Halloween night. Scary Halloween night. Scary Halloween night. >> My dear bride. Spooky bride. You're spooky beautiful. My one and only bride. Spooky mermaid wedding on Halloween. Spooky mermaid wedding on Halloween. [Music] My dear groom. Spooky groom. Be my groom on this Halloween night. Scary Halloween night. Scary Halloween night. My dear groom. Spooky groom. You're spooky, wonderful, my one and only groom. >> Spooky mermaid ready on Halloween. Spooky mermaid on Halloween. [Music] Daddy. Daddy. Where is daddy? Where is daddy? >> Here I am. Here I am. >> How are you this morning? >> Very well, I thank you. [Music] >> Run away. Run away. >> Mommy. Mommy. Where is mommy? Where is mommy? >> Here I am. Here I am. >> How are you this morning? >> Very well, I thank you. [Music] >> Run away. Run away. >> We are all safe. Yeah. Huh? Where did the shark family go? Friends, do you know where they are? Let's go find them. N >> Baby Shark, Baby Shark, where are you? >> Here I am. Here I am. How do you do? >> Why does Baby Shark look so strange? >> I'm a zombie baby shark. >> Oh no. Run away. [Music] friends. Let's throw this medicine to zombie baby shark. Come back, baby shark. Po. [Music] >> Huh? Thank you. Hoy, I can't find my mommy. >> Don't worry, baby shark. Friends, let's go find mommy shark with us. Mommy shark, mommy shark, where are you? >> Here I am. Here I am. How do you do? >> Why does mommy shark look so strange? >> I'm a zombie. Mommy shark. >> Oh no. Run away. friends. Let's throw this medicine to zombie mommy shark. >> Come back, Mommy Shark. Hoy, >> thank you. Hoy. Hoy, did you see Daddy Shark? >> H. No. Friends, I think we need to find Daddy Shark. Hoya. Daddy shark. Daddy shark. Where are you? >> Here I am. Here I am. How do you do? >> Why does Daddy Shark look so strange? >> I'm a zombie. Daddy shark. >> Oh no. Run away. [Music] Friends, let's throw this medicine to zombie. Daddy shark. Come back. Daddy shark. Hoy. Hoy. Hoy. Thank you. Hoy. Hoy. Did you see grandma shark? No. Friends. I think we need to find grandma shark. Grandma shark. Grandma shark. Where are you? >> Here I am. Here I am. How do you do? >> Why does grandma shark look so strange? like a zombie from the shark. >> Oh no. Run away. >> Friends, let's throw this medicine to zombie Grandma Shark. Come back, Grandma Shark. Hoy, ho ho. >> Oh, thank you. Hoy, did you see Grandpa Shark? M no friends, let's go find Grandpa Shark. Oh yeah. >> Grandpa Shark, Grandpa Shark, where are you? >> Here I am. Here I am. How do you do? >> Why does Grandpa Shark look so strange? >> I'm a zombie. Grandpa Shark. >> Oh no. Run away. [Music] Friends, let's throw this medicine to zombie grandpa shark. Come back, Grandpa Shark. Po. >> Thank you, Roy. What in the sea is going on? [Music] Giant zombie mermaids. >> Oh no. Run away. Suck >> friends. Now throw all medicines. The giant zombie mermaid. Come back mermaid. Point. [Music] Thank you. Ho. Boys friends, boys friends, where are you? >> Shark family and hy. >> And here I am. Here I am. Hoy ho ho. [Music] Baby shark. Doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. >> Daddy shark doo doo doo doo doo. Daddy shark doo doo doo doo doo. Hall doo doo doo doo doo. Daddy shark. >> Grandma shark doo doo doo doo doo. Grandma shark doo doo doo doo doo. Hall doo doo doo doo doo. Grandma shark >> Grandpa Shark doo doo doo doo doo. Grandpa Shark doo doo doo doo doo. Hall doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Let's go. A B C D E F G H I J K L M N O P Q R S T U V W X Y and Z. Now I know my ABCs. Next time, won't you sing with me? Now I know my ABCs. Next time, won't you sing with me? Sing with me. Wow. [Music] There are 10 fish in the sea. 1 2 3 4 5 6 7 8 9 and 10. One fish, two fish, three fish, four fish, five fish, six fish, seven fish, eight fish, nine fish, 10 fish. >> Oh no! Here comes a shark. Here comes a shark. Here comes a baby shark. Run away. Run away. Run away. Go home. >> 10 fish. Nine fish. Eight fish. Seven fish. Six fish. Five fish. Four fish. Three fish. Two fish. One fish. >> There's no fish. There's no fish. There's no fish in the sea. >> Only shark. Only shark. There is only a baby shark. I want to be your friend. H. >> It's the day of the day. Are you ready to meet our friends? >> Oh, it's so spooky. >> Set up the marolds. Make a way. Light the candles on this day. Celebrate with all the spirits. Dance, dance to the cha. Paint your face. Put on a big smile. Dress up in your festive style. >> Cate with all the spirits. Dance, dance to the cha. [Music] Here we have prepared a feast. Candies tamate with all the spirits. Dance to the la. Oh, save the dead is not scary at all. [Music] Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy Shark, >> Daddy Shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, >> Grandma Shark, doo doo doo doo doo doo. Grandma Shark, doo doo doo doo doo doo. Grandma Shark, doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. >> It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. [Music] Yellow shark. Doo doo doo doo. Baby shark. Doo doo doo doo. Yellow shark. Doo doo doo doo doo doo doo. Papa. Hey. There was a yellow shark. and shark was his nameo. S h a r s h a r k s h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h h a r k. And shark was his nameo. There was a yellow shark and shark was his nameo. S h a r s h a r k and shark was his nameo. There was a yellow shark and shark was his nameo. [Music] S H A R K and shark was his nameo. [Music] >> Did I ever tell you that on every Halloween? >> When I see the clock and it strikes one, the skeletons crawl out for some fun. like a jug. When I see the clock and it strikes two, the skeletons enjoy a steamy bowl of rice. >> When I see the clock and it strikes three, the skeletons step on each other's feet. >> When I see the clock and it strikes four, the skeletons don't have a shoe anymore. Ba ba. >> When I see the clock and it strikes five, the skeletons dance and feel the feel. [Music] When I see the clock and it strikes six, the skeletons jump on a cow. Yahoo! >> Yahoo! When I see the clock and it strikes seven, the skeletons crash and lose their teeth. >> Lose. >> When I see the clock and it strikes eight, the skeletons eat the yummy yummy cake. [Music] When I see the clock and it strikes nine, the skeletons play in the snow for a time. When I see the clock and it strikes 11, the skeletons don't know who each other are. When I see the clock and it strikes 12, the skeletons find out they're running out of time. When I see the clock, then it strikes one. The skeletons are all done with their fun. J. [Music] La. [Music] [Music] Baby Shark. Doo doo doo doo doo. Baby shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Baby shark. >> Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandpa shark. [Music] Creepy [Music] creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Shine, shine, shine, shine, shine, shine through the sea. >> Oh, Mr. Sun, Sun, Mr. Golden Sun, please shine through the sea. Oh, Mr. Sun, Sun, Mr. Golden Sun, it gets so dark in here. Grandma Shark is asking you, >> please come out so I can love. Oh, Mr. Sun, Sun, Mr. Golden Sun, please shine through the sea. Doo doo doo doo doo. Mr. Golden Sun. Mr. Golden Sun. Oh, Mr. Sun, Sun, Mr. Golden Sun, please come into the sea. Oh, Mr. Sun, Sun, Mr. Golden Sun, it gets so cold down here. Grandpa Shark is asking you, >> \"Please come in so I can feel the heat.\" >> Oh, Mr. Sun, Sun, Mr. Golden Sun, please. Please come into the sea. [Music] Tonic tonic electronic pharaohic tonic electronic pharaoh on it. It's an electronic Halloween. >> Rocket rocket shocket. Shop it. >> It's an electronic Halloween. >> Knock it on the coast. >> Let's do the wave. >> Do the wave. >> Next do the wave. >> Do the way. >> It's an electronic Halloween. >> Rocket. Rocket. >> Shet. It's an electronic Halloween [Music] electronic tonic. Tonic electronic tonic tonic electronic tonic tonic electronic. [Music] We are the super duper trio of the ocean. Baby Shark Gi William, let's go. We are the trio that everyone loves. Fun adventures. We're the ones. Baby Shark, the cutie of the three. >> Chi, the toughest of the three. >> William, the brain of the three. Super duper trio of the ocean. We are the super duper trio of the ocean. Baby Shark, GG, William, let's go. We are the trio that everyone loves. Fun adventures. We're the ones. Baby Shark, the cutie of the three. Chi, >> the toughest of the three. William, the brain of the three. Super duper trio of the ocean. We are the super duper trio of the ocean. Yeah. [Music] >> Baby shark. Doo doo doo doo doo. Baby shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Baby shark. >> Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Mommy shark. Woohoo. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Halloween. Doo doo doo doo doo. Grandpa. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks, creepy, creepy zombie sharks are dancing in the sea. Creepy, creepy, zombie sharks, zombie sharks, zombie sharks, creepy, creepy zombie sharks are dancing in the sea. [Music] Halloween is back. Yay. Let's start the Halloween costume party. >> Ding dong. Trick or treat. >> Who are you? >> I am a pirate. Aoy. >> Welcome to the party. You brought my balls. Pirate. Pirate. Happy Halloween. [Music] >> Yo. Ha. Ho ho ho ho ho. Ding dong. Trick or treat. >> Who are you? >> I'm a ballerina. One, two, one, two. >> Welcome to the party. You brought that cake. Ballerina. Ballerina. Happy Halloween. >> One 2 3 1 2 3 1 2 3 4 1 2 3 1 2 3. [Music] >> Ding dong. Trick or treat. >> Who are you? >> I'm a cowboy. Yeeha! >> Welcome to the party. You brought your candies. Cowboy. Cowboy. Happy Halloween. >> Yippee. Ding dong. Trick or treat. Who are you? >> I'm a refrigerator. >> Welcome to the party. You proud witches brew refrigerator. Happy Halloween. [Music] >> Happy Halloween. >> Baby, >> mommy, >> daddy, >> grandma, >> grandpa. >> We are the shark family. >> This baby shark had a ball. This mommy shark put on makeup. >> This daddy shark cleaned up trash. >> This grandma shark went fishing. >> And this grandpa shark cried, \"Doo doo doo doo doo.\" All the way home. >> This baby shark had a ball. This mommy shark put on makeup. H. >> This Daddy shark cleaned up trash. >> This grandma shark went fishing. >> Ow. >> And this grandpa shark cried, \"Doo doo doo doo doo.\" All the way home. [Music] Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy Shark, >> Daddy Shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark. >> Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, >> Grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark, >> let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. [Laughter] Crash it yet. Crash. Crash it. Yeah. Crash it. Crash it. Crush it. Crash. >> Baby shark. >> Shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo. Baby shark. Doo doo doo doo doo. Daddy shark. >> Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Daddy shark. >> Grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Grandma shark, >> grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark, let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo. Let's go hunt. >> I'm coming for you. Run away. Doo doo doo doo doo. Run away. Doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. >> Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo. Safe at last. Doo doo doo doo doo. Safe at last. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Oops. [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. >> Daddy shark doo doo doo doo doo. Daddy shark doo doo doo doo doo. Hall doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandpa shark. Creepy [Music] creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] >> Ah, who are you? >> Oh, kelp on my back. What have I here? There's a sail on my back. Who am I? My name is Sailfish. Whoosh. And whoosh. There's a big sail on my bag. Let's swim. >> Oh, my eyes. What have I here? There's a hammer on my face. Who am I? My name is Hammer. Wink and wink. There's a cool hammer on my face. I can see you. Who's there? >> On my head. What have I here? There's a lamp on my head. Who am I? My name is Tangler Fish. Blink and blink. There's a bright lamp on my head. Follow me. >> Stingray. Uh, seahorse. I'm just couch. Here we go around the coral bush. Coral bush. Coral bush. Here ring around the coral bush. Doo doo doo doo doo doo. >> This is the way we swim around. Swim around. Swim around. This is the way we swim around. Doo doo doo doo doo doo. >> This is the way we like to hunt. Like to hunt. Like to hunt. This is the way we like to hunt. Doo doo doo doo doo doo. This is the way we run away. Run away. Run away. This is the way we run away. Take that last day. [Music] [Music] >> My dear, take the basket to your grandma. Yes, mommy. >> The wheels on the bus go and round and round. Round and round. The wheels on the bus go round and round all through the sea. The crabs on the bus go pinch and pinch. Pinch and pinch. Pinch and pinch. The crowds on the rocks go pinch and pinch all through the sea. They are so creepy. A >> the eels in the dark go blink and blink blink and blink blink and blink. The eels in the dark go blink and blink all through the sea. >> The whale by the bus goes open and shut. Open and shut. Open and shut. The whale by the bus goes open and shut all through the sea. >> The shark on the bus goes doo doo doo doo doo doo doo doo doo doo doo. The shark on the bus goes doo doo doo doo. All through the sea. Oh, my poor grandson. Come here. [Music] >> Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Mommy shark, doo doo doo doo doo doo. Mommy shark, doo doo doo doo doo doo. Mommy shark, doo doo doo doo doo doo. Mommy shark. >> Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, >> Grandpa shark, doo doo doo doo doo doo. Grandpa Shark, doo doo doo doo doo doo. Grandpa Shark, doo doo doo doo doo doo. Grandpa Shark, let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Save that last. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. [Music] Baby shark. Doo doo doo doo doo. Baby shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Baby shark, >> mommy shark, doo doo doo doo doo. Mommy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Mommy shark, >> daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark. Wow. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Halloween. Doo doo doo doo doo. Grandpa shark. [Music] Cravy creepy zombie shark. Zombie shark. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Twinkle, twinkle, little shark, how I wonder what you are. Up above the world so high. Like a diamond in the sky. Twinkle, twinkle, little shark, how I wonder what you are. >> Twinkle, twinkle, little star, how I wonder what you are. Up above the world so high, like a diamond in the sky. Twinkle, twinkle, little star, how I wonder what you are. [Music] [Applause] [Music] Sharks, attention. Sharks, begin. >> Have you ever seen baby shark dancing here? When you look at me, baby shark, you will see >> sharks. Attention. Sharks begin right. >> Have you ever seen baby shark dancing here? When you look at me, baby shark, you will see. >> Sharks attention. Sharks begin. Right thing, left. >> Have you ever seen baby shark dancing here? When you look at me, baby shark, you will see >> sharks. Attention. Sharks begin. Right fin, left fin. >> Have you ever seen baby shark dancing here? When you look at me, baby shark, you will see. >> Sharks attention. Sharks begin. Right fin, left fin. >> Have you ever seen baby shark dancing here? When you look at me, baby shark, you will see sharks. Attention. Sharks dismiss. What's in the ocean? Let me tell you. Explore the ocean. A to Z. Find out just who lives in the Oh. right now. >> A >> angelf fish. >> B >> blue tank. >> B >> coral. >> D >> dolphin. >> E. >> Eel. >> S. >> Flatfish. >> G. >> Giant clam. >> H. >> Hermit crab. >> I >> Isopon. >> J. >> Jellyfish. >> K. >> Grill. >> L. >> Lobster. >> N. >> Mol. >> N. >> Nautilus. What's in the ocean? Let me tell you. Explore the A to Z. Find out just who lives in the O right now. Now it's time for letter O. >> O. >> Alphabet. O. >> O. >> Octopus. >> P. >> Bufferfish. >> U. >> Queen cotch. >> R. >> Ray. S >> shark. >> T >> turtle. >> U >> urchin. >> B >> vampire squid. >> W >> whale. >> X >> X-ray fish. >> Y >> Yeti crab. >> D >> zebra shark. Ocean ABC. It's so much fun. >> What's in the ocean? Now you know. Explore the ocean A to Z. Don't forget who lives in the oh ocean. Yeah. [Music] Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark Happy Shark doo doo doo doo doo doo. Happy shark. Doo doo doo doo doo doo. Happy shark. Doo doo doo doo doo doo. Happy shark. Baby turtle. Doo doo doo doo doo. Baby turtle. Doo doo doo doo doo. Happy turtle. Doo doo doo doo doo. Happy turtle. Baby seahorse. Doo doo doo doo doo. Baby seahorse. Doo doo doo doo doo. Happy seahorse. Doo doo doo doo doo. Happy seahorse. >> Baby whale. Doo doo doo doo doo. Baby whale. Doo doo doo doo doo. >> Happy whale. Doo doo doo doo doo. Happy whale. Baby turtle. Doo doo doo doo doo. Baby seahorse. Doo doo doo doo doo. Baby whale. Doo doo doo doo doo. We are babies. Doo doo doo doo. Doo doo doo doo doo. Big smile. Doo doo doo doo doo. Be happy. [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. Daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark, >> grandpa shark, doo doo doo doo doo. Grandpa shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] >> Everyone, >> let's >> say hello with Baby Shark. Right. Doo doo doo. Left pin. Doo doo doo. Hello. Hello ocean friends. Doo doo doo doo doo. Let's sing hello with a big big smile. Doo doo doo doo doo doo doo doo. Hello. Good morning. Hello Mr. Turtle. >> Hello baby shark. >> Good morning little clams. >> Hey. How are you? Right. Doo doo doo. Left. Doo doo doo. Hello. Hello ocean friends. Doo doo doo doo doo. Let's sing hello with a big big smile. Doo doo doo doo doo doo doo doo. Hello. Good morning. Hello seahorse. How are you? >> I am very well indeed. [Music] >> Doo doo doo. Left. Doo doo doo. Hello. Hello baby shark. Doo doo doo doo doo. Hello ocean friends. Doo doo doo doo doo. Time to clean the sea. Time to clean the sea. Sweep with a broom groom here and there under the sea. Doo doo doo doo. Having fun. Sweep sweep everywhere. You, me, and everybody. It's Shark family. >> Working as a team to clean. >> Let's go. >> Move your fins now. Up and down. Round and round. Round and round. Now look around. It's so clean and shiny. >> Boom chicka boom chicka boom chicka boom boom chicka boom chicka boom chicka boom chicka chicka boom chicky boom chicka boom. >> Sweep with a broom broom. Here and there under the sea. Doo doo doo doo. Having fun. Sweep sweep everywhere. Me and everybody with Shark family. Working as a team to clean. >> Let's go. >> Move your tails now. Up and down. Round and round. >> And now look around. It's so clean and shiny. >> Boom. Boom. Boom. Boom. Boom. Boom. Boom. Chicky chicky boom. Chicky chicky boom chick. Boom. Hello, Baby Shark friends. Are you guys ready? >> 1 2 3 4 workout time for Baby Shark. >> I can do it. >> Yes, we can do it. >> Oh, yes. Let's get how strong do [Music] go up and hyphen >> hyphen do spin go down and finish >> finish. >> Great job, guys. Go for it. Are you guys having fun? >> Yeah. >> One, two, keep it up. Three, four, we do the workout. Time for Baby Shark. >> I can do it. Yes, we can do it. Oh, yes. Let's get healthy and strong. >> Right, right, right, right. Go to the right side, jump. [Music] >> Go to the left side, jump. >> Oh yeah. >> Relax. Drink some water. [Music] Baby Shark, doo doo doo doo doo. Baby Shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo. Mommy Shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Mommy Shark, >> Daddy Shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandpa shark. Creepy [Music] creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Doo doo doo doo doo doo. >> Baby shark. Doo doo doo doo doo doo. >> Listen up. Doo doo doo doo doo doo. >> Alum. >> Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. >> Mommy shark. Doo doo doo doo doo doo. Mommy shark. Doo doo doo doo doo doo. Mommy shark. Doo doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo doo. Daddy shark. Doo doo doo doo doo doo. Daddy shark. Doo doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo doo. Grandma shark. Doo doo doo doo doo doo. Grandma shark. Doo doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. >> Oh, it's so dark in here. >> Oh, keep going, Bumpy. Super sneaky. Super sneaky. Super sneaky. Keep going, Bumpy. Super sneaky. Doo doo doo doo. Keep going, Bumpy. Super sneaky. Super sneaky. Super sneaky. Keep going, Bumpy. Super sneaky. Dat [Music] [Applause] [Music] [Music] Oh yeah. [Music] Click click here. >> Click click here. >> Boo here. >> Boo there. >> Dance dance here. >> Dance dance there. Doo doo doo doo doo. >> Baby shark went on a trip. Doo doo doo doo doo. >> And on the way he met some crabs. >> Doo doo doo doo. Want to play with me? Want to play with me? >> No. No. Run away. >> Four little baby sharks. Doo doo doo doo. [Music] >> Baby shark went on a trip. Doo doo doo doo doo. >> And on the way he met an octopus. Doo doo doo doo doo. >> Want to play with me? Want to play with me? >> No. No. Swim away. >> Poor little baby shark. [Music] Baby Shark went on a trip. And on the way he met a hammerhead. >> Hey, Baby Shark. Want to play with me? Want to play with me? >> Me? Me? I would love to. >> Baby Shark now has a friend. Hello, Dr. Baby Shark. The fish are jumping on the couch. No way. No more fish jumping on the couch. >> Five little fish jumping on the one fell off and bumped his head. >> Mama called the doctor and the doctor said, >> \"No more fish jumping on the couch.\" Four little fish jumping on the couch. >> One fell off and bumped his head. >> Mama called the doctor and the doctor said, \"No more fish jumping on the couch.\" >> Three little fish jumping on the couch. >> One fell off and bumped his head. Mama called the doctor and the doctor said, \"No more fish jumping on the couch.\" Dr. Baby Shark, the fish are jumping on the couch again. >> Two little fish jumping on the couch. >> One fell off and bumped his head. >> Mama called the doctor and the doctor said, >> \"No more fish jumping on the couch.\" >> One little fish jumping on the fell off and bumped his head. Mama called the doctor and the doctor said, >> \"No more fish jumping on the count. Then what about dancing?\" H dancing is fun. >> Oh yeah. >> Mom, come join us. [Music] Hey [Music] One. One. Number one, who's going to sing? One. Baby Shark sings. Doo doo doo doo doo. Doo doo doo doo doo. Two. Two. Number two. Who's going to sing? >> Two. Baby sing. Doo doo doo doo doo. >> Doo doo doo doo doo. Three. Three. Number three. Who's going to sing? Three baby turtles sing. Doo doo doo doo doo doo doo doo doo doo doo. Four. Four. Number four. Who's going to sing? >> Four baby racing. Doo doo doo doo doo doo doo doo doo doo. Five. Five. Number five. Who's going to sing? Five. Baby clam sing. Doo doo doo doo doo. 1 2 3 4 5. Yay. [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandpa. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Doo doo doo doo doo doo. >> Baby shark doo doo doo doo doo doo. >> Listen up. Doo doo doo doo doo doo. >> Bubbles. >> Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. >> Mommy shark. Doo doo doo doo doo doo. Mommy shark. Doo doo doo doo doo doo. Mommy shark. Doo doo doo doo doo doo. Mommy shark. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, she >> Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, >> Grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark, let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. >> Oh, it's so dark in here. >> Oh, keep going, Bumpy. Super sneaky. Super sneaky. Super sneaky. Keep going, Bumpy. Super sneaky. Doo doo doo doo doo. Keep going. We'll be super sneaky. Super sneaky. Super sneaky. Keep going. We'll be super sneaky. Doo doo doo doo doo. Save the last. Doo doo doo doo doo. Save the last. Doo doo doo doo doo. Save the last. Doo doo doo doo doo. Save the last. It's the end. Doo doo doo doo. It's the end. Doo doo doo doo. It's the end. Doo doo doo doo. It's the end. Oh yeah. [Music] Look at me. Hick hick hick. How can I stop? >> Oh, let me bake bake bake you hot glam buns. >> It looks so sweet, sweet. Let me have one. But the heck hiccups won't stop. [Music] Look at me. Hick hicc. How can I stop? Hiccup. >> Oh, maybe stand. Stand stand upside down. >> It looks so cool. Let me try it. Hiccup. But the heck he hiccups won't stop. Why don't you hold hold your breath and count to 10? 1 2 3. >> No. Why don't you drink drink a cup of juice? Uh-oh. >> Yikes. And a hy. [Music] D. >> Hey, have you seen my dad? >> Mommy's reading a book in the living room. >> Daddy's taking a shower in the bathroom. >> Grandma's knitting a scarf in the bedroom. >> Grandpa's making glam buns in the kitchen. >> Living room, bathroom, and bedroom and doo doo doo doo doo doo doo doo. Welcome to my house. >> Living room, bathroom, and bedroom, and kitchen. Doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo. >> Welcome to my house. >> Yeah. >> Ladies and gentlemen, let me introduce the best duet in the sea. [Music] I'm a baby fish and I love to sing. Baby shark is my best friend. We swim together, we jump together. We're best friends in the sea. Baby shark. I'm a baby shark and I love to dance. William's my best friend. We swim together. We jump together. We're best friends in the sea. William, Baby Shark, we're best friends in the sea. I sing together, we dance together. We're best friends in the sea. Best friends in the sea. [Music] Baby Shark, doo doo doo doo doo. Baby Shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo. Mommy Shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Mommy shark, >> Daddy Shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandpa shark. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. creepy zombie sharks are dancing in the sea. [Music] >> Bye. Good night. It's time for bed. [Music] Good night stingray with a warm sandy blanket till the morning seaorse. Doo doo doo doo doo. Sleep tight >> and hold tight. [Music] Good night parrot fish in a wonderful magic tent till the morning octopus. Doo doo doo doo doo. Sweet dreams. Good night whale blue whale. Sweet dreams through the night. >> Aren't you sleepy, baby shark? I'm not sleepy. [Music] [Applause] [Music] >> Ocean building. Let's go down. >> First floor, >> shark bakery. >> Second floor, >> seahorse gym. Third floor, >> dumping school. >> Down, down, down, going down. >> Fourth floor, >> turtle post office. >> Fifth floor, >> whale police station. >> Sixth floor, >> Squid Bay. Down going down. >> Seventh floor, >> car wash. >> Eighth floor, >> octopus gas station. >> Ninth floor clothing shop. Down, down, down, going down. Ocean building down going down. Tree of the ocean. Here we come. >> Wow, it smells good. >> Welcome to the Angler Fish Restaurant. >> Come to Ocean. [Music] Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy Shark, >> Daddy Shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark. >> Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, >> Grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark, doo doo doo doo doo doo. Grandpa shark, >> let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. [Music] Under the sea, under the sea, the deep sea, the deep sea. You walk and see, you walk and see. Baby mermaid shark, baby mermaid shark, come on over, over, come on over, over, gather around me. I'm Baby Shark, come on over. Come on over. Play with my ocean friends. Doo doo doo doo doo. >> Baby mermaid shark. Baby mermaid shark can hardly wait. Can we wait a great big adventure? Big adventure above the sea. The sea. Above the sea. The sea. What is out there? Above the sea. Above the sea. Sea above the sea. I can see shining stars. Come on over, over over. [Music] Play with my ocean. Doo doo doo doo. See you soon. Shining stars. Doo doo doo doo. [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark, woohoo. >> Daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark. >> Grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. And my [Music] creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] I'm lost. >> Baby shark is lost in the forest. >> Where am I? >> Baby shark is lost in the forest. >> Where am I? >> But the fish is lost. >> Oh no. >> It's so hard to find it way back home. >> Baby shark is lost in the forest. Where am I? >> Baby Shark is lost in the forest. >> Where am I? >> He drops shiny stones, but the crab takes them all. It's so hard to find his way back home. >> Baby Shark is lost in the forest. >> What is it? >> Baby Shark is lost in the >> Wow, look at that. >> He finds a cookie hat and sees what's inside. Baby Shark finds all his friends. La, [Music] [Music] >> please get up. Let's get moving. >> All together, move it. Shark friends. We're super sharks. Make a scary face. >> Swing, swing, roll. >> Swing, swing, roll. >> It's the sharky shuffle. All the shark friends move it. Shark friends. We're super sharks. Make a scary face. >> Shake, shake, shake >> your head side to side. >> It's the sharky shuffle. All together friends where sharks make a scary face to the left and right. Stand as you please. >> It's the sharky shuffle. [Music] It's Easter doo doo. Egg hunting trinoo doo doo. Let's go egg hunting. >> Floral egg. Floral egg. Where are you? Here I am. Here I am. Floral Easter egg. Rainbow egg. Rainbow egg, where are you? Here I am. Here I am. Rainbow Easter egg. >> Daddy egg. Daddy egg. Where are you? >> Here I am. Here I am. Got it. Easter egg. Egg. Egg. Where are you? Here I am. Here I am. Easter egg. Easter bunny. Fruit. Doo doo. Egg hunting. Doo doo. So exciting. Doo doo doo. Who will find the last one? >> I will. Sparkly egg. Sparkly egg. Where are you? >> Here I am. Here I am. Sparkly Easter egg. >> Wow. Excellent. [Music] >> Opposites. >> Big and small. Big and small. Long and short. Long and short. Hard and hard and soft. In and out. In and out. There are a lot of love. Let's sing together. You and me. Big and strong. Big and strong. And short. Hard. Hard and in and out. In and out. There are a lot of misses. Let's sing together. You and me. Alice. [Music] Doo doo doo doo doo doo. Hey, lovely mommy shark. Doo doo doo doo doo doo doo. Hey, lovely mommy shark. >> Give a hug to your sweet husband. Hey lovely mommy shark. >> Listen to your charming baby. >> Hey lovely mommy shark. >> Sing a song with joyful grandma. Hey lovely mommy shark. Bake buns with gentle grandpa. >> Hey lovely mommy shark. >> Doo doo doo doo doo doo doo. Hey lovely mommy shark. Doo doo doo doo doo doo doo. Hey lovely mommy shark. Give a hug to your sweet husband. >> Hey lovely mommy shark. >> Listen to your charming baby. >> Hey lovely mommy shark. >> Sing a song with joyful grandma. >> Hey lovely mommy shark. >> Bake buns with gentle grandpa. >> Hey lovely mommy shark. >> Doo doo doo doo doo doo doo. Hey lovely mommy shark. Doo doo doo doo doo doo doo. We love our mommy shark. [Music] >> Baby shark. Doo doo doo doo doo. Baby shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Baby shark. >> Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Halloween. Doo doo doo doo doo. Grandma shark. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks, zombie sharks. Creepy, creepy zombie sharks are dancing in the sea. Creepy, creepy zombie sharks, zombie sharks, zombie sharks, creepy, creepy zombie sharks are dancing in the sea. [Music] Huh? I'm bored. Isn't there anything fun to do? >> Bored Baby Shark went out to play out to a hidden pirate ship one day. He had such enormous fun. He called for another buddy shark to come. >> Yay! >> Hey, come here. Let's play. >> Baby Shark and a friend went out to play. Out to a hidden pirate ship one day. They had such enormous fun. They called for another Baby Shark to come. Hooray! Hey, come here. Let's play. >> Baby Shark and friends went out to play. Out to a hidden pirate ship one day. They had such enormous fun. They called for another shark to come. >> Hey, come here. Let's all play together. >> Are you talking to me? [Music] Doo doo doo doo doo doo doo doo doo doo doo. Me a sleeping granny. Doo doo doo doo doo doo doo doo doo doo. Someone please break the spell. The evil fairy came to the party and cast a dark dark spell. The poor poor granny fell into a deep deep sleep. The great band heard the tail and came a long way to break the spell. He kissed the granny and he rescued her from the deep, deep sleep. Doo doo doo doo doo doo doo doo doo doo doo. Me a sleeping granny. Doo doo doo doo doo doo doo doo doo. Someone please break the spell. I love you. I love you. I love you. My love granny shark. >> I love you. I love you. I love you. My love grandad shark. [Music] My tail is gone. >> Have you ever seen my tail? My tail? Baby shark's tail. Have you ever seen my tail? My yellow crescent tail. A raised tail for stinging. A seahorse's tail to grab the weeds. >> Oh, no. No, no, no, no, no, no. They're not my tail. Have you ever seen my tail? My tail. Baby shark's tail. Have you ever seen my tail? My yellow crescent tail. A blownish tail for true love. a sea dragon's tail to incubate the eggs. >> Oh, no, no, no, no, no, no, no. They're not my tail. >> Okay, I'm going to look for my tail one more time. Doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo. >> Have you ever seen my tail? My tail. Baby shark's tail. Have you ever seen my tail? My yellow crescent tail. >> A whale's tail to make a big whale. A sailfish tail to swim fast. Oh, no. No, no, no, no, no. They're not my tail. Huh? >> Daddy. Daddy. Where is daddy? Where is daddy? >> Here I am. Here I am. >> How are you this morning? >> Very well, I thank you. Run away. Run away. >> Mommy. Mommy. Where is mommy? Where is mommy? >> Here I am. Here I am. >> How are you this morning? >> Very well, I thank you. [Music] >> Run away. Run away. >> We are all safe. [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. And I [Music] creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] I am a Neil with a long body. >> I can't believe it. >> I can turn on deadly voltage. >> Watch out. >> I blink blink in the dark places. Wow, it's magical. >> Shocking other friends. It is so much fun. Peekaboo. Peekaboo. >> I am an octopus with eight legs. >> You even have suction cups. >> I hide under the rocks and crawl. >> Swishy and flexible. >> I can change my color anytime. >> Where did you go? If you find me, I will. >> I am a football fish with a lantern. >> It's a swinging lantern. >> I turn on my bulb to lure ants. >> It is so pretty. >> My big big mouth will scare you off. >> Snap snap. >> Let's all play. [Music] Hooray! Hooray! Ocean parade! Ocean parade! Here comes the shark family! Ocean parade! Ocean parade! We'd like some friends to watch with us. There are so many friends over there. >> Hey, let's march together. >> Swimming, swimming, swimming, swim, swim. >> Spinning, spinning, spinning, spin, spin. >> Blowing, blowing, blowing bloop. Parade in the sea. Ocean parade, ocean parade. Here comes the shark family. Ocean parade, ocean parade. We find some friends to march with us. There are flashes of light over there. >> Let's go check it out. >> Bouncing, bouncing, bouncing, bounce, bounce, >> buzzing, buzzing, buzzing, buzz, bus. >> Snapping, snapping, snapping, snap, snap. Happy parade in the sea. [Music] Hey, hey, hey, >> hey, hey. Let's go and swim. Swim, swim, swim through the sea. Let's have D and never stop. >> Let's have some fun and swim faster. Go as fast as you can until the end. Go, go, go, go, go, go. Here we go. Do >> hey. Hey. Hey. Let's go and swim. Swim. Swim through the sea. Let's go. Doo doo doo doo doo. And never stop. >> Let's have some fun and jump together. Jump as high as you can to the sky. >> Yeah. >> Close and open your eyes. Hide and seek. Doo doo doo doo doo doo doo. Hide and seek. >> I'm a mimic flatfish. I can change to any color. Yeah, I'm a mimic flatfish. Close and open your eyes. >> Hide and hide and hide and seek. Doo doo doo doo doo. Hide and hide and hide and seek. Doo doo doo doo doo. >> I'm a leafy sea dragon. Looks like sea. Watch out. I'm a ley sea dragon. Close and open your eyes. >> Hide and hide and hide and seek. Doo doo doo doo doo. Hide and hide and hide and seek. Doo doo doo doo doo. I'm a baby shark and I am it. Give me a hint. That's it. Gotcha. I'm a baby shark and I am it. I can find you while it starts. Hide and hide and hide and seek. Doo doo doo doo doo. Hide and hide and hide and seek. Doo doo doo doo doo. Hide and hide and seek. [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Baby shark, doo doo doo doo doo doo. >> Mommy shark, doo doo doo doo doo doo. >> Daddy shark, doo doo doo doo doo doo. >> Grandma, >> yes. >> Grandma shark, doo doo doo doo doo doo. >> Grandpa shark, doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. >> Wait, wait. How? >> And shark. Doo doo doo doo doo doo. And shark. Doo doo doo doo doo doo. And shark. Doo doo doo doo doo doo. Auntie shark. >> Uncle shark. Doo doo doo doo doo doo. Uncle shark. Doo doo doo doo doo doo. Uncle shark. Doo doo doo doo doo doo. Uncle shark. >> Cousin shark. Doo doo doo doo doo doo. Cousin sharks. Doo doo doo doo doo doo. Cousin sharks. Doo doo doo doo doo doo. Cousin sharks. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. [Music] Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. It's a Mima. Mommy shark, doo doo doo doo doo doo. Mommy shark, doo doo doo doo doo doo. Mommy shark, doo doo doo doo doo doo. It's an obo. >> Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. It's a flute. >> Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. It's a trumpet. >> Grandpa shark, doo doo doo doo doo doo. Grandpa Shark, doo doo doo doo doo doo. Grandpa Shark, doo doo doo doo doo doo. It's a controvers [Music] [Laughter] [Music] Orchestra, orchestra, orchestra, orchestra, orestra. Wow. [Music] Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, doo doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo doo. Mommy Shark, doo doo doo doo doo doo. Mommy shark, doo doo doo doo doo doo. Mommy shark. >> Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark, doo doo doo doo doo doo. Daddy shark. >> Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark, doo doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. Doo doo doo doo doo doo. Safe at last. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. >> Baby shark. Doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Mommy shark. Doo doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo doo. Daddy shark. Doo doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo doo. Grandma shark. Doo doo doo doo doo doo. Grandma shark. Doo doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo doo. Grandpa shark. >> It's the end. Doo doo doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo doo. It's the end. [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. >> Daddy shark doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark. >> Grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandpa shark. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Zombie sharks, zombie sharks. Zombie sharks are dancing in the sea. [Music] [Laughter] Crash it yet. Crash it. Yeah. Crash it yet. Crash it yet. Crash it. Crash it. Baby shark doo doo doo doo doo doo. Baby shark doo doo doo doo doo doo. Baby shark doo doo doo doo doo doo. Daddy shark mommy shark doo doo doo doo doo doo. Mommy shark doo doo doo doo doo doo. Mommy shark doo doo doo doo doo doo. Mommy shark >> Daddy shark doo doo doo doo doo doo. Daddy shark doo doo doo doo doo doo. Daddy shark doo doo doo doo doo doo. Daddy shark >> grandma shark doo doo doo doo doo doo. Grandma shark doo doo doo doo doo doo. Grandma shark doo doo doo doo doo doo. Grandpa Shark. Grandpa Shark. Doo doo doo doo doo doo. Grandpa Shark. Doo doo doo doo doo doo. Grandpa Shark. Doo doo doo doo doo doo. Grandpa Shark. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. Doo doo doo doo doo doo. Let's go hunt. >> I'm coming for you, boy. >> Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Doo doo doo doo doo doo. Run away. Safe at last. Doo doo doo doo doo. Safe at last. Doo doo doo doo. Safe at last. Doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. Doo doo doo doo doo. It's the end. Oops. [Music] Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Doo doo doo doo doo doo. Baby shark. Happy shark. Doo doo doo doo doo doo. Happy shark. Doo doo doo doo doo doo. Happy shark. Doo doo doo doo doo doo. Happy shark. Baby turtle. Doo doo doo doo doo. Baby turtle. Doo doo doo doo doo. Happy turtle. Doo doo doo doo doo. Happy turtle. Baby seahorse. Doo doo doo doo doo. Baby seahorse. Doo doo doo doo doo. Happy seahorse. Doo doo doo doo doo. Happy seahorse. >> Baby whale. Doo doo doo doo doo. Baby whale. Doo doo doo doo doo. Happy whale. Doo doo doo doo doo. Happy whale. Baby turtle. Doo doo doo doo doo. Baby seahorse. Doo doo doo doo doo. Baby whale. Doo doo doo doo doo. We are babies. Doo doo doo doo. Doo doo doo doo. Big smile. Doo doo doo doo. Be happy. [Music] My dear, take the basket to your grandma. >> Yes, mommy. >> The wheels on the bus go and round and round. Round and round. The wheels on the bus go and all through the sea. The on the bus go pinch and pinch. Pinch and pinch. Pinch and pinch. The crabs on the rocks go pinch and pinch. All through the sea, >> they are so creepy. A >> the eels in the dark go blink and blink, blink and blink, blink and blink. The eels in the dark go blink and blink all through the sea. >> The whale by the bus goes open and shut, open and shut, open and shut. The whale by the bus goes open and shut all through the sea. The shark on the bus goes doo doo doo doo doo doo doo doo doo doo doo doo. The shark on the bus goes doo doo doo all through the sea. >> Oh my poor grandson, come here. >> Baby, >> mommy, >> daddy, >> grandma, >> grandpa. >> We are the shark family. >> This baby shark had a ball. >> This mommy shark put on makeup. H. >> This daddy shark cleaned up trash. >> This grandma shark went fishing. >> And this grandpa shark cried doo doo doo doo doo. All the way home. >> This baby shark had a ball. This mommy shark put on makeup. This daddy shark cleaned up trash. This grandma shark went fishing. >> And this grandpa shark cried, \"Doo doo doo doo doo.\" All the way home. [Music] [Music] Baby shark doo doo doo doo doo. Baby shark doo doo doo doo doo. Hall. Doo doo doo doo doo. Baby shark. >> Mommy shark. Doo doo doo doo doo. Mommy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall doo doo doo doo doo. Grandma shark >> Grandpa Shark doo doo doo doo doo. Grandpa Shark doo doo doo doo doo. Hall doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Yellow shark. Doo doo doo doo. Baby shark. Doo doo doo doo. Yellow shark. Doo doo doo doo doo doo doo. Papa. Hey. There was a yellow shark. And shark was his nameo. S h a r k. S h a r k. S h a r k. And shark was his nameo. There was a yellow shark and shark was his nameo. S h a r k. S H A R K and shark was his nameo. There was a yellow shark and shark was his nameo. [Music] S h a r and shark was his nameo. There are 10 fish in the sea. 1 2 3 4 5 6 7 8 9 and 10. One fish. Two fish. Three fish. Four fish. Five fish. Six fish. Seven fish. Eight fish. Nine fish. 10 fish. >> Oh no. Here comes a shark. Here comes a shark. Here comes a baby shark. Run away. Run away. Run away. Go home. >> 10 fish. Nine fish. Eight fish. Seven fish. Six fish. Five fish. Four fish. Three fish. Two fish. One fish. >> There's no fish. There's no fish. There's no fish in the sea. >> Only shark. Only shark. There is only a baby shark. I want to be your friend. A [Music] >> Twinkle, twinkle, little shark, how I wonder what you are. Up above the world so high. Like a diamond in the sky. Twinkle, twinkle, little shark, how I wonder what you are. >> Twinkle, twinkle, little star, how I wonder what you are. Up above the world so high, like a diamond in the sky. Twinkle, twinkle, little star, how I wonder what you are. [Music] [Applause] [Music] [Music] >> Baby shark, doo doo doo doo doo. Baby Shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo. Mommy Shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Mommy shark, >> Daddy Shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> Grandma Shark, doo doo doo doo doo. Grandma shark doo doo doo doo doo. Hall doo doo doo doo doo. Grandma shark >> Grandpa Shark doo doo doo doo doo. Grandpa Shark doo doo doo doo doo. Hall doo doo doo doo doo. and my [Music] creepy creepy zombie sharks. Zombie sharks zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Let's go. A B C D E F G H I J K L M N O P Q R S T U V W X Y and Z. Now I know my ABCs. Next time, won't you sing with me? Now I know my ABCs. Next time, won't you sing with me? Sing with me. Wow. [Music] >> Shine, shine, shine, shine, shine, shine through the sea. >> Oh, Mr. Sun, Sun, Mr. Golden Sun, please shine through the sea. Oh, Mr. Sun, Mr. Golden Sun, it gets so dark in here. Grandma Shark is asking you, >> please come out so I can for my love. >> Oh, Mr. Sun, Sun, Mr. Golden Sun, please shine through the sea. Doo doo doo doo doo. Mr. Golden Sun, doo doo doo doo doo. Mr. Golden Sun. Oh, Mr. Sun, Sun, Mr. Golden Sun, please come into the sea. Oh, Mr. Sun, Sun, Mr. Golden Sun, it gets so cold down here. Grandpa Shark is asking you, >> \"Please come in so I can feel the heat.\" >> Oh, Mr. Sun, Sun, Mr. The golden sun, please come into [Music] the sea. [Music] >> We are the super duper trio of the ocean. Baby Shark, >> GG, William, let's go. We are the trio that everyone loves. Fun adventures. We're the ones. Baby Shark, the cutie of the three. >> Chi-Chi, >> the toughest of the three. William, the brain of the three. Super duper trio of the ocean. >> We are the super duper trio of the ocean. Baby Shark, GG, William, let's go. We are the trio that everyone loves. Fun adventures. We're the ones. Baby Shark, >> the cutie of the three. Chi-Chi, the toughest of the three. William, the brain of the three. Super duper trio of the ocean. We are the super duper trio of the ocean. >> Yeah. [Music] Baby shark. Doo doo doo doo doo. Baby Shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Baby Shark, >> Mommy Shark, doo doo doo doo doo. Mommy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Mommy shark, Daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark doo doo doo doo doo. Hall doo doo doo doo doo. Grandma shark >> Grandpa shark doo doo doo doo doo. Grandpa shark doo doo doo doo doo. Hall doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] [Music] Please get up. Let's get moving. >> All together friends make a scary face. >> Swing, swing, roll. >> Swing, swing, roll. >> It's the sharky shuffle. All gather friends move it. Dark friends where super sharks make a scary face. >> Shake, shake, shake >> your head side to side. >> It's the sharky shuffle. All shark friends. Move it. Shark friends. Where super sharks make a scary face to the left and right. Stand as you please. >> It's the sharky shuffle. >> Hey, have you seen my dad? >> Mommy's reading a book in the living room. >> Daddy's taking a shower in the bathroom. Grandma's knitting a scarf in the bedroom. >> Grandpa's making clam buns in the kitchen. >> Living room, bathroom, and bedroom and kitchen. Doo doo doo doo doo doo doo doo. >> Welcome to my house. Living room, bathroom, and bedroom, and kitchen. Doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo. >> Welcome to my house. Yeah. Here we go around the coral bush. Coral bush. Coral bush. Here ring around the coral bush. Doo doo doo doo doo doo. >> This is the way we swim around. Swim around. Swim around. This is the way we swim around. Doo doo doo doo doo doo. This is the way we like to hunt. Like to hunt. Like to hunt. This is the way we like to hunt. Doo doo doo doo doo doo. >> This is the way we run away. Run away. Run away. This is the way we run away. Take that last day. [Music] [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark, >> daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark, >> grandpa shark, doo doo doo doo doo. Grandpa shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark, woohoo! >> Daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark, >> Grandpa shark, doo doo doo doo doo. Grandpa shark, doo doo doo doo doo. Hall, doo doo doo doo doo. And my [Music] creepy creepy zombie sharks zombie sharks zombie sharks creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark, >> daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark. >> Daddy shark. Doo doo doo doo doo. Daddy shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Daddy shark. >> Grandma shark. Doo doo doo doo doo. Grandma shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. Grand. [Music] Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks zombie sharks zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] [Music] Baby Shark doo doo doo doo doo. Baby Shark doo doo doo doo doo. Hall doo doo doo doo doo. Baby Shark >> Mommy Shark doo doo doo doo doo. Mommy Shark doo doo doo doo doo. Hall doo doo doo doo doo. Mommy shark, woohoo! >> Daddy shark, doo doo doo doo doo. Daddy shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Daddy shark, >> grandma shark, doo doo doo doo doo. Grandma shark, doo doo doo doo doo. Hall, doo doo doo doo doo. Grandma shark. >> Grandpa shark. Doo doo doo doo doo. Grandpa shark. Doo doo doo doo doo. Hall. Doo doo doo doo doo. And I [Music] creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are roaming in the sea. Creepy creepy zombie sharks. Zombie sharks. Zombie sharks. Creepy creepy zombie sharks are dancing in the sea. Creepy creepy zombie sharks. Creepy creepy zombie sharks are dancing in the sea. [Music] Ta. Happy 10 years. Did I steal your heart again?",
    "start_time": 0.719,
    "end_time": 8217.8
}