{
    "video_id": "Us6NTLdnuFA",
    "channel_url": "@pinkfong",
    "transcript": "Ping bong. [Music] >> Yay. It's Halloween today. Mom, where is everyone? Which finger? Which finger? Where are you? >> Here I am. Here I am. How do you do? >> Abracadabra. [Music] >> Ghost finger. Ghost finger, where are you? >> Here I am. Here I am. How do you do? Peekaboo. >> Skeleton finger. Skeleton finger. Where are you? Here I am. Here I am. How do you do? Crack. Crack. >> Zombie finger. Zombie finger. Where are you? >> Here I am. Here I am. How do you do? I got you. [Music] >> Finger, finger, where are you? >> Here I am. Here I am. How do you do? [Music] Yay! I found you all. Huh? What are you doing now? Which finger? Which finger? What do you do? >> Stir the pot. Stir the pot. Do you want to try it? N [Music] >> Happy Halloween. Ghost finger. Ghost finger. What do you do? >> Fly around. Fly around. Catch me if you can. [Music] Happy Halloween. Skeleton finger. Skeleton finger. What do you do? Huh? [Music] >> Happy Halloween. >> Zombie fever. Zombie fever. What do you do? >> Creep you out. creep you up. I'm going to catch you. [Music] >> Happy Halloween. >> Vampire finger. Vampire finger. What do you do? >> Hang upside down. Hang upside down. This is so much fun. [Music] >> Happy Halloween. >> Fingers. Fingers. Where are you? Huh? [Music] >> Here we are. Here we are. How do you do? Here we are. Here we are. How do you do? Happy Halloween. Huh? Where did the shark family go? Friends, do you know where they are? Let's go find them. N >> baby shark. Baby shark, where are you? >> Here I am. Here I am. How do you do? >> Why does baby shark look so strange? >> I'm a zombie baby shark. >> Oh no. Run away [Music] first. Let's throw this medicine to zombie baby shark. Come back, baby shark. Po. [Music] >> Huh? Thank you. Hoy, I can't find my mommy. >> Don't worry, baby shark. Friends, let's go find mommy shark with us. >> Mommy shark, mommy shark, where are you? >> Here I am. Here I am. How do you do? Why does mommy shark look so strange? >> I'm a zombie. Mommy shark. >> Oh no. Run away. >> Friends, let's throw this medicine to zombie. Mommy shark. Come back, Mommy Shark. Hoy. >> Thank you. Hi. Hi. Did you see Daddy Shark? >> Hm. No. Friends, I think we need to find Daddy Shark. Hoya. >> Daddy Shark. Daddy Shark. Where are you? >> Here I am. Here I am. How do you do? >> Why does Daddy Shark look so strange? >> I'm a zombie. Daddy shark. Oh no. Run away. [Music] Friends, let's throw this medicine to zombie. Daddy shark. Come back. Daddy shark. Hoy. Hoy. Hoy. Thank you. Hoy. Hoy. Did you see grandma shark? No. Friends. I think we need to find grandma shark. Oh yeah. >> Grandma shark. Grandma shark. Where are you? >> Here I am. Here I am. How do you do? >> Why does Grandma Shark look so strange? >> Like a zombie. Grandpa Shark. >> Oh no. Run away. >> Friends, let's throw this medicine to zombie grandma shark. Come back, Grandma Shark. Hoy, ho ho. >> Oh, thank you. Hoy, did you see Grandpa Shark? >> No. Friends, let's go find Grandpa Shark. Grandpa Shark, Grandpa Shark, where are you? >> Here I am. Here I am. How do you do? >> Why does Grandpa Shark look so strange? >> I'm a zombie. Grandpa Shark. >> Oh no. Run away. [Music] Friends, let's throw this medicine to zombie grandpa shark. Come back, Grandpa Shark. Po. >> Thank you. What in the sea is going on? [Music] >> A giant zombie mermaid. >> Oh no. Run away friends. Now throw all medicines to giant zombie mermaid. Come back mermaid. Point. [Music] Thank you. Hi. >> Boy friends. Boys friends. Where are you? >> Shark family >> and Murphy. >> Hoy. >> And here I am. Here I am. Hoy boy. [Music] Uh-oh. Where are my fingers? [Music] Daddy finger. Daddy finger, where are you? Oh, [Music] I found you. Here I am. Mommy finger, mommy finger, where are you? Oh. [Music] Ah, found you. Here I am. Oh, Grandpa finger. Grandpa finger, where are you? [Music] Oh, there you are. Gotcha. Here I am. Grandma finger. Grandma finger, where are you? [Music] Aha, I see you. Here I am. Hoo! Baby finger, baby finger, where are you? [Music] Gotcha. Here I am. >> We're Halloween family. >> Happy Halloween. [Music] >> Uh-oh. Where are my fingers? [Music] Daddy finger, daddy finger, where are you? Oh. [Music] Huh? I found you. Here I am. Mommy finger, mommy finger, where are you? Oh, [Music] found you. Here I am. Grandpa finger, Grandpa finger, where are you? [Music] Oh, there you are. Gotcha. Here I am. Grandma finger. Grandma finger. Where are you? [Music] Ha. I see you. Here I am. Hoohoo. Baby finger. Baby finger. Where are you? [Music] Gotcha. Here I am. >> We're hung family. >> Happy Halloween week. [Music] Uh-oh. Where are my fingers? [Music] Daddy finger, daddy finger, where are you? Oh, [Music] I found you. Here I am. >> Mommy finger, mommy finger, where are you? Oh, [Music] found you. Here I am. Grandpa finger, Grandpa finger, where are you? A [Music] Oh, there you are. Gotcha. Here I am. Grandma finger. Grandma finger, where are you? [Music] I see you. Here I am. Hoohoo! Baby finger, baby finger, where are you? [Music] >> Gotcha. Here I am. >> We're Halloween family. >> Happy Halloween. Tada! Happy 10 years. Did I steal your heart again?",
    "start_time": 0.719,
    "end_time": 863.24
}