{
    "video_id": "eOJRCC0Xyno",
    "channel_url": "@pinkfong",
    "transcript": "Ping pong [Music] la. [Music] >> Ouch. Halloween monsters visit the doctor. >> Welcome. Welcome to Baby Sharks Hospital. Whenever you need our help, we can make you feel better. Swish. Swish. [Music] >> Which patient? Come on in, please. >> Okay. >> Come in right this way. [Music] >> Owie. Owie. My finger really hurts. Please help me. >> Can you tell me what happened? >> Just wait and see how delicious my soup is. Ow. my nails. Let's go ahead and take a closer look. Hold on. It really hurts so bad. Looks like you have badly broken your nails. >> That looks really painful. The wound could have come in contact with some nicky germs. I'll get to treating it right away. Let's clean the wound first so that it stays nice and clean. >> Now that your wound is all clean, let's smooth out the ends of your broken nails. >> Very carefully. [Music] Now, to make sure that your wound doesn't get infected, let's put on some of this ointment. >> Make sure to apply nice and evenly. >> The witch's nails are all better. >> This can't be. Don't you know that a witch must always have long nails? Make my nails long again. [Music] >> What should we do? There is one way we can glue on some fake nails on top of yours. >> How about this green one? >> I don't think these are the ones. It's delicious. But they are still not the nails that I wanted. >> Then how about this one? Yes, this is perfect. I knew long nails would do the trick. Which is broken nails are better. >> Which is broken nails. Replace it with new ones. Healthy witch. Healthy nails. You're the best baby shark. Now I'm feeling better. Thank you all. Now I am nice and healthy. Yeah. How about some of this special soup as a thank you for helping me get better? >> I'm okay. Me, too. >> Just give it a try. >> Okay. [Music] >> What's happening? We've switched bodies. >> Trick or treat. It's just a Halloween prank. Next up is a vampire patient. Come on in. >> Ouch. [Music] >> Owie. Owie. My arm is broken. Please help me. >> Can you tell me what happened? >> I'm tired. Ouch. my arm. >> Let's go ahead and take a closer look. Hold on. >> Ouch, that hurts. >> Looks like your arm is broken in several pieces. >> Oh no. I'll help you feel better right away. >> Your arm is very swollen. Let's take an X-ray to see how your bones are now. Are you ready? 3 2 1 >> Oh my. All your bones have disappeared. I'll help you find all your bones. >> No, this is a werewolf's arm. I'll pick a different one for you. That's a zombie's arm. >> This is it. This is a vampire's arm. >> That's it. That's my arm. >> Next, I think I need to make you some super special juice full of vitamins to help you gain your energy back. >> I'm starting to feel better already. Thanks, baby shark. >> Oh no, that looks just like blood. >> Vampire patient. All better. >> Crack broken arm made better. Good as new. Healthy arm, healthy body. You're the best shark. Now I'm feeling better. Thank you all. Now I am nice and healthy. Yeah. >> Huh? Where did the vampire go? I'm not sure. >> I'm right over here. >> Next up are patient skeletons. Come on in. >> Owie owie. My bones are out of place. Please help me. >> Can you tell me what happened? This is fun. >> Catch this. >> 5. >> Let's go ahead and take a closer look. Hold on. [Music] >> Looks like your bones have gone all over the place. >> I can help you put all your bones back in their places. >> H. I can't quite remember which bone goes where. Aha. I can use my magic glasses to see which bones belong to who. >> Pink, blue, yellow. Now I can see exactly who each bone belongs to. Just hang on. First, let's put together the pink skeleton. >> Put all the yellow and blue bones aside and put together the pink ones. >> Ta. All done. Next, let's work on the yellow skeleton. Put aside all the blue ones and put together the yellow ones. >> Done. >> Last but not least, the blue skeleton. >> All done. >> Thank you so much. [Music] I think I feel a lot of pain in my joints. >> Oh, if you dance too hard, all your joints are going to be super sore for sure. How about a shot to help your joints feel better? >> But I'm scared. >> Don't worry, it won't hurt one bit. [Applause] Oh, that really wasn't bad at all. Wow, we feel amazing. >> We can dance all day long. All right, >> three broken skeletons, all better. >> Spooky scattered skeleton bones all in their perfect places. Healthy pose. Healthy skeleton, you're the best, baby shark. Now we're feeling better. Thank you all. Now we are nice and healthy. Yeah. >> Let's show Dr. Baby Shark our best dance moves to show our appreciation. [Music] [Applause] Thank you, skeleton patients. I'm so glad everyone is well and feeling all better now. >> Thank you so so much, Dr. Baby Shark. >> Oh, why? You scared me. [Music] >> Where did he go? >> Right over here. >> Let's dance one more time. La. Yeah. >> Just make sure to all take it easy for now. >> Okay. >> Why don't you join me again next time, my friends? Bye >> bye. [Music] >> Hi friends. If you're sick, we'll make you strong again. This is the baby shark hospital. Huh? >> Oh, please help us. >> Oh, it's a policeman, firefighter, and a mechanic. They look really hurt. Let's treat them quickly. Come this way. [Music] First patient police officer, please come in. >> Where are you hurting? What brings you here? >> I got hurt while catching a thief. Stop right there. [Music] You have a cut on your forehead. >> Ouch. Ouch. It stings. It really hurts. >> That naughty thief. I almost caught him. Please treat me quickly. >> Oh no, the thief made you get hurt. Don't worry, I'll take a quick look. [Music] There are lots of germs in the wound. Let's catch the germs with disinfectant. This will sting a little. Phew. All done. Now I'll apply ointment to help the wound heal. Friends, let's squeeze some ointment on the wound. Great, the wound has settled down. Lastly, let's apply a band-aid. Which band-aid would you like? >> Weo. The police car pattern, please. Whale whale. Police car moving out. So cool. [Music] >> The rip. Doo doo doo doo doo. Forehead. Doo doo doo doo doo. Is he doo doo doo doo doo. Treatment done. >> Huh? The lights went out. What's going on? [Laughter] Huh? My stethoscope and bag are missing. >> How dare you steal things in front of a police officer. Stop right there, friends. Let's find where the thief is hiding. [Music] Huh? over there. >> I got you. >> How dare you steal the doctor's precious stethoscope? >> Here you go. I found your bag and stethoscope. >> Thank you so much, police officer. You're the best. >> All right, next patient. Where are you hurting? What brings you here? >> I got hurt while putting out a fire. >> You got a burn here on your leg. >> It is burning. Please help me. Ow. >> Let's quickly treat the burn before it gets worse. >> Oh no, the skin is swollen red because of the heat. Let's soothe the skin with cold water. >> No. Ow. >> Your skin has calmed down a lot. Let's put ointment on the blister. Uh, it stings so much. >> I'll apply it gently so it doesn't hurt. >> Okay. >> P, you did a really great job. Lastly, I'll bandage you up. >> Which bandage would you like? >> I'd like a cool water pattern that helps put out fires. Wow, amazing. [Music] >> Burn on your leg. Get better. Treatment done. >> Thank you so much. >> What's going on? Oh, an earthquake. Let's go under the desk. Protect your head. [Music] >> Is everyone okay? You can come out now. >> Phew, you helped me stay safe. Thank you so much. If there is an earthquake, go under the desk. I'll remember that. Where are you hurting? What brings you here? >> Heavy hammer fell right on my arm. [Music] >> It looks like you hurt your arm. >> My arm really hurts. Please help me. I should have put the hammer in a safe place. Ow. >> Uh, I think you may have broken a bone. I need to take a look. >> Let's take an X-ray to check the bone's condition. Okay, here we go. [Music] Yep, you broke a bone in your arm. Let's put the pieces of bone together. >> Hang in there. Owie. Complete. You did so well. I'll put a cast on you so your bones can stick together. First, let's put on a splint to prevent the arm from moving. And now, let's wrap the bandage. All done. You'll need to use a sling until you're all better. >> Which pattern would you like? >> Vroom vroom. I'd like a car pattern, please. Thank you. [Music] The broken doo doo doo doo ar from the hammer. Doo doo doo doo doo is treated. >> Huh? The ambulance's siren sounds strange. Is it broken? >> Leave the broken cars to me. I'll fix it right up. Finished. Wow. It would have been a problem without the ambulance. Thank you for fixing it. >> I'm so glad you're all healthy again. >> Thank you so much for treating us. >> Friends, thanks for your help today, too. Promise to stay safe and healthy everyone. >> Promise. >> See you next time. >> Bye >> bye. Ouchie. Ouchie. Ouch. Ouch. Can you help me? >> Yes. Yes. Yes. >> Ouchie. Ouchie. Ouch. Ouch. Can you help my boo boo? >> Yes. Yes. Yes. >> What happened? >> I poked a beehive and it fell down. I got stung by a bee. Oh no. >> Oh. Oh. Oh. I can make it better. You'll be fine. >> Thank you, Mommy Shark. >> Ouchie. Ouchie. Ouchie. Ouch. Can you help me? Yes. Yes. Yes. >> Ouchie. Ouchie. Ouchie. Ouch. Can you help me? Boo. Boo. Yes. Yes. Yes. What happened? >> I was trying to get my toy, but a cactus face fell right on my head. Oh. Oh. Oh. Oh. I can make it better. You'll be fine. >> Thank you, Daddy Shark. [Music] Ouchie. Ouch. Ouch. Ouch. Can you help me? >> Yes. Yes. Yes. >> Ouch. Ouch. Ouch. Ouch. Can you help me? Boo. >> Yes. Yes. Yes. >> What happened? >> I was going to eat my soup, but the slid off from my hand. >> Oh. Oh. Oh. I can make it better. Thank you, Grandma Shark. [Music] >> Ouchie. Ouchie. Ouchie. Ouch. Can you help me? >> Yes. Yes. Yes. >> Ouchie. Ouchie. Ouch. Ouch. Can you help me? Boo. Boo. Yes. Yes. Yes. >> What happened? I was showing up my cool jumps, but I fell up and twisted my ankle. Oh. Oh. Oh. Oh. I can make it better. You'll be fine. Thank you, Grandpa Shark. [Music] Itchy itchy. Ouch. Ouch. Can you help me? >> Yes. Yes. Yes. >> Itchy itchy. Ouch. Ouch. Can you help me? >> Yes. Yes. Yes. Please help. >> What happened? My sticky bandages and my cast, they are all very itchy, itchy, itchy. Oh. Oh. Oh. Oh. We can help you feel better. You'll be fine. [Music] Thank you, short. [Music] Ta. >> Happy 10 years. >> Did I steal your heart again?",
    "start_time": 0.719,
    "end_time": 1377.24
}