{
    "video_id": "IqMVZd9cDdo",
    "channel_url": "@nichlmao",
    "transcript": "[Music] Laboo spy. So, this guy's going to test out his Laboo. He whips it out. He's cutting it open and it's in there. Bro, there is no way this is real. Let's test this out. Uh, I was just at the store and picked these up. These things are expensive. All right, here we go. People are saying that you could see a camera in the eyeball. Time to chop this baby up. Oh, dang. This thing's kind of tough, you know. Damn. This is going to make it a lot easier. That's right, guys. These are the new videos that are going to be coming out every week. So, make sure to subscribe and like the video as I'm going to be trying every viral product. All right, let's keep going. This is literally red hot. Look at that. I'm just kidding. All right, this should go straight through the labu. Oh my god. Oh my god. It just went straight through it. There's no way there's going to be something in here. No way. Yo, a microphone. This is completely fake. I just put this in myself two seconds ago. Nothing in this laboo. It's empty. Empty. $60 wasted. I want my labu back. Bro, soggy cereal is the worst. Okay. Yo, honestly, whoever came up with this is a genius. Three pieces. All right, cereal on the go, guys. This This could actually be one of the greatest inventions of all time. But there's only one way to find out. I got the crunch cup. Got some the ethereal. Oh, guys, you know the mornings like when you're late for school and you just need like something like quick to eat, you can just take cereal with you. Put the charms in there. Now, we just need milk. All right, here we go. Pour it in. What we're going to do is we're going to leave this until the end of the video and see if the cereal stays crunchy. But first, we're going to give it a big shake. All right, we're giving it a big shake and now we're going to leave it until the end of the video. I'm going to have to clean this up right now. And by me, I mean my cameraman. Inflatable jet ski. It looks pretty cool. I'm not going to lie. We got it right here. Dude, this thing is a tiny box. I don't know how big the jet ski is going to be. We came to this big old lake. Let's get in, baby. All right, guys. Time to get this thing in the water. Listen to that motor, baby. Hell yeah. This was pretty easy to build. I don't know how well it's going to fly, but let's go. Here we go, guys. We're in the open ocean, baby. Speed, baby. speed, guys. I think I'm too heavy. Let me lose some weight real quick. Let's go. What the hell is moving? >> All right, guys. It's not really moving, but uh at least it supports my weight. Like, I can move around. All right. Well, final review, guys. Uh I think I'm too fat for this. So, maybe if you're a kid, this is good, but for me, this is a zero out of 10. >> All right, guys. On to the next product. Boss, shout out to these people that commented on the last video. If you want a chance to be in the next video, make sure to comment right now. This is sick. Yo, you can control how strong the blade is. Let's open this bad boy up cuz this this looks awesome. All right, guys. We got the lightsaber. Um, it looks a little bit different. I might have gotten scammed. Let's Let's load it up. It needs some butane. It needs some butane. >> Whoa. Whoa. Whoa. Whoa. Whoa. Whoa. Whoa. Hey. >> It needs some butane fuel. So, let's go fuel it up. All right, guys. Moment of truth. Let's turn on What the hell? Wait, guys. What the That's lame as hell. Let's go check in a dark room. Maybe it's too bright in here. Come on. Let's go check in a dark room. >> I mean, that's kind of cool, I guess. >> Let's see if we can cut through a piece of paper with this. >> Oh. Oh, damn. Wait, let me try that again. Oh. >> Oh, brother. This guy stinks. I'm not going to do that again. By the way, guys, because we're going to be playing with fire, we got fire extinguisher on site, you know, like we're going to have fun, but safety first. So, a popular thing they use uh butane lighters for, well, like cooking ones, is uh to sear your meat. So, I'm going to cook up a piece of steak. Make sure to wash your hands first, guys. >> All right, guys. We're putting some oil here. Ah, I'm not going to char the steak cuz I want to do that with the butane torch. It's not charred as you guys can see, but we're going to be using this to char it. So, this is supposed to give it a nice crust. And low key, it's kind of doing it. This is the side that we hit with the torch, and that's the side that we didn't. It kind of did the job. Let's cut the steak open. See what we're working with. Yeah, that's that's crazy. The side that I hit with the lightsaber is cooked, and the side that I didn't is raw. So, it actually cooked the meat. you. Now I lowkey want to try it. So, um, the lightsaber, the video looked really cool. It wasn't as cool in real life, and it kind of feels like a cheap piece of plastic. So, I'm going to give the lightsaber like a five out of 10. All right, next product. Let me go wash my hands. Okay, this toy actually looks sick. I don't know if you've ever flown one of these jets. They're lowkey hard to control. This one looks like you can literally fly it in any room. So, we're going to be testing that in my living room right now. I got the toy right here. All right, here we go. Oh my god. Oh. Yo, this thing is sick. Like, I can actually control it so easily. This toy is actually a certified banger. >> Bye. Have a great time. Honestly, guys, this thing actually worked pretty well. Like, eight out of 10. This This was actually pretty freaking sick. >> Okay. Yo, night vision goggles, guys. I've seen this in like the spy movies. Let's test this baby out. >> Let's see if the they work. I don't see anything. It's just black. What the heck? Oh, I thought it was binoculars, bro. Oh, it's actually like a camera. I figured it out. Look here. No way. Look, we can actually hit record. They should be recording now. Yo, what? Yo, this is sick, bro. I can see everything. Like, that's pretty far away, bro. What the hell is Bro, that Look at that. That looks like a alien, bro. What the hell is that, bro? What? Yo, did it just move? Oh, snap. Oh, snap. What the hell was that? What the hell was that? Oh no. It's It's It's Nova, guys. Why you run like that, bro? You got She got tired running up that hill. >> Oh, my Ugg fell off. >> Oh, her shoes fell off. This really does what it says it does. I'm going to give this a 10 out of 10. Like, it said it was a night vision camera. It is a night vision camera. It's pretty sick. So, this looks like some sort of table sand table thing. The ball moves by itself to draw. How does it know what to draw? Okay, that actually looks sick. Let's check it out. The video was like a table. This is like the size of my head already. I think we got scammed. This was like $100 to $200. Damn. Damn. Okay. All right. It's got like a cool little artwork. Oh, this I love this. You can peel off. Ready, guys? Listen. Listen, everyone. Remove the gloss. Remove the gloss. All right. All right. Now we we get the sand. Hey, sand. You kind of fine. Yo. And now we're going to have to comb it down. Oh, this is so satisfying. Yo, look at that. This is fine. All right. All right. Let's stop getting distracted. Look how tiny that ball is. Yo, here we go. Let's drop this baby in. All right. And yo, did you see that? Oh. Yo, there's some magnetic stuff going on in here. All right, guys. We are in my room right now cuz it's a little bit darker and I haven't tried it out yet, but I've connected to my phone. There are some crazy settings on this thing. So, I'm going to pick one of these artworks. I'm going to go with a T-Rex. Okay. Track added. Play. Okay. Oh my god, it started. Okay. I'm not going to lie. These are really, really slow. Oh, wait. This isn't even starting. It's just centering itself. Oh, wait. Okay. So, now it's going to go faster. Okay, guys. We we we'll come back. This thing looks insane. You already know I had to buy it. Let's test it out. Okay. Oh, what? Wait, what? Nothing's coming out. What the hell going on? Let me check the instructions. I'll be right back. >> A few minutes later. >> All right, guys. There's literally nothing in the manual that says any Why is it working now? There's one where we're going to test this. My friend is in the backyard. Let's go prank her. Hello. >> Why are you dressed like that? >> I always wear this. >> You have a gun or something? >> No. >> Why are you being weird? >> Why are you scared of me, bro? Just sit down. >> Put your hands up. >> No. No. I just straightened my hair. >> Is it going to mess up your hair? >> Yeah. >> Okay, then I won't I Oh. >> Oh my god. >> Wait, you're going home? >> Yeah. I'm going to give this like a 6.9 out of 10 cuz low key it didn't work at first. Just to do a test, I'm going to shoot myself to see what it feels like. Ready? Okay, it's strong. Also, here's a video of me testing out at night. I haven't done it yet, so I don't know if it's cool or not, but yeah. This is what it looks like. So, I don't know. All right, guys. It's time to check in on the sand art. Anything happened? It's still going. Okay. Wait, I don't want to spoil it. It's still going. It's still going. Just have to come back later. All right. Next product here with my coach. Are you ready? >> Are you ready? >> I'm ready. All right. Here it is. >> Watch it. >> What does that even do? >> You're the coach. You're supposed to tell me. We got to test it out. We got to test out. >> What was he doing? He's like, \"O the doctors.\" Look, the Look, the doctors recommend it. All right. Yo, coach. >> No, that's crazy. Let's test it out. >> This was the box it came in. It took me 3 seconds to assemble. It was literally just three parts. I'm going to test this out. >> I'm nervous for you, to be honest. >> All right. Are you ready? Get out. >> Why are you looking at me and doing it, bro? That's just like weird. Am I doing good, coach? Here, why don't you try it out? You tell me. Cuz like I'm the student. Like, I need your your professional advice. All right, coach. Let's see what you got. >> It's not bad. It's just I need more resistance. I think my legs are too strong. >> So, basically, we're too strong. >> Yeah. >> So, for beginners, what do you what do you rate this product? >> Nah, I'll give it a five out of 10. >> I give it a seven out of 10. Come on, coach. It hurts. Got to keep going. Can't give up. >> All right, guys. It's been another 40 minutes. Let's check out the artwork. It It has to be done. It's finished. Yo, guys. This thing looks crazy. Take a No. I tried to tilt it to show you guys the artwork, but it's sand, so it all just fell apart. Ah, this thing does work. It's pretty expensive. I'm going to give it a 8.5 out of 10 cuz it it does what it says, but I can't believe that that's an hour. That's 2 hours of my life wasted. Smart trash can. It It apparently it does all the bagging for you. I'm very lazy. So, this is helpful. Let's test it out. Smart trash can. Why is it already open? Shut up. >> Okay, >> I got lazy. I wanted I got I wanted I wanted I wanted to see it. Okay, I didn't want to wait. But yeah, I haven't tested it out yet. Guys, there's two warning. Do not place flammable, explosive, burning, or smoking objects in this product. Well, I was there. That's what what what else are you supposed to throw in here? Am I right? Uh, and number two, if the garbage in the trash can exceeds the height of the heating wire, please use the overload packing function or press the garbage down below. Let's turn this bad boy on. Oh, snap. I'm going to throw my phone away. It's the only thing I have right now. My phone's in there. All right, guys. So apparently if I just hold this button, it's going to cut it open. Yo, what is going on right now? I can hear it, but I can't see it. Oh, wait. It's a mystery. No way. This thing actually works. Okay, look at this. It's completely sealed. Like it it's like airtight. Well, now I popped it. But my phone was in there. I want to see it happen. Like I'm going to leave the lid open while it's doing its work. All right, guys. We're going to be trying to overflow this trash can. So, I'm going to just put in a bunch of like regular trash that we have lying around and see what happens. This is what it looks like. Like, that's pretty full. Oh, what the hell? What the hell, Leonte? Yo, is it just going to like throw another Bro, what am I even saying right now? You guys know what I'm trying to say. Look, I'm going to take this out. So, we got one trash there. And then when I close this, yo, it double throws it away. It just throws away your extra trash. That's sick. All right, guys. I got an odor bomb here cuz it said no smoky bums. So, I'm putting a smoke bum in there. What are they going to do about it? All right, we're putting it in. Okay. Oh snap. Oh snap. All right, guys. Here's this bag. We removed it. And then look at this. Yo, five stars. fives, 10 stars, 10 out of 10. >> All right, guys. That's it for the products. Uh, I'm going to try out the Crunch Cup to see if the cereal is still crunchy. But before I do that, thank you guys for watching the video. These are going to be the new type of videos that I make. I'm going to be more myself, more authentic, and actually try to have fun with the videos. Got a ton of cool videos coming up, you know, like you guys can see some of them there. Uh, but yeah. All right, let's taste this. Here we go. It works. It's still crunchy. Subscribe",
    "start_time": 0.12,
    "end_time": 823.279
}