{
    "video_id": "R_IBH5B7C5E",
    "channel_url": "@dbillions",
    "transcript": "Mommy baby. Mommy. Mommy. Mommy. Mommy. [Music] [Music] [Music] Daddy. Uh-oh. Baby goo. Daddy. Uh-oh. Baby goo. Daddy. Daddy. Daddy. Ya. [Music] [Music] [Music] Oh. Oh, baby. Na. Oh, baby. D choo choo [Music] moo. Uh-oh baby. Baby [Music] [Applause] [Music] jump. [Music] [Music] No, no, no. Catch go up high. Get it quick. Bye-bye. [Music] [Music] Pinky dinky dinky. No, no, no. Go go dinky. I'm so high. [Music] [Music] pinky. No. I high [Music] [Music] No, no, no. Go go I fly queen. Bye bye bye. [Music] [Music] What you going to do now? Play. No. What you going to do now? Sleep again. No. Hey, what should I do? Do like this. Like this? Like this? Like this? Like this? Like this? Like this? Like this? Like this? Like this? What you going to do now? Eat. No. What you going to do now? Dance. No. Hey, what should I do? Do like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. [Music] What you going to do now? No. What you going to do now? Jump. Jump. No. Hey, what should I do? Do like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. What you going to do now? Play. No. What you going to do now? Slip again. No. Hey. What should I do? Do like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. What you going to do now? Eat. No. What you going to do now? Dance. No. Hey, what should I do? Do like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Like this. Who are you? Who are you? I'm Chacha. I'm Cha. I'm Cha. I'm Cha [Music] Cha Cha Cha. [Music] Who are you? Who are you? I'm chicken. I'm chicken. I'm chicken. I'm chicken. Chicken. Who are you? Who are you? I am Lala. I am Lala. I am Lala. I am Lal. [Music] Yeah. Who are you? Who are you? I am Bumbo. I am Bumbo. I am Bumbo. I am Bumbo. H boom boom boom boom boom boom boom boom boom cha cha boom boom boom chicken chop [Music] cha Boom boom boom boom boom boom t la. [Music] Keep your eyes open. No, it's you. [Music] Mommy. Mommy. Mommy. Mommy. Mommy. Super super mommy. Mommy. Mommy. Mommy. Mommy. Mommy. Super super mommy. Remember, always wear a seat belt. I'm hungry. What are you doing? [Music] Mommy mommy mommy mommy. Super super mommy mommy mommy mommy mommy mommy super super mommy. Healthy food makes us happy. [Music] [Music] Mommy mommy mommy mommy super super mommy mommy mommy mommy mommy mom mommy super super mommy be careful and take care of each other. [Music] Mommy mommy mommy mommy super super mommy mommy mommy mommy mommy super super mommy remember together we are stronger. M yummy yummy yummy yummy yummy. Oh yummy yummy yummy yummy yummy yummy. So yummy. Lemon and tomato. I like it. I like it. Lemon and tomato. I like it. I like it. M. Yum. Yum. Yum. Yum. Yum. I like it. Yum. Yum. Yum. Yum. Yum. I like it. Yummy. Yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, yummy, so yummy. Onion watermelon. I like it. I like it. Onion watermelon. I like it. I like it. M. Yum, yum, yum, yum, yum. I like it. Yum, yum, yum, yum, yum. I like it. Yummy, yummy, yummy, yummy, yummy. So yummy. Yummy, yummy, yummy, yummy, yummy. So yummy. Apple and banana. I like it. I like it. Apple and banana. I like it. I like it. M yum yum yum yum yum yum. I like it. Yum. Yum. Yum. Yum. Yum. I like it. Yummy. Yummy. Yummy. Yummy. Yummy. Yummy. Yummy. Yummy. Yummy. Yummy. Breads and carrots. I like it. I like it. Bread and carrot. I like it. I like it. M. Yum. Yum. Yum. Yum. Yum. I like it. Yum. Yum. Yum. Yum. Yum. I like it. M. I like it. Tomato. M. Yum. Yum. Onion. M. I like it. M. Yum. Yum. Apple. M. I like it. Banana. M. Yum. Yum. Grapes. I like it. Carrot. Yow. Meow. [Music] Y so much. So much [Music] [Music] So much daddy. [Music] Okay. [Music] [Music] Woohoo! So much so much. [Music] Wow. Woo. Woo. [Music] So much so much. [Music] [Music] [Music] What is it? What is it? What animal is it? What is it? What is it? What animal is it? A cat. [Music] What is it? What is it? What animal is it? What is it? What is it? What animal is it? A dog do doggy dog do dog. It's a dog doggy dog. I'm a dog doggy dog. I'm a dog doggy dog dog. What is it? What is it? What animal is it? What is it? What is it? What animal is it? Oh, it's a big big [Music] I'm a beg. I'm a big be. What is this? What is it? What animal is it? What is it? What is it? What animal is it? W Froggy frog frog froggy frog frog frog. I'm a  froggy frog frog. I'm a frog  frog froggy frog frog. I'm a beep beep beep beep beep. I'm a cat cat. I'm a dog dog dog. N frog frog frog frock frog. Baby baby bubbles. Baby baby bubbles. One 2 3 four bubbles. Hey baby baby bubbles. Baby baby baby bubbles. Baby rainbow bubbles. I want a baby. Little drop la. I want a little word. Baby wor [Music] baby bubbles. Baby baby bubbles. Baby wiggles bubbles. Baby baby bubbles. Baby baby bubbles. Let's go with those bubbles. I want a ble [Music] la. I want a ble [Music] la. [Music] Baby bubbles. Baby baby bubbles. Beautiful baby bubbles. Baby baby bubbles. Baby baby bubbles. Run for baby bubbles. I want a butterfly. butterfly la. [Music] I want to track and fly. Dragon and fly la. [Music] Baby bubbles. Baby, baby bubbles. Baby bubbles. Baby bubbles. Baby baby bubbles. Baby bubbles. I want to go baby la. I want a one big la. I want to baby la. I want to be la. Do you believe in magic? Magic. Magic brush. Come on, let's do some magic. Magic. Magic brush. [Music] What the is [Music] up? [Music] [Music] Do you believe in magic? Magic. Magic rush. Come on, let's do some magic. Magic. Magic brush. Woo! [Music] Magic. Magic. Magic. Crush. [Music] Do you believe in magic? Magic magic brush laush. [Music] Magic brush. [Music] What? Oh no, a little star has tumbled from the sky. But how can we help it get back to its daddy and mommy? Let's build a paper airplane. [Applause] [Music] Here we go. Flying to the sky. Shining, shining, shining to the sky. Yeah. Flying down to the sky. Oh no. Crush them. Now let's build a helicopter. Yeah, right. Fantastic. Perfect. Let's go. Come on, baby star. You will do it. Shining, shining, shining in that sky. Yeah. Yeah. Uh-oh. Back to the ground. Shining. Yeah. Yeah. Wow. Balloons. 1 2 3 4 5 6 7 8 9 10. It's enough. Let's go. Look, it's in the sky. So when you fly, you find it in that sky. Shining, shining, shining in that sky. Oh no. Follow you shining. Yeah. Yeah. Don't worry. I got an idea. How about a rocket? Yeah. Right. Good job. Yeah. 3 2 1 go. It's worked. Well done. Shiny shiny shiny sky. Finally, our little star is going to meet its family. Shiny. Yeah. Yeah. Woohoo. You did it. [Music] 1 2 3 4 5 Let's see. Let's see what's inside the egg. Let's see. Let's see. Surprise eggs. Crack. Crack. Crack. [Music] Green. One 2 3 4 Let's see. Let's see what's inside the egg. Let's see. Let's surprise. Crack. Crack. Huh? Crack. Wow. 1 2 3. Let's see. Let's see what's inside. Let's see. Let's see. Surprise. Crack. Crack. [Music] 1 2 Let's see. Let's see what's inside the egg. Let's see. Let's see. Surprise egg. Crack. Crack. Red. Crack. Yellow. [Music] [Applause] Hey, [Music] let's see. Let's see what's inside the egg. Let's see. Let's see. Super super egg. Let's see. Let's see what's inside the egg. Let's see. Let's see. Super super crack. [Music] Wow. What's this amazing place? It's a banana magic forest. Who are you guys jumping around the trees? We are silly monkeys. We love bananas. One and two and three bananas. One, two, three, three bananas. Four and five and six bananas. 4 5 6 bananas. Seven and eight and nine bananas. 7 8 9 bananas. 10 and 11 and 12 bananas. 10 11 12 bananas. Wo! Was this amazing place? It's a banana magic forest. Why you jumping around the trees? We are silly monkeys. We love bananas. One and two and three bananas. One, two, three, three bananas. Four and five and six bananas. 4 5 6 bananas. Seven and eight and nine bananas. Nine nine bananas. 10 11 and 12 bananas. 10 12 bananas. Wow, what's this amazing place? It's the banana magic forest. Who are you guys jumping around the trees? We are silly monkeys. We love bananas. One and two and three bananas. 1 2 3 bananas. Four and five and six bananas. 4 5 6 bananas. 7 and 8 and nine bananas. 7 8 9 bananas. 10 11 12 bananas. 10 11 12 bananas. Wow. What's this amazing place? It's a banana magic forest. Jumping around the trees. We are silly. The monkeys will like bananas. One and two and three bananas. One 2 3 bananas. Four and five. And six bananas. Four and six. Six bananas. Seven and eight and nine. Bananas. 7 8 9 bananas. 10 and 11. 12 bananas. 12 bananas. [Music]",
    "start_time": 4.799,
    "end_time": 1828.27
}