{
    "video_id": "rsSoxjxa-xw",
    "channel_url": "@dbillions",
    "transcript": "Hello. Yellow. >> Yellow. >> Hello. Blue. >> Blue. >> Blue. >> Hello. Red. >> Red. >> Yellow. >> Blue. [Music] Red. Wait. It's color is great. Great great color is great. Great great color great la [Music] [Music] is great. calories. Break great calories great calories. [Applause] La yellow la [Music] red gray yellow gray great red gray great great gray color is gray gray great gray Calories great great calories great great calories. [Music] [Laughter] Am I soft? M. >> Yes. >> Am I green? H. >> No. Am I long? >> Yes. Am I yellow? Huh? Yes. >> Ah, I am banana. >> Banana. Banana. >> Dancing with banana. >> Banana banana. >> Dancing with banana. Hello. M. No. >> Am I big? Yum. Yum. Yes. Am I sweet? M. Yes. Am I green? M. Yes. Ah. I am watermelon. >> Watermelon's green. >> And very very big. >> Watermelon. Green. >> And very very big. >> Am I wrong? Yes. Am I pink? Uh-huh. Mhm. No. Am I red? Yes. Am I tasty? Yeah. Yes. Ah, I'm an apple. >> Apple. Apple. Apple. >> I'm playing with an apple. >> Apple. Apple. Apple. >> I'm playing with an apple. >> Emma's blue. Huh? >> Yeah. >> Am I pretty? >> Yes. Am I yellow? Huh? >> Am I sweet? Huh? Yes. H. I'm strawberry. >> Strawberry. Strawberry. >> Very slow and pretty. >> Strawberry. Strawberry. >> Very soft and pretty. >> Am I proud? Yes. >> Am I green? >> No. >> Am I juicy? >> Huh? >> Yeah. >> Am I big? >> No. >> Ah, I'm an orange. Orange. Orange. Orange. Yummy. Yummy juice. Orange. Orange. Orange. Dance. Dance. Dance with me. La banana. >> Dancing with banana. Watermelon's green >> a very very big >> apple apple >> I'm playing with an apple >> strawberry strawberry slow and pretty >> orange yummy yummy juice with banana and where [Music] I play with an apple very small and pretty. [Music] >> Hi friends. Today we are going to learn some polite words in American Sign Language. Let's go. Say thank you. Thank you. Nice and loud. Say thank you. Thank you. Feel so proud. Hands to mouth then push away. Thank you. Makes a happy day. Yeah. [Music] >> Thank you. >> Say please please say please please all the one circle. Say please. It's kind and sweet. Yeah. Wow. >> Wow. >> Please. Say sorry. Sorry. It's all right. Say sorry. Sorry. [Music] Do you just say sorry today? >> Yeah. [Music] Say I love you loud and true. Say I love you. Me and you. Make l y. This how I say I love you and I. Yeah. And now all together. Say thank you. Thank you. Thank you. >> Say please. Please say sorry. Sorry. >> Sorry. >> Say I love you. >> I love you. >> Thank you. Say please. Please. Please. Say sorry. Sorry. Sorry. I love you. [Music] Are we there yet? Are we there yet? >> Not yet. >> Are we there yet? Are we there yet? >> Not yet. >> Are we there yet? Are we there yet? >> No. No. Hey, Cha. Let's play a game. 1 2 3. This are mountains. >> Mountains. >> This is an eagle. Here you go. >> Wow. >> This is a river. >> Reaper. >> This is a wolf. [Music] >> Are we there yet? Are we there yet? >> Not Not yet. >> Are we there yet? Are we there yet? >> Not not yet. >> Are we there yet? Are we there yet? >> Oh, no. No. Hey, Chacha, let's play a game. >> One, two, three. These are heels. >> Heels. >> These are sheep. >> Sheep. >> Yeah. This is a butterfly. >> Butterfly. >> This is a snake. [Music] Are we there yet? Are we there yet? >> Not not yet. >> Are we there yet? Are we there yet? >> Not Not yet. >> Are we there yet? Are we there yet? >> No. No. Hey Cha, let's play a game. 1 2 3. This is >> This is the sailboat. >> sailboat. >> This is the rainbow. >> Rainbow. These are bees. Wow. [Applause] [Music] >> Are we there yet? Are we there yet? >> Not. Not yet. >> Are we there yet? Are we there yet? >> Not. Not yet. >> Are we there yet? Are we there yet? Oh no, no. Hey, Chach, let's play a game. M 1 2 3. This is a field >> field. >> Yeah. This is a mermaid. [Applause] >> This is a ladybug. >> This is a [Music] I am puppy. Woof woof woof. >> I am chicken. Coof cof. [Music] I'm kitty. Meow. Meow. Meow. I am puppy. >> I am chicken. Co. >> I'm kitty. Meow. >> Meow. Meow. Meow. Co. >> I'm monkey. >> I am puppy. >> I am chicken. I'm kitty. I'm monkey. >> C. Meow meow meow pa. >> Meow meow co. >> Meow meow. [Music] >> I'm donkey. [Applause] >> I'm cow. Moo. Yeeha. Yeeha. >> Moo. Moo. Yeeha! Yeehaw! [Music] I am ship! I'm donkey! Yeehaw! [Music] Yeehaw! Yeehaw! [Music] Yeehaw! [Music] >> I am wolf! Oo, I'm donkey. Yeeha! I'm cow. I'm shoo. [Music] Oh h hey hey hey. >> Aha. >> Magic make a turn it all and sing a song. Magic make a phone. Try to sing along. Boom boom boom boom boom boom boom boom boom boom boom. >> Magic make a phone. Turn it on and sing a song. Magic make a try to sing along. Laoo la. >> Magic make a fun. Turn it on and sing a song. Magic make a fun. Try to sing along. Chicky chicky chicky chicky chicky chicky chicky chicky chicky chicky chicky [Applause] magic make a phone turn it and sing a song magic make a phone try to sing along cha cha boom boom boom la Let's get [Music] [Laughter] La boom boom boom la >> boom boom la >> boom boom la boom boom boom boom boom boom boom la boom boom boom boom la boom Boom boom boom boom boom boom boom boom boom cha boom boom cha boom boom >> cha ba boom boom cha boom boom [Music] boom boom la boom boom laa la chaa La Cha [Music] [Music] boom boom la boom boom la ba boom boom sticky sticky sticky [Music] La [Music] chal cha. [Music] A >> baby snake. Baby snake. Shake. Shake. Shake. >> Baby, baby. >> Stomp stomp stomp. >> Baby monkey. Baby monkey. >> Clap clap clap. >> Baby rabbit. Baby rabbit. >> Jump. Jump. Jump. Okay, kids. Faster. >> Baby snake. Baby snake. Shake. Shake. Shake. Baby pan. Baby pit. Stomp. Stomp. Stomp. Baby monkey, baby monkey, clap, clap, clap. Baby rabbit, baby rabbit, jump, jump, jump faster. Baby, baby, shake, shake, shake. Baby, baby, stop. Baby monkey, baby monkey, go. Baby, baby, jump, jump, jump. Baby sleigh. Baby sleigh. Baby panda. Baby panda. Baby monkey. Baby monkey. Baby rabbit. Baby rabbit. Baby. Say shake. Shake. Baby. And the song. Baby monkey. Clap. Clap. Baby. Jump. Jump. Baby. Say shake. Shake. Baby. The song. Stop. Baby monkey. Baby. pop [Laughter] [Music] monkey. >> Does monkey love honey? >> Does monkey love lemons? Does monkey love banana? >> Yum, yum, yum, yum. [Music] That's you love orange. >> That's you love case. >> That's you love corn. >> Yum. Yum. Yum. Yum. Yum. [Music] Does Bunny love candies? [Music] Bunny love cherries. Does Bunny love carrots? >> Yum, yum, yum, yum. [Music] >> Does mommy love apples? That's popular. That's popular. [Music] Yum. Yum. Yum. Yum. [Music] [Music] [Applause] like a bunny dress yellow. >> Who is it? [Music] >> She's so smart. You [Music] Kyoo. [Music] [Applause] [Music] [Applause] Woohoo. Yeah. [Music] She's so pretty. She's so beautiful. [Music] >> Who is it? [Music] One, the billion. Two, the billions. Three the billions. Four the billions. Four the billions. [Music] One. 4 2 the billions three the billions for the billions for the billions [Music] Two defense three four [Music] the Three. [Music] Four. The video. Four. The video. [Music] Yummy, yummy, yummy, yummy. Fruit juice. Fruit juice. Yummy. Yummy. Yummy. Yummy. M. Fruit juice. Orange. >> No. >> Pineapple. >> Yeah. >> Yummy. Yummy. Yummy. Yummy. Fruit juice. Fruit juice. Yummy. Yummy, yummy, yummy. >> Fruit juice. Peach. >> No. >> Apple. >> Yeah. >> Yummy. Yummy. Yummy. Yummy. >> Fruit juice. Fruit juice. Yummy. Yummy. Yummy. Yummy. [Music] Cherry. Onion. >> Yeah. Yummy. Yummy, yummy, yummy. >> Food juice. Food juice. Yummy. Yummy. >> M. Food juice. Kiwi. Strawberry. [Music] Yummy. Yummy. Yummy. [Music] [Applause] I love you. [Music] Let's go. Wow. Roll. Swim. Swim. Swim. Swim. Wing. Wow. Row. Swim. Swim. Swim. Swim. [Music] Let's go. We can We can go up. We can We can go up. [Music] We are going into [Music] runway away run away. We can we can go down down. We can we can go down down. Wow. Wow. [Music] >> Hi. >> Uh-oh. >> Aha. Cha cha cha. Chop chop chop choos. [Music] [Music] Wow. Wow. Wow. Wow. Wow. Wow. Launcher. [Music] Booger. A [Music] chick. [Music] Salam. [Music] >> Today is the Thanksgiving day. Happy happy Thanksgiving day. Let's get ready. Let's get ready to celebrate with all my family. I'm thankful. I'm thankful for your family. I'm thankful. I'm thankful for my I'm thankful. I'm thankful for this. I'm thankful. I'm thankful for today. The Thanksgiving day. Happy happy Thanksgiving day. Let's get ready. Let's get ready to celebrate with all my family. I'm thankful. I'm thankful for my family. I'm thankful. I'm thankful for my health. I'm thankful. I'm thankful for this meal. I'm thankful. I'm thankful for Thanksgiving. Today is the Thanksgiving day. Happy happy Thanksgiving day. Let's get ready. Let's get ready to celebrate with all my family. I'm thankful. I'm thankful for my family. I'm thankful I'm thankful for my health. I'm thankful. I'm thankful for this meal. I'm thankful. I'm thankful for Thanksgiving. [Music] Grandpa, give me butter. >> What? >> Grandpa, give me butter. >> What? >> Grandpa, give me butterflies. [Music] >> Butterfly. Butterfly. Fly fly. Butterfly. Butterfly. Fly butterfly butterfly fly butterfly butterfly butterfly. >> Grandpa, give me a boo. >> Grandpa, give me a grandpa. Give me a spoon. Give me Give me Give me Give me Give me Give me Give me Give me. >> Grandpa, give me the Grandpa. Give me the >> Grandpa. [Music] What? and time. >> Give me time. Give me time. Give me Give me Give me Give me. >> Grandpa, give me pepper. >> What? Grandpa, give me give me bonus. >> What? Grandpa, give me pizza. >> What? >> Pepperoni. >> Pepperoni. >> Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. Pepperoni. [Applause] [Music] I like milk. You like milk? We like milk. It gives a super power. When I drink, when you drink, we don't drink. We become super heroes. Super trouble's always on my way. Super super. I like milk. You like milk. We like milk. It gives a super power. When I drink, when you drink, we don't drink. We become super hero. Super super hero. Trouble's always super super [Music] strong. I like milk. You like milk. We like milk. It gives a super power. When I drink, when you drink, we don't drink. We become super heroes. Super hero. Trouble's always my friend. Super super catch her cha has a clever mind. I like milk. You like milk. We like milk. It gives a super power. When I drink, when you drink, we don't drink. We become super hero. Super super like hero. Trles are afraid. Super super hero. Nana has a magic track. Super super super hero. [Music] Super super super hero. We are super [Music] >> I love my daddy and he loves me too. He always whatever I do. He's so strong. But I like that. Never mind. That's my dad. He'll always act without any problem. He knows what to do. He's my biggest. That's a real super bad hero. She helps me everywhere. I love my daddy and he loves me too. She always doesn't m strong. [Music] That's my dad. She's always been there for us. She act without any fight. She knows my problem. He knows what to do. is my biggest hero. That's the real super. [Music] >> Oh, I love my daddy and he loves me too. He always cares about whatever I do. He's so strong. King Kong never mind. That's my dad. He's always best for us. He's a guy and it's always love. You know what to do. He's my biggest hero. That's the real super hero. She's always so scared. Super her. She helps me everywhere. I love my daddy and I love me. Whatever I do, she's so strong with the but always being without any problem. and know what to do cuz the biggest hero super [Music] she's always super she helps me everywhere. Ooh. Oh yeah. Be like [Music] I like to move g move. You like to groove groove groove. Shake up the ground. Be like I like to move. You like to groove groove. Shake up the ground. We like to move like Ky dance with Ky move like Ky dance. I like to move move. You like to groove groove. Shake up the ground. You like to I like to move move. You like to prove groove. Shake up the ground. Ground ground. We like to move like Ky dance with Ky. I move like heads dance. I move like I like to move. You like to move. Shake up the ground. Ground ground. Be like. I like to move move. You like to move bro. Shake up the ground. Ground ground be like [Music] I like to move. Move move. You like to move groove. Shake up the ground. Ground ground. You like to I like to move move. You like to move groove. Shake up the ground. Ground ground be like, [Music] >> what is it? >> It's an orange. >> No, it's an apple. >> No, it's an orange. >> It's an apple. I am an apple. Apple apple. >> I am an apple. Apple apple. >> What is it? >> It's a llama. >> No, it's pizza. >> Pizza lemon. >> It's pizza. >> I'm pizza. Pizza. Pizza. Pizza. Pizza. I am pizza. Pizza. Pizza. Pizza. >> What is it? >> I think it's a cake. >> And I think it's cheese. >> No, no, no, no. It's a cake. >> It's cheese. >> I am cheese. Cheese. Cheese. Tasty. Tasty cheese. I am cheese. Cheese. Cheese. Tasty. Tasty cheese. >> Hey, look. What is it? >> Maybe it's H. I'm sure it's pumpkin. >> No, I think it's a light light bulb. La light bulb. I'm a light light bulb. La la la la la la la la la la la la la la la la la la la la la light b. Ah. [Applause] When I grow up, I will have wings to fly. When I grow up, I will fly away into the sky. When I grow up, I will be rising high. When I grow up, I will be a beautiful butterfly fly. [Music] When I grow up, I will have wings to fly. When I grow up, I will fly away into the sky. When I grow up, I will be rising high. When I grow up, I will be a beautiful butterfly. Fly, fly, butterfly, fly, fly, butterfly, fly, fly, butterfly, fly, fly. When I grow up, I will have wings to fly. When I grow up, I will fly away into the sky. When I grow up, I will be rising high. When I grow up, I will be a beautiful butterfly. Fly fly butterfly fly butterfly fly wonderfly. [Music] [Laughter] Hi kids. Hi. Hi. Hi. >> Fell. Let's look. >> Oh, slippers. >> Mangoes. [Music] Apple. Sweet apple. Hi kids, I'm Leila. Huh? What fell? Let's look. >> This is banana. >> Watermelon. >> This is banana. >> Ah, it's banana. [Music] Sweet banana. Sweet banana. Hi. Hi. Hi, I'm a chicken. What crap? Let's go. This is sweet. [Music] Hi kids. How are you? Huh? What? Well, let's look. [Music] >> Ah, orange. Orange. Orange. Orange. Orange. Sweet. Orange. Orange. Orange. Orange. Orange. Sweet. Orange. N. [Music] [Applause] [Music] Wow. Where am I? Where am I? Where am I? Where am I? >> What the heck is this? >> Huh? >> No. >> No. >> No. Yeah. [Music] [Applause] Where am I? Where am I? Where am I? Where am I? Whose footprint is this? Yeah. Where am I? Where am I? Where am I? Where am I? Whose silhouette is this? [Applause] [Music] Please save us. >> Oh no, my friends are in danger. We need to save them. >> No. [Music] [Applause] Christmas presents. Have some fun. They look yummy. Just get wine. Christmas presents. Have some fun. They look yummy. Just get one. A pumpkin. An apple. A candy cane. [Music] Yeah. >> Christmas presents. Have some fun. They look yummy. Just get one. Christmas presents. Have some fun. They look yummy. Just get one. A bunny, a donut, a cheater. [Music] >> Christmas presents. Have some fun. They look yummy. Just get one. Christmas presents. Have some fun. They look yummy. Just get one. A chocolate and ice cream. Wow. A Christmas party. [Music] Have some fun. They look yummy. Just get one. Christmas presents. Have some fun. They look yummy. Just get one. A banana, [Music] a car. [Music] [Music]",
    "start_time": 7.2,
    "end_time": 2851.78
}