{
    "video_id": "OwNcuqH6eh0",
    "channel_url": "@primevideoin",
    "transcript": "Bhai agar paise de rahe hai  toh mai tattoo karwa lunga yaha pe Amazon Are maathe pe likhwa lunga mai to Prime Welcome to Amazon Prime Laxmi Nagar ka sign board bana diya bhai moo ko Apne knives pehen ke chalo Mere papa ko bula lete hai Bhai mujhe gaadi seekhni hai Bhai aaj hum dekhenge Horror Movies Tujhe darr kya lagta hai horror ka? Bhai mere ko na, sone mein phir vo lagta hai Koi aa gaya toh? Mera toh bachpan ka bhi scene hai, Papa waala… Haan phir koi bhoot aise choom ke chala gaya sar pe toh dar lagta hai Koi galti se aashirwad na dede Guys, humari pehli payment aa chuki hai Toh we are starting with the first episode of Prime Mates Meri favorite movie chala rahe hai horror mein, which is The Grudge Bahot suna hai iss movie ke baare mein, but kabhi dekhne ka dum nahi huya Aaj apne bhai ke saath hai tu Yehi toh load hai Shuru toh hone de Deemak Yeh haanikarak hai, aap na kare Oh bhai Hihihihihihihi ohhhhhhh Upar le gaya hahahahahaha Vishamrit khel rahe the bhai Bhai mai bata raha hu mujhe darr lagta hai mat kar Are kya huya, kuch huya hi nahi Oh bass khatam? Itni hi honi chahiye horror movie Tune akele dekhi thi ya kisi ke saath dekhi thi? Akele Kyun? Kyun hi caption likhe idhar? Bhai bhoot ko hum logo ka attention span nahi pata kya Itne mein toh 6 reel dekh lete Meri itni reels miss ho gayi hai yeh dekhte huye Oh shittttt Bhai mat kar Kya kara maine? Mat kar… Bhai band karde bhai Kya band karde, abhi toh maza aa raha hai Tu darr kyun raha hai? Bhai maine Hindi karwaya hi isliye tha taaki kuch fun ho, yeh bolte hi nahi, daraye jaa rahe hai Koi kahi nahi hota bhai hamesha Dekhiyo Poora khaali Chup chaap ise ghar jaake so jaana chahiye Isko bol mat kar lalaaaaa Yeh bhi poora khaali Sahi kar rahi hai, bhaag ja, chup chaap bhaag jaa Bhai pata nahi kaha chali gayi Tu nahi darta mujhe toh de Toh thand to lagti hai… Kya huya? Yaha se kyun awaaz aa rahi hai? Abe kuch nahi aa rahi, tu chal na Abe tu pagal hai kya Kripya motor band karde? Ye sab kar kyu rahaa hai? Terko kya milega? Merko daraa ke kya milega? NSFW warning dedi hai ji Mai sona chahta hoon, merko ni dekhni aur horror movie Yeh sach mein bahot achhi hai, sach mein one of the all-time greats hai in the horror Konsi movie hai? Tumbbad naam hai bhai Badiya movie hai, sach mei Thodi der dekhenge lekin “Fake Promises” Bhai, choti se pakkad liya bhai Oyeeeeee x 2 + bhai bhai bhai Apne knives pehen ke chalo Residue bhai Ruined the most famous dialogue of the film Yeh mera sabse kharab sapna hai, ki mai hotel mein sota reh gaya aur naashta khatam ho gaya Duhh! Horror mein scary hi dekhenge na bhai? Which I HATE Ab darr lag raha hai na tujhe?  Darr bhagane ka ek hi tareeka hai, darr ke saamne jee lo Jee liya Dogesh bhai wants to know your location Bhai mai, tu, Saransh jaate hai, apna yeh jo saamne waali building hai na jaha construction ho rahi hai tabse, thoda little little… Saransh bhi aayega?  Haan  Phir mai tum dono ke haath pakad ke chalunga.  Haan koini tujhe beech mein bithayenge jaise bache ni sote mummy papa ke beech mein vaise sulayenge.  Dad jokes na hi kare toh achha hai… Ye tumhe raat ko hi kya chul padi bhai yeh nikalne ki? Iska na kya scene ho raha tha ke horror movie dekhte huye iske haal kharab ho rahe the, bass dare jaa raha tha. Saransh crying in the corner Thoda bahot hume bata dega, iska darr door kara dega Dekho mai kuchh claim ni kar rahaa, maine suna hai ki jab ye building ban rahi thi, to kuch to accident hua tha jismein chaar log gir gaye the  uske baad se ye building band hai. Mai wahaan rehta hoon maine wahaan se dekha tha ki yahaan se koi to chal ke jaa rahaa tha  Yaa to hamare jaise koi hoga Yahi le ke aaya hoga kissi aur ko Mai yahaan pe tour guide baitha hoon? Bhoot Darshan Saransh tu bhi na. Bhai! Bhai ruk! “Something Sus” Bhai, kuchh hai koi aaya hai yahaan par recently! “Nami?” “Man v/s Wild?” Dr. Salunke ban ke check karna ek baar. Bhai lekin Saransh ko ye sab jagaah pataa hai to matlab isko bhooton ka darr to nahi hai Kissi ek cheez ka to darr hota hi hai sab ko. Yaar, kaam waam kuchh ni hota bas Yaar, kaam waam kuchh ni hota bas, baaki sab kuchh bhi karaa lo. Bhai, aaj hum sab ke darr dur nikaalne nikle hai. Iska darr khatam kar dein? Haaan Kooda padaa hai bohot ghar pe Isse sofa saaf karaa lete hain Meri naa flight ka time ho rahaa hai Kahaan jaa rahaa hai? Abbe phone to dete jaa. Abbe chal apshabd. Abbe phone to dete jaa. Abbe chal apshabd. Are chal apshabd. Bhai, next hum dekh rahe hain - “Khauf” Start kar de. Mera waise to bilkul bhi mann ni hai. Yeh toh vohi bandi hai Yaar mujhe hamesha lagta hai jumpscare ke baad koi naakhun kha raha hota hai koi random cheez kar raha hota hai Kuch alag si cheez kar raha hota hai Apshabd Apshapd Apshabd Passengers after 2 hours delay More Apshabd Gaali de rahi hai Kya bol rahi hai yeh? Iss video mein mat dena Mai aata hu zara washroom se, bahot zor ki lagi hai Bhai rukja bhai, scene aa sakta hai koi bhi Beech mein meri ho gayi toh phir mera surprise ho jayega Bhai tu dekhna bhai, aise scene aa rahe hai, rukja abhi baith jaa. Bhai akele mat jaa, mai nahi dekh paunga Kya dara hua hai, sher puttar hai tu  Sahi mein akele nahi dekha gaya Kaustubh tune giraya hai kya kuch? Kitchen mein??! Chal chup chaap, saath mein baith Saath mein kya baith yaar? Kya course mein complete kya huya? Uska haath tod diya ek bandi ne. DP battle mein haar gayi? Uske sar pe eenth maar raha tha. Yeh kaisa stereotype hai bhai usne usse bahadur pucha? Bahadur bass naam, uska adjective nahi, bass naam. uska adjective nahi, bass naam. Nahi mai toh kamzor hu thodi bolega yar Bhai iski toh haalat kharab hoti chali gayi Oh bhaisahab! Iski kisi ne nahi suni. Bass bhai, bass Kaisa laga, Khauf dekhli humne Yeh to zyada darawani lagi mere ko Tujhe Grudge se bhi zyada darawni lagi? Haan kyun ki Grudge Hindi mein bhi dekhli na humne Oh, vo counter ho gaya Yeh to proper Hindi mein darawani thi. Bhai mai toh… Ab ek cheez kare, bula le? Kya bula le? Bhai mai laaya tha uujuuyaaa board bhai All thanks to Amazon Prime Bhai jab…dost kum ho jaye na To bhai isme kya hai ki koi bhi aap sawaal pucho jo bhi spirits hai aapke paas they will say yes or no Aap objective questions puch sakte ho Mere papa ko bulate hai Mujhe gaadi seekhni hai Goa mein bandi chalati rehti hai gaadi Bhoot se puchhte hai, are you a are you a boy? Bhai, inhone tease kiya - Y pe aate hue, Nooooooooooo Doosra mera sawaal hai, kya Madhur aisa hi rahega? Adjectives… More adjectivesssss. Ek answer mein sab niptaa dega? I think hamara ho chuka hai Mera to ho hi gayaa hai Abhi lagta hai aap logo ka bhi sone ka time hogya hai I hope aap logo ko PRIME MATES ka pehla episode pasand aaya ho Did the bhoot like the episode? Y, oooohhh. “Would you rather” bhi puchh le Would you rather...",
    "start_time": 0.0,
    "end_time": 530.92
}