{
    "video_id": "t3SZHVb5eV8",
    "channel_url": "@primevideoin",
    "transcript": "He is looking at you\n with completely different eyes.  Yeah. Even I'm feeling it.  -We discussed this.\n -Yeah.  Now he feels like\n you are a mother figure.  -Yeah.\n -Yeah. But you know, he is--  Mother figure… To whom?  -Mother!\n -Dude!  He used to call me mom  -even before, right?\n -Yeah.  -Amma.\n -Amma.  Sorry, I said Mom.  He used to call me  \"Amma!\"  Both of you have been\n married for three to four years now.  Tell me something.  Do you see your partner\n through rose-tinted glasses, or has  it come to a point where you're like,\n \"Boss, let me put on my beer goggles\"?  -Kombucha goggles…\n -Has reality slapped you?  Yeah. Has reality slapped you?  I won't speak on his behalf.  But I will speak on his behalf.  Because he has known\n his wife for many years.  They were in school together.  And I think my partner and I also, like…  Ranbir and I\n have a very natural friendship.  So it was never like a dewy eye or\n rose-tinted glasses sort of relationship.  There was always a relationship\n like best friends.  I mean, of course,\n I married him for a reason  because I think he is wonderful\n to me and just as a human being.  But 100 percent, the person\n I love trolling the most is him.  And the person he loves trolling\n the most is me.  So I think that is a very natural\n dynamic between two people.  -So that hasn't changed?\n -No.  I mean, it's changed\n after we've had a daughter.  Like, it's totally different.  I mean, it's just a… We are a unit now.  It's way more of a unit\n than it was perhaps before.  And Varun, what about you?  I fell in love with Natasha,\n I would say maybe, in the fifth  -or sixth grade.\n -Wow!  Like, when I first saw her\n on the basketball court the first time.  And then obviously it's\n like… whatever it was in  school, we are not going\n to take it too seriously and all…  But I think, when we became friends,  I just found her to be a very kind  and an amazing human being,\n which I felt I didn't have these traits.  I said, I don't have these traits.  So I always looked up to her for\n the traits she had as a human being.  -As a human being?\n -Yes.  So even now, after all these years,  for me, when I just see\n her playing with Lara…  -Yeah. Same.\n -it's the most amazing visual.  I just see her…\n I just stare at her.  And… sometimes she's like,\n \"Stop staring. Even you carry her.\"  I'm like, \"Yeah.\"  -\"Do some work.\"\n -Yeah. You do it too.  But I just love seeing\n her play with Lara.  -I feel like that is love, you know.\n -Yeah.  It's like heartbreakingly…  -Beautiful.\n -amazing.  -Beautiful.\n -You are using the word \"love.\"  And I'm asking you, what does\n love have to do with marriage?  Do you think it's an integral part?  Does it change?  I think respect\n is the most integral part.  Because with respect comes\n all the other great things.  Which is support and love…\n In whatever form.  Whether it's, you know,\n affection, physical, or emotional.  But respect for me,\n I think, is paramount.  The most important thing in\n a marriage, in a union.  For me, I think it's adaptability.  Because situations\n and people, they just change.  Like, every now and then,\n life will just throw a curveball.  Something will change.\n Something will happen.  Some situations when…  So at that time, each partner\n has to be able to adapt.  -Sometimes it's going to be her--\n -Leaning more toward…  -Carry on.\n -Sometimes it's her and sometimes it's me.  It's like a see-saw.  -I'm just seeing her.\n -Are you telling her to learn from me?  -Not at all.\n -No?  She is a master.  What do you think?  -I'm not a master for sure.\n -Yeah, what do you think?  It must be… Is it tricky\n with Singham? Or…  \"Tricky with Singham?\"  \"Tricky with Singham?\"  That's not the title of our show.  -Okay. Got you. Tricky with Singham!\n -It's a good title, though.  -It's a very good title.\n -Tricky with Singham.  -I like it.\n -You should ask him.  She does gymnastics.\n Nothing is tricky for her.  No. Gymnastics would be for you.  \"Stunts with Khiladi.\"  \"Tricky with Singham\n and Stunts with Khiladi.\"  Sometimes you do everything that--  -See, I told you he is a marketing expert.\n -Yeah!  -No, they're just names.\n -\"Tricky with Singham  -and Stunts with Khiladi.\"\n -Khiladi.  -Yeah.\n -Fab!  -With Khiladi, I think it's better.\n -Amazon has its next show.  Yeah.",
    "start_time": 0.066,
    "end_time": 223.2
}