{
    "video_id": "InllBbl6bvU",
    "channel_url": "@primevideoin",
    "transcript": "What name will we\nkeep for our shop? Collage of colours! Hey! The name should be easily\npronounceable. Spit! The people who try to be fresh\nwith their sisters, do you... -...know what are they called?\n-Since when... - One minute, quiet, quiet. Before DM ma'am reaches,\nI have to defecate and get out of here. And I have to show her\neveryone's true colours. It means anybody can ask\nfor a loan and they get it? [CHUCKLES] Is it a bank or Shirdi's Sai Baba? You should just have a shop! Did you see that? Gradually\nthey will reveal things. They want this!\nThen they want that! Nothing! Just a shop in a nice area. The bank will give\nyou 4 lakhs as loan. From that give 2 lakhs to\nthe company, as a deposit. Then go to any company! Be it a soap company or a\nstationary company. Okay. The company will give\nyou goods worth 5 lakhs. Nowadays people buy\nthings so quickly. They way white ants eat the wood. So it will take maximum\n1 month to sell the goods. The profit is 20%. So how\nmuch is monthly profit? 1 lakhs! - How much is the bank loan?\n- 4 lakhs! Yes! So within 4 months,\nyou will repay the loan. In the 5th month,\nthe shop is yours. In the 6th month,\nyou will have 1 lakhs. - And in the 7th month...\n- Stop! Stop! Repeat what all\nthings are to be done! Fill the loan forms. Sign it. Then the shop's\npapers, the Xerox... ...and 10-12 Xerox copies of\nthe ration card and passport. File the papers neatly. And express your good\nintention to the bank. But from where will we\nget the shop's documents? Fool! Yes! What name will we\nkeep for our shop? Collage of colours! Hey! The name should be easily\npronounceable. Spit! At last you have shown your status! Keep this name for\nyour betel shop! Spit! What happened? What's the matter? The sister got scared!\nThe sister got scared! -He tried to touch me in the bathroom.\n-What? But sister, I was seeing\nhow brave you are. You'll check your sister's\nbravery in the bathroom? [GRUNT] The people who try to be fresh\nwith their sisters, do you... -...know what are they called?\n-Since when... Since when is she your sister? Good that you people came.\nIf you had not come then... ...I don't know what he would\nhave done to me today? What is this... Listen you chaste woman,\ndo not try to act smart. Yesterday, when he had come\nto your room then you... ...were jumping all round\nand enjoying. What are you saying? What have I done? Did you hear that, sir? This so called\nchaste woman is asking what she has done. Last night when he came to\nyour room, you said nothing. And now you started to scream? Tell me, what special qualities\ndoes he have which I don't? Stop it! Hey, what are you whispering? We can't understand what you are saying. The thing is that there\nis no subtitle below. Listen! Don't try to act smart.\nYou're back answering? You're back answering? I'll blast... ...your head and break your nose. We people eat Chinese,\nwe don't understand it. - Give twenty kicks?\n- Twenty kicks? - Give twenty lakhs.\n- How will you kick him 20 times? Not kicks, I'm saying 20 lakhs,\n20 lakhs, hey 20 lakhs. - It doesn't look good.\n- They will beat us. Keep quiet! Not 20 kicks, 20 lakhs. - I will explain. I will explain.\n- Oh God... Shut up! I'll give it. Hey, you get ready. - I will remove my slippers\nand give you 20 kicks. - Brother Babu... Smarty, don't you understand? What were you saying\nafter removing the slippers? I had told you that I'll give\nyou 20 kicks in the brain. - 20 kicks. Give me Tiwari's money.\n- One minute, quiet, quiet. You people are blabbering since when. Move. ...she had a fight with her husband. Husband!? You mean... Tanya got married? Did I ever say that she is married? Did I? Actually, she is a widow. In fact, she is a double widow. Her first husband was very good.\nHis only vice was smoking. One day he was smoking\na cigarette and it blew up. Blew up!? He was at a petrol pump and it blew up. And the second husband? He was like God. He had no bad habits.\nBut he was forgetful. One day,\nhe got up from bed and took his bath. For his breakfast he had bread,\njam, butter, cheese... But he forgot the most important thing. - Bread?\n- No, his breath. He forgot to breathe. Because he had acute breathing problem. [INDISTINCT] [SOBBING] Both the husbands passed away... ...but I've seen how\nmuch she loves her kids. Kids!? She has kids too? She has 6 healthy kids. Six kids? How can she have six kids in three years? Twins! A pair of twins each year. Hey! What are you doing? There was someone there, wasn't it? Where? No one is there. I am telling you, someone was there. There is no one, ma'am. It must\nbe like a mirage or something. Have you lost your mind?\nCan a mirage be seen in fields? It was a mirage. There was someone there. Move aside. -Let me go!\n-Quiet. Look, Praladh, before DM ma'am reaches,\nI have to defecate and get out of here. And I have to show her\neveryone's true colours. What are you saying?\nHey, hold his pants. I am telling you, I\nwill do it in the pants. Fine. You can do it in the\npants but not in the fields. Throw his water away. The lid is shut. Throw the bottle away. Have you lost your mind? I called you home to\ndefecate. Why didn't you come? You threw away my water? I will defecate without water now. Hey, Vinod... I will defecate without water now. I am folding my hands\nand requesting you. -I am folding my hands.\n-You are folding your hands? Is this how you fold your hands? Two people are grabbing me\nand you are saying... We had to do this because\nof the way you were behaving. -Please listen to us.\n-Vinod, son, listen to me. The village has been declared as ODF. If DM ma'am sees you defecating here,\nthe honour of our village will be lost. Aren't you bothered about\nthe honour of the village? Who will do it if not you? This boy is acting very selfish. It's just a matter of\nanother seven days, Vinod. I will arrange for you to\ndefecate wherever you say. Right? Isn't it? Who's there? What is going on here? Nothing... ma'am. I am Vinod... Vinod...",
    "start_time": 0.0,
    "end_time": 420.4
}