{
    "video_id": "d2LIFSwG0W8",
    "channel_url": "@nickjr",
    "transcript": "Help! I'm stuck in the spiderweb. >> I'd love to help you, Yumi, but I'm lost in the maze. >> We need the Paw Patrol. Now, remember, I want my costume to be scary, but not too scary. No problem. >> How about this? >> Wow. >> Uh, what am I? >> You're a vampire bat clown. I want to trick or treat. >> Hi, Farmer Yumi. How's Halloween at the haunted farm? >> So far, it's been all tricks and no treats. I got hung up hanging a spiderweb and Al and Garby are stuck in the trick-or- treat maze. We're on our way. No farm is too haunted. No pup is too small. Paw Patrol to the lookout. Marshall, watch out. Wo! Trip or treat. [Applause] [Music] >> Wow, cool. Awesome costume. >> Why, thank you. I mean, um, yeah, it's a cool costume. Trick and treat. [Music] >> Sorry kids, I'm all out of treats. >> Hey, no candy. [Music] That kid is taking all the treats. There won't be any left for us. Grandpa, we got to call the Paw Patrol. >> Happy Halloween, Mr. Porter. >> Ryder, a kid in a giant spider costume is taking all the treats. >> We're on it. No spider is too big. No pup is too small. >> Paw Patrol to the lookout. >> Ryder needs us. [Music] Wo wo. >> That's my trick. Now I'm ready for a treat. [Music] Paw Patrol ready for action. Rider. Sir, pups. Our Halloween trick-or-treating will have to wait. A kid in a giant spider costume is taking all the treats in Adventure Bay. So, for this mission, I'll need Chase. I need you to use your megaphone, cones, and net to get the spider under control. Chase is on the case. And Marshall, I need you to use your X-ray screen to find out who's inside the costume. I'm ready for a rough ruff rescue. All right, Paw Patrol is on a roll. Paw Patrol. [Music] Heat. Heat. If it is a ghost, he can't steer. >> Well, all I know is we need to get this ship back to shore. Let's check out the steering wheel. [Music] >> Marshall Zuma, >> you meant us, too. Nothing to worry about. >> Something must be wrong with that steering wheel. >> Sorry. So, that's who's been steering. Chickaletta. There's your Halloween ghost. [Music] >> Oh, you saved her from the ghosts. Thank you, Ryder. And thank you, pups. >> You're welcome, Mayor Goodway. >> Actually, Chickaletta was the ghost. She was moving the steering wheel. Oh, was your naturalb born leader just like her mommy? [Music] >> Well, that's definitely not Chickaletta. >> Let's see what it is. >> Help. Help. Help. [Applause] [Music] I'm guessing our ghost is behind these barrels. I'll tell him to go get lost. >> Oh, Ryder, don't. >> Pups, I'm kidding about the ghost. >> Zoom. Marshall, it'll be okay. >> Ryder, be careful. Okay, everyone. Here's your ghost. Wall-Ally's snores echoed behind the barrels, making that spooky sound. >> And it was Wall-E who ate all the cookies. [Music] Wa! The sails again. That's got to be a ghost >> or a sneaky cat. Callie, you silly kitty. Mystery solved. >> Yeehaw! Shoe pro. Shoo! I'm a scarecrow. All aboard. Cool costume. >> Nice. Boo. >> It's okay, pups. It's only Ryder. >> Is the Big Adventure Bay Halloween party ready yet? >> Almost. Marshall's helping Mir Goodway set it up right now. >> Thank you for helping me put up the decorations for the Halloween party, Marshall. >> You're welcome, Mayor Goodway. >> Oh, there's my Cinderella Chickaletta. Ready to help her fairy godm hand treats. Oh, aren't you the sweetest little princess chicken? Mary Goodway, you have pup and kid treats, too. Yum. And thanks. >> The Halloween party is the last stop on the trickor treat route. I want everything to be ghosttacular. >> H. Hi, Alex. Hey, Mr. Porter. Great costumes. >> Thanks. We're the great Portini and his magic bunny. Abracadabra. Tada! >> It's a pumpkin pie. >> Oh, perfect. Marshall, can you top it off with some orange marshmallow cream? >> I sure can. >> Canon. >> Oh dear. Where's my hearing? >> It's over there. Sticky. >> Sorry. I'll go clean that up. >> No, don't. I love it. It looks like a scary orange spiderweb. >> Okay, then I better get back home and put on my costume. See you soon. >> Be careful, Cinderella Chickaletta. This marshmallow web is sticky, huh? Well, well, looks like there's a party tonight. And where there's a party, there are party snacks. Right, kittens? [Music] Presenting [Music] Her Highness, Princess Sky of Puck Sylvania. >> Dressing up in costume is my favorite part of Halloween. >> My favorite's trick-or-treating. >> I can't wait for Captain Turbet's ghost ship party. >> They say the ship's haunted. It sounds super scary. >> It's only scary if you believe in ghosts. [Music] [Music] It's just Chase hanging up a Halloween decoration. Told you there's no such thing as ghosts. Coming through. Wa! That'll make a perfect jacko'lantern. I'll get the top off with my super jacko-lantern scooper. [Music] Now I'll pull the top off. Got it. Oh, this goo in my dew makes me blue. [Music] Happy Halloween. >> You're silly, Grandpa. >> So glad you could make it to my haunted ship Halloween party. >> This is going to be just so much fun. >> Great job fixing up this old ship. >> Thank you. Just trying to be the host with the most ghosts. Hello everyone. Oh, Mr. Porter, I can hardly wait to try your delicious Halloween cookies. Ooh, smells like corn, worms, and feathers. Mirror Goodway, I think you're smelling your purse. Oh, yes, my purse chicken. Wait till you see Chickaletta's adorable costume. >> Hi, everybody. Check out the adorable costume I got for Callie. She's a pirate. >> Huh? >> Ladies, gentlemen, cat and chicken. Legend has it this pirate vessel once sailed the waters of Adventure Bay with a ghost crew. >> Kelly's kind of a scaredy-cat. >> Well, Chickaletta doesn't believe in ghosts. Neither do I. So, there. >> Grandpa, is the ship really haunted? >> Nah. It's fun to play at being scared sometimes, but there's no such thing as ghosts. Now, step up to the gang plank and climb aboard. If you dare. >> Nothing to worry about. Come on, Callie. [Applause] [Music] >> Camping out is the best. Nothing beats fresh air or fresh marshmallows. Just look at that big, beautiful full moon. >> Full moon? Oh, that reminds me of a story. Ain't sure I should be telling it, though. It might be a bit scary. >> That's okay. It's fun to hear scary stories around the campfire. >> Yeah. >> All righty then. Back in the day whenever there was a full moon, people got real careful about going outside cuz that's when it could come creeping and a pimping and a prowling and a howling. They call it the wild rare puppy. Yuck. Guess I have to wash this off like with water. [Music] >> Tell us more about were puppies, Uncle Otis. >> Well, they're mighty strong and can jump super far with a howl you can hear for miles. >> I wouldn't want to meet a wear puppy. I'd be too scared. Me, too. What do you do if you run into a were puppy? >> Well, you can change him back into a regular puppy by taking him to Sunflower Valley. One sniff of a sunflower turns them back into cute little puppies. >> Back. So, how do cute puppies turn into bear puppies? >> Legend has it that a puppy's got to be standing in water that's reflecting the full moon. standing in water. Rocky, >> what? Do I still have marshmallow on my nose? >> Oh. Uh-oh. >> Rocky, >> you know that the were puppy is just a fun, spooky story, right? >> I know, Ryder. I'm not going to turn into a were puppy. That'd be silly. >> Okay, good night, buddy. Green means go to sleep. [Music] Is someone there? Ah, it must have been a raccoon. H I'm kind of thirsty from eating all those marshmallows. I'm a where puppy. Oh no. Huh? Who's there? I don't want to scare my friends. I got to fix this. Uncle Otis said a wear puppy can change back by sniffing a sunflower. I got to get to Sunflower Valley. Green means go. [Music] Huh? Wa! [Music] Hey, where'd this hole come from? >> Little Hoodie. >> Phew. I mean, I knew that wasn't a ghost. But that's a ghost. [Music] I made it. My turn. My turn. My turn. Don't worry. I'm good. Well, not good at jumping, but you know what I mean. Now it's my turn. >> Rocky, where'd he go? Uh, Rubble, did you dig a hole in the middle of the yard? I didn't dig that. I fell in the hole last night, too, when I heard the Uh-huh. Well, uh, heard the what? Oh, nothing. Just little hoodie, I guess. Hey, pups. How's it going? Not so great, Ryder. Someone's been digging holes and leaving toys all over. >> H Maybe some wild animal was prowling around last night. >> Or some wild ghost. >> Ghost? >> No way. >> Spooky. >> It's definitely a mystery. Well, I saw something last night and it looked pretty ghosty to me. [Music] W sounds like pup boogie in the middle of the night. Okay, you you uh pup boogie monster, come out. Huh? [Music] >> Ghost, >> it's okay, Rubble. It's just me. Yeah, sorry. But I did just see a white thing floating outside and heard someone playing pup pup boogie. >> Maybe someone forgot to turn off the game. But that bag of puppy treats wasn't out here when I went to bed. It's definitely a ghost. We'll figure it out, Rubble. No job is too big. No pup is too small. [Music] Trick or treat. >> I have some treats. Do you have a trick? >> I have a trick. Yep. May I have a treat? >> Very nice. >> Want a shake? >> What a gentleman. Here you go. Tada. >> Outstanding. Hey, check out my robot dance. >> Excellent. You get a treat. >> Thank you, my lady. >> I can. >> Great stunt. You deserve a treat. [Music] [Music] [Music] [Applause] Why is the sail going up on its own? [Music] [Music] Oh no, now the other sail is going up too. And now we're sailing away. I didn't realize this party included a cruise. >> I can't wait for Ryder and the pups to get here. They're going to love the ghost ship party. >> This ghost ship is so cool. [Music] Wait for me. [Music] >> I wonder who's sailing the boat. >> Captain Terot, where are you? [Music] A sea monster. Where? A talking sea monster. Where? It's no sea monster. It's just Captain Turbet. >> A talking turbet. Can you sail us back to the dock? >> Yes, of course. Except I seem to have misplaced my glasses in the uh uh ocean. I can't see anything without my specs. Sorry, Alex. It's mere good way. See, I can't see. But it feels like we're going faster. Oh dear. We're trapped on a rickety old pirate ship with a captain who can't see and a crew of ghosts. Chickaletta and I don't believe in ghosts. But we have to do something. And then it jumped right over the road and made that loud. Ryder, these are the same paw prints I saw near our camp. Sounds like a were puppy to me. The tracks are heading straight for Sunflower Valley >> where a big old sniff of sunflowers will change a wear puppy back. >> But if the were puppy started from the cabin and Skye hasn't found Rocky. >> Does that mean I didn't believe it, but I think Rocky might actually be the were puppy. We got to get to Sunflower Valley. >> I know a shortcut. I'll go on ahead while you finish helping here. >> The sunflowers. I made it. I sure hope they work. >> The legend is true. It is a wear puppy. >> Uncle Otis, don't worry. I'll get you out. >> Rocky, is that you? Better hurry. I've got some big furry company in here. Thanks, Rocky. >> Rocky, it is you. >> Please don't be scared. >> How could we be scared of you? You just saved me with them powerful were puppy paws. >> But I'm scaring everybody else. >> Then take a big sniff of them sunflowers. In a little bit, you'll be right as Rain >> or right as Rocky. All this running and jumping and howling has made me sleepy. >> Then let's get you back to camp. It's a bed. Come on. >> Huh? Is someone there? Go away, bear. >> Huh? Huh? It's just me, Rocky the were puppy. Wear puppy. Sounds like somebody had a pretty exciting dream. >> But you sure put a scare in that bear and saved our marshmallows. Thanks. >> Huh? >> I did. Well, if you're ever in trouble, just howl for help. [Music] >> Super spy chase is on the case. >> Hi, Chase. Good hiding spot, huh? Why do I always forget the tail? >> Come on, Rocky. Let's build that trap. The cookie goes here, and if anyone tries to take it, this bell will ring, and the air nozzle will blow the sheet onto the intruder, catching them. Unless it's a ghost. >> Ghosts don't usually eat dog treats. >> You're right. Unless it's a dog. Ghost. [Music] Hey, Chase. How's everything? >> In position, Ryder. Stand by. Night vision goggles. All clear. >> Great job, Spy Chase. I'll check on the other pups. Over and out, rider sir. Suction cups. [Music] An intruder falling rider. Chase is on the case. Zipline. Ah, I caught the ghost. What? A ghost? A ghost? Really? Pups? No, it's me, Ryder. >> Oh no, the ghost got Ryder. >> No, Rubble. The ghost didn't get me. The trap did. >> Sorry, Ryder. I saw something following you. >> That was me. That's okay. You were both trying to help. Guess we should keep looking. >> Yeah. Hear that? It's the pupa boogie monster. I better check this out. [Music] H. It was a ghost. It is kind of a mystery. I need all paws on deck. Skye, Zuma, Marshall, meet me in the backyard. My grandpa always tells me to eat my veggies to grow up healthy and strong. And now Farmer Yumi's animals will be healthy and strong, too. Alex, I don't think Farmer Yumi wanted you to pick all those o veggies. See, the animals love my salad. Looks like the flora loved it, too. Yuck. Now it's time for animaler robics. Animal what? Now animal robics. If you want to be healthy, exercise like me. Hooves up. Now, wings. Let's go. Okay, I'll go put the wagon away. I'll be right back. [Music] >> Good luck, Francois. May the best turbet take the trophy. Messy, I will. But don't worry, cousin. I'm sure you'll get second place. >> Thanks. Hey, good afternoon everyone and welcome to the first annual tour deter. >> On your marks, get set, jump. Great jump. >> Jump. Jump. You can do it. [Music] >> Alex, what are you doing? Jumping jacks. I let them out of the barn to give them more room to exercise. They shouldn't be loose out here. Let's get them back into the barn now. But we're having fun. Wee! This is fun. [Music] >> Alex, wait. No. Stop. Come back. Oh no. They're heading towards town. I'd better call Ryder. >> Let's get this big one. >> Okay. Hey, Skye. Do you pups need some? Huh? Help. I'm just in the way here. Maybe I can help somewhere else. H. An old rain gutter. Perfect. Don't lose it. Reuse it. [Music] Here comes Rubble on the double. Paw Patrol is ready to roll. Pumpkins. >> There must be something I can do. [Music] >> Marshall, the pumpkins. Marshall, watch out. Uh-oh. Marshall, you okay? >> I'm okay. >> You look good in orange. >> Oh no, the farm is a mess. >> Pups, this isn't how we get the job done. >> We totally got in each other's way. >> H Chase, now I've got a job for you. >> What is it, Ryder? Sir, >> we need you to direct traffic around here. Yeah, Chase would make a great traffic cop cuz well, he is a traffic cop. >> What are we waiting for? >> Paw Patrol, let's roll. [Music] >> Rocky's fruit shoot. Ready for action. >> Give it a try, Ryder. >> Don't lose it. Reuse it. Keep them coming, Rocky. Use your truck to help Rubble. [Applause] Rubble, take it away. Come on in, Rocky. [Music] Zuma Sky, ready your pumpkins. Go, Zuma. Pumpkin pad left. Got it. Skye, roll yours right. Rolling. >> Oh yeah. Uh-huh. We got apples. You can ask your parents to subscribe to the Nick Jr. YouTube channel for new videos every week and find more of your favorite shows on TV on Nickelodeon and the Nick Jr. channel.",
    "start_time": 3.679,
    "end_time": 1892.88
}