{
    "video_id": "73TP2AfEUos",
    "channel_url": "@nickjr",
    "transcript": "[Music] Skye, Chase, Marshall, Rocky, Rubble, Silver. Let's go. Paw Patrol to the rescue. To the rescue. Paw Patrol to the rescue. >> Rubble saves Halloween. [Music] [Laughter] >> There it is, kitties. The giant pumpkin. If we steal that, the Foggy Bottom Halloween party will be so much better than Adventure Bay. [Music] Move you silly vegetable. Ah, who turned out the lights? Woohoo! Woohoo! Wow! I can't wait for this year's Halloween party. All that trickor treat candy. Yum, yum. Just got to fetch that big pumpkin from the farm. Huh? >> Somebody help >> the pumpkin rubble on the double. >> Wo wo wo. I can't see. >> Hello there. Uh, Mr. Pumpkin head, >> get this dreadful vegetable off me. >> Uh, I think it's a fruit. >> Oh no, the pumpkin's heading right before the Halloween party. I have to do something. [Music] Yeah, Halloween is safe. >> It was horrible in there. >> Mayor Humper, you're Mr. Pumpkin Head. >> Not on purpose. [Music] You did it, Rubble. You're my hero. I mean, um, I had everything under control. >> No problem, Mayor Humdinger. It was easy peasy. Trick or treaty. Paw Patrol to the basket. Skye, Chase, Marshall, Rocky, Rubble, Zoomer. Let's go. Paw Patrol to the rescue. To the rescue. Paw Patrol to the rescue. >> Zuma's Octopus Rescue. [Music] >> This new buoys underwater alarm gizmo will scare all the sea life away from Adventure Bay and make them go to Foggy Bottom. Aha! [Music] It's working. Have fun in Foggy Bottom. >> Huh? Uh whoa. What's that noise? I need to check this out. Ready, set, get wet. [Music] That's right. Go to Foggy Bottom, my fishy friends. Uh-oh. Shoo. You tentacle troublemaker. I'm too handsome to be Octo. I must be getting closer because the sound is getting totally louder. Paw Patrol help. >> Oh, that was quick. >> What's that noise, Mayor Humdinger? >> Ha. None of your business. Just save me. >> Claw. >> You got to be kidding me. >> The alarm save the octopus. How do you turn it off? >> Oh, okay. Fine. I just need to press the red button. >> Do it, dude. Awesome. [Music] >> Not fair. My suit. [Music] >> Skye, Chase, Marshall, Rocky, Rubble, Zoomer. Let's go. Paw Patrol to the rescue. To the rescue. Paw Patrol to the rescue. >> Liberty in the Water Geyers. [Music] What a gorgeous day outside of Adventure Bay for exploring the desert. [Music] There should be gold around here somewhere. Huh? Sweet golden nuggets. [Music] This desert is so serene and fast. Water. That ain't right. Liberty, help me. Don't worry, Uncle Otis. I am ready to pro. >> I got to catch him. Thanks, Liberty. >> Wa! I knew there was gold out here. >> Uncle Otis, wait. >> Would you look at that? >> Look out. I'll save you. Come on. Gotcha. >> Thank you, Liberty. It's a shame I lost the gold nugget, though. It was just perfect. [Music] >> You were safe. [Music] Skye, Chase, Marshall, Rocky, Rubble, Silver. Let's go. Paw Patrol to the rescue. To the rescue. Paw Patrol to the rescue. >> Everest snowside rescue. >> Great work, Everest. Everyone's going to be stoked about the new path. >> You betcha, Jake. >> Check out my new trick. I call it snowway like Jake's way. That looks just like an avalanche. Jake, look out. Am I surfing? >> Off the trail. Everest won't fail. >> Jake, hold on. Grappble. Where's Jake? Huh? [Music] Help. >> I'm coming. Jake, he must be stuck in the cave behind all that snow. Jake, are you okay? >> Hurry, Everest. It sure is cold. [Music] It's getting even colder. >> I'm still I'm ready to go. [Laughter] >> You saved me, Everest. But uh I'm really cold. Thanks, Everest. Nice and warm. Now, how about a race to the bottom? >> You bet, Jake. >> Paw Patrol time. >> Skye, Chase, Marshall, Rocky, Silver. Let's go. Paw Patrol to the rescue. To the rescue. Paw Patrol to the rescue. >> Tracker rescues the golden chicken. Mirror's treasure hunt is so much fun. The golden chicken must be around here somewhere. I want to be the first to find it. What was that? [Applause] Nope. No way I'm going in there. I really don't like the dark. But what if the golden chicken's in there? Maybe someone's lost in there. I've got to check. [Music] [Applause] >> Uh, hello. Anybody need rescuing? [Applause] >> Was that a yes or no? Oy, oy. >> The golden chicken and Mayor Goodway. >> Tracker. Thank goodness. Chickaletta and I were placing the golden chicken here for the big treasure hunt, but now we're seeking a quick send. Help! >> Oh, Chub's trying not to panic. >> Oh, Savio, hold on. >> Oh no, the truck's too heavy. Here goes rough keyboards. [Music] I got it. I'll pull you out. >> Oh, thank you, Chucker. >> Uh-oh. >> Thank you, Tracker. Why is the cave shaking? >> Caveman, he's got to get out of here. Hurry, Tracker. Tracker. The doorway. >> That was too close. >> Thank you, Tracker. And this golden chicken is yours. Congratulations on winning the treasure hunt. >> Whoa. Thanks, Mayor Goodway. Patrol to rescue. [Music] >> Skye, Chase, Marshall, Rocky, Rubble, let's go. Paw Patrol to the rescue. To the rescue. Paw Patrol to the rescue. >> Rubble and the runaway birthday cake. >> Oh. Oh. Can I open my eyes yet? >> Just a moment, Rubble. You can open them now. [Music] >> Happy birthday. >> Wa, this is so awesome. Thanks, Mr. Porter. >> Of course, Rubble. Anything for a friend of the cafe. And besides, baking this was a joy. It gave me a chance to try out my new vanilla recipe. And the touch of cinnamon just Oh. Oh no. >> Mr. Porter, >> I need to get the cake. >> Don't worry, Mr. Porter. Rubble's on the double. [Music] [Music] Look out. Runaway cake. [Music] >> Mr. Porter, turn left. >> The other left. I've never driven a trolley before. [Music] >> Wa! That'll stop the trolley. >> Huh? [Music] Mr. Porter is headed to the water. [Music] [Music] Nice one, roll. >> Uh-oh. [Music] [Laughter] Talk about a piece of cake. >> You save the day, Rubble. Happy birthday, >> Paw Patrol. >> You can ask your parents to subscribe to the Nick Jr. YouTube channel for new videos every day and find more of your favorite shows on TV on Nickelodeon and the Nick Jr. channel.",
    "start_time": 0.04,
    "end_time": 954.399
}