{
    "video_id": "1tK7Ks3emaA",
    "channel_url": "@nickjr",
    "transcript": "Hello, Mr. Nibbles. Oh, he's so cute. >> I think Mr. Nibbles has done the trick. >> And so cuddly. >> Our work here is done. Come on, Tommy. We've got our magic to practice. >> And so fluffy. >> Just like, >> it's okay, Tia. Why don't we >> There it's okay, Mr. Nibbles. Get something yummy to eat. Here you go, Tia. Ah, strawberry ice creams are the best. >> Yay. M. This is my favoriteest. Yummy. >> Great. That means me and Tommy can get back to >> Dy's favorite, too. Dus, >> we're never going to get to do any magic now. Yes, we will. Uh, hey Tia, how about we um uh take a rocket ride through the stars. [Applause] >> Come see the stars up in the sky. >> So many stars here way up high. >> Look, pictures made of stars. >> She's having fun so far. What sort of pictures do you see? >> I see a giant bumblebee. >> Hey, look, a birthday cake, a rocket ship, >> and a big woolly mammoth. It's task. [Music] >> Oh, I can't believe it. >> Cheer up here. Tusky will be done soon. >> Yeah, I'm sure if we go home now, he'll be washed and clean and ready for cuddles. >> Really? >> Really? >> No. [Music] Just a tiny bit more waiting to do and then Tusky will be out and ready for cuddles. >> But I miss him so much. [Music] >> It's okay, Tia. Let's find something else to do. Even if we never get to do any magic. >> I wish I could magic this washing machine to stop. >> Tommy, you're a genius. Wait, why? Tia, I have the perfect thing to take your mind off Tusky. And we get to do magic. [Music] >> Welcome to my Jurassic Magic show. >> And this is my assistant, Magic Tommy. >> Yes. Biggest fans right here. >> Today, I shall perform my greatest trick and pull a curly Astro Bunny out of this magic box. But how will you do that? Magic, Tim. Your box is completely empty. With magic. >> Wow. Now we say the magic words. A brotherloaptor. And go. Uh-oh. I can't find the Bossaurus. Keep the show going. I need more time. Maybe if we get Mom and Dad to say the magic words. Mom and dad. The raptor >> found it yet, Tommy. No, keep going. I know. >> Tia, why don't you say the magic words? >> Aba, >> anything yet, Tommy? >> No. Keep going. [Music] >> Are you okay, boys? >> Yeah, we're all right. How do we get out of here? >> Thanks, Dad. >> Sorry, everyone. Our show is a disaster. We're never going to cheer up Tia. >> Why don't you check inside your magic box, Magic Tim? [Music] [Applause] Oh, Tusky. He's so fluffy and cuddly and he smells like fresh moon flowers. Come on, Tusky. You miss so much today. I saw Mr. Nibble and had ice cream. >> Wow, Tim, that was astro amazing. How did you make Tusky appear? Me? I didn't do anything. I thought you put Tusky in the box when I wasn't looking. Dad, did you do something? >> Don't look at me. I thought Tusky was still in the washing machine. I'm genuinely puzzled. >> Oh, let's try again, Tommy. Come on. >> You can ask your parents to subscribe to the Nick Jr. YouTube channel for new videos every week and find more of your favorite shows on TV on Nickelodeon and the Nick Jr. channel.",
    "start_time": 0.16,
    "end_time": 307.44
}