{
    "video_id": "rIvhSdrrM6M",
    "channel_url": "@nickjr",
    "transcript": "harness. Oh dear. Quickly. Oh no. [Music] Thank goodness. Gotcha. And I got you. Thanks so much, Skye. [Music] Great catch, Skye. Okay, Everest, you're up. Hang on, you two. Help is on the way. Grappble. All right. Well done. Nice shot, Everest. But that ledge isn't very stable. Armor Yumi and Garby, you'll have to move fast. We're on it. me first. But what about you? Oh, okay. If you insist. Good thing I brought my lucky horseshoe. [Music] Whoa. Huh? Barbie, nice balancing. Oh, mine. [Music] Great work, Gerby. Now, let go of the grapple and Everest will relaunch it so you can come across. [Music] Okay, now if I can just hook a stronger part of that ledge. Oh dear. I'm not sure there is a stronger part of that ledge. Look. Coming Garby. Farmer Yumi. Wait. [Music] Of course I'm here. The more the marrier. Remember? I just hope you remember your yoga poses, too. We've got to stay balanced on this thing. Okay, here we go. Relaxed rooster. Seated scarecrow. Waving windmill. [Music] It's working. Keep it up. And we can ride this all the way down to Oh, peach fuzz. Those giant boulders. We've got to get Farmer Yuni and Darby off that rock before it crashes into those boulders. Everest, use your snow cat's claw to try and slow them down. Off the trail. Everest won't fail. Marshall, get down there with your firet truck quick. I'm ready for a rough rough rescue. I need you to stop pressing those buttons and jump into my plane. Jump from up here? I don't think so. But it's the only way to get you down. Uh-uh. Mm- No way. My plane has a snack cart. Snack cart? Why didn't you say so? Now boarding mayor hump. Oh wait, I can't leave without printing my picture. Ah, this button should do it. Deleted. Why? Ooh, I probably need that. Mayor Huntinger broke off that rocket booster. Woo! 40, look out. Ryder, we've got big trouble. 40 Shuttle and Hoter and the satellite are falling. You've got to find a way to catch them fast. Fast. No problem. Help. Come on. Come on. And I don't have all day. [Music] Gotcha. That's great. But can you slow down, too? Not yet. We still have a monkey to save. Climb in. Oh, all right. [Music] That's better. Now, when do I get those snacks? This puppy's got to fly. The shuttle's falling fast, but Skye's catching up. Come on, Skye. You got this. [Music] [Applause] Hang tight, Gordy. I'm here to help. Help? How? You can't grab the shuttle with your claw. You're already holding a satellite, remember? Oh, I'm not going to grab the space shuttle. I'm going to lift it. I'm attached, 40. Now I just have to pull up. Better make it quick. [Music] Oh, are we there yet? Sky to Rider, we're coming in for a landing. We'll be ready for you. [Music] [Music] [Music] Welcome home, dudes. We've got to polish this bell until we can see our reflections. Is that a flying truck? Hold on. Burma next. What a ride. Thanks, Chase. You're welcome. Cheers. Could you do something about this balloon? I don't think it belongs here. Marshall to control tower. I'm closing in on the sky high cousins. All right, Marshall. Just be careful. All three of you are very high up. Roger that. I keep cautioning you, cousin. You can't climb and carry that cumbersome cudgel. Release the rod already. Cajel rod. For the last time, it is a balancing pole and it goes wherever I go. Anybody need a lift? Rough ladder. Okay, Francois, climb on. No, no, it is too far. I cannot reach. You can do it, Francois. You're an acrobat. An amazing, adventurous, and at times aggravating acrobat. Sal is right. I am an acrobat. [Music] [Music] You know, maybe he was right about that balancing pole. Ryder, come in. I've got Francois. But Captain Turbet is falling fast. If you dive too fast, Francois might not be able to hold on. But if we do not catch him, who will? This puppy's got to fly. Skye switching to rescue mode. Woohoo! [Music] It's now or never. Huh? All right, that was one amazing save. Correction, cousin, that was two amazing saves. Mic balancing pole. Sky the control tower. We're coming in. Zuma, you know what to do. On it, dude. All right, kitty dude. Time to abandon sandwich. [Music] Nice work, Zuma. Now we just have to get Mayor Humdinger down. All right, mayor. Your turn. Finally. Oh, wait. I need to grab something first. What? Where are you going? I'll only be a minute now. Where did I put those sunglasses? Uh-oh, the trailer's breaking. I can't hold it much longer. Hey, keep it steady. Hurry, mayor. The trailer could fall any second. Oh, I'll be right there just as soon as I find my Oh, here they are. They were on my hat again. Sometimes I think I'd lose my mustache if it wasn't attached. Uh-oh, it's falling. Jump, huddinger. Phew. I've got you, mayor. And I got you sunglasses. Way to go, Scott. [Music] Mayor Hungdinger, you're okay? I am, but my trailer is at the bottom of a canyon. Don't worry, Zuma Sky and I will get it out of there. Yeah, whenever your trailer takes a tumble, just yelp for help. No, I could really use a vacation from this vacation. [Applause] What? You could come to Come on, everyone. I know just the place. After today's rescue, I really needed this. Me, too. Me three. Me four. But aren't beaches supposed to have waves? Where's the water? Coming right up. Whoops. Where did I put those sunglasses? First, I get soaked, then I can't find my sunglasses again. [Music] You're right. Once we get this page, all we need is the map. I've got this. Rough wall walkers. [Music] Thank you, Chase. Oh, there's some gold lettering here. It says, \"We'll reveal the true treasure.\" We should show it to Ryder. [Applause] [Music] We've got these, Ryder, but no map. That's okay. We're getting the book back together page by page. Oh, I bet that map must have blown out to see. Aha, that must be it. Full speed ahead to treasure. [Music] Is that Mayor Hunginger's boat? We better find out before we run out of daylight. Skye, ring your copter. This puppy's got to fly. goggles. It's Humpdinger and Chase Kitty. [Music] They're after the map. I'm almost there. Whoa. Oh, [Music] [Applause] [Music] wolf's cold. Good thing I was What's going on? I must have that map. Please stop or crash. Look. The whole town is glittering. Wow. Spider, do you see what I'm seeing? It's beautiful. Of course, the clues. The giant's torch will reveal the true treasure. The map wasn't meant to be followed. It was meant to be projected using the lighthouse as the giant's torch. So there's no treasure. Adventure Bay is the treasure. All of it. The people, the places, and the pups. That map must have been made of special gold paper. Aw. Now put me down this instant. Some treasure. My boat sprung a leak. Oh, kitties start bailing. Jump. Mayor Goodway. [Applause] Great timing, Zuma. Or should I say great timing. Mayor Goodway, care for a snack? They're only a little soggy. Sky Huninger, do you read me? Turn off the rain. Don't blame me. This was supposed to be a juicy drizzle. Don't just stand there, kitties. Help me pull this thing. It might be an off switch. [Music] [Applause] That was an off switch. All right. But it turned off everything, the rain and the engines. What do we do, kitties? What do we do, kitties? Wait, take me with you. Ew, sticky. Sky to control tower. We read you, Skye. The big cloud is headed for city hall, and Mayor Humdinger is barely hanging on. Chase, take your police chopper and rescue Mayor Humpdinger. Air rescue Chase is on the case. Skye, can your jet lift that entire cloud? I'm going to find out. Switching to rescue mode. Oh, it's working. Woo! Go! That's modified, Skye. Sweet moves. Oh, where are my kitties? I don't think I can hold on much longer. Net launchers. Oh, put me down. Put me down. Phew. French fry. May Humdinger. Yuck. How' they get so wet and purple? Oh, never mind. Good news, Ryder. We've managed to drain the rest of the grape juice. Great work, pups. And let's get that hum cloud out of here. I know just where to take it. to buggy bottom. When it comes to air travel, we know you have many options. So, thanks for choosing to fly with us. Now, sit back, relax, and enjoy the flight. Sky to Ryder. Forest animals are on board and enjoying their flight. Good work, Skye. As soon as the fire's out and we know it's safe, you can bring the animals back home. Marshall, how's the fire fighting going? Pretty good, Ryder. I'm putting out fires all over the place. But since that pogo stick keeps starting new fires, it's going to take some time to get them all. Don't worry, Marshall. Zuma, Rubble, and I are here to help. Rubble, keep an eye out for glowing embers. Even the smallest one could restart a fire. You got it. I can put them out with my rig. It's a dirty job, but somebody has to do it. [Music] Now it's my turn to make a splash. Ready, set, get wet. [Music] Great job, pups. But we still need to stop what's causing all these fires. Danny. You mean Dar and Daddy? Chase, I need you to rescue Danny and stop that rocket booster. Working on it. Megaphone. Danny, if you can bounce a little higher, I'll catch you with my net. A little higher. I can do way better than that. [Music] Woohoo. Woo! Nice bounce, Danny. What? Now, let go and I'll catch you. This is going to be so epic. Met launchers. Yeeha! Check it out. I'm flying. Yeah. [Music] Uh-oh. But my rocket powered pogo stick is still balancing. Not for long. [Music] Possome news pups. That rocket booster shut down for good. As long as the magnet's on, Marshall and Chase can't go anywhere near that drone. I've got to get out there and help. But if your jet gets too close to the magnet, it'll get stuck, too. Actually, I don't need to get close, Rocky. Only my passengers do. Who? us. [Music] All right, ground crew. We're in position. Time to skydive down to that drone. Once you're on top, you can look for a way to turn it off. Green means go. [Music] [Applause] There's the drone right by the bridge. Uh, isn't the bridge made of metal? Uncle Lotus, are you okay? Oh, I'm hanging in there, but I don't know how much more this bridge can take. Whoa, what is that? Just hang tight. I'll turn the drone off as soon as I get this panel open. Screwdriver. [Music] Wrench. Hammer. Do you have any tools that aren't metal? I'm going to say no. Ooh, hang on. My tummyy's trying to tell me something. [Applause] Pop treats. Dude, I don't think this is the time for a snack break. Not for me, for opening the panel. It's not made of metal and it's really tough. Just the way Buddy likes them. It worked. Oh, pup treats. Is there anything they can't do? Get ready, everyone. Turning the drone off in three, two, one. Wa! Marshall, Chase, go, go, go. We've got lotus. Next time I'm walking [Music] launcher. Woohoo! They did it! Woo! [Music] Sky to Air Rescue control tower. We stopped the drone and saved the day. Great job, pups. You're cleared for landing. Woohoo! [Music] Rock rescue buoysio overalls are so last season. Thanks, Zuma. You pulled us from peril with primo precision. But what do we do about my flaming flounder? I'm on it, dude. Hang on. Ruff fan cannons. The flounder's all over the place. I can't spray it long enough to put up the fire. Marshall, look. The flounder is headed for Adventure Bay. We've got to shut off the engine before it crashes into the waterfront. But how? It's not safe to get on board if it's on fire. I've got it. Rubble, get your dump truck and hurry to the Adventure Bay Bridge. I'll tell you the plan when I get to the pier. Rubble, on the double for redhot trouble. [Music] Look, Rubble's on the bridge. Marshall Tazuma, we have a plan to put out the flounder fire. Once it's out, we need Captain Turbet back on board to cut the engine. We'll do. All right, Rubble. As soon as the flounder goes under the bridge, dump all the sand you've got onto the fire. It should be enough to smother the flames and put them out for good. I can dig it, Marshall. And I can dump it, too. Ready, steady, now. Woohoo! Perfect shot. Is the fire out? Let me check. Rough thermal imager. Yes, the flames are out and the flounder is safe to board. Zuma, let's get Captain Turbet back on that boat. Hang on, dude. Rough jetpack. [Music] Wo! Time for this captain to conclude this catastrophic cruise. [Music] We did it. H. Yeah. Sky to Ryder. Is it about my missing prize? I found all the prizes. The seagulls are using them to build a nest on the Adventure Bay Bridge. And there's eggs in it, too. But what's climbing the bridge? It's Chickaletta. She's climbing to the nest. That can't be. She's right over She must be going after her raffle prize. Oh, I've got to stop her because it might be dangerous. No, because she might try to take my prize, too. Hump patrol is on a roll again. Skye, keep an eye on things until we get there. But don't get too close. We don't want the seagulls to think their nest is in danger. [Music] Just as I thought, she is going for my prize. I always knew that chicken couldn't be trusted. Oh, this is going to give me blisters. [Music] Wait, digger. Let us help you. No need. Hum patrol is in control. Ooh, that's a good one. Stop. I don't want your eggs. I just want my prize. Ow. Spider. Mayor Huntinger and the nest are getting too close to the edge. If he's not careful, they could all fall. Zuma, I need you and your hovercraft at the bridge. Quick, let's dive in. Sorry, seagulls, but I won this prize. Fair and square. My prize. Oops. Hump Patrol, do something. I got it. The nest is falling, too. Now I got it. Booy. A You're welcome, dudes. All right, Zuma. Excellent save. Yeah, great. So, I should get myself down, then maybe there's something in this hump pack I can use. Oh. Aha! A mustache comb. Well, if I'm going to save the day around here, I suppose I should look my best. Uh-oh. I got you, Mor. Nice one. Way to go, Skye. All right. Yeah. Yeah. Woo! Woo! Where's my prize? H you can ask your parents to subscribe to the Nick Jr. YouTube channel for new videos every week and find more of your favorite shows on TV on Nickelodeon and the Nick Jr. channel.",
    "start_time": 0.719,
    "end_time": 1823.6
}