{
    "video_id": "yfGYX9A-_7o",
    "channel_url": "@nickjr",
    "transcript": "Mini Patrol, a bad rainstorm is coming and it's going to ruin our mural. Our mission is to keep it from getting wet. [Music] >> That's right, Chickaletta. Mini Patrol is on a roll. >> Mini go. >> You're next. Go go go. >> And finally go go go go go. [Music] >> Okay. Stay in place and protect the mural. I said protect, not peck. I'll cover it with my wagon. >> Oh no, the wind is blowing away the mini patrol. >> Please calm down. Calm down. >> Stop. >> Oh no. Time to call the Paw Patrol. >> Ryder here. >> Ryder, you'll never believe what we just saw. >> Let me guess. A giant pterodactyl. It is a prehistoric creature and is definitely >> a really, really, really big Utah raptor. Isn't it great? >> Wow, he's huge. Hang on, we're on our way. >> Wow. I got my birthday wish. >> Run away. Look, >> it's a boo. See you later, alligator. What are you going to do? What are you going to do? What are you going to do? We could use those for Halloween. [Music] No. Oh dear. What if that big dino thing magic tries to eat my Chickaletta? Rider, it's a disaster of enormous proportions. Hurry. >> Don't worry, M goodway. We're on our way. >> Paw Patrol, back to the lookout. >> Okay, pups. We need to help Alex get over his fear of the dentist. >> How? >> I want you pups to do one thing you're afraid of. Who wants to go first? Uh well um well, okay, I'll go first. With the Paw Patrol, I do scary things like hang from Skye's helicopter or climb icy cliffs. But you know what really gives me nightmares? >> No. What? >> Mr. Porter, some Brussels sprouts, please. >> Coming right up, Ryder. >> Here they are. >> Thanks. I suppose [Music] [Laughter] >> there. That wasn't so bad. >> Nice try. But I didn't think so. >> Okay, it was. But even though it was scary, I'm still okay. Rocky, what are you scared of? >> Um, well, uh, water. Uh, go ahead, Marshall. You've got it. Hose. Ready, Rocky? Ready. Wet. Now I'm going to have that wet pup smell. And Rubble is afraid of spiders. >> Spider. [Music] Not scared. Not scared. Have I finished not being scared yet? >> Yes. Spot the cobwebs. >> Now Skye and Marshall. >> Marshall's scared of flying. >> This isn't so bad. Look out. An eagle. I don't like eagle. Wo. Wo. I really don't like flying. Wow. the ground. Mwah. Wow. I didn't think the Paw Patrol was scared of anything. >> You see, everyone's scared of something. But sometimes you need to do things even though you're scared. >> If you pups can be brave, so can I. I'm going to the dentist. >> Alex, could you help one last pup be brave, too? >> Who? >> Huh? >> Chase. He's afraid of the dentist, too. >> I don't need to see the dentist. >> See, maybe you can help Chase out if he sees how brave you are. >> Of course I can. [Music] [Music] >> Oh, >> come on, Chase. It's just a dentist. Let's go in at the same time. Okay, >> good for you, Alex. >> The dentist was really nice. She gave me a sticker and a toothbrush. [Music] >> It's stashing acorns in Alex's treehouse. >> Wow. Looks like all the other squirrels have had the same idea. That treehouse is starved. >> Uh-oh. Sounds like it's more than it can hold. >> Hi, Paw Patrol. >> Alex, climb down. Your treehouse might fall. >> Oh, no. Really? [Music] >> Rubble, use your crane to hold it up. >> On it. >> Woohoo! Uh-oh. Woohoo! Woo! Woohoo! Look at me. I'm doing it. Daddy, >> get out of the way. [Music] >> Yeah, close call. Epic landing though. >> Hang on. My treehouse. >> Alex, come back. >> You'll get it. Pups off to that treehouse. [Music] This is fun. Treehouse boarding. Why did I think of that? Totally extreme. Alex, put this up. Can you reach my hand? I can't reach you. >> Hold on, Alex. I'm coming. Yoohoo. Now to ride the treehouse in or not. Thanks for the rad rescue. Pups, Alex's treehouse has turned into an off-road racer. Skye, we need your copter to slow it down. >> This puppy's got to fly. >> And Marshall, we're going to need your ladder to get Alex and the squirrels down off the treehouse. >> I'm ready for a rough rough rescue. [Music] >> Go. [Music] Awesome. Uh-oh. >> Oh no, they're heading for the blacks. [Music] >> Got it. >> Great job, Skye. Marshall, you're up. Ladder. Okay, Alex, climb over to me. I did it. Thanks, Marshall. Oh no, my treehouse. [Music] >> Now that's some extreme footage. >> You saved me and my treehouse and the squirrel's dinner, too. You can ask your parents to subscribe to the Nick Jr. YouTube channel for new videos every week and find more of your favorite shows on TV on Nickelodeon and the Nick Jr. channel.",
    "start_time": 0.719,
    "end_time": 608.0
}