{
    "video_id": "VjIbGTnQTbg",
    "channel_url": "@nickjr",
    "transcript": "[Music] Hey, ghosts. Knock it off. Let me think about it. >> No. [Music] >> You asked for it. [Music] [Applause] What? >> Allow me. Dirt. [Music] >> This is not good. Go on, Stumpy. You got it. >> Uh-oh. I mean, better luck next time. [Music] Where'd they go? >> I don't know. But be ready for anything. >> I was born ready for anything. >> Here we are. [Music] [Laughter] [Music] This is fun. But you know what would be more fun? >> Oh, ice cream. No, let's invite all our ghost friends. This is a great city to haunt. >> Oh, Sterling, I like that even more. >> That's why I keep my phone on solid. >> Ghost Vinnie, it's me. We've got a haunting growing down an important city. You and the boys should come through. See you soon. >> Oh man, more ghost. This is a nightmare. >> Welcome ghost friends. From now on, shall important city belongs to us ghost friends. Okay, >> this is not good. >> I didn't sign up for this. >> We don't have time for this. Here, look. [Music] Cute cats make everything better. >> Oh, thanks, Doc. >> I'm just glad we're all okay. >> Well, not all of you. Where's Stumpy? >> Oh, no. Stumpy. >> Oh no. Where are you, Stumpy? [Music] >> Stumpy, come in, Stumpy. There are ghosts everywhere. Where are you guys? What do I do? >> We have to get the ghosts back into that house and close the ghost proof door before midnight or they'll hunt Important City forever. >> What? All of them? >> If only we could scare them back. That got us to run home real quick. >> Y How are we going to do that? They're ghosts. It's not like we can just say boo. >> Why would you say that? Uh, say what? Boo. >> Guys, I think I know what to do. >> I know. That's right. Go get him, Stumpy. [Music] [Applause] [Music] Uh-oh. It's working. [Music] >> Come on now. Get those ghosts back, bunnies. It's almost midnight. They going to get us right this way. Scaredy ghosts. Hurry. >> Step aside. [Music] There. No one's ever going to open that door again. [Music] Well, certainly not. Now that the ghosts are locked away and Steve's finally retrieved the drone. Um, right, Steve. >> Uh, drone. [Music] >> It's going to be a long hundred years. >> You know, I wasn't really scared. You You weren't scared, huh? >> Stop. >> You can ask your parents to subscribe to the Nick Jr. YouTube channel for new videos every week and find more of your favorite shows on TV on Nickelodeon and the Nick Jr.",
    "start_time": 0.44,
    "end_time": 311.68
}