{
    "video_id": "8AiyyOlHLG4",
    "channel_url": "@nickjr",
    "transcript": "Pub caps. >> Wa! >> Oh man, those underwater volcanoes are busting out lava rocks. >> Shelly, >> it's okay, Shelly. Those lava rocks can't stop us, cuz we've got something on our backs to protect us from danger. We've got super strong sea turtle shells. >> Oo! Yeah! Sea turtle shells are made of keratin. It makes the shells super hard so sea turtles can protect themselves. >> Come on, Shelly. Time to use our shells to get past those lava rocks. >> Shelly, >> we've got sea turtle. >> Get ready. Two lumber rocks headed this way. And here comes one more. >> How many lava rocks are there all together? >> Three. Yeah. 1 2 3. >> Woohoo. It worked. >> Way to use that shell, Shelly. >> Look out. Here come two lava rocks and two more. How many are there all together? Four. Right. One 2 3 four. >> We've almost made it past the underwater volcanoes. We've just got to get past three lava rocks and two more. How many are there all together? Five. Yeah. 1 2 3 4 5 [Music] We made it. Yay. [Music] Hey, Shelly, look what's up ahead. It's the seaweed forest. >> Yeah, you're almost home. Shitty, shitty, shitty. >> Uh-oh. But look, there's one more volcano. And it just blasted a lava rock that's headed for the seaweed forest. >> Wo! Come on, Shelly. We've got to stop that lava rock and fast. >> Shelly, >> time to use sea turtle blazing speed [Music] >> to give us blazing speed. Say, \"Let's blaze.\" >> Let's blaze. [Music] See power. [Music] We did it, Shelly. We saved the seaweed forest. >> Shelly. [Applause] [Music] Look, Shelly, the other sea turtles are thanking you. You're a hero. >> Shelly. Shelly. >> A. >> You're welcome, Shelly. You're one brave little sea turtle. >> Now, come on. Let's go check out your new home and have some sea turtle fun. Woohoo! [Music] Sea turtle power. Sea turtle power. Let's go traveling across the sea. Taking it back. Sea turtle power. Sea turtle power. Let's go. The ocean is so much fun. The journey is just turtle power. Sea turtle power. Let's go. [Music] >> Phew. Stopping that robot elephant is going to be tougher than I thought. >> Don't worry, team. I've got an idea. I can look for a way to stop that giant elephant with my supervision. [Music] [Applause] Aha, I found something. Those look like secret buttons. >> Yeah. And one of them must be a shrink button that will make the robot get smaller. >> Well, if there's one thing I know about shrink buttons, it's that they always look different from all the others. >> Come on, help us find the button that's different. Look closely. Which button is different? That one right. It's a triangle and all the other buttons are squares. >> Shrink button, here I come. [Music] >> All right. [Applause] Yeah, >> it worked. >> The button that's different made the robot elephant shrink. >> Aha. I see more buttons right over there. >> Remember, to shrink the elephant, we need to find the button that's different from the others. Which button is different? That one. Yeah, it's smaller than the others. >> This sounds like a job for Super Mom. Woohoo! [Music] All right. >> Good going, Super Mom. You made the robot elephant get even smaller. [Music] If we can just find one more shrink button, that ought to stop this robot elephant once and for all. >> Let's look. >> Which button is different? >> That one. Yeah, it has more stripes than the others. Super Team to the rescue. Yeah. [Music] Yeah. Woohoo! [Music] We did it, superheroes. We stop the robot elephant and save the world. >> All in a day's work for the superherooes. [Music] [Applause] >> I'd say that was a super movie. A >> look for watching the last movie. We're getting our last star stamp. [Applause] >> Well, what do you know? That makes three stars, >> which means we finally earned our special surprise. >> And what better surprise for a day at the movies than popcorn. [Music] Monster movies. Monster of the movies, action, adventure, and comedies. Monster machines. Monster machines at the movies. >> Uh-oh. Watch out, Blaze. A giant mud ball is headed this way. >> Gaskets. We need a powerful blast of water to disintegrate that mud ball. >> Activating clean machine power. Woohoo. >> It worked. >> But get ready. Here come more mud balls. >> I see two mud balls. And one more. >> How many is that all together? Three. Right. >> Three. Water blast coming up. One, two, three. >> We did it. >> Nice one. [Music] >> Uh-oh. More mud balls headed this way. >> That looks like one mud ball. And three more. How many is that all together? Four. Yeah. One, two, three, four. All right. >> We've almost made it to Darington. >> Gee, I just hope you're able to get past these last mud. [Music] >> Here come two mud balls. And three more. How many is that all together? Five. Right. One 2 3 4 5 Yeah. [Music] Woohoo! [Music] Tada! Woohoo! >> We did it! We saved Darington. Thanks, fellas. >> You're welcome, Darington. Now, there's just one thing left to do. >> What's that, Blaze? >> Clean up every single mess in town. >> Yeah. With our clean machine, we can wash away all the mud and spilled paint and cotton candy. >> Whoa. But won't that take a long time? Not when you've got clean machine blazing speed [Music] to give me blazing speed. Say, let's blaze. >> Let's blaze. [Music] Yeah. [Music] [Music] We need my super strong robot hands. Woohoo. Muffin. Muffin. >> Yeah. Ready. It looks like the robot's making a really big muffin. A muffin. That's 3 m. >> Then to squish it, we need to make my robot hands bigger than three. Let's make them a size of four. >> Count to four with us. >> 1 2 3 four. >> All right. Now my hands are big enough for a super smash. >> Yeah. >> Way to go, Robot Blaze. >> Mofu. >> Look out. The muffin bot is about to make an even bigger muffin. >> Mofu. >> A muffin. That's 5 m. >> Then we need to grow Blaz's hands to be bigger than five. Let's make him a size of >> six. >> Count to six with us. >> 1 2 3 4 5 six. >> Robot hands smash. >> All right. >> We're almost at the muffin bot. muffin. [Music] >> But to get to that shrink button, we've got to squish the biggest muffin yet. A muffin that's 9 m. >> Then let's make Blaz's robot hands bigger than nine. We'll make them 10. >> Count to 10 with us. 1 2 3 4 5 6 7 8 9 10. [Applause] >> Oh, look at her. We did it. We swung the last breakfast spot. >> Muffin. Muffin. Muffin. >> A look, Crusher. The muffin bot's tiny again. He's not scary anymore. >> Scary. You never scared me. Muffin bot. You and your giant >> muffin. >> Muffin. >> Well, AJ, now that we've shrunk all the breakfast bots, there's just one thing left to do. Clean up this mess with robot blazing speed. To give me robot blazing speed, say let's blaze. Let's blaze. [Music] We did it. We cleaned up all the breakfast mess. >> Yeah. And check out what we did with all the leftover food. We built a breakfast food playground. >> Wow. >> Come on, everyone. Let's have some breakfast fun. [Music] Please hurry. >> We need your frosty ice cream to save our planet. >> Don't worry, aliens. Ice cream truck Blaze is on his way. [Applause] >> Hub caps. If we're going to bring ice cream to outer space, we'll need our biggest transformation yet. >> Check it out. We could turn our ice cream truck into a submarine or a rocket ship to go to outer space. Which one should we choose? The rocket ship. >> Oh yeah, I'm an ice cream rocket ship. [Applause] Blasting off in 3 seconds. >> Countdown with us. Start at three. >> 3 2 >> 1 [Music] [Applause] [Music] [Applause] [Music] Look, it's here. It's >> I see rocket blade. [Music] >> Oh man, that space volcano is erupting a lot of hot lava. To stop it from erupting, we're going to need the biggest scoops of ice cream we've ever made. An ice cream scoop with a big diameter. >> Let's check it out. Diameter is the distance across the middle of a circle. Ice cream scoops are shaped like a circle. So, the bigger the diameter, the bigger the scoop. To stop this space volcano, we need to make an ice cream scoop with a diameter of 10. >> Let's make some ice cream. >> All right. Now, let's measure and see if this scoop has a diameter of 10. Is that the number 10? No, that's five. We need to make it bigger. >> Let's make some more ice cream. [Music] >> Is that the number 10? >> Not quite. That's only seven. We need even more ice cream. More ice cream coming up. >> Wa! Now that's a big scoop. >> Let's check the diameter. Is that the number 10? >> It is. We've got to hurry and get this stuff to the volcano before it erupts hot lava all over the planet. Activating ice cream blazing speed. >> To give us blazing speed, say let's blaze. >> Let's blaze. [Music] We did it. Our ice cream cooled the volcano and stopped it from erupting. >> Thank you, friends. >> You have saved our planet. >> A You're welcome, aliens. Wherever there's an ice cream emergency, you can always count on us cuz we've got ice cream power. >> Yahoo! [Applause] [Music] Ice cream. Ice cream. Ice cream. It always tastes so taste so sweet. Ice cream. Ice cream. Ice cream. It all tastes so tastes so sweet. Ice cream. Ice cream. Make it ice cream. [Music] [Applause] [Music] It worked. The dragon's ice breath cooled the hot lava. But look, more lava's headed this way. >> Here come two lava balls and two more. How many are there all together? >> Four. Right. Say blast four dragon. >> Blast four dragon. [Music] Yeah. >> Look, Crusher. We're almost at the dragon door. >> Yeah. So long as we can get past the most lava yet. Here come three lava balls and two more. How many are there altogether? Five. Yeah. Say blast five dragon. >> Blast five dragon. [Music] [Applause] [Music] We made it to the dragon door. >> Thanks for your help, Ice Dragon. [Music] >> Come on, everyone. Back to the game board. Woohoo! Yeah, we're back >> and we're so close to winning the game. Look, >> there it is. The dragon castle. Let's count how many spaces we have left to get there. Count with me. Start here. 1 2 3 4 5 6 7 8 9 10. >> That means when we spin the spinner, it's got to land on the number 10. [Music] >> Here it goes. It's slowing down and the arrow is pointing to this number. What number is it? 10. Yeah, [Music] [Applause] we're going to win. >> Uh-oh. But look, >> the drawbridge at the castle is starting to close. >> We'll never make it in time. >> Oh, yes, we will. It's time for board game blazing speed. to give us blazing speed. Say, \"Let's blaze.\" >> Let's blaze. [Music] [Applause] Oh yeah, we did it. We won the dragon game. >> Hooray. >> And look, it's the dragons. >> Congratulations, game players. >> We knew you could do it. >> Thanks, dragons. We couldn't have done it without you. All right, game players. Are you ready to get your prize? >> You bet we are. >> Wa! We've got dragon wings. Yahoo! >> Oh yeah! Come on everyone, let's fly. It's the dragon game. The dragon game. We're so glad you came to play the dragon game. It's the dragon game. The dragon game. We're so glad you came to play the dragon. It's the dragon. The dragon. >> Uh-oh. Look. Crasher used the wind to knock over those pipes. >> What do we do, Blaze? >> Hm. Looks like the only way to get past them is to jump over the pipes by going really fast. >> Yeah. And we've got just the right gauge to help us. A speedometer. A speedometer is a gauge that shows how fast a vehicle is moving. >> To jump over these pipes, we need to go a speed of 50. >> Let's do it. Help us go a speed of 50. Count by 10 with us. Repeat after me. 10 20 30 >> 40 50 [Applause] [Music] >> We made it. >> Well, if the wind didn't stop Blaze, maybe this will teach him to chill out. An ice storm. [Music] Oh man, it's a huge wall of icicles. >> To jump over it, I'm going to have to go even faster this time to a speed of 60. >> Count by 10 to 60 with us. Repeat after me. 10 20 30 40 50 60 [Applause] [Music] that didn't stop him either. [Music] >> Well, good thing I just had a bright idea for my biggest cheat yet. I'll use this weather machine to make >> sunshine [Music] pop caps. >> Crushy used the sunshine to pop all that corn and make a giant wall of popcorn. >> To jump over it, we've got to go our fastest speed yet. A speed of 100. Count to 100 with us. Repeat after me. >> 10 20 >> 30 >> 40 50 60 70 80 90 100. >> Oh yeah. >> Oh, that was amazing. And look, there's the finish line. >> Sorry, Blaze, but you're too late. The finish line is right over there. Even you're not fast enough to get there before me. [Music] >> That's what you think, Crusher. >> Yeah, there's still one gauge we haven't used yet. Our blazing speed gauge [Music] >> to give me blazing speed. Say let's blaze. >> Let's blaze. [Music] And the winner is [Applause] [Music] one. Yeah. And we got the weather machine back. Thanks everybody. >> So, team Blaze, how are you planning to celebrate your big win? >> Gee, I don't know. >> Hey, I've got an idea. We can use my weather machine to make a rainbow. [Music] [Applause] Come on everyone. Who's up for a rainbow ride? [Music] On. [Music] [Applause] [Music] We've got to get to that ticket fast before the hot lava gets there. >> Hey, I've got an idea. We can ride to the top of the volcano on a balloon. [Music] >> Flying on a deflating balloon. Now that's my kind of plan. [Music] >> Great. Now let's see if the balloon can fly us all the way up to the top of the volcano. >> If we let the air out now, we'll fly like this. And our apex will be here. >> Will that get us to the ticket? >> No, that apex isn't high enough. >> Sounds like I better blow it up a little bit more. [Music] >> If we let the air out now, we'll fly like this >> and our apex will be here. >> Will that get us to the ticket? Not quite. >> Hurry. The lavas almost made it to our ticket. >> Darington, quick. Blow up the balloon. >> You got it. [Music] >> Now, if we let the balloon's air out, we'll fly to the apex that's up here. Will that get us to the ticket? >> Yes. >> Here goes nothing. [Music] I got it. >> We got back all the tickets. >> Now hang on everyone. I'm going to get us back to that carnival super fast with balloon blazing speed. Woo! >> To give our balloon blazing speed, say, \"Let's blaze.\" >> Let's blaze. >> Oh, look at that. [Music] [Applause] [Music] Tada! >> Here you are, sir. Seven tickets for the rocket ship ride. >> Well, all righty then. Climb aboard. >> Let's do it. We're finally going to see how high this rocket ship ride goes. Rocket ship ride. >> We're going higher and higher and higher. >> We're going all the way to [Music] outer space. >> They weren't kidding when they said this was the biggest ride ever. >> It's so big, it's out of this world. Yeah. [Applause] [Music] [Applause] >> Look, there's little Petey. But he's so high up. How are we going to get him down? >> Hey, I see a way. We can swing up to Petey on this pirate ship ride. >> Ah, great idea. I'll push this button to turn it on. >> Huh? The ride's not moving. >> I see the problem. Looks like this ride doesn't have any gears. Gears? What's a gear? >> A gear is a special wheel with lots of little bumps on it. Those bumps make gears connect to each other. A motor uses its power to turn the first gear. Then that gear turns the next gear, which turns more and more gears until the power moves all the way to the machine and makes it go. >> Hey, there are some gears. Let's use those to fix the ride. >> Yeah. To make this pirate ship ride work, we need to add three gears. Is that three gears? No, that's only two gears. Look, I found another gear. >> Now, do we have three gears? >> Yeah, [Music] it's working. >> The motor's turning the gears and making the ride go. Wo! [Music] Woohoo! >> You saved him. >> Oh, thank you, Stwel. >> Look, there's little Peggy by the Ferris wheel. >> But the ferris wheel doesn't have any gears either. We have to get it working again so we can save her. >> The ferris wheel needs four gears to work. >> Check it out. Here are more gears. >> Is that four gears? >> Yeah, that's four. [Music] [Applause] All right. [Applause] Well done. [Music] Woohoo! [Applause] >> Yay! >> All right, now there's just one panda left to rescue. Little Polly. >> Wa! >> And look, his bubbles floating by that spaceship rock. >> And it looks like we'll need to add five gears to fix it. >> There's some gears. >> Is that five gears? >> No, that's only three gears. I found one more gear. Is that five gears? Not yet. How about now? Is that five gears? Yeah. [Music] All right. >> Thank you. >> Thank you. >> Thank you. >> Aw, you're welcome, little pandas. We're just glad you're safe. >> Oh, look out. >> Gaskets. The crusher blocked the tunnel through these mountains. >> Hey, but look over there. It's another tunnel. But to follow it, we'll need some way to ride on those old train tracks. Hey, I know what we could use to ride on those tracks. A steam engine. >> Yeah, a steam engine boils water to make steam. And that steam pushes a piston to make the train's wheels turn. >> Come on, help build the parts and turn me into a steam engine. First, I need special driving wheels to keep our train steady on the tracks. To make the driving wheels, say driving wheels. Driving wheels. Next, our steam engine needs a boiler tank to hold all the bubbling hot water. To make the boiler, say boiler. Boiler. Last, I need a chimney to pump out smoke and steam. To make the chimney, say chimney. Chimney. Oh yeah, I'm a steam engine monster machine. >> All right. Yeah. Full steam ahead. >> Woohoo. [Music] Yeah. [Music] [Applause] >> Oh, check it out. This tunnel is full of big shiny gemstones. >> Watch out, please. >> Hop caps. We've got to get through this cave without getting hit by falling gems. >> I know. We can keep away from the gems if we predict where they're going to fall. >> Yeah. When you predict, you use what you know to make your best guess about what's going to happen next. >> Look, more gemstones up ahead. >> And we know the gems always lean in the direction they're about to fall. Which track do you think they're going to fall on? The yellow track or the blue track? >> The blue track. Yeah. >> Quick, take the yellow track instead. Our prediction was right. >> Yeah. [Applause] [Music] >> Get ready. There are more gemstones ahead. >> Which track do you think they're going to fall on this time? The yellow track or the blue track? The yellow track. Way to predict. And look, there's the way out of the cave. >> But we'll have to get past one last pile of gemstones. >> Let's predict. Which track do you think they're going to fall on? >> The yellow track. [Applause] [Music] Woohoo! We made it. Now we're back in the race. >> Hub caps. Crusher must have made these snow shards to try and stop us from getting the hot chocolate. >> Oh man, how are we going to get past them? >> Hey, I've got an idea. Let's build something that can blast those sharks far away. We'll make a snow cannon. >> Yeah. Snow cannons use water to make tiny six-sided ice crystals. Then they blast the ice crystals and water out into the air. The water freezes on the sides of the crystals so they become snowflakes. And with enough snowflakes, we can make a huge snowball big enough to roll those sharks away. >> Come on, let's get building. First, we're going to need a big tank of water. To make the water tank, say water tank. Water tank. Now, we need an air compressor. It breaks the water up into teeny tiny drops to make the air compressor say air compressor. Air compressor. And last, we need a fan. That's what blows the water drops into the air where they freeze and become ice crystals to make the fan say fan. Fan. Oh yeah, I'm a snow cannon monster machine. >> Yeah. All right. [Applause] [Music] Get ready, Blaze. A snow shark is headed this way. >> Snow cannon activate. [Music] >> Our snow cannon worked. >> But be on the lookout. There are still three more snow sharks out there somewhere. When you see another snow shark, say snow shark. >> Snow shark. >> Keep looking. There are still two more snow sharks out there. >> When you see another shark, say snow shark. Snow Shark. Just one snow shark left. >> When you see the last shark, say snow shark. >> Snow shark. We did it, Blaze. >> Snow Sharks, no problem. >> Now, let's keep moving. >> Deploying robot laser blasters. [Music] [Applause] All right, those giant bananas are no match for our lasers. >> Come on, Sparkle. Let's go save our friends. More giant bananas are headed this way. >> Quick, let's get coding. This instruction will tell the robots to blast their lasers. And this repeat code will tell them how many times to do it. There are four giant bananas. So, we need to do four laser blasts. Which of these is the number four? That's a four. Yeah, [Music] >> we've got the code. >> Go laser blast. 1 2 3 4 and stop. >> Yeah. >> Woohoo! >> It worked. [Music] >> Get ready. Here come five more giant bananas. >> Let's code our lasers to blast them. Come on. We've got to tell our lasers to blast five times. Which one of these is the number five? >> Yeah, that's the number five. That's our code. >> Go. Laser blast. >> 1 2 3 4 5 >> and stop. Y robots, look. Crusher and Pickle are right there. >> But that robot's sending out all the bananas it has left. 10 giant bananas. >> Help me code our lasers to blast 10 times. Which of these is the number 10? Yeah. We've got the code. Go. Laser blast. 1. 2 3 4 5 6 7 8 9 10 and stop. We did it. We got past the giant bananas. [Music] All right. >> Quick, let's turn green so we can hide in those green bushes. >> H. To make the color green, let's try mixing red and blue. [Music] >> What color is this? >> Purple. Yeah, but we need green. >> Hm. Let's try mixing yellow and blue. What color is this? Green. Right [Music] now. Come on. Let's sneak past those trash smashers. [Applause] [Music] Smash. Smash. We did it. >> We're trash masters. >> Train ahead. >> To sneak past them, let's make ourselves purple like those rocks. >> Here, we can mix red and blue together. What color is this? Purple. Yeah. Here we go. [Music] [Applause] [Music] >> All right. Woohoo. We've almost made it. >> We just have to sneak past these last trash mashers. Let's turn orange to camouflage with those mushrooms. >> Try mixing yellow and blue together. >> What color is this? >> Green. Right. But we need orange. >> H. Let's mix red and yellow. >> What color is this? Orange. Yeah, >> let's go for it. Smash. Smash. Splash. Smash. Smash. Smash. Woohoo. >> So long, trash mashers. >> Smash. Smurf. Look, it's Cousin Ben. Cousin Ben, what are you doing up there? >> I'm hiding from the tickling spiders in this web. >> Smart, but now I'm stuck and can't break free. This web is too strong. There's only one way to break a web that strong. We need a heavy load. A heavy load, of course. What's a load? A load is how much weight something is holding. Right now, the load in the web isn't very heavy. But if we put more stuff in the web, the load will get heavier and heavier until the web breaks. >> Well played, fellas. And it'll be even better if you can do it before the tickling spider gets here. >> We got to hurry. To break that spiderwe, we need to make the load weigh 10. But right now, it only weighs this much. What number is this? Eight. Right. >> We've got to make the load heavy. >> Oh boy, he's getting close. >> This to make the load heavier. A barrel. >> Great. I'll use my tow truck cable to get it into the web. [Music] Wo. Now, how much does the load weigh? >> 10. Right. >> That's heavy enough to break the web. >> Yippee. >> Hooray. >> Thanks, fellas. >> Hello. >> It's cousin Ken. >> Can you get me out of this web? Pretty please. >> Don't worry, cousin kid. We'll break you out of there. >> How heavy is the load in this web? >> Seven. Yeah. >> But to break the web, we need to make it 10. >> Look what we found. Maybe these instruments could make the web heavier. >> Let's find out. [Music] Now, how much does the load weigh? >> 10. I got you. >> Glad you're safe, cousin Ken. Glad you're safe, Cousin Bear. >> Hooray. Now, we just got to find >> cousin Sven. Oh, I sure don't want to be tickled. [Applause] >> How heavy is the load in this spiderweb? >> Six. Yeah, that's not heavy enough. >> Here, let's add this big crate to the load. >> Oh, yeah. Good idea. >> How heavy is the load now? Eight. It's heavier, but not heavy enough. >> Oh my. There's nothing left to throw. >> Oh. Oh, I know. Blaze, you can throw me. >> Whoa, that's so brave. Here goes. Hey. >> Hello, >> how much does the load weigh now? >> 10. [Music] >> Pon, you saved me. >> These pirate acorns keep bumping our boat. >> Hey, bumping boats be their favorite thing to do. Oh no, the pirate big horns are blocking the way to the last key. >> Oh wo is me. We'll never get to the key now. >> Don't give up, Peg wheel. To get past those big horns, we just need a machine that can blow their ships right out of our way. We need a vortex cannon. Remember, a vortex is a fluid that spins around in a circle. In a vortex cannon, that spinning fluid is air, and it spins around like this. If a blast of that spinning air hits the big horn ship, it'll blow it far away. >> Come on, let's turn me into a vortex cannon. First, we need a stretchy membrane. That's what shoots the air out of the cannon. To make the stretchy membrane, say stretchy membrane. stretchy membrane. Great. Now we just need the barrel. It makes the air spin around and become a vortex. To make the barrel, say barrel. Barrel. Oh yeah, I'm a vortex cannon monster machine. Woohoo. I've asked there be a pirate big horn heading this way. Help me aim my vortex cannon. [Applause] If we aim here, will our vortex hit the big horn ship? >> No. >> Big wheel, steer the ship a little to the right. >> Hey, AJ. >> Now, will our vortex hit the big horn ship? >> Yes. >> Yo ho, vortex. Another pirate big horn dead ahead. [Music] If we aim here, will our vortex hit the big horn ship? Yes. Yo ho, vortex. Yeah, >> parachute. >> Just one more pirate big horn ship to get past. >> I That's the roughest, toughest pirate big horn of them all. Is >> Captain Big Horn? >> If we aim here, will our vortex hit Captain Big Horn's ship? >> No. Big wheel, turn the ship. >> Huzzah! >> Now, will our vortex hit Captain Big Horn's ship? No, we've got to turn back the other way. Yeah. >> Now, will our vortex hit Captain Big Horn's ship? >> Yes. >> Yo ho, vortex. So long, Captain Big Horn. >> You can ask your parents to subscribe to the Nick Jr. YouTube channel for new videos every week and find more of your favorite shows on TV on Nickelodeon and the Nick Jr. channel.",
    "start_time": 1.439,
    "end_time": 3587.04
}