{
    "video_id": "A9SDhWIbo2o",
    "channel_url": "@wizkhalifa",
    "transcript": "Yeah, it's your boy Mr. Easy Wider right here on W and I'm letting y'all know it's time to get your windows down and pass that weed around. Yeah, go ahead and place your order at no time. We can pack it up and fly on any plane. We can take a le show you how my lifestyle these days have a little baby take you to the do some breathing vitamins I give you all you [ __ ] like a fivear fre couple carrots in every ring private plane fill the buckets with champagne she ain't thinking about a wedding day update her story letting everyone know she landed safe she like to smoke weed day rolling up a stogy while she let the oldies play. Hey, hair long, you don't know a race. Uh, she cool with y'all, but she want to be with Taylor Gang. Taylor gang. We can pack it up and fly on any plane. We can take it. Show you how my lifestyle these days. We can have a little take you to the vitamins. I give you all the [Music] Now she's starting to dress like me. Wearing Rick instead of Nike. She working out, we doing yoga and hiking. Grown as hell, so we spend our time wisely, but still down for a rockar night where I let you pick a bad [ __ ] to slide with. Uh, we could smoke weed all night, go back to the yacht and play. It's gang. You know what the vib is? Come on. Uh, he can pack it up and any plane [Music] take you to the vitamins. I give you all [Music] [Music] [Music] join in my hand. The other one on the wheel. If she don't do it, guarantee another one will. I'm into it getting money. I love the way it feel. We going to rub them bottles and drink them before they spill. I'm getting all them dollars a few weeks another meal. Don't got a lot of time, so I spend that with my children. 20K like [ __ ] it, I pay the bill. 8020 mile way. Now we can make the deal to make it this far. You got to hone in on your skills. No hotel this time. We want the biller. Been the [ __ ] We the winning team. Still want to smoke weed. Get my money up and just chill. Bring a couple chicks over so we can feel ain't no fantasy. It's all real. Taylor gang in the house. [Music] What can I say? I choose a life of a G over a square all day. All day. Lot of crime bud and women. There's nothing left to do if you stay away. >> Stay away. Think outside. I stay out the way. Out the way. >> Stay on my job. Money always chase. >> I would never change my away. >> And keep something put up just in case. Got what it takes to go and get that new house by the lake. I go hard for my family's sake. My son and my daughter going to be proud when they hear my old taste. My push making clouds by the fireplace getting baked. Maybe tomorrow have a jet ski race. Might crack a couple bottles on the beach day. Multi-million dollar calls about release dates. Guess they made for swimming dog. Even deep waves. Never rush nothing. Went through each phase. Hey. Hey. Heard my music. I'm the reason for your push cravings. Held it down. They call me the anchor. Yeah. Ain't she wild? And can anybody tame her? Now she want to be a gangster. Rolling weed. It's been a week since we seen a neighbor. Damn. It feels good to be a tailor. Yeah. What can I say? I choose a life of a G over a square. All day. Lot of crime and women. There's nothing left to do if you stay away. Stay away. Stay outside. I stay out the way. Out the way. >> Stay on my job. Money always chase. I will never change my place. >> And keep something just in case. And that's the only way it could be. You going to be broke, not me. Money in my pocket, new clothes on my back. I'm like that, Jack.",
    "start_time": 2.8,
    "end_time": 317.0
}