{
    "video_id": "JEe_N6myrQk",
    "channel_url": "@wizkhalifa",
    "transcript": "Lots of tacos, crab rolls. Uh, take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Uh, drop your top, switch lanes. If they ain't on them, put them on the game. Ain't no randoms, this a family thing. Spend 100K to fly them all out to LA. If they need trees, I'm the one they call. Don't matter if we got to take it on a plane. Always hitting the target because of aim. Always give me your money cuz I got game. Always traveling, learning a different language. Overseas teaching them Khalifa man slang. They smoking weed to my music because it bang. She want to give me that nookie because of my chain. I always keep a bad [ __ ] that'll roll something. Drunk night. She went ahead of my name. Who private and she ain't never been the same. No swear she only [ __ ] with the game. Uh, take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. When I write verses, sometimes it's like verses. Critics against me, them witches cast curses. Meet me down at the elevator cuz I'm coming up like ice cube. They try to keep me from running up. I used to beat the [ __ ] up. Now I just slap box it. Handle it with kid gloves. Take the locks off it. Limit my drinking to the weekend so my system won't be tweaking. Sometimes in life you got to speak in to keep the dark spirits out cuz I'm a ghost buster. I bust devils in their mouth to keep it my way. The fly wave, the highway. Either way, I'm way high. I used to think about how much I spent, but that's stupid. Compare my dollars. These haters sense. When you're clean is the queue, nothing comes out in the rinse. I dress so fidious, you could compare me to Prince. Uh, take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Take your time, get paid. Wake up early in the morning, then I b I ain't never sleeping. I'mma stay up. Hustle every day to feel the pain. Y ain't saying nothing to me. Wake up early in the morning, then I b I ain't never sleeping. I'mma say hustle every day to feel the pain. Y'all ain't saying nothing to me. [Music] Down. [Music]",
    "start_time": 5.359,
    "end_time": 184.389
}