{
    "video_id": "WmZ4Rc6E_cg",
    "channel_url": "@wizkhalifa",
    "transcript": "In the heart of sunshine we play with God to light up the way [Music] >> trees from the grower on a pound of weed so I move slower. Say she came to the studio back in the day but I don't know her. Smoke a leaf, push my eyes lower. Mind of a stoner, [ __ ] that. Mind of a owner. Rolls-Royce. Mind getting chauffeer. Always getting to the point. Always rolling up a joint. Always able to supply what they wanting. Always staying on my grind. This ain't comfort. Want to cush. Make sure they got what they come for. Roll me up a joint, but I need one more. My [ __ ] on my [ __ ] bed and my weed bomb. Ain't telling [ __ ] nothing. That's what the police for. I'm doing great at my job. You should be doing yours. A lot of smoke in the air when I open my door. My clothes supposed to be tailored. Cars supposed to be for life full of action scenes and ain't supposed to be boring. Count this money up and do the same thing in the morning. I got pion that's just for performing. I'mma light this joint up. I won't give you a warning. She going to jump right in my car. don't care about her boyfriend. She going to bring some of her friends and tell them to join in. Stay away from the drama. I try to avoid it. What I give them red eyes, what we g [Music] me in the back door. I'm the owner of it. I dropped cushion. No J, you a stoner because of it. I roll up another one. That's another roach clip. I got busted with three joints. They waved and told me it was a zip. That's a lot of weed smoked in one sitting. Break it all down. Don't have the nerve to tell me it won't fit. I'm the last one smoking and the first one rolling up sticky weed snob. That means I'm picky. [Music] I get paid millions just for performing. I'mma light this joint up. I won't give you a warning. She going to jump right in my car. Don't care about her boyfriend. She going to bring some of her friends and tell them to join it. Stay away from the drama. Try to avoid it. Would I give them red eyes? What we g [Music] [Applause] [Music] radiation in my heart.",
    "start_time": 1.04,
    "end_time": 184.44
}