{
    "video_id": "bnlUqhDh0mE",
    "channel_url": "@movieclips",
    "transcript": "Dad is going to retire and leave us the hotel. >> He's okay. He's okay. Just a little too much sugar. >> Whoa. I didn't even know he was thinking of retiring. >> Shh. Neither did I. >> Oh my gosh, Mavis. I'm so happy for you. You're going to be amazing. You mean we're going to be amazing? Dad's leaving the hotel to both of us. >> Really? Both of us? Are you sure? >> Of course. Why wouldn't he? >> Oh, uh, I don't know. I I guess I just never got the feeling that he really thought of me as, you know, part of the family. >> What are you talking about? Of course you're part of the family. >> No, I know, but you know how cranky things is sometimes. I mean, it feels like I am, but not really. >> That's not true. >> Well, not anymore. It isn't. Shh. >> We can't spoil the surprise. >> Right, right, right, right, right, right, right. I better walk this off. Hey, how's it going? Nothing to see, nothing much to talk about except the greatest thing happening in the entire universe. There is no just keep it cool, Johnny. There will be plenty of time to thank him after. All right, let's see here. Uh, dearest family, friends, and an honored guests, I have started a new phase in my life, and I feel it is time to begin a new chapter for Hotel Transylvania. So, I am extremely proud and honored to give the key to the hotel to I can't believe it. I can't believe it. I'm going to explode into a thousand little excited bits. And then those little excited bits are going to explode into millions of tiny little excited bits. >> Oh, mighty king. It is with all my heart that I accept this great honor. With this mighty key, I will unlock the future and usher in a new destiny for the great Hotel Transylvania. So many great ideas. I'm dizzy with hospitality creativity like horizontal escalators all through the lobby. Name tags for all guests for more casual relations. Green energy standing options every room for your own power source. It's going to be the ultimate Johnny takeover. I can't do it. I thought I could give the hotel to Mavis and Johnny, but he's going to ruin everything. I have to get out of this. I have to. I I ah Whoa, whoa, whoa, whoa, whoa. Sir Johnny, I think that there has been a misunderstanding. I actually can't give you the hotel. >> What? Yes. Yes. Yes. Yes. Yes. It is an old, very, very old, very ancient, very serious real estate law. >> Real estate law. >> Yes. Yes. It says, \"No residence, whether it be residential or commercial, shall ever be transferred to, owned by, or inherited to a human. For if it did to it, then that property shall be forfeited and repossessed unto it.\" Whoa, those are some serious its. >> I am truly sorry. I would absolutely love to give you the hotel, but you know, you're not a monster, so can't >> But then what's the big announcement?",
    "start_time": 0.719,
    "end_time": 237.36
}