{
    "video_id": "lIhf5sJPKFQ",
    "channel_url": "@zhong",
    "transcript": "Today, I'm stealing brain rods in real life from YouTubers because I want them all. To get them, I'll have to sneak past security and escape without getting caught. But before I try to steal the rarest brain rod from Mr. Beast, let's start stealing something easier. All right, guys. I just broke into my YouTuber friend Alan's house. He's literally right there. This is my plan. I'm going to send Allan a fake delivery tax, and once he leaves, I'll be able to steal his brain rot. Then oh, delivery. All right, Alan is gone. Now, let's find his brain rod and get out of here. Wo, so many packages. Who sent me this? Guys, I think I just found Alan's base. No way. He has a spaghetti toileti. But guys, we have a problem. His base is locked. Hold on. Look at all these red buttons. One of them has to unlock the base. This was in the package. Whoever is sending me these packages is weird. All right, let's hurry up and press one of these buttons before Allan gets back. This one. Hold on. What's that sound? Hopefully Alan didn't hear that. All right, let's try again. Um, this one. [Music] Allan has so many defense systems. I need to hurry up. Oh, it worked. I got Alan's spaghetti toileti. Now, let's hurry and get out of here. Hey, where'd my spaghetti go? No. >> Stealing Alan's brain rod was way too easy. But stealing a rare brain rod from the next YouTuber will be a lot harder. >> All right, guys. We just made it to my girlfriend Cat's house. Time to steal that dragon canalone. Wait, she's right there, though. >> Okay, let's uh let's sneak in the back. >> You're so smart. I know. Come on. [Music] There has to be an open window somewhere. >> Wait, Song, do you hear that? >> What? There's so much water. I think it's a defense system against thieves. I'm pretty sure it's a sprinklers. Run, >> guys. I'm so wet now. And Zong, I can hear something again. >> Wait, what? Luckily, there was nothing else this time. >> Let's just dry off and find a way into the house. Let's hurry. Oh, guys, we couldn't get in from the backyard. >> All right. Well, then we got to try the front. The cat is right there. Zong, >> let's try extreme camouflage. I have an idea. >> I like the way you think. >> Special delivery. >> Uh, I didn't order anything. Who's this from? >> Uh, Sammy. >> Sammy, wait. Help me bring this inside. >> All right, guys. We're now camouflaged as a package. >> I am so excited to get that dragon can alone. It's the second rarest brain rot in the game. >> I know. Oh, it's so heavy. Is Kase all in here? >> Are we really that heavy? >> You are that heavy, Zen. Don't pull me into this. >> I guess me and Case are related. >> All right, man. Have a good day. >> Thank you. Bye. >> All right, guys. We're in. >> Oh, I can't wait to open this. >> No. >> Actually, I'm getting kind of hungry. This can wait. >> She left. We're head small box. >> What we didn't know was getting inside Cat's house, which is first of three challenges we'll have to face to steal her brain rod. Where could Cat be hiding the second most rarest brain rod in her house? >> I don't know. Look at these slippers. So comfy. >> Bryce, focus. She can catch us anytime. Come on. >> Yeah, my bad. Guys, Cass's house is so big. You know what? Let's split up. It's a good idea. I'll go right. I'll go left. Where could the bra be? Oh no, I hear something. It's just my favorite YouTuber, Balden, and Kayla's playing on the TV. I got to lock in. All right, I'm going to start in the kitchen. Maybe the dragon canalone is in the fridge. No, no brain rots in here. But there is a cheese stick, though. Not bad. [Music] All right, guys. We are now in Cat's garage. There's a lot of stuff. I have a feeling the brain rod is in here. They're just bunch of paintings. Hold on. Something's shining. What is this, guys? I may not be the smartest, but I'm pretty sure the brain rod is in here. Oh no, guys. The box is locked. I have to find the key. >> It's mine. >> No, this is mine. Who are you? >> Back off. I call dibs. It's mine. >> No, it's mine. >> Wait, what's that noise? I'm going to check it out. >> Wait, I hear footsteps. That has to be Cat. See you. Not cat. >> Hello. Anyone here? >> Ew. Good thing my dragon catalone is still locked and safe. >> A, you guys are so cute. Bryce, are you playing with cats plushies? >> Uh, no. I'm looking for the brain rot. >> It doesn't matter. Someone's chasing after us. Go, go, go. >> The what? >> Who is this guy? >> I have no idea. >> Wait, look. Cat's coming. >> Cat's coming. I'll get you guys next time. As long as he's coming, we got to hide somewhere. Um, I know. The couch. >> Okay. >> Huh. Guess I was just hearing things. >> All right, guys. Me and Bryce are now camouflaged as the couch. >> All that walking made me so tired. I'm just going to sit down and take a break. >> Oh no. Cat just sat on top of us. Can she just hurry up and leave so we can steal that brain rot? >> Okay, back to video game. >> That was a close one. You're telling me. >> Wait, where did my pink slides go? They were literally right here. Maybe someone is in my house. I know what to do. My package from Sammy. Someone's definitely inside my house. I'm coming to find you. Come out. Come out wherever you are. >> Bryce, this is all your fault. She knows someone's here because you took her slides. Song. They're so comfy, though. Give it back. Otherwise, we're not going to be able to steal the brain rocks. Fine. Whatever. Come on. >> My slides were here the whole time. Maybe I was overreacting. >> All right, Song. Do you have any idea where this dragon canalone is? I do, but it's lock. We have to get the key from Cat's room. >> Not unless I get it first. >> We are taking you down. I don't think so. >> Where do you think you're going? I'm not done yet. >> Go ahead. Take my new wini pizza. Woo. The keys. You're not taking them. >> No way. I've got a pie hotspot. >> I need to find something to help Zong. He doesn't eat fruit. A plate. This will work. >> While this deep is knocked out, take the key and go get the brain rod. Here I go. There it is. The fre should be in here. Well, then what are you waiting for? Open it. Here we go. All right, let's see it. No way. I cannot believe we finally got dragon canaloney. Now, let's do the final and most rare brain rod. Strawberry elephant. I know where it is. Follow me. The only person in the world who has a strawberry elephant is Mr. Beast, which means if I want it, I'll have to sneak into his warehouse to steal it. >> All right, guys. We just made it to Mr. Beast's warehouse. So, Mr. Beast is right there, and we have Strawberry Elephant. We have to steal it. All right, let's break in. Come on. >> What are you guys doing? >> Uh, nothing. >> Okay, come on. You're coming with me. A >> next time, stay in the contestant area. >> Okay, guys. We are not in the jail. I don't think we got caught. >> No, that guard definitely thinks we're contestants. That means we're going to be in the next Mr. Beast video. Let's go. >> What? >> Bro, what are these clowns doing here? They trying to steal my Mr. Beast money. >> And what's with this embarrassing trip? Mr. Beast, official slag only. >> All right, Zong, just put on the shirt and play along. >> Don't forget the mission. We have to steal the strawberry elephant brain rod. Okay, >> please. I'd never forget. All right, contestants. It's time to play the beast games. Let's go. >> Let's go. >> Somehow, we were able to sneak inside the Mr. Beast warehouse. But little did we know, this was the first challenge out of three we'll have to face in order to steal his strawberry elephant brain rod. >> Welcome to the first Beast Games. >> All right, contestants. The first game is the cash cube. You have 1 minute to grab as much cash as you can. Ready? All right, this is the plan. While the contestants are busy trying to get the money, we're going to sneak off and steal the strawberry elephant. >> Zozong, no. There's so much money. >> Come on. The strawberry elephant is way more rare. Fine, whatever. I already know these two goos up to no good. Either way, I'm not leaving without this Mr. Beast money. >> H, who should go first? I think ladies first. >> Yes. What? Of course they chose a girl. Don't worry, Tyrone. You going next. >> Time sts. >> Let's do this. >> This is the plan. When she's done and they're celebrating her win, that's when we'll sneak off and find the strawberry elephant. >> It's a good idea, Z. It's a good idea. >> Trying to be rich after this. >> They're almost done. Let's get ready to sneak away. Okay, >> I did it. I'm free money. >> Hey, wait a minute. You look familiar. >> What are you talking about? I am not Tyrone. >> Perfect. We needed more help anyways to steal the strawberry elephant. Let's go. Wait, wait. I'm broke. We don't care. [Music] All right, guys. We are now entering Mr. Beast's kitchen. What are we doing here? We're stealing from Mr. Beast. This way. [Music] I be from earlier. You got to get out of here. I'll take care of him. Hide. >> So, what are we doing in the bathroom? >> Let's just hide here until the coast is clear. >> All right. Want to try these? >> Can we get the new Mr. Beast candy? >> Yes, sir. Let's try it. >> I'm going to try the blue one. I'll try the red one. M. So sour. >> Oh, these are actually really good. >> I could eat these all day. >> Mhm. >> Hello. >> Oh no. I think the security guard's knocking. >> Anyone in there? >> Oh, what are we going to do? We need to hide. >> We cannot get caught. >> I know. It's camouflage time. >> Let's do this. >> I'm coming in. >> All right, guys. We're now camouflaged. Hopefully, he doesn't see us. >> Hey, what's going on in here? >> Oh, nothing, sir. Just doing some cleaning for the boss, Mr. Beast. >> Guys, I cannot get caught now. Otherwise, I won't be able to steal Strawberry Elephant. >> Have you seen three contestants around here? Uh, no sir. No contestants around here. I don't believe you. I need to search the area. >> No, he's searching the bathroom. This is not good. >> Looks empty in here. Empty. >> Uh, sir, it seems to be 3:00. 3:00. >> Yeah. >> Oh, Tyrone, you are so smart. He saved us. >> We need to go search somewhere else. >> You do that, sir. Good luck on finding those contestants. So, get out now. That was a close one. That camouflage was S tier. >> Now, let's find the strawberry elephant. After you. >> All right. Where do we go? This place is massive. Upstairs is usually where people keep all their valuable stuff. How do you know, >> bro? I'm a professional. Hey, >> is that Mr. Beast? >> It is. Well, I'm going to go get an autograph real quick. >> No. Focus. We need to steal the strawberry elephant. >> All right, guys. We're not in Mr. Beast's office. >> If I was Mr. Beast, I would definitely hide my strawberry elephant here. >> Let's search. Um, guys, I don't see anything. >> A Pokémon. >> Find anything, Tyrone? >> Is this Mr. The beast chair. >> I've always wanted to do this. >> Mr. Beast, you smell amazing. >> Tyrone, stop getting distracted. >> Okay, my bad. >> Is there a red button? Oh no. Tyrone, what are you doing, >> bro? This red button could open up a secret room to where the strawberry elephant is. We all know red buttons are no good. >> Ah, that makes sense. Wait, someone's coming. >> I've looked everywhere and I can't find that strawberry elephant. Why is the beep here? That mean Bryce took the L. Rest in peace. >> A red button. Maybe this will lead me to a secret room where the strawberry elephant is. >> Zone, if that red button leads to a secret room, I'm going to get you. Let's see what happens. >> Guys, he just hooked the red button. >> Oh, he's going to press it. Maybe I'll press it. >> Three, two, one. >> Oh, what did I tell you? You were right. This is why you never press red buttons. >> I got creamed. I got to get this off of me. >> That was crazy. Mr. Beast got booby traps in here. I know. All right, let's continue and search for that strawberry elephant there. Wait, wait. The guards are coming. How did they not see us? Because we were blocked by the wall. Where they just came from? Got to be where the strawberry elephant is. >> 100%. >> Guys, I just saw Mr. Beast leave this room. Wait, is it world's most dangerous trap? Are you sure we should go in there? >> Why not? Uh, you better be right. So, you found it. There's a strawberry elephant. So, grab the strawberry elephant. Wait, is there lasers? >> No. Is there any traps? I don't think so. >> Okay, this was easy. 3 2 1 I got it. >> Woohoo. Wait, are those knives on the wall? >> Why is it moving closer? Come on. Let's get out of here. >> What am I doing? The knife are coming. Put it back. >> The knives stop moving. I think I need a new pair of underwear. The knives got so close to us. >> Of course, bro. That's why you never go into a room that says dangerous traps. So, let's just leave the strawberry elephant. >> No. I have an idea. Tyrone, take out your phone. Okay. 3 2 1 swap. It worked. But what about my phone? That's not my problem. Come on. Let's go, >> guys. I got the strawberry elephant. >> All right, let's go home. Now, where do you think you're going? >> Sor, what? Where are we? >> I don't know, but why is there a countdown on the TV? I might not be the smartest, but being tied up and a countdown doesn't sound good. >> Tyrone, are we still alive? >> Uh, I think so. I think that was a confetti bomb. >> Wait a second. These ropes aren't even tight. >> What? Oh, someone's messing with us. >> Bro, >> why are we back at my house? What was the last thing you remember? >> Uh, we found a strawberry elephant from Mr. beast. And then the thief came and I passed out. >> Hold on. There's a note here, too. It says, \"Stay away or the bomb won't be fake next time.\" >> Oh, and I think the thief left you a video message. >> Let's watch it. All right, it's loading. >> Song, now I have all your precious little brain rocks. >> You're never going to find me, loser. >> Song, the thing stole your strawberry elephant. You're cooked, bro. Let me see what else is on this paper. It says, \"Super excited to add trolotar to my collection.\" My base. My trarod is gone for my base. >> He stole all of your brain rods. >> I know. >> Wait a second. Does this mean I left Beast Games to help you all for nothing? >> Wait, we might be able to find him. Follow me, >> bro. >> Guys, maybe we missed something. You see anything? >> I don't see nothing. Wait, zoom in right here. I know that menu. I know exactly what restaurant it belongs to. For real? Let's go. >> Now that I know where the thief is hiding, it's time to get back all the brain rods he took from me. This will be the hardest mission yet. All right, guys. We just made it to the restaurant where we saw the menu. >> How do you know this the right one? >> I know all the restaurants in the city. Come on. >> You're right, big boy. >> All right, let's go inside and get the brain ros back. >> Guys, it's blocked. Don't worry, Zone. >> I got this. >> Tyrone, hurry up, police. >> I'm doing my best. >> We're literally in public. There's so many people here. Hurry up before the police shows up. >> You don't think I know that? >> Come on. Be a professional. >> Bingo. >> Finally. All right, guys. We're in. Time to steal the brain rot. [Music] >> Open banana peels right here. >> Tyrone, are you okay? >> Yes, I'm fine. I'm fine. Tyrone, I think that was a trap. >> Sir, what did you get me into? >> Let's just find a thief and get the brain rods and get out of here. >> Whatever. >> Stupid. >> Getting inside was just the first of three challenges to get my brain rods back. Wish me luck. >> Guys, this place is creepy. >> So, there better not be any more traps. >> Wait, I see something. >> Huh?  you. So many balls. Is it done? >> Where the balls hit me? >> Tro, I think you have bad luck. >> I'm about to crash out. Why is there so many traps here? And why do I keep getting hit by them? >> I don't know. The thief really don't want us to get their brain rods back. Come on. I see something over here. Look, the thief is right here. >> You're not going to my boss. Yes, we are. Ugly face. Who you calling ugly? You cry me. Tyrone got this. >> Wait, your face is actually kind of pretty. [Music] >> Nobody messed with Tyrone. >> Tyrone, I knew you could do it. I don't want to hear it. >> Wait, I actually think I see something this time. Follow me. Okay, >> you're pushing your luck, Z. >> Look at these boxes. It says spring rods on them. >> Wait, this could be another trap. >> Tyrone, I think you're overthinking it. >> All right, Z. I'mma trust you. >> Let's see what's in the first box. 3 2 1 >> What is that? >> Uh, Song, why is it pointing at me? Okay. Okay. No. I'm tired of these traps. >> Tyrone, relax. If that was the trap, one of these other boxes has to have the brain rods inside. >> Wait a second. If the trap came from me when you opened the box, I'm opening the next one. >> Okay. I even brought gloves just to be safe. >> All right, let's open the box. >> Tyrone, you find anything? Oh, I think I got something. >> Tyrone, what happened? >> My hand got stuck on a glue trap. Why do these bad things keep happening to me? >> At least you wore gloves. All right, Tyrone, don't be mad. Let's just open the last box together. >> Fine. >> All right. 3 2 1 Surprise! >> Is that the thief? >> What should we do? >> Get him. Bring it on, brother. All right. >> Tyrone, stop messing around. Let's go. >> Okay. >> Where'd he go? >> He was right here. >> Hold on. This bookshelf. It could lead to a secret room. >> It says employees only. >> That's definitely where the thief and the brain rots are. Let's check this out. Is that a basement? You ready? >> No. No. No. I had enough of this. You are your own zone. >> Goodbye, Tyrone. Brain rods, here I come. Wo! There's so many lasers, guys. If I want to get to the brain rods, I have to cross all of these lasers. Woo! Let's go. All right, let's continue. Oh! Oh, that was easy. Oh, it's moving. Oh, okay. Got to hurry up. Oh, I think I survived. That was a close one. This laser maze is one of the hardest I've seen. This laser even moves. All right, let's hurry. Woo! Oh, I think I did it, guys. I see the exit. This is my chance. I have to wait for the right timing. 3 2 1 All right, guys. I'm in a basement now. Where did the light go? I can't see anything. The lights are back up. Ah, the lights are gone again. Wait, what's touching me? The lights are back up. Now, let's explore this basement. Guys, look. This door has a warning sign on it. You know what? I have a feeling that the brain rods are behind it. Let's go investigate. Yo, guys. I found it. My brain rods are here. Oh. Rise. >> Of course it's me. >> What are you doing here? >> Oh, I'm just hanging out. Untie me. All right, let's get you out of here and let's take these B rods home. >> Sounds like a plan. >> Come on. We got the brain rods. The actor is right here. Let's get out of here. >> Where do you think you're going? Oh, not again. That was so easy. You all thought you could steal the brain rots back from me. >> Guys, the thief is way too smart. No one's coming to save us, Zong. This is it. We're done. >> Freeze. Nobody move. You're under arrest for stealing the brain bar. I'm taking you to the station. >> Let's go. >> I can't believe we actually just got saved by the police. >> Yeah. How do you know where we were? >> You weren't answering your text, so I checked your location and it led me here. >> Oh, that makes sense. >> Oh, I'm totally taking Tralero Tala and Ballerina Cappuccina back to my base. >> And I'm going to take Spaghetti twi and dragonaloney with me. See you. >> So I don't get any brain rods. >> Nope. >> Come on, guys.",
    "start_time": 0.08,
    "end_time": 1474.2
}