{
    "video_id": "LvxPsP5RLAM",
    "channel_url": "@5minutecraftsyoutube",
    "transcript": "[Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] [Music] [Music] Heat. Heat. Heat. Heat. Heat. [Music] Heat. Heat. Heat. [Music] [Applause] Heat [Applause] [Music] up here. [Music] [Applause] [Music] [Applause] Heat. Heat. [Music] [Applause] Heat [Applause] [Music] Heat. Heat. [Music] [Music] [Applause] Heat. Heat. [Music] [Applause] [Music] [Music] Do you remember this year? day was yesterday when everybody knew your name in high school. We were lost in nature. We were never in the classroom when you were my biggest crash till a friend of mine told me that you miss the way started ringing. It was my lucky day. You tasted higher [Music] trust. You say, \"Let me tell you that I think I just my first kiss would be with you. [Music] With you with you. I was a stranger in a shy world hide behind the walls as you walk in the halls. Didn't think I'd ever be yours if I'm nervous. I thought it was a dream. My friend said it was a love and I took to extreme. You tasted high. You say, \"Let me tell you that I think I learn too much.\" My first kiss would be with you, you [Music] skip, spend more time together. Gaz into my eyes. Wish it lasted forever. You whisper that you love me. Raise your lips against mine. It was the first time that I felt that with you. [Music] Heat. Heat. Heat. [Music] with you. [Music] [Music] There's something And you feel it. I know it's true. My heart stop bleeding. My heart stop bleeding. The colors of my love. Blue, green, yellow, red, purple. Looks like a rainbow. Oh, me just going with the flow. My river over my rainbow. My rainbow over my rainbow. My rainbow. What a wonderful day for me to be in love. I could have it any other way. With you, I want to reach the top. With you, I want to reach the top. The colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Me just going that far over my rainbow. My rainbow [Music] over my rainbow. My rainbow. [Music] Hey, hey, hey, hey, hey, hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, above. [Music] Looks like a rainbow. Ooh. [Music] Hey, the colors of my love. Blue, green, yellow, and purple. [Music] Looks like a rainbow. Me just going with the flow. Over [Music] the rainbow. Over the rainbow. Ooh. Over the rainbow. Over the rainbow. [Music] [Music] Hey, [Music] hey, hey. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. N. [Music] You are like the air brea you to feel alive. Chasing all the clouds just to be right by your side. Look me in the eyes. Do you see that you're my sky? You're my sky. I all my love all my love. I give you all of my love baby. All of my love baby. All of my love. All of my love, I give you all of my love, baby. All of my love. All of my love. All of my love, I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. You're like the air. Brea you into f. I don't even care about the world. It's you and I. Take me all the way. Baby, will you stay? I've given every drop of me. So what you say? Oh my love. Oh my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. Don't care about what people say. Oh, baby, baby, baby. It's not me. All of my love, I give you all of my love, baby. All of my love, baby. All of my love. All of my love, I give you all of my love, baby. All of my love, all of my love, all of my love, I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. [Music] When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill. You know what I'm talking about. I just want to know. And my dress is always clean and nothing in between. You know what I'm talking about when I'm on my way. Nothing masses up my head and my eyeliner is dream. You know what I'm talking about. That is all I want. Am I asking for too much time from scratch? When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill, you know. But I'm talking about that is all I want. Am I asking for too much? But I start all the time from scratch. This is hard to feel like you like it's true. So true. This is hard to feel like it's true. So true. This is hard to feel. Not damn late. There's none that I can do. Even if I really knew. Any beauty needs time. Make a choice. Get dressed. And there's so many things to do because the sky is not always blue. Any beauty needs time. Wardrobe filled with clothes. It would be nice to have it once. Don't think about it for a month. I need beauty time. That is all I want. Am I asking for too much? But I start my time from scratch when I'm out of bed. I want to look like a 100 mill like I'm living on the hill, you know. And I'm talking about that is all I want. Am I asking for too much? But I start all the time from scratch. This is hard to feel. I know. I know it's true. So true. This is hard to know. I know it's true. So true. This is hard to know. [Music] Heat. Heat. [Music] [Music] Heat. [Music] Heat. Heat. [Music] [Music] Heat. [Music] [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Applause] [Music] Heat. [Music] Heat [Music] up here. [Music] [Music] Do you want to come with me on the h? I don't think so. So, do you want to ride with me in the car? Uh, I don't think so. Well, I can show you all the things in the world. Uh, I don't think so. So, tell me, baby, what you like? I go everywhere with love. I don't think so. I don't think so. I don't think so. I don't think so. [Music] I don't think so. I don't think so. Well, you can give it all you got. I'm not amazing. I don't know. If you like me, just show me. I don't like the empty words you see. Is it going to ask me out and do it really nicely? You want to come with me on the I don't think so. Oh. So, do you want to ride with me in the car? I don't think so. Well, I can show you all the things in the world. Uhhuh. I don't think so. So, tell me, baby, what you like? I go everywhere with love of my life. I don't think so. I don't think so. I don't think so. I don't think so. [Music] I don't I don't think so. I don't think so. But you can give me all you got. I'm not a shot. My answer is my [Music] I don't think so. I don't I don't I don't think so. I don't think so. I don't think so. I don't think so. I don't I don't I don't think so. [Music] Every time I'm in the mirror, I see you looking at me, leaning on my shoulder, holding my hand, kissing my cheek. I don't know what to do now. You look at my phone cuz my nose to remind me that it's over. I finally talk to your Instagram stories. Down your face on the walls. I thought that I want somebody to hold me. It's not like getting to move on. One thing was horrible and yeah, I couldn't sleep. Then two, I finally did, but you invading all my dreams. Then three, I felt like dying. And then four, I couldn't breathe. Heat. Heat. Heat. [Music] Heat. Heat. Heat. [Music] I still wish that you [Music] would be a little clearer after some time and I would see only me in the mirror. You're still here looking at me forever. Was it a lie? What do you mean? Is the story really over? You're my book is you and me. I finally b your Instagram stories down your face on the walls. All that I want somebody to hold me. Start getting my dream. [Music] [Music] Heat. Heat. Heat. [Music] Heat. Heat. Heat. Why you still [Music] still [Music] d [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat Heat. [Music] Heat. [Music] Heat up here. [Music] Heat. [Music] Heat. [Applause] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] [Applause] [Music] Heat. [Music] Heat. Heat. Heat. Heat. [Applause] [Music] [Applause] [Music] Heat [Music] [Music] up here. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Yeah. [Music] Heat. [Music] Heat up here. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. N. [Music] [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat [Music] up here. Heat. Heat. [Music] [Music] [Music] [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music] [Applause] [Music] Heat. Heat. [Applause] [Music] Heat. [Music] [Applause] [Music] Heat. [Applause] Heat up here. [Music] [Applause] [Applause] [Music] Heat up [Applause] [Music] here. Heat. [Music] [Music] [Applause] [Music] Heat. [Music] [Applause] [Music] [Music] Do you remember years? was yesterday when everybody knew your name in high school. We were lost in nature. We were never in the classroom when you were my biggest crash. Till a friend of mine told me that you miss me. My phone started ringing. It was my lucky day. You taste the hide. [Music] You say, \"Let me tell you that I think I just My first kiss would be with you. [Music] I was a stranger and a sh hide behind the walls as you would walk in the halls. Didn't think I'd ever be your except for thought it was a dream. My friend said it was a love and I took to his dream. You chasing hash. You say, \"Let me tell you that I think I learn too much. My first kiss would be with you. With you, with you. With you. With you. We would skip classes, spend more time together. We both gaz into my eyes and wish that last forever. You whispering that you love me. Raise your lips against mine. That was the first time that I felt that. [Music] Heat. [Music] Heat. [Music] [Music] There's something you You feeling I know it's true. My heart stop bleeding. My heart stop bleeding. The colors of my love. Blue, green, yellow, referable. Looks like a rainbow. me just going with the flow. Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful thing for me to be in love. I could have it any other way with you. I want to reach the top with you. I want to reach the top. The colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Me just going that far. Oh my rainbow. My rainbow. [Music] Oh my rainbow. My rainbow. [Music] Hey. Hey. Hey. Hey, hey, hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, a purple looks like a rainbow. [Music] Hey, the colors of my love, blue, green, yellow, and purple. Looks like a rainbow. Me just going with the flow. Over the rainbow. Over the rainbow. Ooh. Over the rainbow. Over the rainbow. [Music] [Music] Heat. Hey, heat. Hey, heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat up here. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] You are like the air brea you to feel alive. Chasing all the clouds just to be right by your side. Look me in the eyes. Do you see that you're my sky? You're my skyh. Oh my love. Oh my love. I give you all of my love, baby. All of my love, baby. All of my love, all of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love, I give you all of my love, baby. All of my love, baby. All of my love, all of my love, I give you all of my love, baby. All of my love. You're like the air. Brea in to feel alive. I don't even care about the world. It's you and I. Take me all the way, baby. Will you stay? I've given every drop of me. What you say? Oh my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love. Baby, all of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. Don't care about what people say. Oh, baby. Baby, baby, baby. It's not a story with me. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. [Music] When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill. You know what I'm talking about. I just want to know. And my dress is always clean and nothing in between. You know what I'm talking about. When I'm on my way, nothing masses up my hair. And my eyeliner is true. You know what I'm talking about. That is all I want. Am I asking for too much time from scratch? When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill, you know. And I'm talking about that is all I want. Am I asking for too much? But I start all the time from scratch. This is hard to feel like you like. It's true. So true. This is hard to feel like now. Like new. It's true. So true. This is hard to feel. Not a damn late. There's nothing that I can do. Even if I really knew. Any beauty needs time. Make a choice. Get dressed. There's so many things to do. Because the sky is not always blue. Any beauty needs time. Wardrobe filled with clothes. It would be nice to have it once. Don't think about it for a month. I need beauty time is all I want. Am I asking for too much? Got to start all the time from scratch. When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill, you know? When I'm talking about that is all I want. Am I asking for too much? But I start all the time from scratch. This is hard to feel like you like. It's true. So true. This is hard to feel like it's true. So true. This is hard to feel now. [Music] [Music] Heat up here. Heat. [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat up [Music] here. [Music] Heat. [Music] Heat. [Music] [Applause] [Music] Heat. Heat. [Applause] [Music] Heat up [Music] here. [Music] [Music] Do you want to come with me on the NH? I don't think so. So, do you want to ride with me in the car? I don't think so. Well, I can show you all the things in the world. I don't think so. So tell me, baby, what you like? I go everywhere with love of my life. I don't think so. I don't think so. I don't I don't think so. I don't think so. [Music] I don't think so. I don't think so. I don't I don't think so. I don't think so. Well, you can give it all you got. I'm not an easy shot. I know my answer is my change. I don't know. If you like me, just show me. I don't like the empty words. You see, if you're going to ask me out, do it really nicely. You want to come with me on the I don't think so. So, do you want to ride with me in the car? I don't think so. Well, I can show you all the things in the world. Uhhuh. I don't think so. So tell me, baby, what you like? I go everywhere with love of my life. I don't think so. I don't think so. I don't I don't think so. I don't think so. [Music] I don't think so. I don't think so. I don't think so. I don't think so. Why? You can give me all you got. I am not an amazing [Music] I don't think so. I don't think so. I don't I don't think so. I don't think so. I don't think so. I don't think so. I don't I don't I don't think so. [Music] Every time I'm in the mirror, I see you looking at me, leaning on my shoulder, holding my hand, kissing my cheek. I don't know what to do now. And look at my phone cuz my windows to remind me that it's over. I finally your Instagram stories. down all your pain on the walls. It's why that I want somebody to hold me. It's not like getting to hold on. One month was horrible and yeah, I couldn't sleep. Then two, I finally did, but you invaded all my dreams. Then three, I felt like dying. And then four, I couldn't breathe. Heat. Heat. Heat. [Music] Heat. Heat. [Music] the text. I still wish that you [Music] be a little clearer. After some time and I would see only me in the mirror, you're still here looking at me. So, is it forever? Was it a lie? What do you mean? Is the story really over? You know my book is you and me. I finally b your Instagram stories down all your face on the walls. All that I want somebody to hold me. It's not getting to hold on you. I couldn't brea [Music] [Music] Heat. Heat. Heat. [Music] I still I still [Music] [Music] Heat. Heat. [Music] [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Applause] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. N. [Music] Heat. Heat. [Applause] [Music] Heat. Heat. [Music] Yeah. [Music] [Applause] [Music] Heat. [Music] [Applause] [Music] Heat. Heat. [Music] Heat up [Music] here. Heat. Heat. [Music] [Music] [Applause] [Music] [Applause] [Music] Heat. Heat. [Music] [Music] Heat up [Music] here. [Music] Hey, hey, hey. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Hey, heat. Hey, heat. Heat. Heat. [Music] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Heat. Heat. Heat. [Music] [Applause] Heat. Heat [Music] [Applause] up here. [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] [Music] [Applause] Heat. Heat. [Music] [Applause] [Music] [Music] Do you remember years? It was yesterday when everybody knew your name in high school. We were lost in nature. We were never in the classroom when you were my biggest crash till a friend of mine told me that you found me away started ringing. It was my lucky day. You taste it and hide another kiss. Let's face this. You say, \"Let me tell you that I think I love just my first kiss would be with you. With you. [Music] I was a stranger in the sh hide behind the walls as you walk in the halls. Didn't think I'd ever be your next nervous. I thought it was a dream. My friend said it was a love and I took to his dream. You tasted hideous. You say, \"Let me tell you that much.\" My first kiss would be with you. With you. With you. With you. With you. With you. We would skip spend more time together. We gaze into my eyes and wish it lasted forever. You whisper that you love me. Raise your lips against mine. It was the first time that I felt that [Music] you me. [Music] Heat. Heat. [Music] I'm here with you. With you. With you. [Music] [Music] There's something new and you feel it. I know it's true. My heart stop bleeding. My stop bleeding. The colors of my love, blue, green, yellow, red, purple looks like a rainbow. Me just going with the flow. Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful day. See, for me to be in love, I could have it any other way. With you, I want to reach the top. With you, I want to reach the top. The colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Me just going over my rainbow. Oh, my rainbow. [Music] Oh, the rainbow. My rainbow. Hey, hey, hey, hey, hey, hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, and purple. Looks like a rainbow. Ooh. [Music] Hey, the colors of my love. Blue green, yellow, and purple. [Music] Looks like a rainbow. Me just going with the flow. [Music] The rainbow. Oh, the rainbow. Ooh. My rainbow. My rainbow. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. N. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] You are like the air breathing to feel alive. Chasing all the clouds just to be right by your side. Look me in the eyes. Do you see that you're my sky? You're my skyh. Oh my love. All of my love. I give you all of my love. Baby, all of my love, baby. All of my love. All of my love. I give you all of my love. Baby, all of my love. All of my love. All of my love. I give you all of my love. Baby, all of my love. Baby, all of my love. All of my love. I give you all of my love. Baby, all of my love. All of my love. All of my love. I give you all of my love. Baby, all of my love. Baby, all of my love. All of my love. I give you all of my love. Baby, all of my love. You're like the air. Brea you in to feel alive. I don't even care about the world. It's true and I take me all the way. Baby, will you stay? I've given every drop of me. So what you say? Oh my love. Oh my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love don't care about what people say. Oh baby, baby. [Music] Will you escape with me? All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I give you all of my love, baby. All of my love. All of my love. All of my love. I give you all of my love, baby. All of my love, baby. All of my love. All of my love. I gave you all of my love, baby. All of my love. [Music] When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill. You know what I'm talking about. I just want to know. And my dress is always clean and nothing in between. You know what I'm talking about. When I'm on my way, nothing masses up my head. And my eyeliner is dream. You know what I'm talking about. That is all I want. Am I asking for too much time from scratch? When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill. You know what I'm talking about. That is all I want. Am I asking for too much? But I start all the time from scratch. This is hard to feel like new. I know it's true. So true. This is hard to feel like it's true. So true. This is hard to feel. Not damn late. There's nothing I can do. Even if I really knew. Any beauty needs time. Make a choice. Get dressed. And there are so many things to do because the sky is not always blue. Any beauty needs time. Wardrobe filled with clothes. It would be nice to have it once. Don't think about it for a month. I need beauty time. That is all I want. Am I asking for too much time from scratch? [Music] When I'm out of bed, I want to look like a 100 mill. Like I'm living on the hill, you know. And I'm talking about that is all I want. Am I asking for too much? But I start all the time from scratch. This is hard to feel with you. It's true. So true. This is hard to feel with you. I know it's true. So true. This is hard to know. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Applause] [Music] [Applause] [Music] Heat [Music] up [Music] here. [Music] [Music] Do you want to come with me on the N? I don't think so. So, do you want to ride with me in the car? Uh, I don't think so. Well, I can show you all the things in the world. Uhhuh. I don't think so. So tell me, baby, what you like? I go everywhere with love. I don't think so. I don't think so. I don't I don't think so. I don't think so. [Music] I don't think so. I don't think so. I don't I don't think so. I don't think so. Or you can give it all you got. But I'm not an easy shot. I know my answer is my change. I don't know. If you like me, just show me. I don't like the empty words. You see? Is it going to ask me out and do it really nicely? Do you want to come with me on the I don't think so. So, do you want to ride with me in the car? I don't think so. Well, I can show you all the things in the world. I don't think so. So tell me, baby, what you like? I go everywhere with love of my life. I don't think so. I don't think so. I don't I don't think so. I don't think so. [Music] I don't think so. I don't think so. I don't I don't think so. I don't think so. Well, you can give it all you got. I'm not a laser sh my [Music] I don't think so. I don't think so. [Music] I don't think so. I don't think so. I don't think so. I don't I don't I don't think so. [Music] Every time I'm in the mirror, I see you looking at me, leaning on my shoulder, holding my hand, kissing my cheek. I don't know what to do now. Can look at my phone cuz my windows to remind me that it's over. I finally talk to your Instagram stories. Tok down all your pics on the walls. I thought that I want somebody to hold me. It's not like I need to move on. One month was horrible and yeah, I couldn't sleep. Then two, I finally did, but you invading all my dreams. Then three, I felt like dying. And then four, I couldn't breathe. Heat. Heat. Heat. [Music] Heat. Heat. Heat. [Music] I still [Music] wish that you [Music] gone to be a little clearer after some time and I would see only me in the mirror. You're still here looking at me. So forever is it alive? What do you mean? Is the story really over? You are my book of you and me. I finally put your Instagram stories down your face on the walls. It's all that I want somebody to hold me. It's not getting on you. Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] Heat. Heat. Heat. Heat. Heat. Heat. [Music] I still I still [Music] [Music] Heat. Heat. Heat. [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] Heat [Music] up here. [Music] [Applause] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. Hey, heat. Hey, heat. [Music] Heat. Heat. N. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] I got [Applause] [Music] heat. [Music] Heat up [Music] [Applause] Heat. [Music] [Applause] [Music] Heat. [Music] [Music] Heat [Music] up Heat. Heat. [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Heat. Heat. [Music] Heat up here. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. [Music] Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. [Music]",
    "start_time": 0.33,
    "end_time": 6907.919
}