{
    "video_id": "EsD2ay90NCA",
    "channel_url": "@5minutecraftsyoutube",
    "transcript": "[Music] OMG, every time it's getting worse. I'm not made for this bad. I don't even really care. It's only time. I don't want to. I don't want to care about you. I feel like I'm stuck and I'm so out of luck. It's because of you. You driving me insane. You sticking like blue. I swear I'm tight over you. I swear I'm tight over you. Mad and it's getting really bad. I don't want to babysit and I don't think it's it. Just want to chill, have fun. I don't want to. I don't want to. I am done. I feel like I'm stuck in so out of black. It's because of you. You drop me insane. You stick it like blue. I spend tight over you. I spend time over you. [Music] Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye. Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye bye. >> I feel like I'm stuck in my love is because of you. You drop me in s you stick like blue sp [Music] I feel like I'm stuck in so love is because of you. You drop me insane. You're sticking like blue. Swear I'm tired of you. I'm tired of you. I swear I'm tired of you. I'm tired of you. I swear I'm tired of you. I'm tired of you. I'm tired of you. [Music] [Applause] [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] [Applause] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] Heat. Heat. Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Music] [Applause] [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat up here. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music] Heat. Hey, [Music] hey, [Music] hey. Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. Heat. Hey, heat. Hey, heat. Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. [Music] [Music] Heat. [Music] Every time I'm in the mirror, I see you looking at me, leaning on my shoulder, holding my hand, kissing my cheek. I don't know what to do now. You look at my phone cuz I know it knows to remind me it's over. I finally sto down your face on the walls. I want somebody to hold me. It's not like to hold on. One month was horrible and yeah, I couldn't sleep. Then two, I finally did. like you invading all my dreams and three I felt like dying and four I couldn't breathe my Heat. Heat. Heat. [Music] Yeah. Heat. [Music] I still wish that you [Music] might want to be a little clearer. After some time and I would see only me in the mirror, you're still here looking at me. Is it forever? Was it a lie? What did you mean? Is the story really over? You know, my book was you and me. I finally b your Instagram stories down your face on the walls that I want somebody to hold me. start getting I feel my Heat. Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. I still wish that you were here. [Music] [Music] I still I still [Music] [Music] need [Music] it. [Music] Trying not to laugh. Trying not to laugh. When I say those words, try not to laugh. Don't crush my heart. Trying not to laugh. Trying not to lie. When I say those words, try not to laugh. Don't crush my heart. Try not to lie. Try not to lie. When I say those words, try not to laugh. Don't crush my heart. Trying not to laugh. Trying not to lie. When I say this, we're trying not to. Don't crush my heart. Crush crush. Crush crush. [Music] No need. [Music] No need to try not to laugh. When I say this word, try not to laugh. Don't crush my heart. Try not to love. Trying not to laugh. When I say this word, try not to laugh. Don't crush my heart. Try not to. Try not to. When I say this word, try not to. Don't crush my heart. Try not to try not to try not to try not to try not to try not to [Music] try to [Music] say this. Don't crush my mind. Try not to laugh. Try not to laugh. When I say this word, try not to laugh. Don't crush my mind. Trying not to laugh. Not [Music] [Music] OMDers. Every time it's getting worse. I'm not made for this. I swear I don't even care. It's only time. I don't want to. I don't want to care about you. I feel like I'm stuck and I'm so out of luck. It's because of you. You driving me insane. You sticking like glue. Swear I'm tired of you. I swear I'm tight over you. You're driving me mad and it's getting really bad. I don't want to baby and I don't care. That's it. Just wanna chill, have fun. I don't want to. I don't want to. I am done. I feel like I'm stuck and I'm so out of black. It's because of you. You d me insane. You stick like blue. I'm tired of you. I tight you. [Music] Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye. Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye bye. I feel like I'm stuck and so my love is because of you. You drop me in sick like blue spike [Music] I'm stuck in so it's because of you. You drop me insane. Take it like blue. Swear I'm tired of you. I'm tired of you. I swear I'm tired of you. I'm tired of you. I swear I'm tired of you. I'm tired of you. I'm tired of you. [Music] Heat. Hey, Heat. [Music] [Applause] [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] [Applause] [Music] Heat. [Music] Heat up here. Heat. [Music] [Applause] [Music] [Applause] Heat. Heat. Heat. [Music] Heat [Music] up here. [Music] [Music] [Applause] [Music] [Applause] [Music] Heat up here. [Music] Heat. [Music] Heat. [Music] Heat up here. Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Hey, [Music] [Music] hey, hey. [Music] Heat. Heat. [Music] [Music] Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. Heat. [Music] [Music] Heat. [Music] Every time I'm in the mirror, I see you looking at me, leaning on my shoulder, holding my hand, kissing my cheek. I don't know what to do now. Can't look at my phone cuz my windows to remind me that it's over. I finally got to your Instagram stories down your face on the walls. I thought that I want somebody to hold me. It's not like I need to move on. One month was horrible and yeah, I couldn't sleep. Then two, I finally did. But you invading all my dreams. And three, I felt like dying. And then four, I couldn't breathe. My still me. [Music] [Music] I still [Music] wish that you [Music] got to be a little clear after some time and I would see only me in the mirror. You're still here looking at me. So is it forever? Was it a lie? What do you mean? Is the story really over? You're my book is you and me. I finally post your Instagram stories down your face on the walls. All that I want somebody to hold me. Start getting my Heat. Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. Heat. I still wish that you were here. I feel I still [Music] [Music] see the together. [Music] Trying not to laugh. Trying not to laugh. When I say those words, try not to laugh. Don't crush my heart. Trying not to laugh. Trying not to lie. When I say this word, try not to laugh. Don't crush my heart. Train to laugh. Train not to laugh. When I say those words, try not to laugh. Don't crush my heart. Try not to. Train to laugh. When I say this word, try not to crush my heart. Crush crush crush crush crush. [Music] [Music] window. [Music] No, it's not. Try not to laugh. When I say this word, try not to laugh. Don't crush my heart. Try not to laugh. Trying not to laugh. When I say this word, try not to laugh. Don't crush my heart. Try not to try not to. When I say this word, try not to. Don't crush my heart. Try not to train not to try not to train not to try not to train not [Music] [Music] my Trying not to laugh when I say those words. Train. Don't watch my heart. Trying not to laugh. No. [Music] [Music] OMG. I'm not made for this. I swear I don't even really care. It's only time. I don't want to. I don't want to care about you. I feel like I'm stuck and I'm so out of luck. It's because of you. You driving me insane. You sticking like glue. I swear I'm tired of you. I swear I'm tired of you. You drive me mad and it's getting really bad. I don't want to baby and I don't care. That's it. Just want to chill, have fun. I don't want to. I don't want to. I am done. I feel like I'm stuck in so out of black. It's because of you. You d me insane. You stick it like blue. I sp you. I said I'm tired of you. [Music] Every single time I want to cry, cry, cry. I go on my own. Bye bye by bye bye. Every single time I want to cry, cry cry. I go on my own. Bye bye bye bye bye. >> I feel like I'm stuck in so much love is because of you. You drop me in s you sticking like blue sp you. I feel like I'm stuck in so it's because of you. You drop me in s you sticking like blue. I swear I'm tired of you. I'm tired of you. Swear I'm tired of you. I'm tired of you. I swear I'm tired of you. I'm tired of you. I'm tired of you. [Music] [Applause] Heat. Hey, heat. Hey, heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat up [Applause] [Music] here. [Music] Heat. Heat. [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] Heat. Heat. Heat [Music] up here. [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Every time I'm in the mirror, I see you looking at me, leaning on my shoulder, holding my hand, kissing my cheek. I don't know what to do now. You look at my phone cuz my window knows to remind me that it's over. I finally your Instagram stories down your face on the walls. That I want somebody to hold me. It's not like move on. One month was horrible and yeah, I couldn't sleep. Then two, I finally did, but you invading all my dreams. The three I felt like dying and then four I couldn't brea Heat. Heat. [Music] Heat. Heat. Heat. [Music] The test you still wish that you know who [Music] gone be a little clear after some time and I would see only me in the mirror. You're still here looking at me forever. Was it a lie? What do you mean? Is the story really over? You know my book was you and me. Finally your Instagram voice down your face on the walls that I want somebody to hold me. start [Music] my dream. [Music] [Music] Heat. Heat. Heat. [Music] Heat. Heat. [Music] I still [Music] I still [Music] [Music] got together. [Music] Trying not to laugh. Trying not to laugh. When I say those word, try not to laugh. Don't crush my heart. Trying not to laugh. Trying not to laugh. When I say those words, try not to lie. Don't crush my heart. Try not to lie. Try not to laugh. When I say those words, try not to laugh. Don't crush my heart. Try not to train to laugh. When I say this word, try not to crush my heart. Crush crush crush crush. [Music] [Music] window. [Music] No need to laugh. Try not to when you say this word. Try not to laugh. Don't crush my heart. Try not to love. Trying not to love. When you say those words, try not to lie. Don't crush my heart. Try not to try not to. When I say this word, try not to. Don't crush my heart. Try not to train not to try not to train not to try not to try not to [Music] try to see this. Don't crush my heart. Trying not to laugh when I say those words. Try not to laugh. Don't watch my heart. Trying not to laugh. Not [Music] [Music] OMG worse. I'm not made for this. I swear I don't even really care. Need some me time. I don't want to. I don't want to care about you. I feel like I'm stuck and I'm so out of luck. It's because of you. You driving me insane. You sticking like blue. I swear I'm tired of you. I swear I'm tired of you. You drive me mad and it's getting really bad. I don't want to babysit and I don't it just want to chill, have fun. I don't want to. I don't want to. I am done. I feel like I'm stuck and so out of black. It's because of you. You jump me insane. You stick like glue. I spend time over you. I said I'm tired of you. [Music] Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye. Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye bye. >> I feel like I'm stuck in so much love is because of you. You drop me in sick like you spend time on you. I feel like I'm stuck and so lucky it's because of you. You drop me in sick like blue. Swear I'm tied over you. I'm tired of you. Swear I'm tired of you. I'm tired of you. Swear I'm tired of you. I'm tired of you. I'm tired of you. [Music] Heat. Heat. N. [Music] [Applause] Heat. Heat. N. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Applause] [Music] Heat. Heat. [Music] [Music] [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat [Music] [Applause] [Music] [Applause] [Music] up here. Heat. [Music] Heat. [Music] Heat up here. [Music] Heat. Heat. [Music] Heat. Heat. N. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] [Music] Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] [Music] Heat. Heat. [Music] Hey, hey, hey. Heat. Heat. N. Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Hey, heat. Hey, heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. [Music] Heat. [Music] Every time I'm in the mirror, I see you looking at me, leaning on my shoulder, holding my hand, kissing my cheek. I don't know what to do now. Look at my phone cuz my wet nose to remind me that it's over. Oh, I finally your Instagram stories down your face on the walls that I want somebody to hold me. It's not like me to move on. One month was horrible and yeah, I couldn't sleep. Then two, I finally did, but you invading all my dreams. Then three, I felt like dying. And then four, I couldn't breathe. Heat. Heat. [Music] Heat. Heat. Heat. [Music] I still wish that you [Music] would be a little clearer after some time and I would see only me in the mirror. You're still here looking at me. Swing is forever. Was it a lie? What do you mean? Is the story really over? You're my bookers, you and me. I finally b your in your face on the walls. I thought that I want somebody to hold me. It's not getting you. Heat. Heat. Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. Heat. Heat. Heat. I still I still [Music] [Music] Trying not to laugh. Trying not to lie. When I say those word, try not to laugh. Don't crush my heart. Try not to laugh. Try not to lie. When I say those word, try not to laugh. Don't crush my heart. Try not to laugh. Try not to laugh. When I say those words, right? Don't crush my heart. Try not to try to lie. When I say those words to crush my heart crush crush it. [Music] No. [Music] No. to train to say this word. Try not to crush my heart. Train to train to say this word. Try not to crush my heart. Train to train to say this word. Try not to love. Don't crash my heart. Try not to try not to. Trying not to try not to try not to try not to [Music] try to try to see this. Don't crush my heart. Try not to do that. Trying not to laugh when I say those words. Don't crush my heart. Trying not to laugh. Not the rea. [Music] [Music] [Applause] [Music] I don't want to. I don't want to care about you. I feel like I'm stuck and so out of life. It's because of you. You driving me insane. You sticking like glue. I swear I'm tired of you. I swear I'm tied over you mad and it's getting really bad. I don't want to babysit and I don't get it. Just want to chill and have fun. I don't want to. I don't want to. I am done. I feel like I'm stuck in so out of black. It's because of you. You d me insane. You stick like blue. I spend time on you. I said I'm tired of you. [Music] Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye. Every single time I want to cry, cry, cry. I go on my own. Bye bye bye bye bye. >> I feel like I'm stuck in so love is because of you. You drop me in sick like blue spo [Music] I feel like I'm stuck and so out of love it's because of you. You drop me in s take you like blue. I swear I'm tired of you. I'm tired of you. I swear I'm tired of you. I'm tired of you. I swear I'm tired of you. I'm tired of you. I'm tired of you. [Music] Heat. Heat. [Applause] [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Applause] [Music] Heat [Music] up here. [Music] [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Music] [Applause] [Music] [Applause] [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat [Music] up here. Heat. Heat. [Music] Heat. [Music] [Music] [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music]",
    "start_time": 0.66,
    "end_time": 5778.069
}