{
    "video_id": "VhTlzHFA43k",
    "channel_url": "@5minutecraftsyoutube",
    "transcript": "There's something new and you feel it. I know it's true. My heart stop bleeding. My heart stop bleeding. The colors of my love. Blue, green, yellow. Looks like a rainbow to me. Just going with the flow. Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful thing. See, for me to be in love, I could have it any other way. With you, I want to reach the top. Yeah, boy. With you, I want to reach the top. [Music] The colors of my love. The colors of my love. The colors of my love. You bring yellow, red, purple. [Music] Looks like a rainbow. Me just going that far over the rainbow. My rainbow. [Music] Over the rainbow. my rainbow. [Music] Hey, hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, a bubble. Looks like a rainbow. Ooh. [Music] Hey, the colors of my love blue, yellow, and purple. [Music] Looks like a rainbow. Me just going with the flow. Over the rainbow. Over my rainbow. Ooh. Over the rainbow. My rainbow. [Music] Heat. [Music] [Music] Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] Heat up [Music] here. [Music] Heat. [Music] Heat. Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Yeah. [Music] Heat. Heat. Heat. Heat. Heat. [Music] Heat. [Music] Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. [Music] Heat. Heat. [Music] [Music] She's not perfect but perfect for me. She got that smile I can't resist. When she looks at me I fall. She always on my mind night. I can't imagine that I would just saw in my arms beyond night like she would shine so bright. I wish I fix her hair. There's magic in the air. She acts like she doesn't care but I feel the w there. She's the only one that I see. No grown, no girls, no. She stand out as the only if I have to give her a 10. She thinks that she's not the one for me. I got to explain the way that I feel for her. She's the one that I want to call my baby. I've got to make her understand. And maybe one day she talk to me and I'll hear those sweet voice for once. She's not perfect, but perfect for me. She got that smile I can't resist. When she looks at me aart, she always on my mind. I can't imagine what it would be like my eyes be like she would shine so bright I think far away on an island that staring with her forever. My dreams don't come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains. The ball of the band is bended in my heart. She's the one perfect and little just like a pickle bit of blood inside. All right. Want to know the reason why? When I talk to her, she turns the other side. She's not perfect, but perfect on me. She got that smile. Can't resist. When she looks at me, she always on my mind at night. I can't imagine what it would be like. Just my arms beyond night. Like a special sh so bright. She's not perfect. perfect on me. She's got that smile I can't resist when she looks at me. She always on my mind. I can't imagine what it would feel like your mom be like so bright. [Applause] You're my You're my king. You're my You're my king. You're my You're my my king. You're my Let's take a walk through. Let's be different together. It's worth the fight. Cuz you're not like that. Cuz you're not. You're not. I like that. Am I [Music] baby with you? But this song so far nothing makes sense but I alone but you think that you're the king of my ride this bike riding through life. Let's be weird together. I'll stick with you forever cuz you're not like that. Cuz you're night. You're night. I like that. I like it. I like it. I like it. You're my I am my [Music] You're the king of my throne. You're the king of my throne. You pull that sword out of my soul. Now I'm completely devoted to you. Take me to her castle. Make my dreams come true. Baby, you're my you. So nothing makes sense when I [Music] be I am I am nothing I am [Music] nothing I am I am nothing my [Music] you're my king you're my you're my king you're My my [Music] Heat up here. [Music] [Music] Heat. [Music] Heat. [Music] [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Applause] [Music] There's something new I'm feeling. I know it's true. My heart stop bleeding. My stop bleeding. The colors of my love. Blue, green, yellow, referable. Looks like a rainbow. Oh, [Music] me just going with the flow. >> Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful day for me to be in love. I could have it any other way. With you, I want to reach the top. With you, I want to reach the top. The colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Me just going that far. Over the rainbow. My rainbow. [Music] Over the rainbow. My rainbow. [Music] Hey, hey, hey, hey, hey, [Music] hey, hey, hey, hey, hey. [Music] The colors of my love, blue, green, yellow, a bubble looks like a rainbow. Ooh. [Music] Hey, the colors of my love will bring, yellow, and purple. [Music] Looks like a rainbow. me just going with the flow. Over the rainbow. Over the rainbow. Ooh. Over the rainbow. Over the rainbow. [Music] Heat. [Music] [Music] Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat up here. [Music] Heat Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Hey, heat. Hey, heat. Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] [Music] Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] She's not perfect but perfect on me. She got that smile I can't resist when she looks at me at She always on my mind Wednesday night. I can't imagine that I would deny my arms be all night like she would shine so bright. I watch her fix your hair. There's magic in the air. She acts like she doesn't care but I feel the wipes out there. She's the only one that I see. No, no, no. She stand out as she only if I ever want to give her a 10. She thinks that she's not the one for me. I've got to explain the way that I feel for her. She's the one that I want to call my baby. I've got to make her understand. And maybe one day she talk to me and I'll hear those sweet voice for once. She's not perfect, but perfect for me. She got that smile I can't resist. When she set me aart, she always night. I can't imagine what it would be like. Just like be like a sh so bright. I will take her far away on an island that won't stay with her forever. My dreams but don't come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains. The followed in my heart. She's the one perfect and little just like a big bit of blood inside. All right. Want to know the reason why. When I talk to her, she turns the other side. She's not perfect right on me. She got that smile I can't resist. When she looks at me for she always on my mind at night. I can't imagine what it would be like. Just as I ar like sh so bright. She's not perfect but perfect on me. She got that smile I can't resist when she looks at me. She always on my mind at night. I can't imagine what it would be tonight like so I feel [Applause] you're my You're my king. You're my You're my king. You're my You're my king. My m Let's take a walk through life. Let's be different together. It's worth the fight. Cuz you're not like that. Cuz you're not. You're mine. I like that. You're my You're my [Music] baby. that I have with you so far. Nothing makes sense when I alone everything else. You're the king of my ride this bike riding through life. Let's be weird together. I'll stick with you forever. Cuz you're not like that. Cuz you're not. You're not. I like that. I like it. I like it. I like that. You're my [Music] king. You're my king. You're my [Music] king. You're my You're the king of my throne. You're the king of my throne. You pull that sword out of my soul. Now I'm completely devoted to you. Take me to our castle. Make my dreams come true. Be my king. Baby, you're my you. You so far. Nothing makes sense when I [Music] be I am I am nothing. [Music] You're my nothing. You're my [Music] You're my You're my king. You're my You're my my king. You're my my [Music] [Music] [Music] Heat up here. Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Applause] [Music] There's something you and you feel it. I know it's true. My heart stop bleeding. My heart stop bleeding. The colors of my love. Blue will bring yellow above. Looks like a rainbow to me. Just going with the floor. Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful day for me to be in love. I could have it any other way. With you, I want to reach the top. Yeah. With you. I want to reach the D. [Music] The colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. me just going the far over the rainbow. My rainbow. [Music] Oh, the rainbow. My rainbow. [Music] Hey, hey, hey, hey, hey. [Music] Hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, and purple. Looks like a rainbow. Ooh. [Music] Hey, the colors of my love will bring yellow and purple [Music] looks like a rainbow. Me just going with the flow over the rainbow. Over the rainbow. Ooh. Over the rainbow. So the rainbow [Music] [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. Heat. Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. N. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] She's not perfect but perfect for me. She got that smile I can't resist. When she looks at me I fall. She always on my mind night. I can't imagine that I would deny cuz she saw my arms be all night like she would shine so bright. I wish I fix your hair. There's magic in the air. She acts like she doesn't care but I feel the w there. She's the only one that I see. No, no, no. She stand out. I see the only if I ever want to give her a 10. She thinks that she's not the one for me. I got to explain the way that I feel for her. She's the one that I want to call my baby. I've got to make her understand. And maybe one day she talk to me and I hear the sweet voice for once. She's not perfect, but perfect for me. She got that smile I can't resist. When she set me aart, she always on my mind. I can't imagine what it would be like. Just like Mars be like sh I think her far away on an island that will stay with her forever. My dreams but don't come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains. The ball of the band is spended in my heart. She's the one perfect and little just like a pickle bit of inside. All right. Want to know the reason why. When I talk to her, she turns the other side. She's not perfect right on me. She got that smile I can't resist when she looks at me at she always on my mind at night. I can't imagine what it would be like. Just as I be all night sh so bright. She's not perfect but perfect for me. She's got that smile I can't resist when she looks at me. She always on my mind that night. I can't imagine what it look like just my arms be like she was sh so I am. [Applause] You're my You're my king. You're my You're my king. You're my You're my king. My m Let's take a walk of beautiful life. Let's be different together. It's worth the fight. Cuz you're not like that. Cuz you're not. You're mine. I'm like that. You're my [Music] baby. You're my house with you. But this song is so fun. Nothing makes sense when I love you. Everything does. You're the king of my ride this ride through life. Let's be we're together. I'll stick with you forever. Cuz you're not like that. Cuz you're not. You're not. I like that. I like it. I like it. I like that. You're my king. You're my [Music] You're the king of my throne. You're the king of the throne. You pull that sword out of my soul. Now I'm completely devoted to you. Take me to our castle. Make my dreams come true. Be the king. Maybe you're my you. So nothing makes sense when I am [Music] nothing. I am [Music] nothing. I am nothing. You're the king of You're my You're my king. You're my You're my You're my my king. You're my my [Music] Heat. Heat. [Music] [Music] [Music] Heat. Heat. Heat. [Music] Heat. Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Applause] [Music] There's something new and you feel it. I know it's true. My heart stop bleeding. My heart stop bleeding. The colors of my love. Blue, green, yellow, river above. Looks like a rainbow to me. Just going with the flow. >> Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful day. See, for me to be in love. I could have it any other way. With you. I want to reach the top. with you. I want to reach the [Music] colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Oh, me just going that far. Oh, my rainbow. My rainbow. [Music] Oh, my rainbow. My rainbow. [Music] Hey, hey, hey, hey, hey. Hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, a bubble. Looks like a rainbow. [Music] Hey, the colors of my love blue, yellow, and purple. [Music] Looks like a rainbow. Me just going with the flow. Over [Music] the rainbow. Over the rainbow. Ooh. Over the rainbow. My rainbow. [Music] [Music] Heat. Heat. Heat. Heat. [Music] Heat. [Music] [Music] [Music] Heat. [Music] Heat. Heat. [Music] Heat up [Music] here. [Music] Heat. [Music] Heat. Heat. Hey, heat. Hey, heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. N. [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] [Music] [Music] Heat. Heat. [Music] [Music] [Music] Heat. Heat. [Music] Heat. Heat. Heat. [Music] Hey, heat. Hey, heat. [Music] [Music] She's not perfect but perfect for me. She got that smile I can't resist when she looks at me at all. She always on my mind night. I can't imagine that I would deny cuz she saw in my arms be all night like she would shine so bright. I wish I fix her hair. There's magic in the air. She acts like she doesn't care but I feel the w there. She's the only one that I see. No, no girls, no. She stand out as the only if I was to give her a 10. She thinks that she's not the one for me. I've got to explain the way that I feel for her. She's the one that I want to call my baby. I've got to make her understand. And maybe one day she talk to me and I'll hear those sweet voice for once. She's not perfect but perfect for me. She got that smile I can't resist. When she looks set me aart she always on my mind. I can't imagine what it would be like my eyes be like she would shine so bright. I will take home far away on an island that won't stay with her forever. My dreams will come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains. The ball of the band is bended in my heart. She's the one perfect and little just like a big bit of blood inside. All right. Want to know the reason why? When I talk to her, she turns the other side. She's not perfect on me. She got that smile. Can't resist. When she looks at me, she always on my mind at night. I can't imagine what it would be like. Just as I be like sh so bright. She's not perfect, but perfect for me. She's got that smile I can't resist. When she looks at me, she always on my mind. I can't imagine what it would feel like she was So, [Applause] you're my my You're my king. You're my You're my king. You're my You're my king. My m Let's take a walk. Let's be different together. It's worth the time cuz you're not like that. Cuz you're not. You're my I like that. You're my You're my [Music] Baby with you. But this song so far. Nothing makes sense but alone. But you think you're the king of my ride this bike. Riding through life. Let's be weird together. I'll stick with you forever. Cuz you're not like that. Cuz you're not. You're not. I like that. I like it. [Music] I like that. You're my king. You're my king. You're my [Music] king. I'm my You're the king of my throne. You're the king of my throne. You pull the sword out of my soul. Now I'm completely devoted to you. Take me to her castle. Make my dreams come true. Baby, you're my you. Heat. Heat. Heat. [Music] I am I am nothing. I am nothing. I am my [Music] You're my You're my king. You're my my You're my my king. You're my my [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music] Heat. Heat. [Music] Heat up [Music] here. [Music] Heat up here. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Applause] [Music] There's something new and you feel it. I know it's true. My heart stop bleeding. My eyes stop bleeding the colors of my love. Blue, green, yellow, red. Looks like a rainbow to me. Just going with the flow. >> Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful day. See, for me to be in love. I could have it any other way. With you. I want to reach the top. with you. I want to reach the [Music] colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Oh, me just going that far. All of my rainbow. My rainbow [Music] over the rainbow. My rainbow. [Music] Hey, hey, hey, hey, hey. [Music] Hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, and purple. Looks like a rainbow. [Music] Hey, the colors of my love blue, yellow, and purple. [Music] Looks like a rainbow. Me just going with the flow. Over the rainbow. Over the rainbow. Ooh. Over the rainbow. The rainbow. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat [Music] up [Music] here. [Music] Heat. Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Hey, Heat. Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] [Music] [Music] Heat. Heat. Heat. [Music] [Music] [Music] [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] [Music] She's not perfect but perfect on me. She got that smile I can't resist when she looks at me at She always on my mind. I can't imagine that I would deny just my arms be all night like she would shine so bright. I watch you fix your hair. There's magic in the air. She acts like she doesn't care but I feel the wipes out there. She's the only one that I see. No, no, no. She stand up as she only if I ever want to give her a 10. She thinks that she's not the one for me. I've got to explain the way that I feel first. She's the one that I want to call my baby. I've got to make her understand. And maybe one day she talk to me and I'll hear the sweet voice for once. She's not perfect, but perfect for me. She got that smile and resist when she set me aart. She always on my mind. I can't imagine what it would be like. Just like Mars be like a shine so bright. I will take her far away on an island that won't stay with her forever. My dreams but I'll come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains. The ball of the band is spended in my heart. She's the one perfect and little just like a big bit of blood inside. All right. Want to know the reason why when I talk to her, she turns the other side. She's not perfect right on me. She got that smile I can't resist when she looks at me for she always on my mind at night. I can't imagine what it would be like just my arms beyond night like sh so bright. She's not perfect but perfect for me. She got that smile I can't resist when she looks at me. She always on my mind at night. I can't imagine what it would be like all night like she was It's all right. [Applause] You're my You're my king. You're my You're my You're my king. You're my my You're my king. Oh my m let's take a walk you through life. Let's be different together. It's worth the fight. Cuz you're not like that. Cuz you're like you're I like that. Am I [Music] baby with you? So you come so far nothing makes sense but alone with you everything else. You're the king of my ride this bike riding through life. Let's be weird together. I'll stick with you forever cuz you're not like that. Cuz you're not. You're not. I like that. I like it. I like it. I like that. You're my king. You're my [Music] king. Why you Why? You're the king of my You're the king of my throne. You pull that sword out of my soul. Now I'm completely devoted to you. Take me to our castle. Make my go to be the king. Baby, you're my you. Heat. Heat. Heat. [Music] I'm [Music] nothing. I am nothing. You're my nothing. You're my [Music] You're my You're my king. You're my my You're my king. You're my my [Music] [Music] [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat [Music] up here. [Music] [Applause] [Music] Heat. There's something new and you feel it. I know it's true. My heart stop bleeding. My heart stop bleeding. The colors of my love. Blue, green, yellow, referable. Looks like a rainbow to me. Just going with the floor. Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful day. See, for me to be in love, I could have it any other way. With you, I want to reach the top. Yeah. With you, I want to reach the top. [Music] The colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. Looks like a rainbow. Me just going the far rainbow. My rainbow. [Music] Oh my rainbow. my rainbow. [Music] Hey, hey, hey, hey, hey, [Music] hey, hey, hey, hey, hey, hey. [Music] The colors of my love, blue, green, yellow, a bubble looks like a rainbow. Ooh. [Music] Hey, the colors of my love will bring yellow and purple. [Music] Looks like a rainbow. Me just going with the flow. Over the rainbow. Over the rainbow. Ooh. Over the rainbow. Over the rainbow. [Music] [Music] Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. Heat [Music] up here. [Music] [Music] [Music] Heat [Music] Heat. Heat. [Music] [Music] [Music] Heat. Heat. Heat. Heat. Heat. Heat. [Music] [Music] She's not. [Music] She's not perfect, but perfect for me. She got that smile I can't resist. When she looks at me, I fall. She always on my mind. I can't imagine that I would deny cuz she saw my arms be all night. Like I saw her fix her hair. There's magic in the air. She acts like she doesn't care, but I feel the webs are there. She's the only one there. I see. No ground, no girls, no B. She stand out as she on the earth. If I ever want to give her a 10. She thinks that she's not the one for me. I got to explain the way that I feel for her. She's the one that I want to call my baby. I've got to make her understand. And maybe one day she talk to me and I'll hear the sweet voice for once. She's not perfect, but perfect for me. She got that smile I can't resist when she set me apart. She always on my mind. I can't imagine what it would be like my be like she would shine so bright. I will take her far away on an island that won't stay with her forever. My dreams but don't come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains. The ball of the band is spended in my heart. She's the one perfect and little just like a pickle bit of spit inside. All right. Want to know the reason why when I talk to her, she turns the other side. She's not perfect on me. She got that smile I can't resist. When she looks at me at She always on my mind at night. I can't imagine what it would be like. This is how you always be all night like sh so bright. She's not perfect but perfect on me. She got that smile I can't resist when she looks at me. She always on my mind that night. I can't imagine what it look like just in my arms like she was sh [Applause] You're my You're my king. You're my You're my king. You're my You're my my king. M let's take a walk you through life. Let's be different together. It's worth the fight. Cuz you're li You're like that. You're mine. You're mine. Am I [Music] looking my [Music] baby? You're my better with you. But this song so far nothing makes us better. I love you. Everything else you're the king of my riding through life. Let's be weird together. I'll stick with you forever. Cuz you I like that. Cuz you're night. You're night. I like that. I like it. [Music] I am. You're my [Music] king. You're my king. You're my [Music] king. You're my You're the king of my You're the king of my throne. You pull it all out of my soul. Now I'm completely devoted to you. Take me to our castle. Make my go. Maybe you're my you. Heat. Heat. Heat. [Music] I am I am nothing. [Music] You're my king of my You're my You're my king. You're my You're my king. You're my my [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. Heat. Heat. [Music] Heat. [Music] Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Applause] [Music] There's something new and you feel it. I know it's true. My heart stop bleeding. My heart stop bleeding. The colors of my love. Blue, green, yellow, river above. Looks like a rainbow to me. We're just going with the flow. >> Over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful thing. See, for me to be in love. I could have it any other way with you. I want to reach the top. with you. I want to reach the colors of my love. The colors of my love. The colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Oh, me just going that far. Oh, the rainbow. My rainbow. [Music] Oh, the rainbow. My rainbow. Hey, hey, hey, hey, hey. Hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, and bubble. Looks like a rainbow. [Music] Hey, the colors of my love blue, yellow, and purple. [Music] Looks like a rainbow. Me just going with the flow. Over the rainbow. Over the rainbow. Ooh. Over the rainbow. The rainbow. [Music] [Music] Heat. Heat. [Music] Heat up [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat up [Music] here. [Music] Heat. [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] Heat. Heat. Heat. [Music] [Music] [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music] She's not perfect but perfect for me. She got that smile I can't resist. When she looks at me I fall. She always on my mind. I can't imagine that I would deny cuz I hear my arms be all night like she would shine so bright. I wish I fix your hair. There's magic in the air. She acts like she doesn't care, but I feel the webs are there. She's the only one there. I see. No grown, no girls, no friendly. She stand out as the only if I ever want to give her a 10. She thinks that she's not the one for me. I got to explain the way that I feel for her. She's the one that I want to call my baby. I've got to make her understand. Then maybe one day she talk to me and I'll hear those sweet voice for once. She's not perfect but perfect for me. She got that smile I can't resist when she looks at me. She always on my mind. I can't imagine what it would be like cuz she's my be like sh so bright. I will take her far away on an island. I never stay with her forever. My dreams will come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains. The ball of the band is spended in my heart. She's the one perfect and little just like a big bit of blood inside. All right. Want to know the reason why. When I talk to her, she turns the other side. She's not perfect right for me. She got that smile I can't resist when she looks at me for. She always on my mind at night. I can't imagine what it would be like. Just how my arms be all night. Like she won't sh so bright. She's not perfect but perfect for me. She got that smile I can't resist. When she looks at me I She always on my mind at night. I can't imagine what it would feel like she was So right. [Applause] You're my You're my king. You're my You're my king. You're my You're my king. My m Let's take a beautiful life. Let's be different together. It's worth the time. Cuz you're not. I'm like that. Cuz you're not. You're not. I like that. You're my [Music] baby. You're my with you. But this song comes so far. Nothing makes sense. I love the you ride this bike. Riding through life. Let's be weird together. I'll stick with you forever. Cuz you're not like that. Cuz you're not. You're not. I like that. I like it. I like that. I like that. You're my I am my king. You're my king. You're my [Music] king. You're my You're the king of my You're the king of my throne. You pull it all out of my soul. Now I'm completely devoted to you. Take me to our castle. Make my dreams come true. Baby, you're my you. So, so nothing makes sense when I [Music] feel [Music] nothing. I am nothing. My I am nothing. You're my king of You're my You're my king. You're my You're my my king. You're my my [Music] [Music] Heat [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. [Music] [Music] [Music] Heat. Heat. [Music] [Music] Heat. [Music] feeling heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Applause] [Music] There's something new and you feel it. I know it's true. My heart stop bleeding. My stop bleeding. The colors of my love will bring yellow looks like a rainbow to me. Just going with the flow river over my rainbow. My rainbow. Over my rainbow. My rainbow. What a wonderful thing for me to be in love. I could have it any other way. With you, I want to reach the top. Yeah. With you. I want to reach the top. [Music] The colors of my love. The colors of my love. Oh, the colors of my love. Blue, green, yellow, red, purple. [Music] Looks like a rainbow. Me just going that far. All the rainbow. My rainbow. [Music] from the rainbow. My rainbow. [Music] Hey, hey, hey, hey, hey. [Music] The colors of my love. Blue, green, yellow, red, and purple. Looks like a rainbow. [Music] Hey, the colors of my love blue, yellow, and purple. [Music] Looks like a rainbow. Me just going with the flow. [Music] The rainbow. Over the rainbow. Ooh. Over the rainbow. Over the rainbow. [Music] [Music] [Music] [Music] Heat. Heat. [Music] Heat. [Music] Heat. [Music] [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat up [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. Hey, heat. Hey, heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] [Music] She's not perfect but perfect on me. She got that smile I can't resist when she looks at me at She always on my mind. I can't imagine that I would deny just saw my arms be all night like it's sh there's magic in the air. She acts like she doesn't care but I feel the wipes out there. She's the only one that I see. No, no girls. She stand up as she only if I ever to give her 10. She thinks that she's not the one for me. I got to explain the way that I feel for her. She's the one that I want to call my baby. I've got to make her understand. And maybe one day she talk to me and I'll hear the sweet voice for once. She's not perfect, but perfect for me. She got that smile. Can't resist. When she looks at me aart, she always on my mind. I can't imagine what it would be like. miles be like a shine so bright. I think I'm far away on an island that won't stay with her forever. My dreams but I'll come true then. And if she turns me down, I'll try again. I'll try again. Put it in her brains to follow the banded in my heart. She's the one perfect and little just like a big bit of blood inside. All right. Want to know the reason why when I talk to her, she turns the other side. She's not perfect right on me. She got that smile. Can't resist when she looks at me for she always on my mind at night. I can't imagine what it would be like. This is how you arite like a special sh so bright. She's not perfect but perfect on me. She's got that smile I can't resist when she looks at me. She always on my mind. I can't imagine what it would be like cuz we saw your mom be all night like she so I am. [Applause] You're my You're my king. You're my You're my king. You're my You're my king. My m Let's take a walk through life. Let's be different together. It's worth the fight. Cuz you're not like that. Cuz you're not. You're mine. I like that. You're my You're my [Music] [Music] baby. You're my better with you. song so far. Nothing makes sense, but I alone everything else. You're the king of my ride. Riding through life. Let's be we're together. I'll stick with you forever cuz you're not like that. Cuz you're night. You're night. I like that. I like it. I like it. I like that. [Music] I am my king. You're my [Music] king. My You're the king of my You're the king of my throne. You pull that sword out of my soul. Now I'm completely devoted to you. Take me to our castle. Make my dreams come true again. Baby, you're my you. Heat. Heat. Heat. [Music] You're my [Music] nothing. You're my nothing. You're my [Music] You're my You're my king. You're my my You're my king. You're my my [Music] [Music] Heat. Heat. [Music] [Music] Heat. Heat. Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] [Music] Heat. [Music] [Music] Heat up here. Heat. Heat. N. [Music] Heat. [Music] Heat. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Applause] [Music]",
    "start_time": 2.639,
    "end_time": 10483.939
}