{
    "video_id": "HEehhF_aUis",
    "channel_url": "@brentrivera",
    "transcript": "Today I'm breaking into famous YouTubers' houses and using extreme camouflage to hide in plain sight. These houses are so big and have so many places to hide. But I do not want to get caught. >> Get the out of here. I'm calling the cops. >> Starting with David Dori. His house is over 7,000 square ft. And I have more than 50 rooms I can hide in. So, let's get started. Oh. Oh, >> Brett Rivera. Oh my god. How long do we have in this house before David gets back? >> Maybe like an hour and a half. >> Okay, perfect. >> Then we went inside and Jason showed us around so we can find the perfect hiding spot. >> You think you can see me, >> bro? Yes. But since we don't have much time, we need to be fast, >> bro. He literally has a pool table. What if you disguise yourself as the balls? That's genius. You love balls. >> That's a good idea, but then we would have to cut a hole through his pool table. And since we didn't know if we could do that, we decided to ask Jason about the rules. Do we have permission to dig holes? >> Um, yeah. Inspired by me. >> But before we get to digging, we went back inside to check out a few more potential spots that I could camouflage into. Look how small I am on this bed. >> What if you hide in the Fables vending machine? >> Okay, that's actually really smart. I can disguise myself as the Fastables chocolate and get inside there. You could just hide yourself in this. >> We probably have to break it. >> Yeah, which we probably shouldn't do. >> Jason, is it cool if we break the juke box? >> Yeah. And now that we know we're allowed to destroy things, Drew took it upon himself to start making a hiding spot. >> Hey, Drew, what are you doing? Check this out. Your face is going to be the rug, and we will never see it. Where's Drew? >> Sorry, I didn't know you were there. >> And since this clearly wasn't working, and we were running out of time, we checked every room on the first and second floor before making our way back outside. >> Check this out. We found the perfect spot. We could hide in the pool. >> Where? >> Literally right there. >> Right there. You look weird. >> Brent, >> Drew, we said we were going to throw Brent in the pool. >> I lied. I'm sorry. >> And this series of events somehow led to Drew coming up with what might be the perfect hiding spot. You can camouflage yourself as a pool floater. That's actually genius. >> Okay, wait. You're saying that I camouflage myself as a swan and stay in the pool and hope he doesn't find me. I think this is a dumb idea, but I do agree. I think it might work. >> Yes. And now that I had the perfect hiding spot, we rushed back to the van where our special effects makeup artist was ready to make me look like a pool floaty. It's not stupid, right? >> Not at all. >> Okay. >> Okay. And now that we know it's not stupid, it's time to get started. When is David going to be back? We got like 15 minutes. >> What? >> Yeah. You're going to have to hurry. Okay. All right. Let's hurry. Let's hurry. >> Fast. >> Damn. Wait. This is actually pretty good. How long do you think I'm going to last in his house without him noticing? >> You might be spending the night. What if I have to go pee? >> You're in a pool. Just pee in the pool. >> Oh, okay. Yeah. Holy. You guys are gross. >> And now that I'm ready, we went back to the pool and checked to make sure I look like the other floaties before getting in the water. >> Do you think this is going to work? >> Honestly, yeah, I actually do. >> I believe that was his car. Was it? >> That was his car. >> Brent, good luck. >> And now it's time to put this hiding spot to the test. >> Oh my god. I just walked into the house. I got to stay super still. >> We're in the control van and David just got home. >> Here he comes. Here he comes. >> Oh my god. Okay. >> He has no idea Brett's in his pool. >> He didn't look to the right. Brent is right there. >> Okay. It looks like he's walking into the kitchen. >> The fact that Brett's literally a swan right now in the middle of his house is so funny. >> So, this is what David Dori does when he gets home. >> Is this like weird that we're doing this right now? >> It's really weird. >> It's a little creepy. >> Okay, it's been about 20 minutes and I'm still in the pool. It's getting a little cold. >> He's leaving the kitchen. >> Oh no. Where's he going? Where's he going? >> Okay, just don't go left. >> Okay, just go upstairs. Go. >> Okay. Okay, we're >> He's walking upstairs. He's walking upstairs. Okay, this is good. This is good. David was upstairs for about an hour and things were going smoothly until suddenly they weren't. Oh no, he's getting up. He's going toward the stairs. >> Oh. Oh. >> Oh my god. No. He's going back downstairs. >> Dude, he looks Brandon is looking straight down the stairs. >> Okay. As long as he doesn't go outside, we should be good. >> Oh, he's looking. He's looking. >> He looked towards the pool. >> He definitely just looked right at Brent and didn't notice. >> I feel like I've been in this pool for so long. I can't believe this disguise is working. >> Bro, what is Brent doing? Why is he moving so much? Just stay still. Oh. >> Oh, he's up. He's >> Oh, he's walking. Is he on the phone? >> Yeah, he's on the phone. That's good. He's distracted. >> Oh my god. The pool is right to the left of him. >> Oh, dude. No. Go to the pool. Don't go to the pool table. >> Table is right there. >> Look at Bro, it looks so good. >> They're probably honestly like 30 ft apart. And David has no idea Brent's in his pool. >> And it's almost like David somehow heard Dom because right after that, he got up and started walking outside. >> Oh no, he's walking to the pool. Hello. Here, Brent, do not move, Brent. >> Just stay still. Stay still. >> Oh my god. >> Oh, he's going to get caught. >> Oh, he's right there. He's literally right there. >> Oh my god. >> Stay still. Stay still. >> He's looking at the other swan, bro. >> Dude, he's going to walk back. Oh my god. >> Did you see him? Did you see him? >> I think he noticed him. >> Hold on. >> He's laughing. He's laughing. No, >> I got to call you back. There's something in the pool. It's hard to explain. I'm looking right at it. I'll send you a picture. >> Oh my god. >> That's definitely going on a snap, bro. Okay, dude. He's definitely getting caught, bro. He's >> splashing him with water. >> Let's go. Let's go. Let's go. Let's go. >> We're coming. >> Bro, my god, >> bro. You look good. >> Wait, that's crazy. For a second, my heart sank. But then I then I processed it really quickly. I'm like, I think that's just a human being hiding there. Who let you in? >> Jason. >> Yeah, >> Jason. >> Got I got to talk to that guy. >> We had cameras all over your house. >> Wait, you said you've been here for a couple days or hours? >> A couple hours. >> Oh, good. Okay. All right. Well, you know what? We're going to get out of your hair. Sorry for breaking into your house. All right. Bye, guys. >> All right. Bye, David. >> David Dori was nice about it, but some of the YouTubers coming up did not react the same way. So, make sure you keep watching. But next up, we have Ben Azelar and his girlfriend gave us a key to his mansion and warned us that we only have 1 hour until Ben gets home. So, let's get started. >> Let's break in. >> Who? What? Don't say that. We're in a neighborhood. We're not breaking in. And after explaining to the neighbors that we weren't actually breaking in, we broke in. >> Oh no. >> And right when we entered the house, I knew there was going to be so many places to hide because Ben has made dozens of secret rooms for his YouTube videos. >> This is nice. >> Oh my god. >> He has a Lego Millennium Falcon, which are like $800. [Music] >> Oh, what? He's going to kill us, >> bro. What do we do, >> Drew? He's going to be home in less than an hour. We don't have time to clean this up. Let's go. >> He's going to see this. >> Well, we're not off to a good start, but after a few minutes of freaking out, we finally came up with a game plan. >> Maybe I'll go set up the cameras upstairs. You guys find a spot. >> Okay. All right. And little did we know splitting up was going to turn out to be the worst decision we've ever made. >> Dude, there's literally so many rooms in here. Oh. Oh, okay. Oh, I can camouflage myself into Ben's bed. >> Dude, Ben loves to sleep. He's definitely going to find you in his own bed. >> You're right. Let's keep looking. >> And after a few minutes of searching, we found our first secret room. >> Wo! What? >> Oh my god, >> bro. What is down there, >> dude? I forgot this is Ben's house, bro. He has all these weird contraptions. >> And while Dom and I were searching for something for me to camouflage into, Drew was almost done setting up all 50 hidden security cameras around Ben's house. >> This bathroom's huge. There's got to be something here. >> Wait, Dom, look. >> What the Dude, what is this? >> It's a Lego wall. I can paint myself as the Legos and camouflage myself into the wall like this. >> Oh my god. Yo, >> what just happened? >> Oh my god. >> How many secret rooms does he have now? >> Oh my god. >> And after finding a few more secret rooms. >> Oh my god. >> I don't think this is a safe spot to hide. >> We were running low on time, so we decided to check on Drew and the hidden cameras. >> I got this whole room surrounded with hidden cameras. We got one right here, one right there, one right there, and my favorite one right there. That smoke detector is a hidden camera. >> Yeah. Wait a minute. Look. >> Yo, >> that's actually really smart. But we only have 30 minutes until Ben gets here. I have to find a spot. >> Yeah, but then let's keep looking. Let's keep going. >> Time was ticking. And since none of these spots were good enough, I was starting to get more and more nervous. But Drew wasn't. Drew, what are you doing? What is this? >> For my benny poo. I don't. >> Dude, she made this for Ben. >> Dude, you don't even know. >> I don't think you know how serious this is. He's going to be here any minute. I have to find a spot. >> Take a fruit snack. >> What is wrong with you? >> Let's go. >> And with only a few minutes left until Ben gets here, we decided to check the backyard. >> Dude, there's like nothing here. You going to hide in the pool? Wait, what is that? >> Yeah, there's a Wait, there's a treehouse. >> Oh my god. >> Wait, behind the tree? That's already camouflaged. I know. I can barely see it. And after seeing how hard it was just to get here, I knew this was going to be a good spot. Oh my god. >> Yo, this place is sick. I would say this treehouse would be perfect, but there's literally spiderw webs everywhere. What? What is that? >> Oh my god. >> He's coming for us. Oh my god. >> Okay, go go go go go. >> I'm trying. >> I guess that wasn't such a good spot. But after going inside to clean the spiderw webs off, we got some bad news. >> What? >> What? >> Ben's girlfriend said Ben's going to be here in 5. >> What? Yes. >> Wait, but I don't have a spot. Okay, well, we have to go. It doesn't matter. >> And just like that, time was up. So, we tried our best to clean up before driving off, but I wasn't going to let this stop me. So, since Ben is in his house and he's not leaving, we had to find a way to get into his house without him even noticing. So, I'm going to disguise myself as a Level's chip bag and hide in a vending machine that we're going to deliver to him as a gift. So, now that Brett's inside, we have to fill the rest up with Level's bag so that Brent comes in. Oh my god, >> that's crazy. >> Brent's life is literally in our hands right now. >> Ow, guys. Careful. Then we rolled up the hill and now it's time for the scariest delivery of my life. >> Okay, I think we're at Ben's front door. >> Yo. >> Hey, what's up, bro? >> Wait, what are you guys doing? >> We got you a Level's vending machine. >> Uh-huh. >> Oh, this is nice. >> And just like we thought, food was the perfect way to trick Ben. And things were going really smooth. >> That's a perfect This is good. >> And now that everything is set, Dom and Drew made their way back to the control van. So, let's get started. Okay, he just walked outside. Dude, he was literally looking at the vending machine for so long. >> The first few minutes went by pretty fast and Drew and Dom finally made it back to the van. >> All right, we just dropped off the vendetting machine and we are now in the control van watching Ben's every move. >> There's cameras. I hope we don't have a camera in the bathroom cuz I would not want to see Ben in the bathroom. >> Bro, what? I've been in here for like 30 minutes and my butt is starting to hurt. So far, things were going well, but maybe a little too well. It had already been 2 hours, but Ben hasn't done anything besides eat snacks in pretty much every room of the house. >> Wait, is he eating Doritos? >> Oh my god. >> Right in front of the levels vending machine. Ben, what the hell? >> Everyone knows I have beef with Doritos. Oh crap. >> Oh my god, he just looked over here. >> And just when he was about to see me, something unexpected happened. >> Someone just knocked on the door. Wait, what is going on? >> Why does he have a mariachi band in his house? >> Is this actually his daily routine? What is going on? >> What is happening? Ben does some weird stuff. This went on for another 10 minutes until they finally left the house. >> Wait, he's walking into the living room. This is where Brent is. Oh my god. He's walking this way. [Music] Why does he keep looking over there? I feel like he's suspicious of something. >> After that close call, Ben put away his snacks and went upstairs to shower. >> Part of me is wishing that he notices me because my back is starting to hurt. >> He just got out of the shower, which means he might be hungry again, which is bad news for Brent. Bro, he just ate. He's coming. He's coming. What is he doing? He's laying down on the other couch. >> Oh, he's going to the vending machine. >> Oh my god. This could be it. >> Dude, he literally just used the vending machine. He didn't see breath. >> Oh, it's not working. >> The vending machine's not working, >> bro. Wait, he's literally shaking the vending machine. >> Oh my god, dude. The vending machine is broken. >> Dude, that is not good. [Music] Where's he going? >> He's walking away. What's he doing? He's walking away. He literally just left. >> Oh my god. He was shaking the vending machine so hard. One of the chip racks must have gotten stuck when he was trying to get one. >> Where is he going? He He went into the Lego room. >> Is he grabbing a bat, bro? Wait. Oh my god. This bat. What is he going to do with a bat? >> Break the vending machine. >> He's coming back down. He's coming back down. >> Is he holding a bat? Dude, Brett's got to get out of there. What is he doing, >> dude? He's going to hit Brett in the face of the back. >> Dude, he's about to break anything. >> All right. All right, that's enough. Go, go, go, go, go. >> What is he? What is he doing with the bat? [Music] Open. I'm in here. I'm in here. >> What are you doing? >> Can you help me out, please? >> Why are you in my house? >> I've been here for 4 hours. Ow. >> Stop. Don't hit it. >> What is going on? >> Yo, all your guys' plan is ruined. >> Ow. When did you know I was in the vending machine? Like 10 seconds ago. >> What? >> Wait, is that why you grabbed the back? >> Yeah, I was going to break it open just to mess with you. >> Honestly, this is why Lexi is the better Rivera. >> What? >> I mean, he's not wrong. >> Subscribe for me >> and like for Lexi. >> No, subscribe. >> Like, like, guys, everyone likes me more. >> Okay, now that you've subscribed, let's move on to the next YouTuber, Fede. The next YouTuber on the list is the biggest creator in Mexico with 69 million followers. >> Wow. >> What? 69. >> Now that we have that out of the way, let's break in. >> Oh, wo. >> Oh my god. >> He has a Lego coffee table. >> Where do you even buy that? Doesn't this guy look like Drew? >> Bro, that does look like >> The only problem is is I have no idea when Fetty is going to get home. >> What? >> Yeah. No, literally none. >> So, we should probably find a spot fast. >> Exactly. Since time was limited, we quickly looked through a few rooms. >> Oh, wait. Okay, it's a bathroom, but look at this. Wait, what? Why does he have an arcade machine in his bathroom? >> And after a few more rooms and some questionable artwork, we found something that might come in handy later. Wait, he has cameras all over his house. >> We got to make sure that he's not looking at these while you're trying to hide. >> Next, I tried on some disguises I brought from home, and then we made our way outside. >> Look at this painting. This could be honestly perfect. All you have to do is paint your face like the wall. You could hide right here. Okay, that's actually a really good idea, >> right, >> guys? What? Where does this lead? Come here. Look at this. There's like this weird door under his house. >> Oh my god. >> Holy crap. >> This basement is so creepy. It's a door. >> Oh my god. I think it goes deeper. >> What is all that stuff? Look at this. Oh my god. There's another room. No way. What is this? It goes like far back there, too. There's like tunnels. Oh my god. >> What is that? I think we should go look for a spot somewhere else. I don't like this. >> I agree. Let's get out of here. >> Why the does he have this? What is this, Betty? What? >> After getting the hell out of there, we went back inside to check out the second floor. >> Wait, this is his closet. >> Yeah, he has a lot of weird stuff in here, honestly. >> Oh, this is his bathroom. Look. >> Yeah, look. I left him a gift in here. >> What? >> Bro, what is that? Why it stinks in here? >> Yeah, I had to go, bro. Okay, so we broke into his house and then ruined his toilet. And since we already left too much evidence inside, we decided to head back outside. We've literally checked his whole house, and I have no idea where I'm going to hide. Bro, out here is literally just a bunch of bushes and rocks, dude. >> Okay, well, we're running out of time. Why don't you just hide in the bush with the ghillie suit you brought? Wait, that's actually so small. >> It's like our only option. He's going to be home any second. >> And Drew was right. This was my only option. So, I put on my disguise and found the perfect spot. >> I mean, it looks good, but your face is so exposed. Hey, well, I can do my makeup to blend in with one of these rocks. All right, I'm almost done, guys. What do you think? >> This is so scary. >> It's crazy. >> What? >> Then we made our way back to the spot, got in position, and then we started adding some grass to help me camouflage perfectly. >> Oh my god. Wait, that actually looks so good. >> And after a few finishing touches from the special effects artist, I was perfectly hidden. >> Bro, this looks so good. You can't even tell where Brett is anymore. >> I'm right here, guys. >> Oh my god, dude. Okay, we're going to go to the control van. You just stay here, okay? Don't move. Good luck. And just as we thought things were going smoothly, this happened. >> Bro, he's literally here. What do we do? What do we do? Daddy's literally already home. He was not supposed to be home by now. >> Wait, Freddy is already in the house. How are you going to leave the house now? >> Okay, so we didn't make it to the control van, but luckily this monitor has a bunch of security cameras. So, I mean, I guess we should just watch this one sec. >> It's crazy to think that Brent is literally just right there. >> Okay, I just have to hope FedE does not come in the backyard. I feel like this is our opportunity now to slip out and get to the control. >> No, he's coming back downstairs. >> Are you serious? >> Oh no, he's right there. Dude, we can we can't risk leaving this room around. >> Bro, why is he moving so much? >> Oh. Oh. Oh, he's watching TV. Okay. >> I can't believe this is working. He literally has no idea where I am. >> Oh, he's up. He's up. He's going back downstairs. Wait, it looks like he's going outside. Dude, Brent is definitely freaking out right now, >> guys. I have to pee. >> Oh my god. Oh my god, dude. He's literally right in front of us right now. Yo, he's like trash at basketball. >> He's playing basketball right now. He's literally right next to me. >> Oh, wait. He's going back inside. >> Oh, right outside. Should we hide? Should we do He's right outside. >> Dude, let's go. He's coming. Let's go. Hide. Hide. Hide. Hide. Hide. Go. Go. Oh my god. [Music] >> What? Oh, what's up, bro? >> What are you guys doing here? >> Hey. Hey man, >> did Dom and Drew just get caught that he's definitely going to know that something is up. >> Where's Bren? >> Yeah, he's uh he's kind of >> Yeah, he's on the way. >> I hope Dom and Drew can think of a good excuse. >> Are you sure Bren's is enough here? >> And then we found out the real reason of why he wanted to know if I was there >> on the couch. Where's Lexi? Where's Lexi? >> What? >> Drew and Dom were doing a good job of distracting Fede, but he was still extremely suspicious. >> Just one question. Where's Where's Bren? He's He's coming. He'll Yeah, he's not here. >> I don't know how long I'll be able to get away with this, but it's already on hour two. >> Dad, what's where's Bren? >> Bro, why are you so suspicious? >> Bro, yeah. Why do you keep asking? We told you he's just not here yet. Wait, is that it? >> No, it's not. Hey, >> what are you doing, bro? >> It looks like he's looking for me, >> bro. What are you looking for? I'm looking for a friend. >> What do you mean? Bro, we're telling you he's literally He's not here yet. >> Feet is not messing around. He's literally looking for me everywhere. Maybe he's on a mission. >> Maybe he's downstairs. Did you think Lexi is going to watch this video? >> She will. >> Oh yeah, guys. Maybe Bry is here. >> Don't distract me. >> Okay. >> Oh my god, they're walking toward the backyard. I have to stay really still. >> And while I was staying extremely still, Dom and Drew took Fede to the haunted basement. >> All right, go check in there. Perfect. >> Dude, what are we going to do? We're running out of place. >> One sec, Fetty. The door is locked. >> It's locked, >> dude. We're literally running other places to distract him with. What are we supposed to do? >> Is there anyone in here? >> Oh my god. Hey guys. >> Oh my god. >> I hear them. They're checking the basement. >> Uh maybe he's in the tunnel. >> Wait, there's a tunnel. >> What is down there? >> Okay, look. I mean, >> maybe I can check in the gym. >> Dude, that's like really close to our friend's side. >> Oh my god, they're headed to the backyard. This is so bad. This is so bad. >> Let's Wait, show me the I I haven't even seen the gym. >> Yeah, actually, I'm I'm kind of out. Wow. So, do you actually use this gym? >> I don't know how long I've been out here, but it feels like I've been here for 5 hours. >> In the roof. >> The roof? >> Wait. Yeah. >> You can go on the roof. >> All right. Wait, what? Oh my god. >> All right. Show us the roof. >> Wait, what? >> You just climb up there? >> Yes. >> Let's go, guys. >> Oh my god. >> We're going. While Drew had Fede distracted on the roof, Dom came over to check in on me. >> Fede and Drew are looking on the roof right now. He literally walked past you twice and has no idea you're here. >> Then Dom and I came up with the perfect plan. And if everything goes well, I might end up staying the night here. >> Hey, did you guys find him? >> What? >> Did you guys find him? >> No, he's not here. >> That's what I'm trying to tell him. >> When are you going to realize that he's just not in this house? >> One sec. >> What? He keeps saying that and then doesn't find him. >> Where are you gone? >> Yo, wait. Where are you on? >> It's weird because this is not mine. >> Um >> then what is it? Agillies here. >> No, over here. You You should show us the tunnel. >> No, don't worry. >> Wait, where you going? >> Go here. >> See, there's nothing up there. >> A secret room in there. >> There's a what? What? >> A secret room? Secret room. >> Yo, it's We've been here for like 4 hours. Like, it's getting late, man. >> No, seriously. >> So, those plants are new, >> huh? >> Plants are new. >> Oh, these? Yeah, I like I like those. It's really nice. >> Dude, we should uh you put these plants in here. >> Uh no, no, no. We just we found it like that. >> What is that? >> Huh? >> What the What? How? >> I knew it, bro. >> I knew it. >> He was committed on finding Brent. How did you know? >> When When I went to the gym, he was there. Yes, I was there the entire time. Bro, you walked past me like two times. We've been here for like 4 hours. Betty, I'm sorry for breaking into your house. >> It's okay. >> I literally feel like I'm going to pass out. >> But before I do, let's move on to the next YouTuber. Jordan and Salish Matter. So, we're here at the house right now, and Jordan is going to help me find a spot somewhere in the house so that Sish has no idea I'm in there. >> Yo. >> Hey, Jo. >> Hey, how you doing? >> Good. Oh, you got the levels. >> Oh, what? Oh, is this your mom? Then he took us around the house and showed us a few potential hiding spots. >> Wait, friend, what if you painted your entire body red and literally just sat in the chair? Stand up. Look it. If you cut a hole through the chair, stop. Wo! Dude, that's my chair. >> Are you actually kidding? >> You can hide inside of it. >> What are you doing? >> My chair. >> We're desperate for a spot. I didn't know what else to do. >> Are we chair? >> Oh my god. Don't say that. Stop. And since Drew already ruined the chair, Jordan let us cut a little more to see if this spot would work. So, I would disguise myself as this red chair. >> Dude, that does not look good. >> So, I guess I owe Jordan $1,000 for nothing now. But after that, we checked out a few more spots and then I asked him a few important questions. Jordan, what time is going to be home? >> It's going to be about an hour. >> Okay, we got to hurry this up. >> Come here. Come here. Come here. >> Jordan, there's nothing in this closet that I can hide in. >> What? Yo, >> wait. What is that? >> That's sick. Oh my god. >> Wait, what? >> So, this is like a secret movie theater room? >> Yes, it's awesome. But the fact is that she won't go in there. So, like you're just going to hide there for a year. >> With time running out, we made our way outside and checked out a few more places. >> Wait, wait, wait, wait. You know what could be more interesting? Actually, come here. What about this? >> Wait. I can literally disguise myself maybe as the balls and like >> Yeah, if you were 3 ft tall, you could. >> Wait, wait. >> What? >> Your head would fit like perfectly here. Wait, I could literally hide inside the cotton candy machine and then my head could stick out right here and I can disguise my face as the cotton candy. >> I have a feeling this is the best spot. >> Wait, that's literally perfect. >> Okay, now that I have my spot, we only have 15 minutes to get my makeup done to look like cotton candy and get in position. >> Good luck. >> Okay. All right. Wait, wait, wait. True. True. True. >> What are you doing? >> I'm eating cotton candy. >> Okay. No, Dom. Drew, can you guys carve a hole through the cotton candy machine so I can fit inside? >> Wait, are we allowed to do that? >> Yeah, why not? >> Yes. While Drew and Dom were doing that, I made my way to the van and got started on my makeup. So, I'm about halfway done through the makeup. Salish gets home in 20 minutes, so we need to hurry. How do I look? >> So good. >> Insane. >> Sish is going to be here in 5 minutes. So, I'm going to get in the machine as fast as I can. >> Oh my god, >> bro. That's crazy. >> And after a few finishing touches, it was time to get started. >> Wish me luck, guys. >> All right, good luck. Let's go. >> We cannot let her see us, Dom. Go, go, go to the control. Okay, we're going to start shooting in a few minutes. >> Oh, Sish, she's home. All right, Salish and Jordan are home. >> They're inside the house. They're waiting for the clown that they hired, but she has no idea that the clown is Drew. Okay, I'm putting on the clown outfit. Everything is going to go according to plan as long as I do not blow Brent's cover. >> Exactly. All right, Drew is going in as a clown right now. This might be one of our worst ideas ever, but hopefully it works. We just got to check it on Brent. >> All right, we're ready. We got the clowns. >> All right, he's going in. He's going in. Dude, this is so funny, bro. We're doing like a $100 carnival, $1,000 carnival, and a $10,000 carnival. >> Okay, it looks like they're distracted. I think Drew is going to try to talk to Brett. >> I'm doing fine. She still hasn't noticed me. >> It looks like he's literally just talking to the cotton candy machine. What is wrong with this clown? >> So, why don't we do this? Okay, ready? You want to do the intro? All right, let's do the intro. Come on over here. >> They're literally walking out to the backyard. I just have to stay super still. >> Okay, everybody. We are the $100 carnival and we have 5 minutes to experience it. 1 2 3 go. Okay, first thing we got to do. >> I can't believe she literally can't see that bread is right there. >> Jordan, you guys should go over there and check that out. >> We will. Oh my god. What is that voice, dude? >> Why is Drew talking like that? >> Okay, there's one. >> Yeah. >> Okay, Drew is currently having a conversation with Brent and Sish literally has no idea. It looks like he's just talking to the cotton candy machine. >> No, no, >> but then the worst thing possible happened. Salish decided to try the food. Um, I'm going to go to the bathroom and I'll I'll just be right back. >> Okay, Drew's coming back right now and Brent still didn't get caught. >> No, we'll try it. Okay, yum. Here we go. Okay, good, good, good, good. Okay, you put the cotton candy on this. Grab some cotton candy and then we're done. Just grab some There we go. Okay, that's too much cotton candy. You're really doing a lot of cotton candy. >> Wait, what? >> What? Wait, what's that? >> What? >> No. She's biting you. She's fighting. Okay, we got to go back. We got to go back. Go, go, go, go, go, go, go. >> No. Were you suspicious? >> Not really. I mean, a little bit, but No. I thought it was kind of a weird video. >> Guys, I'm still in here. >> He's good. He's good. Let's go get some dinner. Have some dinner. >> Are you guys hungry? Let's go get We got to go. We got reservations. Bye. [Music]",
    "start_time": 0.24,
    "end_time": 1650.6499999999999
}