{
    "video_id": "Z5NtYq3i-mk",
    "channel_url": "@brentrivera",
    "transcript": "Today, I'm exploring some of the creepiest, scariest, and most isolated locations I found on Google Maps. Like this abandoned water park on a remote island, a sunken World War II tank with live missiles, and so much more. All of these places have either been evacuated or abandoned, and right now, we're going to figure out why. So, make sure you keep watching until the end because we risked our lives filming this video. What the [ __ ] is that? Starting with this military plane crash in the middle of a Canadian forest. But first, we need to find it. So, we drove into the woods and hiked for about an hour. And then we started seeing signs of a plane crash. Wait, this dirt path is where the plane landed and slid. That's got to be why all these trees are knocked down. >> Yo, guys, I think I see something. >> What? Up here. Oh my god. >> Oh my god. It's the freaking engine. What? >> And after walking through a lot more debris, we finally found the main part of the plane. >> Bro, it's right here. Oh my. Dude, it's way bigger than I thought. >> Holy crap. >> Look at how many pieces there are. This is just all plane debris. Oh my god. >> And now that we're here, let's start searching for clues. >> Oh, dude. It's like a blueprint of the plane. We're standing on that right now. I can't believe you can go inside of it still. This is crazy. We're going inside the tail section of the plane right now. Oh, I mean, >> you can tell it's old because everything is just rusting away. Like, look at this. >> You know what that is? That's the turret that was used to like shoot enemies. >> So, this this plane fought. >> Yeah. Huh. This plane used to carry big bombs to drop. >> You're right. It like spins. They shoot like following planes. >> Exactly. >> Imagine being a soldier just like sitting right here while the plane is crashing. Now that we found the tail of the plane, we need to hurry up and find the rest because the sun is starting to set and if it gets too dark, we won't be able to find our way back through the forest. So, our goal is to find out why this massive plane crashed. You said it was a military plane. It could have got shot down. >> Maybe that's the only reason it makes sense. All right. Well, let's keep looking for clues. Look, there's a number. Wait, what is that? >> Oh, okay. Here, look, look. The number 5113721 refers to a serial number of the RB-36H Peacemaker. >> What? >> And it gets crazier. There was 20 passengers on board and nobody survived. >> What? >> Wo. >> It doesn't say why it crashed. So, let's see if we could find something. >> Okay. And after finding a few more pieces of the plane, things were still not making any sense. >> Bro, there's caution tape. >> Okay. Wait, why would there be caution tape? That should be like a sign not to go. >> Wait, there's more up here. Are we not supposed to be here? >> Oh my god. Dom, this isn't a good idea. We might find something we don't want to see. >> This is probably a huge explosion. This is melted metal just all along the sides right here. This thing was definitely >> I mean, yeah, it was probably carrying bombs, right? So, it would make sense if it exploded. >> As we were exploring, we kept finding things that seem like they were part of a cockpit, so we knew we were getting close. >> Bro, this looks like a window. >> Yo, holy crap. >> This is freaking huge. >> In order to get to the rest of the plane, we're literally stepping over all the wreckage. >> Wo! >> Oh, is this like a shell? It's a freaking shell from the turret. >> Shut up. >> That's crazy. >> And after searching another mile, we found what might be the most eyeoping thing on this island. >> Oh my gosh. >> Oh, it's burnt. >> The pilot was probably wearing this. >> That's crazy. >> I'm going to put this down. Well, if it's helmet's right here, this is probably where he died. That's so sad. >> That's crazy to think about. >> Now that we searched the entire area and found all the clues we could, it's time for the final verdict. Based off all of this wreckage and how everything is so scattered and destroyed, I think this plane got shot down. >> I agree. >> Yeah. >> What else could it be? You can't just hit a mountain like that. >> That's what I'm saying. >> But we better get out of here because we have a flight to catch to the next Google Maps location. >> Oh, a flight. Brent, I am not flying after seeing this. >> Bro, what? How are you going to get home? >> I'll drive. I don't know. I'll walk. >> What? >> Drew, let's go. Bro, what? Next Google Maps location? >> Don't get off the hook. >> All right, let's head across the world to Japan for this next one. But keep in mind, these places only get crazier and crazier. So, make sure you keep watching. This next Google Maps location is an abandoned water park somewhere here in Japan. >> Yeah. What do you mean by abandoned? >> What are you wearing? >> I was ready for the water park. >> Why would I come if it was abandoned? >> Okay, so the spot we're looking for seems to be in the middle of the woods. And it looks like there's still slides there. >> Yes, there's slides. >> After that, we hiked for about 20 minutes before finally arriving at the front gate. Okay, so this is the front of the water park where you would buy your tickets. >> Oh, look at this. The entrance right here. >> What? >> We can go in right through this little gate. >> Oh my god, bro. What? >> Brent, you got to see this. >> Oh my god. >> This is sick. What? >> Oh, >> the water's black. >> Water's not supposed to be black. >> Yo, let's go check out over here. This was the bridge to get to the middle. >> Exactly. >> We might be able to use this piece of wood. >> Drew, you know what? Not we're not going to use this. This is way too dangerous. And since we couldn't find another way across the lazy river, we decided to check out some of the other slides when we noticed we could walk across this one to get to the main area. >> Oh my god, the staircase is right here. >> Let's go. >> Drew, wait, wait, wait. Bro, this place has been abandoned for years. How do you know that that staircase is not going to collapse? >> I don't know if we should be walking up these stairs, bro. >> Oh, okay. >> My gosh, >> this does not feel sturdy. >> I am not surprised there's no line for this slide. >> Then we started walking down the water slide. >> Okay, now we are able to make it to the big slide. Oh my god. Holy, bro, these slides are huge. >> Look at how many there are. I don't think I've ever been anywhere as cool as this. Yo, when you stomp, the entire structure rattles. Ready? >> Probably not the best idea. >> So, are we sure we should keep going up? >> Yeah. This is pretty high. >> Wo! >> Oh my god, bro. Dude, look how high up we are. >> Okay, but why does this slide look so new? The slide actually does look really new. >> It does. >> Like, look at this. This is perfect, bro. The fact that we are this high up on a rusted structure. We don't know if it's safe is crazy. Yeah. >> And while Drew and I were literally in the middle of talking about how dangerous this slide was, Ashton was doing this. >> Ashton, bro, what are you doing, >> bro? I'm just chilling in here. It's kind of nice. >> That is not safe. >> I think I'm going to check out more down the slide. >> He's just going to go down the slide. >> Yo, Ashton, go to the bottom. We'll meet you at the bottom. >> Okay, sounds good. >> Oh my god, this guy's going to die. I got it. Okay, I really hope this is stable because if not, my life might be on the line. >> And since it was, Ashton was extremely careful and extremely slow. I can like hear the slide freaking rocking as I'm taking my steps. >> Guys, this is scary. >> It doesn't sound like he's gone anywhere. He's like still way up there. >> There you are. What took you so long? >> Halfway down, it got pitch black and I could feel it shaking. >> Well, I'm glad that you did it and Drew and I are safe. Oh my god. Then we got back to our mission because we need to find out why this place got shut down. >> This looks like the office to the water park. This does not look welcoming. >> Wait, these are probably what controls on the slides. >> Moment of truth. >> Wait, what is that? >> Three. >> Wait, don't truth. >> No, they always tell you to press the red button. >> No. Hey, >> 2 1. Now that we got that out of the way, let's keep looking. >> Okay. Wait, guys. Yes, guys. Look at this. Look at this. What is this? >> Oh, right. Not function report. >> Oh my god. >> What? Look at this. The ride literally snapped in half. Wait, there's more. >> Oh my god. >> And after finding a few more pictures and documents that we couldn't read, we found something that we were not expecting to find. >> What? What is this? Wait, what is that? Is that a DVD player? >> Look, there's a DVD in it. >> Oh, wait. >> It turned on. >> What? It looks like a commercial. >> That is Wait, so that was like an old commercial for this water park? >> Yeah, that was it. >> I'm not going to lie, this water park looked really fun in its heyday. Um, are you sure about that? >> I mean, not that. >> Because I I think this might have something to do with why this place is closed. >> I think so, too. >> But little did we know, we were about to find something that would change our entire perspective on this water park. >> Where's this? >> Is this a grave? >> It's like a memorial for something. >> Look at they have like a little toys and the flowers. Bro, this is a memorial, bro. >> I mean, why would it be here at the water park? >> This person probably died at the water park. >> Oh, wait. On one of the broken slides. >> That's the only thing that explains on why it was opened only for 10 years. >> Yeah, exactly. It just felt like way deeper. Like I kind of had the chills. Yeah, >> that location was definitely eye opening. But these next places get even crazier and crazier with this next one being an abandoned military tank that somehow ended up in the middle of the Pacific Ocean. And since we didn't have a boat, we hired a local to take us there. >> It's pretty dangerous from what I've heard. >> Really? >> Do you think we'll be able to find it today? >> Hopefully. >> Hopefully. Okay. >> Then we got on the boat and started searching. >> Wa! What is that? And while we were out in the middle of the ocean, we somehow found something that wasn't a tank. >> Bro, look at how close we are. >> Oh my god. >> Okay, so it's definitely not a tank. >> No, this is a full-blown shipwreck. >> But before we could even get on the boat, we got some really bad news. >> So, should we explore the boat? >> I mean, we could. >> Actually, guys, there's a storm coming right there. And if we don't get going now to find the tanks, we probably might end up like the ship. >> What? Underwater? >> All right. Yeah. Yeah, we should probably go find the tanks. Then we kept searching for another hour, but we cannot find the tank anywhere. >> We haven't had much luck, so I'm going to fly my drone to get a better view. Drew, you know what happens every time you fly your drone. What happens? Nothing happens. Stop. >> 3 2 1 no. >> Okay, so that's what happens. >> Stop every time. >> After retrieving the broken drone, we kept searching and finally found the tank. >> Oh, wait. Look at Brett. That's it. That's okay. >> Are you sure? >> No. >> That's that. >> That's definitely it. >> That's literally it. >> Oh my god. >> That's crazy. We found it, >> bro. This is insane. The whole tank is covered in moss and coral. >> This thing has to be like over 50 years old, >> dude. Look at It's so rusty. >> Oh my god. >> Oh my god. >> We're literally standing on a military tank right now, >> bro. At one point, this thing was shooting missiles at things. That's crazy. And look at Ashton's just looking down the hole. Ashton, what are you doing? >> I'm just hoping it doesn't shoot anymore. >> So, he puts his face in front of it. >> Bro, that's so scary. >> You can still see like wires and stuff. >> Oh, yeah. Look, bro. The pipes. Look at the pipe right there. And now that we've pretty much seen everything on the outside, let's check out the inside of the tank. >> You can go inside of it. I mean, let's find out. >> Wait, what? >> Oh my god, bro. It's rusty everywhere. Look at this. I don't even know what I'm stepping on right now. Is there anything down there, >> bro? It's freaking actually huge down here. Look at this. >> Wait, really? >> Oh, there's aing skeleton. >> Wait, what? Wait, what? Dude, no. Shut up. You're lying. >> Right there. Look, there's a freaking skeleton. >> I don't see it. >> It's right there. It's like blended in. >> Oh, that can't be real. >> True. >> This is fake. Why is it down there? What? >> The locals probably put it here to scare people like you. >> Oh, and it worked. Why does it look so real? >> Oh my god. And now that it's safe, it's time to check out the inside. >> Oh my god, >> dude. We are literally in the tank right now. This is what you would use to shoot the tank. >> Wait, look at this. There's like storage. This probably where they put their stuff. >> You guys, look what I just found. >> What? What is that? Is that a bullet? >> That's a real bullet. >> Shut up. >> Oh my god. >> What is a bullet doing in here? >> Wait, look at how old this thing is. It's all green from the ocean water, too. >> Bro, that just shows that this tank was actually used for like war. There's so many things in here. Like, look it. Wait, what is that? It's a canteen. Look. >> Listen. >> Ew, bro. It's freaking splashing on me. >> Stuff in this. >> Wait, what? What's in it? >> Oh, bro. >> What is it? >> Ew. What the >> Bro, what is that? >> Is it that old that turned black? >> Stoping pouring it. That's where we're standing. >> And now that the floor is covered in whatever the hell that was, we need to finish searching this tank fast. >> Is that gas mask? >> Oh my gosh. It's a old gas mask. >> Shut up. Why is that in here, bro? This might be from like World War II, bro. No, you're not putting that on. Ashton, what are you doing? >> Ashton. >> Ew. Bro, I'm in the tank. >> Dude, what is going on? Look at this. This is the peeppole. So, this is where they aimed to shoot the tank. >> What? >> And it's just It's still right here. You can barely see through. Look at There's fish in the tank. It's a It's a Oh, it's a fish tank. >> What? >> That's pretty good. >> The only clues inside the tank were the bullet and the gas mask. So, we went back outside to check underneath the tank. >> Get him, Mom. >> Drew. >> Oh my god. >> I'm going under. >> All right. Come on, Drew. >> Drew is looking around the tank right now. We're going to see if we can find anything. Did you find anything? >> No, not yet. But there's still a lot more to explore. >> Okay, look on the other side. Ash, go search on that side. Drew, do you see anything under there? Guys, have you found anything yet? Wait, Drew, what is that? What do you see? >> Brett, what? What is this? Willis, what is that? >> Oh my gosh. >> This is what they shoot. >> Oh, wait. Where did you find that? >> It was under the tank, >> bro. It's a perfect fit. After 70 years, I cannot believe that this is still here, >> bro. I mean, it makes sense that it would be here. >> Dude, look how rusted it is. This is like history right here. >> All right. Well, let's put it back where we found it. Dude, what do you mean? We have to take this. >> Dude, we have a flight. We're not going to bring this on the plane. What are you talking about? >> Arrested. >> Put it back. >> After we put the missile back in the tank, the storm that the captain warned us about finally reached us. The storm is rolling in right now. We got to get out of here before we're stranded. >> Let's get back to the boat. >> Go, go, go, go, go. >> I guess we'll never know why that tank is just in the middle of the ocean. >> We never know. >> Wait, where'd you get levels? >> I brought them >> here. Give me some mine. >> What? >> Mine? >> Bro, give me that. >> All right, let's move on to the next Google Maps location. in an abandoned theme park in the middle of the forest. Okay, so where is it? Well, we just have to follow this trail and it's about a 30-minute hike, >> bro. We freaking found it. >> Oh my god, I cannot believe that's still here. >> Dude, this feels unreal. It's kind of creepy. Dude, it's really creepy. >> And after finding caution tape and a security camera, I was ready to pack my things up and go home. But Drew did this. Drew. Dude, >> we traveled 13 hours. We're going in. >> Okay. All right. You know what? If we're going to do this, we got to go now. >> Okay, then open it. We're breaking in. Oh my god. >> What is that? There's like a little ride. Wait, what? Everything is overgrown. >> I just walked through like a 100 spiderw webs. No, no one has been here for a while. >> And that's what we thought. But after finding a few more broken rides, we found something that might mean we're not here alone. >> There's a freaking car. Can we open it? >> Huh? No, don't open it. Oh [ __ ] bro. It opens. Okay, close it. >> Okay, you know what? I feel like we shouldn't be in there. Let's just leave the car alone. >> Dude, look, a vending machine. >> Well, there's literally mold on the cans. >> Ashton, what are you doing? >> Freaking ate my coin, dude. Of course it did. What do you think, bro? The vending machine is obviously broken. And after convincing Ashton to give up on the vending machine, we remembered the whole reason why we came to this theme park in the first place. Once upon a time, this park used to entertain millions of people, and now it's just completely abandoned. We have to figure out why. So, our first step is to check out some of these rides. It's one of those rides that go like this, you know? >> Yeah, the pirate ships. >> I love these rides, >> bro. What? >> Let's go, >> Ashton. Let's go. Come on. >> And after checking out 20 more rides and attractions, we still had no idea why this place shut down. >> Why is everything dismantled? >> You're right. >> It could have fell apart and someone could have been on it. I don't know what type of ride this is, but look at this. >> Is that a spaceship? >> Yo, what? >> Sick. >> How cool is that? >> Wait, what the hell? So far, we've seen a lot. But we still haven't even explored 30% of the theme park. Just like how less than 30% of you guys are subscribed. So, hit that subscribe button cuz things in this video keep getting crazier. Literally a roller coaster on the track still. >> Bro, what? This place is huge. >> Wait, who is that? >> What? There's someone walking over there. There's a person. There's a person. Wait, what? Oh my god. Literally a freaking person. What are you talking about? >> Was it security? I don't know. I didn't see the shirt. There's just someone in here. >> Wait a minute. We do. Go. Go to this. Go, go, go, go, go. What do we do? Do we stay? >> No, we have to go. >> He's leaving. >> Huh? That's towards the exit. We can go that way and explore and then just go around. >> Bro, he's security. He's definitely staying. >> Okay. Well, the amusement park's huge. He's not going to see us if we're on the whole other side. Okay, we got to go now. And since we weren't 100% sure he was actually security, we made our way to the other side of the park and kept exploring. >> Ashton, what are you doing? Having fun on my favorite ride. >> What? How? This one actually works. >> No, Drew's pushing me. >> Drew. >> Hey, help me push. Boom. Go higher. >> Dude, the whole ride is moving. >> I can't keep pushing him. Ashton, Ashton, it's not going to work. I want to go higher. And while Ashton was trying to find a ride that would work, we ended up coming across a few rides that are illegal now. >> Wait, I got to go. >> It's one of those spinning rides. >> We don't have We don't have these in the US either. >> This ride literally just spins at full speed. No harness, no anything to hold you in, so people just fly out. >> Illegal rides, broken rides, and clearly a lot of safety hazards. Things are starting to add up, but we still need to find some proof of why this place was suddenly abandoned. And after finding this underground tunnel, we decided to get to the bottom of it. Literally, bro, I feel like we shouldn't be in here. Property of Yongma land. Lights on. >> Wait, open it up. >> Yo, what? Look at how old this is. There's no way this like works. Wait. Initializing. >> Wait, what? What? What the [ __ ] is this? >> Behind me is the site of the now permanently shut down Yaman Park. Yamand was closed just last week due to reports that children were turning up missing while >> What? >> Children went missing. So, you think that's why it is closed down? They Dude, did you heard it? It said they never found him. What happened? Okay. Yeah, we got our evidence. Let's get out of here. >> Yeah, we should probably go. >> I'm down. Let's go. Okay. Now that we had our proof, we finally headed back. But we saw something we had to stop for. Oh, look at the marriage around. This is crazy. >> Okay. Wait. We haven't even checked this out yet. >> Dude, wait. There's a remote, >> bro. It worked. It's working. >> It freaking worked. >> Why does this turn on? Are you serious, >> bro? It moves. >> No way. >> Oh my god, bro. The horses work, too. This is insane, bro. >> Why does it >> Hey, >> what? >> You can't be here. >> All right, we're just going to >> We'll leave. We'll leave. We'll leave. >> Oh my god. >> 5 seconds. >> Bro, what just happened? All right, off to the next Google Maps location. Now it's time for our final and craziest Google Maps location we've ever done. It's an abandoned school in the middle of nowhere and it has something really scary written on the roof. >> Yeah. So look from the outside it might look normal but from the top down view it says SOS on the roof. >> Wait, doesn't that mean someone needs help? >> Yeah, but what if they still need help? >> Okay, that's why we're going there right now, but it's not easy to get to. This is like a 2 and 1/2 hour drive into a random forest and honestly I think we're lost. >> Dude, I haven't seen a single house in sight. So, like, who was going to this school? >> Well, we're about to find out. >> Bro, I'm scared. >> Okay, we made it. >> Dude, why does it look so scary? >> Dude, this is crazy. It looks like it's been abandoned for years. And I want to know who wrote SOS on the roof. >> What if we were trapped in here? >> How long ago was this, though? >> Okay. All right. Well, we're not supposed to technically be here, so let's get inside and let's figure this out. Let's see if there's SOS still on the roof and let's see if anyone actually needs help. >> Yeah, that's if we can get inside. And since we didn't know how to get in, we walked around to find the front door. >> Shut up. >> Is it open? >> Oh my god. >> Why was all this stuff just left behind, though? Okay, so we just entered the school and it looks like that this was the nurse's office. >> Bro, this is crazy. There's still artwork from probably students. >> Oh my god. Oh, there's a fridge. >> What? >> Maybe they have a snack. >> Drew empty, bro. Really? Oh, I'm so hungry. We traveled so long to get here. Least they could do is have a snack. >> And since they didn't have any snacks, we decided to keep looking for clues instead. >> Friend, this place really is the worst. What do you mean? They have homework. Huh? >> Nobody likes homework, dude. Okay. All right, put that down. Let's keep looking around. Wait, there's trophies. A safe? Wait, a safe? >> It's locked. That's another safe. >> Yes. >> Why are there so many safes in here? >> Bro, I feel like someone's hiding something in here. Look at all these trophies. And after searching the rest of the room, we made our way to the classes. Guys, everything is destroyed. Papers everywhere, files, boxes. Um, why is this in a classroom? Oh my god. >> What is that? >> This probably has something to do with why there's SOS on the roof. >> This is like a machete. Wait, where did you find that? Just on the ground. We've only been in this school for 5 minutes, but we've already seen so much. But we were not expecting this to happen. >> A bunch of random stuff. It's like a storage room, it looks like. Look it. Oh, that there was a bat. There's literally a bat in there. What was that? What was that? >> It blew right next to my head. >> There was a freaking bat. Okay, that was scary. But we need to make our way to the roof. So, we kept going. >> Look at this. Is when the school was in session. There was a playground outside. That's the school. >> That's what it looked like. >> It looks so good. What happened? >> I don't know. But what happened was probably an emergency of some sort. All the control boxes are open. Everything is like completely scattered everywhere. As if there was like an earthquake. >> Yeah. Or they had to like leave. Like they left all their stuff. >> Yeah. We were starting to solve the mystery, but we still have no idea why SOS was written on the roof. So, let's keep going. Wait, guys. What is this? Okay, dude. I don't like What the is that? Dude, why are there Why are there knives everywhere? For all we know, like someone could be in here with a knife. The knives probably play a part of why there's SOS on the roof. What if like someone was being, you know, trapped here against their will and they wrote SOS and, you know, maybe got me. That's why the doors are locked. >> You scared me, dude. I'm on head. Stop. >> Now that we've searched every room on the first floor, let's head to the second. This classroom is so creepy. Dude, look at all the stuff written on the wall. Like, what does this mean? I don't know. It's all in Japanese. Look at this. Wait. Subscribe to Brent Rivera. Wait, what? What? How did that get there? Did you do that? >> Yeah, I did. >> I just thought this was a good time to let them know to subscribe. I mean, it's always a good time to subscribe, guys. Subscribe right now. >> Everyone subscribe. >> And now that you have, let's continue exploring. >> I swear to God, I'm hearing footsteps. Like, someone is in here. Shut up. I'm not even joking. >> Yo, we have to figure it out. No, bro. >> After that, we couldn't convince Drew to keep searching inside. So, we armed ourselves and went back outside to search for another way up. Okay, we walked around the perimeter of the school and we cannot find a way onto the roof to see if the SOS is still there. >> Okay, look here. I brought a drone so we can see what's on the roof right now. Absolutely not. I don't trust you with the drone. >> Bro, Drew, you're not doing the drone. Give me that. >> Why? >> Give me that. >> Right there. Right there. Look at that. >> Oh my god. >> What is that, bro? It literally says, look. SOS. Why? >> Okay. There's SOS still written on the roof. The school is destroyed as if there was an earthquake. And there's knives everywhere. Dude. Yeah. It could have been an earthquake. It could be someone holding someone in their hostage and they write SOS or aliens. >> That's the only other thing it could be. >> Dude, it's not aliens. Why would they write it on the roof to signal the UFOs? >> All right. Okay, you're ready. >> No, seriously. I'm not even joking. >> All right, let's just head back inside and see if we can find any more clues. Wait, it's getting dark. Can't we just call it? Dude, we traveled 4 hours to get here. >> Okay. >> Okay, we need to solve this. >> Yeah, we need to get to the bottom of this. >> No, we don't. >> Okay, let's go. Come on, hurry up. I don't want to go in there if it's getting dark. >> Dude, hurry up. >> I'm all right. >> Let's go. >> Open it. What does it look like I'm doing? >> What are you doing, bro? >> I'm trying to open it. It's locked. Isn't this the door we went in through? Yeah. Did you shut it behind you? No, I didn't close it. Wait, then why is it locked? Who locked it? Does that mean someone's inside? I don't know, >> bro. What the [ __ ] is that, bro? >> Oh my god. >> What? You see that light? >> Someone in the window. >> Holy [ __ ] Go, go, go. Someone's moving. >> Who was that? >> Holy [ __ ] >> Who was that? What? >> Who was that? >> I don't know. I don't know. >> Go. [Music]",
    "start_time": 0.16,
    "end_time": 1472.859
}