{
    "video_id": "VIbWQsBnNuo",
    "channel_url": "@agt",
    "transcript": "Welcome to Vegas. You are about to experience tonight. >> 30 minutes, three targets. Please take your seats and prepare to [Applause] heat. Good job. [Music] >> Oh, sorry. I didn't see you there. [Applause] So in magic, they say seeing is believing, but that's not always the case. So I'll make these coins travel for you again, but this time you won't see them, but you will hear them. So don't just watch, but also listen. So now I'll take the shaker. Remember that sound. Listen for the coins and watch closely. Sometimes with magic, the trick only ends when it comes back to where it began. Is that the eye? Hello, it's me, Pip the Magic Dragon, flying in like a regular dragon, just like I do every single night here at the Flamingo Hotel and Casino. Then I'm going to gracefully land. So graceful. James Salone high kicks himself in the face. Oh, and Triple Man Dragon strides over to the trash can of terror. Here we go, Jade. On the count of three. 1 2 3 4 5 and inside the trash can. Um, he's gone. Where is he? He's gone. He's gone. [Music] [Applause] We gave them the cards. Now we show them the trick. Heat. Heat. N. [Music] There we go. [Music] And this trick actually started a few minutes ago. You just didn't know it yet. That's the thing about a good trick. It's not about speed or flash or slide of hand. It is about timing. It is about putting a thought so quietly into your head that you think you put it there yourself. [Music] It's locked. What are we going to do? >> Do you have a lockpicking set? >> I didn't bring anything. Maybe we could use a comb or something if you have I >> I don't use combs. Maybe a credit card. It's too soft. I don't think that's going to work. >> He's the key. [Music] What the heck are you doing? >> Just a process. [Music] >> Did he just >> Yes, he did. Now, I could pick a card for you, but that's not how this works. You're going to pick it for me. >> You ready? >> I am. >> I'm going to flip through this deck quick. And don't overthink it, okay? Just let your eye catch one. Not this one. That's too obvious. Too quick. That's on me. Let's try again. You see one now? >> Yes. Do you see it here? >> I don't. >> Well, that's the thing about a good trick. It doesn't end when the cards are gone. >> It ends when everyone finally sees what was right in front of them the whole time. [Music] [Music] You know what to do with this. [Music] [Applause] [Music] Heat up here. Hello, ladies and gentlemen. You might not realize it yet, but we cannot continue tonight's competition without what's in this bag. [Applause] Okay, >> this diamond is the key. While it may be beautiful on the outside, as the old saying goes, it's what's literally on the inside that matters the most. [Music] >> Step aside, boys. I got this. >> Okay, I might need some help. >> Uh, Terry, can you back us up here? >> Terry, we got I love you guys. >> I'm ready. Take a big swing. >> Are we ready? Watch out now. Watch yourself. Watch yourself. Ready? broke the bag. >> There's a hole in the bag. >> There's a hole in the >> Yeah. >> Oh, >> this has the name of tonight's Milliondoll winner inside. Terry, we'll leave this with you for safekeeping. On with the show. >> All right. Yes. Your brand new movie. Now you See Me, Now You Don't Hits theaters November 14th. One more time for its new stars, Jesse Eisenberg and Matt Franco, Shin Limb, and Pip the Magic Dragon.",
    "start_time": 8.4,
    "end_time": 576.36
}