{
    "video_id": "pBwqq7zd7Dc",
    "channel_url": "@agt",
    "transcript": "Thank you very much. Um, it's been so fun doing this. I feel like you've got to know a lot about me. I want to get to know some stuff about two people in this audience tonight. If you're here in a couple, if you are in a relationship, make some noise. Couples make noise. I need two of you. I got two chairs. I got two chairs. What's No way. Okay, guys. We have a real housewife in the house. We have Bosema St. John and Key Watson. Newly engaged, right? Do you want to join me on stage? Would you come on stage with me? Yeah. Bring it up. Keep that noise going. Make some noise. You guys look incredible. Please step up here into my love shack. This is uh this is beautiful. Yeah. Oh, stunning. [Music] Lovely to meet you. Uh Bo Bose and Keely. Yes. Yes. Um, you are you are freshly engaged. Rocks on the finger. Absolutely smashing it. >> I would love to know how you guys met. How how did it happen? >> How do we meet, babe? >> Okay, so uh it was through my nephew. I was scrolling Instagram one night. There was a picture, there was a post. I saw her in the red dress. I'm like, \"Dang, she's bad nephew.\" I was like, \"Who's that?\" >> And the funny thing is when he when his nephew introduced us, I said, \"Do I look like I date uncles?\" I mean, honestly. But then I saw his Instagram and I was like, I date uncle. >> Obviously you do. Yeah. So, uh, you're engaged. When did you know that that Keley was the one? When did you know Pose was? >> Well, I knew he was the one when he asked me on the third date and I said, \"I'm going to Ghana.\" >> So, I packed up, went to Ghana, and uh, the rest was history. >> Wow. >> Good date. Um, I would love to know chance to, you know, air some dirty laundry. Uh, what's a bad habit of his? >> A bad habit of his. Oo. Well, you know, I I already know what she's going to say. I like plastic cups. >> I mean, >> dang. I use plastic cups for everything. >> I rather China. Thank you. >> Okay. Um, and then one final question. >> One final question to test how well you know each other. Um, if the other one could have a superpower, what would that be? >> For her, I I'm going to say teleportation because she's everywhere. >> She's in Italy, she's in New York, she's in LA. That's all in like two days. >> Yeah. Yeah. Yeah. And I and I would say that I mean I like my men strong and so you know a superhuman strength I think is what >> stuff. Lovely. Well look we're going to we're going to celebrate you guys with an improvised rap dedicated to you based on what you've just told me. Now this is all freestyle DJ. Let's hit that track. [Applause] On the stage we got Keely and Bose here at the show. And if you're feeling the flow I remember Key. I was a single man, but your plan, you were there scrolling Instagram, saw a picture of Bose. You're like, damn, red dress. I hope that she ain't even got a man. Maybe send a message like you want to have some fun, y'all. Bose is like, yeah, I don't date uncles. But then we all know what came next. He's like, \"Yeah, I'm an uncle, but check these pecs. Looking so strong, looking so hench. Clearly, you've already got superhuman strength. Looking so fly in the nice orange suit. I'm colorlind. Apologize if it's beige.\" That's true. Anyway, you saw him. You're like he's a charmer. One, two, third date. Come with me to Ghana. You were there lusting. You're heading after her. That's pretty far. Traveling off there to Africa. I know love's hard. It doesn't come easier, but it's strange to me. You need to have a date with a visa going over there. I know you couldn't wait at restaurants every day. Complain about the plate. You're like, seriously, you know I asked it. Boza's got the China asking for the plastic. What is up? You need to get a silver cup. I really love it. And you travel till you self-destruct. You're like, \"Yes.\" Go from nation to nation, America to Ghana, teleportation. Well, yeah. You know, you feel like handing gloves. So, right now, make some noise for Key and Bose's love. Chris Turner, Key Watson, and Bose St. John. Close them up. You're going to be back on our screens very soon with Jimmy Fallon with the new show On Brand. It lands on NBC and Peacock on September 30th at 10:9 central. Thanks to Bosema and Keely. And good luck tonight, Chris.",
    "start_time": 2.24,
    "end_time": 275.08
}