{
    "video_id": "ZifA-vP_u6k",
    "channel_url": "@agt",
    "transcript": "[Applause] But for one more act, the AGT dream is about to come to an end. Let's find out who your votes put in fifth place. America has voted. The act finishing in fifth place and leaving the competition is Lightwire. Oh man. Lightwire. What has being on AGT meant to you? >> It's a dream. It's a dream for me, for all this team. It's a pleasure to to be here. Thank you. Thank you, America. >> Yes. >> You've been awesome. America, make some noise one more time for Light Wire. We are down to the top four. And for all of them, the win is getting closer. But right now, one more act is about to head home as we find out who made your top three. Let's do it. America has voted. The act finishing in fourth place and leaving the competition is Leo High School Choir. Leo High School Choir, Mrs. Hill, you have wowed America. How does that feel? >> It feels absolutely amazing. We're so grateful for this opportunity and we want to say thank you to America. Thank you to AGT. Thank you to every educator, every parent. Simon, what do you want to say to Leo High School? >> I'd like to say something to you, which is you are going to inspire so many people, and I really mean that. Um, and I'm so proud of what you've achieved. You have an amazing talent. You have an amazing mentor, and it has been an honor, honestly, having you on the show. And >> and thank you to my amazing students. Thank you. >> It's been amazing watching you every week. Give it up one more time for Leo High School Choir. So this is your top three. Jordan Blue, Chris Turner, and Jessica Sanchez. They all came to win, but two more still have to leave the competition. Let's see who finished in third place. America has voted. The act finishing in third place and leaving the competition is Jordan Blue. [Applause] Jordan, I'm so sorry. Here's a look back at your time on AGT. Jordan, >> the amount of belief that I had in myself whenever I walked on the stage in my first audition >> to now. >> I mean, that's a world's difference. >> I really truly believe that you can win this. You can't really put into words how grateful I am. Go. >> You know, it started on the street singing, but the journey's I feel like just beginning. Jordan, what has performing for America meant to you? >> Honestly, it's been a it's been a long journey to get here and it's just meant everything. All glory to God. Thank you. Thank you. >> Howie, what do you want to say to Jordan? >> Hey Jordan, I know this probably doesn't feel great, but I think you leveled up your life and your career to the stratosphere. This is not the end. I believe this is the beginning. and Jordan name that people for years and years to come. >> Jordan, you've been awesome and good luck in the future. America, make some noise for Jordan Blue. Your top two acts are Chris Turner and Jessica Sanchez. Now, Chris, what would winning AGT mean to you? >> Um, it would it would it would mean everything. I mean, my mom and dad are here tonight. My wife and my daughter are here. It would mean that all the sacrifices they made, all the support they gave me has has got me here. It would mean so much. Yeah. >> Now, Jessica, what would winning AGT mean to you? I mean, this has been 20 years in the making for me, so it mean everything. But I'm just so honored to be standing here with Chris. He's so so talented. We've seen acts come from every corner of the globe, chasing the AGT dream. They performed on the biggest stage in the best talent show in the world, hoping to change their lives. And now, after all the performances, all the judging, and all the voting, we are about to find out who's won. >> Let's take another look at the extraordinary journeys these acts have been on since they first stepped out at the auditions. >> I was always wondering, how would freestyle rap do on this show? No one had done it before. I took the biggest risk of my career and it paid off like crazy. >> This experience has been one of the most incredible feelings in my life. >> I'm very grateful. >> I want to win it and maybe I can. [Applause] >> This big dream of mine really started 20 years ago. >> Jessica Sanchez. >> I really wanted to give the dream another shot. I wish I could tell my 10-year-old self, here we are today, girl. >> Not only are you talented, you've never given up. >> This journey has definitely been transformative for me. To do this with her in my belly, I feel so strong and I feel so proud of myself. >> Two super talented acts. Only one is your winner. It's time. America has voted. The AGT champion and the winner of $1 million is [Applause] Jessica San Die. Jessica, you're the new AGT champion. How does that feel? >> I'm sorry. I'm really emotional. This is amazing. Thank you so much, America. All right, come on up here. Listen, it's been awesome. America, one more time for your winner. And give it up for all of our finalists. What a winner. What a season. I will never forget it. Big thanks to Howie, Mel, B, Sophia, and Simon. It could be you up here winning this time next year. coming audition from America's Got Talent. I am Terry Cruz. Good night, America.",
    "start_time": 0.12,
    "end_time": 570.519
}