{
    "video_id": "Zt-1Tw8koDw",
    "channel_url": "@agt",
    "transcript": "[Applause] All right. Tell me the story of Laser. >> Oh, so we're a group called Lucarif. It's an anagram of the phrase, I'm fearless. And I'm fearless represents the attitude of our team. Very fearless. >> Fearless. >> How was performing at AGT? What's it like? Oh, surreal. Surreal. Growing up in the States, I watched this show all the time. So to perform tonight was insane. I was like, I feel like I'm going to throw up. >> Our fans out there. >> Yeah, there were so many. [Music] >> So you're on your first US tour. Do you have a favorite American food? >> Popcorn. >> Popcorn. Popcorn baby. True. >> What's coming up for you? What's coming up for Sarah? >> New music next month. >> I'm so excited. >> Thank you guys so much. >> Thank you so much. >> Thank you guys so much for having us. Hi, we are Larin >> and tonight we will be singing Perfect Night. [Applause] >> Have a perfect night. How is everybody doing? [Music] It's going to be a perfect night. Me and my girl going to party till it's got me feeling really tonight. Cut some traffic but the radio is blasting and we're singing goodbye. [Music] Ooh like the morning feel like magic. I got all I need. You know nothing else can be the way that I feel when I'm missing with my girls. Perfect energy. Yeah, we fall as we free. There's no better feeling in the whole wide world tonight. I don't care what's wrong. Don't stop blowing up my life. I get ready at 11:59, but nothing comes after midnight. Come and take a ride with me. I got a credit card and some good company. Some come through, but I feel we're good. Why you still stuck on way and on you night to morning liotion I got all I need you know nothing else can be the way that I feel when I'm dancing with my girls perfect energy how we flawless yeah we free no better feeling in the whole world tonight I don't care what's right doors are blowing on my line. I can't ride a letter. I'm 59, but nothing comes after [Music] make. [Music] >> That was so shy. >> I got all I need. Nothing else can be the way that I feel when I'm dancing with my eyes. >> Perfect energy. Yeah, we flawless. Yeah, we free. There's no better feeling in the whole wide world. >> Tonight, I don't care what's wrong. Don't stop my 119. Don't stop my [Applause] Thank you. [Applause]",
    "start_time": 0.55,
    "end_time": 254.009
}