{
    "video_id": "1dIOy6_iIoo",
    "channel_url": "@genevievesplayhouse",
    "transcript": "Purple race car. Five. Blue race car. Four. Green race car. Three. Orange race car. Two. Red race car. One. We have 1 2 3 4 five race cars. Now we need some drivers. And this first one will be our derpy eyed cat, Hobs. Next we have gamer Genevieve with purple hair. Then we have our friend shiny blueberry cat. And finally we have our orange friend Fox. But that's only four drivers. And we have five race cars. We'll need to match them to the cars to see which driver is missing. Since Hobs is green, he can drive the number three green race car. Here you go, Hobs. Blueberry cat is a lovely shiny blue color. So, let's put her in the blue number four race car. Let's see. Genevie's a little tricky. She has yellow clothes, but I don't see a yellow car. So, maybe we can match her purple hair to the purple race car. Here you go, Genevieve. Next, we have Finnick Fox. Since he's orange, we'll have him drive the orange number two race car. And now we can see that we're missing our red race car driver. I wonder who the missing driver is. >> Well, my brother's cherry cats wanted to race with us, but we're too hungry to join us. >> Oh, well, maybe we can get an apple from the apple tree for cherry cats. Let's see. Oh, man. It's just a squirrel. Here, you can go back, >> baby. Try the red one cuz we need the red race car driver. >> Hey, that's a great idea, Genevieve. Look at that. You are right. There's a red apple in our tree and it matches our red race car. And there's an opening at the top of the tree for us to put the apple in. Hey, what was that? Let's see. Cherry Cats, what are you doing in there? Come on out of there, guys. Why? We can't be expected to race on an empty stomach. Yeah, I guess you're right. Now we're ready to race. All right, now that we have all five racers, we can see who wins the race at the end of the video. >> Now, let's go practice. Good idea, John. >> All right, let's go. Last one. There's a rotten egg. Hey, where did everybody go? Hey, Midnight. Nice tractor. >> Thanks. I've been playing with it all day, but now I'd like to play with it as a robot. >> Oh, well, do you need help transforming it? >> Yeah, it's locked and I can't find the key. >> Well, since our apple tree helped us with our first toy, maybe it can help us with our second. >> An apple tree. >> Not just any apple tree. A magic apple tree. >> Ooh. >> And since your toy is orange and the second one we played with, it must be in the orange number two window. There it is. The orange apple we needed. All right, let's see if it worked. It did. There's the key to unlock the robot. >> All right, the key. >> Let's use the key we found to unlock the robot. Now, let's see what we need to do. We can start by pulling the arms out from the body. There's the left one, and now the right one. Then, we can unfold the legs from the back of the tractor. Now with the legs extended, we can close up the feet. There we go. Now let's flip the robot around to work on the front. Let's get the bucket off the shoulders and then raise the arms up. Now we can twist the torso around so the head is facing the correct direction. And here's the head right here. Pop. Then let's bend the arms down to a more natural pose. [Music] One last touch and our robot is transformed. Awesome. It looks so cool. And so Midnight doesn't lose the key again, let's snap it on the chest here. >> All right, my robot's back. Now, let's go play on the playground. >> Affirmative. I call dibs on the swings. >> Choo choo. Make way for the animal train. >> Wow. Oh, what do you have there, Catron? >> I'm bringing animals to the nature preserve. Want to meet them? >> Sure. I don't believe I've seen animals like this before. >> Oh, well, this is a tiraffe. >> Typh. >> Over here we have an eleph. >> Okay. >> And over here we have a gerolifant. >> Interesting. >> And a panger. >> Hm. Catron. I'm not sure if these animals are put together correctly. >> Oh dear. I'm not from Earth, so I'm not familiar with all its creatures. >> Don't worry, Catron. I think you just mixed up the pieces. We just need to rearrange them a little and see what we get. I'll take this head piece over here and place it on the body of this animal at the end. Then we'll take the head of this one and place it on the first animal. And that'll give us room to take this and put it on the body of the third animal. And I don't think this piece here is supposed to be a hat. There we go. And finally, this cute head can go on the body of our second animal. And now we have a tiger, an elephant, a panda, and a h. I think we're missing a piece. >> Oh, no. I promised the nature preserve four animals. >> Don't worry, Catron. We can get our apple tree to help us. Since the animal with the missing piece is yellow, and this is our third toy, let's try this door. All right, the apple we wanted. Let's put it in the tree and see if we get the missing piece. All right, it's there. But this is a weird looking piece. It looks like we can tip it back and forth. Oh, I know what this is. It's the neck for a giraffe. Here you go, little guy. Now you can reach the tallest trees. Oh boy, a giraffe. Now I can deliver my animals. We're off to the nature preserve. Make way. There's a moose on the loose. >> Wow. Nice boat, moose. >> I have a boat. >> Sure. What did you think it was? >> I thought it was a water car. >> Nope. It's a boat and a nice one. >> Yeah, I guess. >> What's wrong, Moose? >> The horn's not working. It does this. [Music] That's not a good boat sound. I see that your boat has a green ball, a purple ball, and a red ball, but the blue ball is missing. Maybe that's the problem. Of course, it's so obvious. Since the missing ball is blue, and this is the fourth toy, we'll open the blue number four door. And all right, there's our blue apple. Let's add it to the tree and see what happens. All right, the missing blue ball. Let's put it where it belongs on the boat. There. That's where it goes. Hooray. All the balls are in place. Now, let's use our hammer to see what horn sounds each ball can make. We'll start with the green one. Ooh, nice. Next, let's try the purple ball. Wo, that's a loud one. Now, it's the red ball's turn. Ooh, I like that one. And finally, the missing blue ball sound. Oh, wow. Well, those are some great horn sounds for your boat. >> Yay! Now I can honk it all day long. See you around, Moose. Wait for boat noisy. Oh, look who's coming to see us. It's Bob the Ant. Wow, Bob, that's a really nice and colorful train. Oh, thanks. It's a shapes train. I'm going to use it to build something. Wow, that sounds like a fun idea. Yeah, too bad I couldn't find any shapes for the caboose, though. Oh, yeah. You have two triangular prisms, three cylinders, and four rectangular prisms, but nothing in the caboose. I can still build something, but it just won't be as cool. Don't worry, Bob. I think our apple tree can help us here. Since the caboose is a purple number five, we'll open the purple number five door. And inside, we found the apple we were looking for. Let's place it in the tree. Yeah, it worked. Now our basket has five new shapes in it. Awesome. Now I can build something cool. Glad we could help, Bob. Here, I'll load them up for you. Thanks for the help. Always glad to help, Bob. See you around. Wow, that was a lot of fun helping our friends. Now we can watch the pig race. And look, our racers are ready. And so are the fans. >> Do it. >> All right, guys. The winning racer will be the first car to the finish line. Get ready. Go. >> Oh no. Cherry cats. What happened? Somebody forgot to put fuel in our car. That wasn't my job. Well, it wasn't mine. Let's take a look at the race again. And it looks like Genevieve won. Woohoo! Genevieve, come to Victory Circle to get your trophy. I guess all that time playing Mario Kart paid off. >> Yeah, but now we know your secret for next time. Bring it on, Blueberry Cat. Bring it on.",
    "start_time": 0.0,
    "end_time": 604.72
}