{
    "video_id": "O2FQQd6xs-8",
    "channel_url": "@genevievesplayhouse",
    "transcript": "Hey guys, what you got there? It's a toy gumball machine. >> Yeah, but we don't know how to does it. >> Yeah, and we've tried everything, >> even sitting in it. But that didn't work. >> Wow, Moose. I can't believe that didn't work. I tell you what, I'll show you guys how to get to the gumball surprises. And we can practice our Spanish. Deal, deal. To get the gumballs, we just need to press the coin down. There, we got one. Hooray! It worked. All right, let's see what's inside of our first surprise capsule. It looks like our first toy is Mario, but he's in pieces like a people puzzle. >> You're right, Moose. So, let's put him back together. Starting with his legs, >> followed by his torso. >> Torso. >> And finally, his heada >> there. Now, what are some things that Mario can do? >> Uh, he could grow a mustache. >> Okay. Anything else? Uh, he can walk. >> That's a good one, Cherry Cats. Mario can walk. >> Mario can talk. >> It's a me, Mario. >> Mario can jump. >> Mario can jump on bad guys. >> Wow. Thanks, Mario. You're welcome. Wow, thank you, Mario. Let's see what our next toy surprise is. [Applause] I can see something inside, but I can't tell what it is. Hm. Is that a bee? It is. It's an orange honeybee. >> Aa. >> It's really cute. What are some things a bee can do? >> They can fly. Bol? >> That's right. They can. What else can they do? >> Well, they can sting. Pikadura. Ooh, they can. Just stay calm moose and the bee will leave you alone. >> Bees are also one of nature's special helpers because they're pollinators, which means they can help plants by spreading their pollen around. >> Bowling. >> And when they're done collecting the pollen, they bring it back home to their hive so they can make honey with it. >> Meal. >> Ah, here's some now. It's a delicious thick and golden liquid that the bees use to feed themselves with. And we can eat it, too. Wow, I didn't know beets were so cool and helpful. You got that right, guys. Now, let's see what our next surprise is. It looks like this one's in a golden capsule. Oh, cool. This capsule had a yellow ball inside of it. >> Ba. >> What's something a ball can do? How about bounce? >> Reut. What else can we do with the ball? We can throw it >> and catch it. >> Yeah, give it a try. All right. >> Nice catch, Moose. >> Nice throw, cherry cats. >> Great job. Now, let's check out our next surprise in this yellow capsule. Oh, it looks like inside of this one, we have some ice cream. >> El, >> what do we know about ice cream? It's called >> Frio and you can eat it. But there's one other thing. What thing is that, cherry cats? >> Brain freeze. >> Cerebro. [Music] >> Oh, that hurt. I'm sorry about that, moose. Maybe next time try eating the ice cream more slowly. Now, let's see what our next capsule contains inside. It looks like this one has a vehicle inside. It does, and it's a fire truck. What's something we can do with the fire truck? We can drive it. >> That's right. We can drive the fire truck. Let's take it for a spin on our course. We can rotate the green knob to get the fire truck to the elevator. Then push the red button to enter the elevator. Next, we can raise the elevator to make the fire truck go up. Now, our fire truck has two paths it can go on. Let's start with the one on the left. sca. >> Let's call in a helicopter for some help. Then let's pop the fire truck up and our helicopter can drop us off on the left path. Wow, look at it go. I hope the fire truck doesn't mind that it's going down backwards, though. Now we can send our fire truck back up the elevator. First, we'll raise it up with our button and then rotate the dial to send it down the hill. We'll send the elevator down to it for the elevator and then raise it up. Now we can try the path on the right. >> So let's call in our elevator for a pickup. And now let's go. Wow, this path has a bunch of little seesaws. Now we can leave the ship, cross the bridge, and we're back to where we started. Now, let's check out our next surprise. Inside this capsule, we have a green ball. This ball's kind of squishy. What's something we can do with it? >> Can we bounce it like the other ball? >> Let's try, Moose. Hm. I guess not. I think this ball is different. Let's compare it to our yellow ball. Our yellow ball is hard and bouncy. Our green ball is squishy, so maybe we can stretch it >> and squeeze it. >> So, these similar objects can have different uses. Let's see what else is in our gumball machine. Ooh, here's a nice red capsule. I wonder what we'll find inside. Oh, it looks like it's a controller. >> Mando, >> what's something we can do with a controller? We can play. Who got it? That's right. We can play. Here, Moose. Try playing a video game. Ooh. Okay. Ooh, this is a shaped game. I'll stack them up real big. H. This one goes over here. Oh, it broke. Oh, maybe that game's too hard for you. Try this one. Ooh, a Mario. Ooh, this game is fun. Oh, I don't like it. A Moose, don't worry. You did really well. Those games are hard. Don't worry about it, Moose. Maybe video games aren't your thing. >> Yeah, we can't all be video game experts. Let's find out what else we have in our gumball machine. It looks like this is a teal capsule. Let's find out what's inside. Oh, it looks like we have a key. Devi, what are some things a key can do? It can lock something or unlock. Hey, here's a locked door. Maybe we can use our key to unlock it. Hm, this key doesn't work. It looks like this key is for door number three, but this door is number one. So, let's find door number three. There's the number two door. There's the number three door. Now, let's unlock it with our key. It works. Let's see who's behind the door. Oh, it's fairy Genevieve. >> Hi, everyone. Hope you're having fun with those gumballs. >> Yeah, we're having lots of fun, Genevieve, and learning all kinds of things. All right, see you around, Genevieve. Thanks for stopping by. Now, let's make sure to use our key to lock the door back this time. We only have two more surprises left. Let's see what they are. Is this another ball? Oh, wait. It's a capsule and it's filled with slime. >> Baba, >> what are some things we can do with slime? We can jiggle it. >> That's right, cherry cats. And it's actually pretty fun to jiggle. Just look at it move. And we can twist it. >> Hey, that's a good one, Moose. Let's twist it around like some jump rope. That's pretty fun. Now, it's always important to clean out slime after we're done playing with it. And now we can see what our last surprise capsule is. Oh, this one has a see-through window. I wonder what it can be. Oh, would you look at that? It's a Minecraft block. >> Block the Minecraft. >> What can we do with Minecraft blocks? We can build with them. goes through here. >> That's right, Cherry Cats. Let's see what we can build with our Minecraft blocks. [Music] We can build a tree. >> Arble, >> what else can we make? For this one, we'll add one, two, three, four walls and a roof. And now we've made a house. Casa, >> of course, we can always go creative mode and make something crazy like this lion le. >> And we use sand, dirt, and water blocks to get creative. Pretty fun, right? All right, guys. That's all the surprises in our gumball machine. Well, thank you for your help. And thanks for teaching us a bunch of Spanish words. No problem, guys. And I can't wait till we play next time. See everyone later. Bye.",
    "start_time": 0.08,
    "end_time": 584.56
}