{
    "video_id": "jezWUo84G9I",
    "channel_url": "@genevievesplayhouse",
    "transcript": "Number one and number two are riding their bike to the school bus stop just in time. The bus is waiting for them. Our bus has room for 1 2 3 4 5 6 students. But so far we only have two students. We have our first student number one and our second student number two. Maybe we can use the magic of math to make additional students. Let's take the number one and the number two and add them together and see what we can get. Great job. We made the number three. What's the next number we should make? How about the number four? For that, we'll try taking the number one and adding the number three to it. Three + 1 makes four. We got our next student. Wow, great. Now we can make the number five. For that, we'll use our numbers 3 and 2. We'll start with three and add two to it. 3 + 2 makes 5. Awesome job. Now, to make our sixth student, we'll take the number four and add two to it. Four + 2 equals the number six. All right. Now, let's get all of our students on the bus. Now, [Music] now that we have all six students in our bus, we need a bus driver. Since the next number after six is seven, let's see if we can make the number seven be our bus driver. To make seven, we'll use the number five and add the number two to it. All right, we made seven, but it looks like they're missing their colors. >> I'm supposed to be a rainbow, but all my colors are missing. >> Oh no. Well, we'll see what we can do to bring your colors back. We'll start with the first color of the rainbow, red. Look at that. The first color appeared on our bus driver. And the next color of the rainbow is orange. It's working. Now orange is colored on our bus driver. Let's keep the rainbow going with yellow. And now our bus driver has a new color. Next, we have the color green. All right, nice job. Next, we can use the color blue. Our bus driver has almost all of their colors. Now, for the last color of the rainbow, we have purple. Hooray! Now I'm fully colored. Thanks, kids. Time to drive these kids to school. All right, let's go, everyone. Now, our bus can drop students 1 through 5 off at the elementary school, and then number six can go to high school. Let's climb the rope ladders. Uno. One, uno, dos. [Music] Two. Uno t. Three. Uno tatro. Four. Uno tatro. Cinoco. Five. All right. In they go. Now, let's open up the school and join them inside. Wait a minute. Are we missing someone? Let's find which student is missing. We have one, 2, 3, and five. We must be missing four. >> Maybe they're hiding in one of these lockers. >> That's a great idea, too. We'll have to check the lockers to find out. Let's see. Is number four hiding in the orange locker? Oh, it's just Blueberry Cat. >> Shoo. Thanks for letting me out of there. >> H, that wasn't right. Let's try the yellow locker next to it. Oh, it's just Genevieve. >> Yep. No, number four is here. >> Hm. Seems like that there's something in the green locker. >> I think you're right. Let's check it out. Ah, there's four. They were hiding in the green locker. Haha, nice job, guys. But you found me. Let's make some bigger numbers for the teachers. Let's make the number eight by taking the number five and adding three to it. 5 + 3 equals 8. Look, it's Mrs. Oo. Let's use three numbers to make our math teacher. We'll start with the number four. And if we add three to it, that makes seven. And if we add two more to seven, we get nine. It's our math teacher number nine. Hi. Let's make one more teacher. How about number 10? We'll start with the number four. And then we'll add in three. And then we can add two, which brings us to the number nine. And finally, we add one more to make 10. All right, it's Mrs. 10. Now, let's set out our first class and let the students learn. We'll need a desk and some chairs. Number one is red or rojo, so they'll go in the red chair. Number two is orange or naranga, so they'll go in the orange chair. Number three is yellow or amaro, so they'll go in the yellow chair. Number four is green or be they so they go in the green chair. And finally number five is blue or azul so they go in the blue chair. >> Hola nños. Let's learn some Spanish numbers. Does anybody know what number quattro is? >> H not me. Quattro is four. It's me. >> Excellent job guys. Quattro is four. How about trace? >> H not me. >> Th is me. The number three. >> All right, good job, kids. Now, one more. What is sinco? >> That's easy. Sinko is five. >> Great job. You guys passed Spanish class. Now, time for some math. [Applause] >> All right, guys. It's time to learn some math. How about what is 2 * 2? >> Well, I'm one two and I'm two twos. >> I want to count. 1 2 3 4. 2 * 2 is four. >> Great job, kids. You're right. How about 5 minus 4? >> Well, let's see. I'm the number five. And then we can use me to subtract four from you. So if you subtract four from five, you get me. So the answer is one. >> Great job. Now we got one more. How much wood could a woodchuck chuck if a woodchuck could chuck wood? >> Um, do what? >> I don't know. >> Mr. Nine, are you being too hard on these kids? >> It's an easy question, really. Oh, it's time for recess. Come on outside, kids. [Music] All right, kids. What do you want to do for recess? >> H how about a race? >> Oh, yeah. That sounds fun. >> All right, since the kids want a race, let's get them some cars. Red, orange, yellow, green, and blue. [Music] >> All right, then. Let's head to the racetrack. >> All right, drivers, start your engines. My marks, get set, go. It looks like red's out ahead. But here comes yellow to take the checkered flag. I won. I won. >> Great job, number three. It looks like you're the champion of today's race. >> Woohoo! Congratulations, number three. Ah, you won fair and square, but I'll get you next time. Yeah, just wait till tomorrow's race. All right, guys. That was so much fun. Thanks for watching the video. Give us a thumbs up if you liked it. See you next time, guys. In today's playhouse video, we're going marbles with our marble rush dino track. It has lots of fun pieces like a bucket elevator, a spinning elevator, and magnetic zip lines. And oh yeah, a marble eating dinosaur. And it has three different builds from easy all the way up to advanced, which we're going to try today. So, let's get the box open and get the pieces out so we can start building. Oh wow, there's a lot of cool stuff inside. Let's dump it all out so we can see what we're working with. [Applause] Now, let's find the advanced build in the instructions. And just like any building project, we'll start with the foundation. These big foundation pieces have 1, two different rows and 1 2 3 four columns. So, we can think of them as 2x4s. And we'll set one more of our 2x4s next to the first one. To match our instructions, we're going to need a lot of 2x1 pieces. [Music] [Applause] All right. Now that we have our foundation in place, we can start building our marble maze. We'll start by placing our spinning elevator piece. It goes here on the corner of the foundation. Then we'll top it off with this sign that says T-Rex Dino Thrill Track Set. Woo, that's a mouthful. We'll need lots of these blue connectors to help move the marbles along the track. This gray straightaway piece will serve as a bridge from the elevator to the blue connector. And then we'll use this small orange curved piece to connect the elevator to the other one. Now, let's extend the track further down the foundation. Another gray straightaway piece will connect the two pieces we just placed. This piece is a marble catcher. It'll keep the marbles from going the wrong direction. That way, we can keep the track going the way we want it to. We can even stack the pieces to give our marble maze more than one level. And pieces like this twisty curve will help our marbles go from one level to the other. Now, we need to add some more supports to help our second level along. Since this piece is a semicircle or half a circle, the marbles that go along it will be turned 180°. And check out this cool piece. It's a magnetic zip line that'll let the marbles zip down the track. All right, that should be good. Now, we need to add a few more supports so we can extend the track down to the bottom. And a few more track pieces will help guide our marbles along the way. This piece will be our bucket. It'll catch the marbles when they're done. And I have to say, it almost looks like a marble hammock. And this green curve will make sure that there are two ways to get to it. Let's make a bit of a tower here so we can put our next piece on top. This orange splitter that'll send the marbles two different ways. [Music] I call this next piece the banana. And it's to catch the marbles and send them into the splitter. This downward slope will catch the marbles that go this way. And for the pieces that go to the right, we have this really cool bucket elevator. It can use it rotating arms to bring the marbles from the bottom all the way back up to the top. Now, let's build the structure and supports that'll bring the marbles to it. We'll need to make our pillars two blocks high so that the track can feed into the bucket elevator. Now that we have the supports, we can fill in the rest of the track pieces here with our orange curve piece completing the journey. Now, we can work on raising our track a little bit. Let's add another splitter and top it off with another banana. Now, let's see if we can get our track to loop around so we can get the marbles to come back to the bucket at the end. This red slide will let the marbles go from the third level to the second. Next, we'll need a bunch of pillars. With our support pieces in place, we can use our track to fill in the gaps. That'll give our marbles a way to get to the bucket from this side. Do you hear that? It's a dinosaur. You don't even have legs. H. >> Don't worry, we can help you with that. Here's your right leg. And one more for the other side will be your left leg. If we open and close the dinosaur's mouth, it makes its tail go up and down. That'll be an important mechanism for our marbles. Here you go, T-Rex. Now, don't eat any of the track while we're building. We'll need to feed our dinosaur some snacks, so this spring-loaded marble launcher should do the trick. [Music] And if our aim is good, this launching ramp will help guide the marbles into the dinosaur's mouth. Now, let's connect our launcher to the ramp and then use this green curve to feed marbles into our launcher. This gray corkcrew piece will give the marbles a path down. Another banana piece and this part of the track will be good to go. Let's work on getting our track up to the spinning elevator. Another corkcrew piece will help the marbles travel vertically. This long piece has its own ridges that slow marbles down as they go along it. We'll use it to connect our elevator to the rest of the track. We're almost done with our build. Just a few more pieces and then we'll be ready to rock. We just need a curved piece here and one more magnetic zip line to connect the two sections of the track. All right, now that we built the track, let's jazz it up with a few decals. All right, now that's what I'm talking about. Now, let's get our track ready for some marbles. We'll need to prime the spinning elevator by moving the platform down to the bottom. That way, when a marble triggers it, they'll be spun all the way to the top of the elevator. Then, we can get our dinosaur ready to eat some marbles. And finally, flip the switch for our bucket elevator. All right, now that everything's set up, let's get some marbles. Our dinosaur must have already got a hold of this red marble because it has claw marks on it. Now, let's see where it wants to go. It looks like it's taken the path straight to the bucket. Right into the dinosaur graveyard. Let's try this yellow marble with a fossilized egg on it to see if it takes a different path. It did. Right to the launcher. And our dino is hungry. Open wide. All right, first shot. But it looks like our dinosaur isn't quite ready to give up the marble just yet. Let's use our secret weapon, a magnetic marble loaded directly in our launcher. All right, Dino, have a taste of this one. All right, it worked. Our magnetic marble freed our yellow marble from the dinosaur. Now they can both get to our marble bucket safely. Let's find out what happens if we add a bunch of magnetic marbles to the track at the same time. Since they're magnetic, they'll go on the zipline path. Whoa, nice catch by the spinning elevator. And check it out. Our spinning bucket elevator helps the marbles restart at the top of the track again. Now with our magnetic marbles going, let's see if we can do something about our dinosaur problem. Let's use our launcher to see if we can take it out. Oh, miss. All right, nice shot. Let's try again. Oh no, it jammed. Yes, we got it. Take that, Dino Bully. >> All right. Nice job taking out that dinosaur. >> Woohoo. Nice job. >> Yeah, that's showing him. >> Hey guys, what's up? >> We're just headed to the marble racetrack to see whose marble is the fastest. >> Or we could just save time and declare mine the winner right now. >> In your dreams, cherry cats. Whoa, I'd love to see that. Can I come? >> Sure. You can help make sure cherry cats don't cheat. >> Hey, that's insulting. >> All right, guys. Let's take a look at our track to see what we're up against. Our two racers will head down two separate tracks. Then they'll meet up in the middle to jockey for position down our peg slide. And finally, the winning marble will be the first one to get to the end of our track. Our first round will be Catron versus Genevieve. And the second round will be between Jasper and Cherry Cats. In lane one will be Catron's green number 72. And in lane two will be Genevie's blue number 23. Marble, start your engines or whatever it is you have. 3 2 1 go. The blue marble's out to an early lead, but it looks like the green marble has cut in front for the win. Congratulations, Catron. Your marble won the first round and will play for the championship. >> All right, nice race, Catron. Good job. >> And now for our second round, we have Jasper's orange checkered marble in the first lane. In the second lane, we have Cherry Cat's brown marble. Its name is Roundy. Oh, apparently Cherry Cats's marble is named Roundy. Come on, Randy, you can do it. Um, I'm not sure cheering on a marble really helps, but we'll find out. Let's go, marbles. And here we go with the marbles fighting to see who gets on the slide first. And it looks like it's Cherry Cat's Roundy. Well, maybe the marble was listening because Cherry Cat's Roundy came out first. We knew you could do it, Randy. >> I should have given my marble a name. >> All right, guys. It's time for the championship round with Catron's green number 72 squaring off against Cherry Cat's brown Roundy. This time, we'll set the marbles with our launcher. And next is Roundy's turn. All right, now our marbles are ready for the race. >> Uh, tell the viewers at home how many takes that took. >> Um, no, Jasper. We're keeping that a secret. All right, guys. This one's for all the marbles. Literally. Here we go. Roundy takes an early lead, but Catron's marble sneaks ahead for the win. Congratulations, Catron. Since your marble was the winner, you get this trophy filled with gumballs. >> Oh, wow. Thank you. >> We were robbed. >> Don't worry, cherry cats. I'll share with everyone. >> Oh, well then, hooray for Catron. All right, everyone. If you had fun watching these marble mazes, give us a thumbs up. Bye, everyone. See you next time. Crayon Red English cat. Shy at school bus. Hm. Billowat horse. for super pig. [Music] Piggy [Music] sheep. Oh to motherh. Goat. [Music] Takea number chicken Mr. rooster. [Music] Cherry cats. [Music] Playhouse character. Mini mouse microwave. Burger. Square. triangle. Hexagon. Microwave microwave bone. Take blue. Oh, Blueberry. [Music] Mhm. Take Blueberry cat. Octopus. Dolphin. Die or buy [Music] purple gumballs. Coral. Coral. No, no, no, no. Oh, wow. [Music] Take Huh? Wow. [Music] Bye. Wow. Bye. [Music] Green. [Applause] Take minute. Yay! School! Oh! [Applause] Dear rabbit. forgu. [Music] Huh? Yes. Fish stump fox beloved. Beaver. Squirrel. [Music] Beer. Yellow [Applause] shirt. What's blueberry or cherry cat? Genevi shoved school bus. [Music] Blueberry cat, hops or cherrypid jack or the tuxedo tabby jamus. [Music] Bye idea.",
    "start_time": 0.32,
    "end_time": 2071.159
}