{
    "video_id": "kqpYdwcPiio",
    "channel_url": "@loolookids",
    "transcript": "[Music] Lulu kids [Music] trickor treat. Where are you? Where are you? I found you. I found you. I found you. [Music] Woo! [Music] Woo! [Music] Where are you? Where are you? I found you. I found you. I found you. Trick or treat. Trick or treat. Trick or treat. Trick or treat. Trick or treat. Where are you? Where are you? I found you. I found you. I found you. [Music] Where are you? Where are you? I found you. I found you. I found you. [Music] Wow. [Music] Oh, >> color blue. Wow. >> That's orange. [Music] >> And color red. >> Johnny. Johnny. >> Yes, papa. >> Eating sugar. >> No, papa. Papa telling lies. >> No, papa. >> Open your mouth. Haha. [Music] >> Wow. >> Color green. That's purple. and yellow. >> Johnny Johnny >> Yes, papa. >> Eating sugar? >> No, papa. >> Telling lies? >> No, papa. >> Open your mouth. Haha. [Music] >> Shark. Doo doo doo doo doo doo. Baby shark. Haha. Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark doo doo doo doo doo doo. Baby Shark surprise egg. Let's break it now. Mama Shark doo doo doo doo doo doo. Mama Shark doo doo doo doo doo doo. Mama Shark doo doo doo doo doo doo. Mama shark surprise egg. Let's break it now. Wow. Papa Shark, doo doo doo doo doo doo. Papa Shark, doo doo doo doo doo doo. Papa Shark, doo doo doo doo doo doo. Papa Shark, surprise egg. Let's break it now. Grandma Shark, doo doo doo doo doo doo. Grandma Shark, doo doo doo doo doo doo. Grandma Shark, doo doo doo doo doo doo. Grandma Shark, Sri Egg, let's break it now. Grandpa Shark, doo doo doo doo doo doo. Grandpa Shark, doo doo doo doo doo doo. Grandpa Shark, doo doo doo doo doo doo. Grandpa Shark. Surprise egg. Let's break it now. Baby Shark, doo doo doo doo doo doo. Mama Shark, doo doo doo doo doo doo. Papa Shark, doo doo doo doo doo doo. Grandma Shark, doo doo doo doo doo doo. Grandpa Shark, Surprise. Let's play now. Happy Shark, doo doo doo doo doo doo. Happy shark doo doo doo doo doo doo. Happy shark doo doo doo doo doo doo. Happy shark. [Music] Trick or treat. Trick or treat. Trick or treat. Trick. Give me a try. >> Little monsters running down the hall. Hiding in the closets where the spiders crawl. Glowing jacko'lanterns in a pumpkin face. Spooky decorations all over the place. Wo wo. >> Halloween is fun and scary. Wo wo. >> Trick or treating. Lots of candy. I can be whoever I want to be when it's Halloween. >> Trick or treat. >> Nah. [Music] Ghost and witches flying through the air. Silly little goblins are laughing everywhere. Don't be scared to worry. This is our tomorrow. It will disappear. Oh yeah. Wo wo. >> Come on in. >> Hungry is fun. [Music] >> Wo wo yo. >> Trick or treating. Lots of candy. >> Yeah. I can be whoever I want to be when it's Halloween. Trick or treat. Trick or treat. Trick or treat. Trick. Give me a treat. Dressing up just like a mommy. So much candy in my tummy. If you are sad, it's over. Have no fear. Halloween next year. Wo wo. Trick or treat is fun and scary. Wo wo. Trickor treating my >> happy Halloween. >> I can be whoever I want to be when it's Halloween. >> Okay. [Music]",
    "start_time": 0.43,
    "end_time": 444.829
}