{
    "video_id": "yEmT5oYUtao",
    "channel_url": "@loolookids",
    "transcript": "[Music] Lulu kids [Music] [Music] up ba black sheep have you any w sir yes sir and keeping it cool not For the master, not for the day. All for myself now to play my own game. [Music] Ba red sheep, have you any w? Yes sir. Yes sir. It's looking so good. Not for the master. Not for the day. All for the fashion. I'm winning the game. [Music] Ba yellow sheep, have you any wool? Yes sir, yes sir. Shine so clear. Not for the master, not for the day. All for the sunshine. That's my golden flame. Da da da da da da da da da da da. Ba ba green sheep, have you any wool? Yes sir, yes sir. Sickle and cool. Not for the master, not for the day. All for the planet and proud of my name. [Music] Ba blue sheep, have you any more? Yes sir, yes sir, wavy and cool. Not for the master, not for the dame. All for the ocean. The waves know my name. D. [Music] [Music] The little chick is blue. Tap the yellow button. And now the little chick is yellow. Yellow. Yellow. The little chick is yellow. Yellow. Yellow. Yellow. And this is very fun. The little chick is pink. Tap the red button. And now the little chick is red. Red. Red. The little chick is red. Red. Red. Red. And this is very fun. The little chick is green. Tap the blue button. And now the little chick is blue. Blue. Blue. The little chick is blue. Blue. Blue. Blue. And this is very fun. The little chick is white. Tap the pink button. And now the little chick is pink, pink, pink. The little chick is pink, pink, pink, pink. And this is very fun. The little chick is gray. Tap the green button. And now the little chick is green, green, green. The little chick is green, green, green, green. And this is very fun. All the little chicks flap, flap, flap, flap. All the little chicks tap, tap, tap, tap. All the little chicks play all day and this is very fun. All the little chicks go down the slide. All the little chicks go wee wee we wee we wee. All the little chicks go down the slide. And this is very fun. Let's learn colors together. That's red. >> The wheels on the bus go and round and round. Round and round. The wheels on the bus go and all through town. The door on the bus goes open and shut, open and shut, open and shut. The door on the bus goes open and shut all through the town. The wipers on the bus go swish swish swish swish swish swish swish swish swish. The wipers on the bus go swish swish swish all through the town. The horn on the bus goes beep beep beep beep beep beep beep beep beep. The horn on the bus goes beep beep beep all through the town. The people on the bus go up and down, up and down, up and down. The people on the bus go up and down all through. The baby on the bus goes wah wah wah wah wah wah wah wah wah. The baby on the bus goes w all through the town. The mommy on the bus goes shush shush. The daddy on the bus goes shor. The mommy on the bus says, \"I love you. I love you. I love you.\" The daddy on the bus says, \"I love you, too.\" All through the town. [Music] [Applause] [Music] Five little ducks. I quack quack quack flap flap flap and quack quack quack. Blue, red, yellow, pink, and green. Cute ducks you ever see. Five little ducks say quack quack quack. Flap flap flap and quack quack quack. [Music] Yay! Yoohoo! >> Blue, red, yellow, pink, and green. Cutest ducks you've ever seen. Five little ducks say quack, quack, quack. Flap, flap, flap, and quack, quack, quack. Blue, red, yellow, pink, and green. Cutest ducks you ever seen. Five little ducks say quack quack quack flap flap flap. Quack quack quack. [Music]",
    "start_time": 0.43,
    "end_time": 436.609
}