{
    "video_id": "LRZtghQOxhs",
    "channel_url": "@loolookids",
    "transcript": "[Music] Woo! Kids! [Music] [Applause] The wheels on the bus go round and round, round and round, round and round. The wheels on the bus go round and round all through the town. The door on the bus goes open and shut, open and shut, open and shut. The door on the bus goes open and shut all through the town. The wipers on the bus go swish swish swish swish swish swish swish swish swish. The wipers on the bus go swish swish swish all through the town. The horn on the bus goes beep beep beep beep beep beep beep beep beep. The horn on the bus goes beep beep beep all through the town. The kids on the bus go up and down, up and down, up and down. The kids on the bus go up and down all through the town. The signals on the bus go blink blink blink blink blink blink blink blink blink. The signals on the bus go blink blink blink all through the town. The motor on the bus goes vroom vroom vroom vroom vroom vroom vroom vroom vroom. The motor on the bus goes vroom vroom vroom all through the town. The wheels on the bus go round again, round again, round again. The wheels on the bus go round again all through the town. [Music] Let's learn colors together. That's red. The wheels on the bus go round and round, round and round, round and round. The wheels on the bus go round and round all through town. The door on the bus goes open and shut, open and shut, open and shut. The door on the bus goes open and shut the town. The wipers on the bus go swish swish swish swish swish swish swish swish swish. The wipers on the bus go swish swish swish all through the town. The horn on the bus goes beep beep beep beep beep beep beep beep beep. The horn on the bus goes beep beep beep all through the town. The people on the bus go up and down, up and down, up and down. The people on the bus go up and down all through the town. The baby on the bus goes w. The baby on the bus goes wah wah wah. All through the town. The mommy on the bus goes sh. [Music] The daddy on the bus goes sh all. The mommy on the bus says, \"I love you. I love you. I love you.\" The daddy on the bus says, \"I love you, too.\" All through the town. [Music] I can't wait to go to the fair today. Hey, here comes the bus. Hooray! >> Hop on board. >> The wheels on the bus go and round and round and round. The wheels on the bus go and all through the town. The door on the bus goes open and shut, open and shut, open and shut. The door on the bus goes open and shut all through the town. The wipers on the bus goes swish swish swish swish swish swish swish swish swish. The wipers on the bus go swish swish swish all through the town. The horn on the bus goes beep beep beep beep beep beep beep beep beep. The horn on the bus goes beep beep beep all through the town. The kids on the bus go up and down, up and down, up and down. The kids on the bus go up and down all through the town. The signals on the bus go blink blink blink blink blink blink blink blink blink. The signals on the bus go blink blink blink all through the town. The motor on the bus goes vroom vroom vroom vroom vroom vroom vroom vroom vroom. The motor on the bus goes vroom vroom vroom all through the town. The wheels on the bus go round again. Round again, round again. The wheels on the bus again all through the town. [Music] The wheels on the bus go and round and round. Round and round. The wheels on the bus go round and round all through the town. The door on the bus goes open and shut, open and shut, open and shut. The door on the bus goes open and shut. All through the town, the wipers on the bus go swish swish swish swish swish swish swish swish swish. The wipers on the bus go swish swish swish all through the town. The horn on the bus goes beep beep beep beep beep beep beep beep beep. The horn on the bus goes beep beep beep all through the town. The people on the bus go up and down, up and down, up and down. The people on the bus go up and down all through the town. The baby on the bus goes w. The baby on the bus goes wow wow wow all through the town. The mommy on the bus goes shush shush shush shush shush shush shush shush. The daddy on the bus goes shush shush shush. All through the town the mommy on the bus says I love you. I love you. I love you. The daddy on the bus says, \"I love you, too.\" All through the town. [Music]",
    "start_time": 0.43,
    "end_time": 505.81
}