{
    "video_id": "RWdSzFvI7Cw",
    "channel_url": "@nickdigiovanni",
    "transcript": "Nick:\nThis is the Number 1 rated steak in the\nentire world... and we're gonna compare it to this ultra\nrare Wagyu that costs $100 per bite at this futuristic steakhouse, that turns meat\ninto cotton candy and everything in between. And we're starting here in Turkey at Salt Bae's\nrestaurant, Nusr-Et Steakhouse. Nick: You ready?\nSalt Bae: Always.\nNick: Tell me about the grill! Sakt Bae:\nThis is iron. We use only charcoal. Nick:\nThis is gonna give incredible flavor to the\nmeat. Salt Bae:\nThis is the giant tomahawk. Turkish Wagyu. 4 weeks...\ndry aged. Nick:\nLook at the incredible red,\nvibrant color of this beef...and the streaks of fat in there, that beautiful marbling. Salt Bae:\nMost important: you must hear this voice. Nick:\nYou want even contact across the whole\ntomahawk on the grill, so it gets even char marks. But this is heavy,\nso it doesn't need you to press it. Obviously, we don't have any browning in the center\nthere, but look at these lines! He flips it sideways for the crosshatch\npattern...when you get that kind of crisscross on the steak. In addition to the tomahawk,\nhe's also got a beautiful Chateaubriand. This is a tenderloin,\nbut it's the best part of the tenderloin. That's a good sound. Looking good, Salt Bae. Salt Bae:\nWhen you cook, must be more gentle. Soft. Nick:\nLook at the contrast between the golden brown\ncrust on the edge there, and that beautiful red on the inside! Now he's laying it on its side to render some\nof the fat on the edges off. And look at this! I just noticed his chain is\nthe exact same shape of the steak we're cooking right now. He's letting me go for a\ntry here. Hopefully I don't mess it up. Push it down a little bit...quickly get that very,\nvery top part. Ain't this crazy? Me and Salt Bae, used to have \"beef\". Now we're cooking beef\ntogether. Look at the perfect pattern that he got on the tenderloin! Salt Bae:\nThis is art.\nNick: He's right. Cooking is a patient process\nsometimes. We've been standing here for maybe 15,\n20 minutes. Salt Bae:\nEvery minute is important. Salt Bae: Salt Bae.\nNick: Every few seconds,\nhe spins the steak just a little bit. And what that's doing is making sure that the\nwhole steak gets even contact across the grill at all times. He's moved it around so\nmuch that it almost has a fully even crust. This is the longest I've ever seen a steak\ncooked on the grill... and it looks amazing.\nSalt Bae: Almost medium. Nick:\nHow do you know? Salt Bae:\nLast 29 years...I cook every day. Nick:\nIt looks like it's done. It's time for the presentation of the steak.\nThe moment you've all been waiting for. Look at that! Cooked to perfection. The biggest bite of meat I've ever had. That's the color right there\nthat you want in any steak. To see how much care he puts into cooking it,\nand then to actually taste it right away after that...\nIt's juicy. Look at that drip! It's flavorful. Perfectly\nsalted. Unbelievable. I've always wanted to see him\ndo this. This is so satisfying. Oh! Listen to those crispy \"chicharrones\" in there! It's one of the best sounds I think I've\nheard from food. And if you think this looks good, just wait until you see some of the\nsteakhouses coming later in this video! Listen! 3, 2, 1.\n(Distorted:) Salt Bae! Nick:\nOh, my God! With the \"chicharron\" in there... Salt Bae:\nSalt Bae. Nick: Can I ask you to just try my steak seasoning?\nSalt Bae: Okay. Nick:\nThis is my Osmo steak seasoning. It's available at Walmart. And in addition to\nthe steak seasoning, I've got chicken, seafood, vegetable, and all-purpose flaky\nsalt. Since you're the king of steak,\nI'd love to see if this is \"Salt Bae approved\". I'm kind of nervous. It's keeping me in\nsuspense here. Salt Bae:\nGorgeous. Nick:\nDo you like it?\nSalt Bae: Very fresh. Tasty. Nick:\nSalt Bae! One of the best bites of steak I've\never had. Our next stop is a Michelin Starred\nsteakhouse called Cut. And here we're gonna try the rarest steak\nin the entire world: Japanese Kobe beef. It's so rare that each cow actually gets its\nown official birth certificate. Oh, and this is my friend Airrack. He's gonna\nbe eating with me. Airrack:\nHow's it going, guys? Nick:\nWhy would you wear Crocs? I told you multiple times this was a fancy\nrestaurant. Airrack:\nYou can take the man out of the Crocs,\nbut you can take the Crocs out of the man. Am I right? Nick:\nI feel like I'll regret introducing you to\nthe head chef, but I'm gonna do it anyways. Cut Chef: Nick, nice to see you.\nAirrack: How's it going? Cut Chef: How are you?\nAirrack: I am looking for the dollar menu. Cut chef:\nNot here. This is what we're gonna be enjoying today. This is the real deal... Kobe beef. All Kobe beef is Wagyu,\nbut not all Wagyu is Kobe beef. It has to meet a certain criteria. To be eligible to sell it, you have to have this certification. It's about $100 an ounce. I've had people cry after they've taken a\nbite of this. Airrack:\nWhat are we about to experience? Nick:\nYou know, a regular steak,\nright, Airrack? Airrack: Yeah.\nNick: Well, if you jump a few levels above\nthat, you get Wagyu. Very fancy Japanese beef. But then above that, there's this very small\namount of absolutely perfect Wagyu, that qualifies as \"Kobe beef\". And this is considered the \"best steak on the\nplanet\". Airrack:\nIt's like a Big Mac but 10% better or\nsomething like that. Nick:\nNo. What I love so much about Wagyu is every\nsingle cut is different. Like a snowflake. One of the other things\nthat makes it so expensive is you're trimming off so much of these different parts to get\nto the core of the Wagyu. This one little piece right here is about $25\nworth of Kobe. Look at it compared to my head! Airrack:\nWhat are you gonna do with this? Cut Chef:\nThe cool thing about Kobe beef... You can do whatever you want to it,\nand it's not gonna suck. Airrack:\nSo are you thinking like Chicken McNuggets?\nThe whole space back here is hot. Like, it's not just this. It's like the entire kitchen\nis, like, scalding hot. It makes me angry back here. Nick:\nI just want to do a quick challenge, and see\nwhich one of you can hold your hand over the grill longer. Airrack versus Chef. 3, 2, 1. Go! Airrack:\nI'm gonna have burns from that. Cut Chef:\nI can't feel anything. Airrack: Dude, what are you talking about?\nCut Chef: I can't feel anything. Nick:\nAlright, let's cook! Where do we start? Cut Chef:\nThis is a little bit of rendered Wagyu fat. Nick: Wow!\nCut Chef: So not to change the flavor of the beef\nat all. Nick:\nSee how he's seasoning from high up, guys? This is how you're supposed to season. Kobe goes on. The smell is insane. Airrack:\nDo you feel like a high level of\nresponsibility, cooking this meat?\nCut Chef: 100%. Nick:\nYeah. I mean, this is something that you\ncannot mess up. Airrack:\nYou're saying that to me like I would mess\nthis up. Nick:\nYou absolutely would. What's so cool about\nhow they cook this Kobe here at this restaurant is that...they're getting the flavor\nand the grill marks from the charcoal and the wood over here, and then they're moving it\nover to a plancha to cook it the rest of the way through in a different way. Cut Chef:\nI like it a little \"pass\nmedium rare\". Airrack:\nIt looks so good.\nCut Chef: You might shed a tear or two. This is gonna be the best steak you've\never had in your life. You guys are in for a treat. We're just gonna serve it simply with\na little bit of salt. Nick:\nThe plating is awesome. Super simple. Airrack:\nLet's do this! Cheers! I actually can't believe that. That's insane, dude. That was the best bite\nof food I've ever had in my life. Nick:\nThis might be crazy, but I want to try with\nmy new seasoning. Our slogan is that \"Osmo makes everything\nbetter\". This might be one rare exception, where I don't think it's gonna be the case. Nick: Mm!\nAirrack: That's insane, dude. Nick: It's fun.\nAirrack: The only thing I feel like could\nmake it better is some ketchup. Nick:\nLet's go to the next steakhouse, before I get\nmad! Our next restaurant is a Brazilian steakhouse called Max and Guga's Meatery. Since my friend, Guga is Brazilian and Max\ncooks meat almost every single day, I asked them to open a \"1-day-restaurant\"\njust for this video. Nick: Nice to meet you.\nMax: Welcome here!\nNick: Nice to meet you.\nMax: I heard so much about you. Nick:\nThis is quite possibly the most exclusive\nsteakhouse in the world. Guga:\nIt's as exclusive as it gets. Max, fix it,\nplease! Yeah, just slap it! That's what you were\nsaying, sir? What were you saying? Nick:\nBefore we eat, could you take me around the\nkitchen? Guga:\nAbsolutely. So here we have a few skewers\nready to go for you, sir. Picanha, Skirt steak...\nMax: Pineapple, some beautiful Brazilian sausages... Max: What is this?\nGuga: Filet Mignon and bacon.\nMax: We have the Filet Mignon and bacon. And of course, we have the Wagyu.\nGuga: But not any Wagyu. These are the most exquisite Wagyus in the\nworld, because each single one of them is an experiment. Max, can you do it properly,\nplease? Are you all right?\nMax: I'm good, I'm good. Guga:\nOkay, good. But as I was saying,\neach one of these Wagyus are experiments for my videos. And only for you. Max, you begin with this one,\nplease! So a generous amount of salt in all of our skewers. Do you know what this cut is?\nNick: Picanha. Guga:\nThat is correct. Brazilians' Number 1 steak. Picanha, we only use salt and\nnothing else, but the other 2, we're actually gonna use a little bit of\nblack pepper, which is totally fine. Max:\nI'm still a chef in training at this\nBrazilian steakhouse. But somehow today you've left me with the best of the best,\nthe Wagyu. Guga:\nThat is correct. Don't mess it up,\nMax! How do you like your steaks? Nick:\nI actually prefer medium. Guga:\nWhat? Nick:\nI'm serious. I like medium. Guga:\nGet out! We got our grill nice and hot. Let's put them in!\nMax: Why don't we start with the Picanha? It's\nthe biggest. Guga:\nYes. And the best. Picanha is in,\nfollowed by... Max:\n...beautiful flank steak. Guga:\nThat's correct. Max:\nOutside Skirt steak. Guga:\nThat is correct, sir. Max:\nWe have our bacon wrapped Filet Mignon. Guga:\nAnd the end?\nMax: Sausages. Guga:\nYes. Voila! Now close this up,\nbecause we're not done yet. Max:\nIt is time for our beautiful pineapple\ndessert. We're giving our pineapple a really nice sear\nfrom both sides. Charcoal at the bottom, torch over the top...\nWe're cooking from every angle. Guga:\nDon't burn it, Max!\nMax: My bad.\nGuga: Now that we got a little bit of char, we'll sprinkle a little bit of cinnamon and\nsugar. And now we'll let it cook for a little bit\nlonger, caramelizing everything. And it's gonna be amazing. No, no, no, no, no! What are you doing? We gotta caramelize it nice and slow. Good things comes with\npatience, Nick. Max:\nOh! Max: Guga!\nGuga: Let's check in on our meat! Oh, okay. We're getting there. Max:\nColor is looking great on that Skirt steak. All those juices just basting itself. Guga:\nThat man is in for a treat. Max:\nHe is. Guga:\nLet's cook you some Wagyu,\nsir! Straight from Japan. Several different\ngradings. I just want to ask one more time. How do you like your steaks? Nick:\nMedium. Guga:\nAnd the key is to get a nice,\nbeautiful golden brown crust. That type of caramelization is the one I\nlike. You go sit down, sir. You go enjoy it!\nNick: We're ready?\nGuga: Yes. Nick:\nWe're ready. Guga:\nNow we serve. Here we got some Picanha, sir. Max:\nWe have some beautiful flank steak. Guga:\nNice and medium. Just the way you like it,\nsir. Nick:\nWow! That looks cooked really well. Oh, my gosh! You're gonna poke me in the eye. Max:\nI apologize. Nick:\nThe Picanha is really good.\nGuga: Max! Max! Max! Max! Max! Max! Lower it here to be stable! Nick:\nSo on possession. Guga:\nThere you go. And then put it down! Yes. Max:\nYes, chef! Guga:\nYou just upgraded. Good job. Nick:\nIt's cooked plainly?\nGuga: I'll double check for you. Nick:\nNo chance you guys are supposed to be\neating. I will say... so far, very good. I quite literally believe\nthat Guga and Max could make the best Brazilian steakhouse on the planet for one\nday. Probably not every day,\nbut definitely for one day. Max:\nSir, we got some slices of...Oop! Apologize. Nick:\nWow! The nice thin slice right there. Guga:\nYes, sir. Nick: Very good.\nMax: I think you could use one more\nslice. Nick:\nYou almost just poked my eye. Guga: Let's put...\nNick: This is... Guga: ...it down!\nNick: ...insane! This is actually so dangerous.\nMax: I apologize. Nick:\nThe marinade on this is fantastic. Guga: Very good, huh?\nNick: This is the biggest plate of meat\nI've ever had at a Brazilian steakhouse. They actually did an incredible job. Max:\nAlright, I need you to try this one. It's a\nPicanha Wagyu A5. Some of the greatest Picanha in this side of\nthe Mississippi. Nick:\nWow! That's incredible. Max: Thank you!\nGuga: Good job, chef! And here we have the specialty, sir. Just a few pieces of Wagyu for you. Nick:\nSomething is... Oh! That's disgusting. Guga:\nWe dry aged it in durian. We like to experiment here,\nsir. Nick:\nIt's like petrol. It's so horrible. Guga:\nAnd of course we have dessert,\nsir. This is caramelized pineapple. Dig in! Nick:\nThat is exceptionally good. Max ang Guga's Meatery. You wish you could eat here...\nbut you can't, because you guys are... permanently closed...right now. Guga:\nAt least we made it 1 day,\nMax. Nick:\nOur next restaurant is Peter Luger's\nSteakhouse, the Number 1 rated steakhouse in New York\nCity that's world famous for its dry-aged beef that's served on a hot,\nsizzling plate of butter. I've also brought along my friend, Matt Stonie\nto help me eat. If you haven't seen him before, he is one of the best competitive\neaters in the world. First, we're gonna check out their dry age\nvault. This room we're entering right now is filled with over $1 million worth of dry-aged\nbeef. And to remind anybody who doesn't understand:\nthe entire point of dry aging like this is to develop lots and lots of flavor in beef. It smells like a weird cheese. Matt: I've never smelled a smell like that before.\nNick: As we walk down this room, the meat is gonna get harder and harder, because it's been aging\nlonger. The meat just goes on forever. They just have tons and tons of \"meat hallways\"\nin here. Peek over the top! It's like the coolest view\nI've had in here. Matt: I'm not that tall.\nNick: You want me to lift you up?\nMatt: Sure. Oh! Matt: It's beautiful.\nNick: Some of these actually feel like a rock. I think I've torn my knuckle a little bit by\njust knocking that. I can push this as hard as I can with my\nhands and fingers. Nothing. Now the hardest part... Nick: Picking the meat that we're gonna eat.\nMatt: Dude, I eat hot dogs. I have no idea what I'm looking for here.\nNick: Ooh! Look at these guys! That one is huge. Matt,\nI think I found our meat. Frank is a master butcher. He's gonna help us break this thing down. And\nhe's gonna start by trimming off that outer bark, since we can't eat that part. And then\nthat right there is the first full steak being cut. Out of all the pieces we just got, this\nis the biggest, nicest one. This is a Porterhouse. But there's just one\nmore quick step before cooking, which is to trim off some of that excess fat. Here's a good \"Before\" and \"After\" look of\ntrimming off that fat. Matt, be honest! In one sitting, how many of these do you think you\ncould realistically eat? Matt:\nThat stack looks doable right there. Nick:\nWhat? Alright, time to cook this bad boy. They have these crazy ovens here. It's basically like a giant broiler. Nick: These are 1000°C.\nMatt: 1000°C? Nick:\nAnd as you can see, they put a lot of very\nfine salt on the top of the steaks. The reason there's so much salt is...it's only\ngoing on that top side. And then later when they add the butter, it's\ngonna melt down with all that salt, and create almost a sauce. Matt:\nI've never seen steaks cook like this before.\nLike the flame is right there above it. It's oddly calm. Matt: Oh, oh!\nNick: It's on fire. It's like making a\nS'more. Looks like it's time for a flip. Matt:\nOh! Nick: Nice.\nMatt: Oh, baby! Matt: There we go.\nNick: Look at those bubbles on there!\nAll that really fine salt has dissolved across the steak. When it's almost done\ncooking, they're gonna slice the steak. And as a reminder, this is a Porterhouse. So you\nget both that New York strip and the tenderloin here. But the very final step is\nto cook it a second time in some butter to give it some extra last second flavor. And that way they can send the finished plate\nout to the dining room, when it's still hot and sizzling. Matt, you want to share or you\nwant your own?\nMatt: Is that a question? Nick:\nThis looks amazing. I think there's something\nabout watching a meat cook that makes me hungry. Matt:\nIt's like waiting in line at Disneyland or\nsomething. You know, it's like you see all the action and get really excited. Nick:\nI'm gonna go for a piece of the tenderloin\nfirst. I'm going for a little butter dip as well. Mm! Dude, the butter is insane.\nMatt: That butter's really good. Nick:\nI can taste the dried flavor. Matt:\nThe crust is crazy. I don't think I've ever\nhad a streak like this before. Usually there's some sort of flavor... This is, like, the most pure...salt, butter... Nick:\nWell, that's the thing. The coolest part\nabout the steakhouse, to me, is that the flavoring is all done in that dry age room\ndownstairs. They don't need seasoning...\nbut maybe they don't know about Osmo. We're moving on to Born & Bred,\nthe 15th best steakhouse in the world, known for its Hanwoo beef,\nKorea's ultra rare version of Wagyu that never leaves the country. Which means I had\nto fly all the way here just to try it. Nick: And I've also brought along my friend, Dooby\nto eat with me.\nDooby: Hi, y'all! Nick: Ready? Dooby: I'm ready.\nNick: They're letting us first take a\nquick peek in their butchery, where they prepare all the beef for this experience. Dooby:\nWhat differentiates Hanwoo versus other types of\nbutchery is that the cuts are much more specified. To really make sure you get that\nreally nice texture and flavor all in one. Nick:\nWhat they're doing here with this beef is\nmostly letting the lines of fat guide where they cut, so that they're not cutting through\nthe actual meat. But what's really crazy to me about all this is that I'd never heard of\nHanwoo, before we started working on this video. It's such a well-kept secret in Korea, and that must be for good reason. This is amazing. Dooby:\nWow! So fancy. Nick:\nI know. I didn't know it would be this fancy. The first dish we'll get to try is this steak\ntartare made from Hanwoo top round. What a bite! Dooby: Wow!\nNick: I'm really excited for this second one. It uses the Hanwoo beef rump,\nand they're combining it with strawberry. I've never seen anything like this before.\nThere's also some honey infused vanilla oil going on top, as well as a little mint leaf\nthere. Oh, my gosh! It tastes like a dessert. Dooby: Wow!\nNick: The first thing that came to my mind\nbefore I tasted the beef was strawberry shortcake. Dooby:\nYou're onto something. Nick:\nNext, we get to try this honey tenderloin\ntopped with a bit of truffle. I really love the simplicity of this dish. Dooby:\nMeat and truffle. How could it go wrong? That's a juicy fellow. Nick:\nIt tastes so pure, but the flavor is not very\noverpowering...in a nice way. It's unlike any piece of beef that I've ever\ntried before. Before our next bite,\nit looks like we're getting a palate cleanser: some mango with a little bit of\nblack lime zest. Oh! Oh, my gosh! I'm gonna start eating my mangoes\nwith lime zest every time. This next course is really creative. It's a Hanwoo top\nblade that's cooked using both charcoal and snow. Why are you resting the meat on the\nsnow? B&B Chef:\nThis is what our ancestors used to do. Put it on the charcoal, and cool the meat down.\nPut it on the charcoal, until it's done. Nick:\nBack and forth? B&B Chef: Yes.\nDooby: That's so cool. Nick:\nSo it's like rapid resting. I'm curious to see if this worked. Dooby:\nIt's one of the best bites I've ever gotten. Nick:\nI'm not totally sure what this next course\nis, but it's being very carefully grilled in some\ntraditional Korean paper... and they're also constantly spraying it with\nwater to keep it moist. He's untying it now, almost sort of like a\nChristmas present. Whoa! Is it a perfect mix of beef and fish? I think it is. Dooby:\nWhat's being smeared on top is a \"Doenjang\"\nsauce. \"Doenjang\" is a Korean traditional bean paste\nthat's been fermented for longer. Nick:\nAnd now he's using a torch to caramelize the\nsugars to really boost that flavor. It tastes like a hamburger patty with Miso Black Cod.\nDooby: Nobu meets McDonald's. Nick:\nGetting close to the end of the meal now,\nwe've got some hot pot using Hanwoo top sirloin. I love how they're using every cut\nof beef in a completely different way. It tastes like a fresh garden. Dooby:\nFor me, it's the textural component of the\nvegetables. It's almost the noodles. Nick:\nThe fresh wasabi and the fat together are\nreally good. The final dish is a \"Hanwoo Bulgogi\", the national dish of Korean royalty. This right here is the dish I flew all the\nway to Korea for. This is making my mouth water. He's plating\nthis with the beef drippings and the broth. What is this? Dooby:\nIt's a \"banchan\". Korean classic table fare. B&B Chef:\nThis is the highlight.\nNick: Where do we start?\nDooby: I think I'm gonna go for...a leafy green. We put our beautifully seared Kobe on top. We do a little bit of the marinated raw crab, a little bit of rice. You wrap it up. Nick:\nBoom! Here we go. There's so many flavors here. But what's so\nmuch fun is that you can build each little wrap each time however you want. Dooby:\nThis feels like a friend who,\nafter summer break, just got a total transformation. It's like: \"Girl! Who is she?\". Nick:\nI have absolutely no idea what you're talking\nabout. Our next stop is Cote, a Michelin Starred Korean barbecue restaurant, that's the Number 1\nranked steakhouse in America. I don't have a guest for this one,\nso I'm sending one lucky subscriber here for dinner instead. But don't worry!\nThere are plenty more guests joining us later in this video. Here comes the chef. He's\ngonna start by oiling up the grill with some beef fat trimmings. His first cut here is hanger steak. Ooh! And we're already cooking. Of all the\nrestaurants out there, Korean barbecue is one of my favorite, because you see the food from\nstart to finish. Rotating it around a little bit. Cote Chef:\nYes, because it has different hot spots. Nick:\nLook at that! My first bite of beef here. Mm! The hanger is the most underrated cut of\nsteak. Cote Chef:\nThat's my favorite cut, actually. Nick:\nMe too. Boom! I love how many sides there\nare, by the way. The sides here are actually part\nof the reason this is the only Michelin Star Korean barbecue restaurant in the United\nStates. I'm gonna use them to make a nice lettuce wrap. It's gonna take me a bit.\nThis next steak here is a 45 day dry-aged ribeye. You'll notice that the chef is cooking all\nthe meat for us, and that's because the quality of beef they\nuse here is so incredibly high that they don't want you to mess it up.\nBut I'm not sure how I feel about that, since I actually like cooking my own stuff at\nKorean barbecue. That one is amazing. The flavor combined with\nthe fact that it's fresh hot off the grill... I would say, for me that's a clear Top 10\nsteak bite...ever. I'm also gonna try this with a shiso leaf,\nwhich sort of tastes like a mix between mint, basil and licorice. I don't know how to\ndescribe it, but I really like it. Looks like next we're\ngetting a 120 day dry-aged ribeye. This will be the longest aged beef that we\ntry in this entire video. This is very rare to find in any steakhouse. Cote Chef:\nDoesn't it taste like blue cheese? Nick:\nIt tastes a lot like blue cheese. It's weird. The more you chew it,\nthe more it tastes like blue cheese. If you like blue cheese, then you might like 120 day\ndry-aged beef. If not, I don't think you'd like it. Finally, we have the Kobe beef. Here we go. That one's my favorite. Perfect overall\nbalance across the entire bite from start to finish. Before our final bite of Korean\nbarbecue, he's gonna change out the grill here, since the final steak has such a\ndifferent flavor profile. They are not messing around. This one's called the \"Dessert Steak\". It's a short rib that's been marinated in soy\nsauce, brown sugar and pear juice to make it sweet\nand tender. It's like almost as if a piece of cooked beef\nwere very lightly candied. I didn't know how I'd feel about this one,\nbut that is exceptionally good. Let's go eat some more steak! Up next is Maison Kasai,\na fancy hibachi restaurant run by a Michelin Starred chef. I also brought along a couple\nof friends to help me eat. We've got Patrick and Albert. I didn't tell you this yet,\nbut the experience has already started. We are in a room that somewhere has a secret\ndoor that leads to the restaurant. Patrick:\nAlright, let's get looking! Nick:\nOh! No, that's not it. Oh! Albert, you found it. Patrick: Oh! No way!\nMaison Kasai Chef: Welcome, guys! Maison Kasai Chef: Welcome!\nPatrick: Woo! Alright.\nMaison Kasai Chef: Alright. Here we go. Okay...who wants to try it? Get loose! Patrick:\nOh, no. I don't like this. I don't like this.\nMaison Kasai Chef: Alright, here we go. We're just gonna stack this egg. Patrick:\nWhat? Nick:\nLeaning tower of eggs... Maison Kasai Chef: Alright, I'm gonna light it up.\nPatrick & Nick: Oh! Oh! Maison Kasai Chef:\nWe're gonna start off with some eggs. Patrick: What?\nMaison Kasai Chef: We're just gonna play with our food. Patrick:\nIt's like art.\nMaison Kasai Chef: Little vegetables for the rice. Patrick:\nIs that day old rice, chef? Maison Kasai Chef:\nWeek old. Patrick:\nOh, week old. Maison Kasai Chef: Alright, here we go.\nPatrick: It's a heart. Maison Kasai Chef: I love you, guys. \nPatrick: Oh, is that the Osmo seasoning?\nMaison Kasai Chef: Yeah. We got our \"Furikake\" with sesame\nseeds. Patrick:\nI love \"Furikake\".\nMaison Kasai Chef: We have the veggies here. Nick:\nSome shiitake mushrooms,\nsome rosemary. Wow! I love that. That right there is one of\nthe small but important details that separates the good from the great.\nMaison Kasai Chef: Beef tallow. Nick:\nAnother thing that separates the good from\nthe great. Maison Kasai Chef:\nStart off with our ribeye. Nick:\nBeautiful ribeye. Patrick:\nI mean, out of all regular topping beef place, they're not\nwrapping the meat like this...with like rosemary and thyme. So this is just...\nnext level. Maison Kasai Chef: Okay, there we go. Careful. Hey!\nNick, Patrick & Albert: Whoa! Maison Kasai Chef:\nThis one's dangerous. Do not try this at\nhome! Maison Kasai Chef: Grab this!\nPatrick: Oh! Nick: What?\nPatrick & Nick: Oh! Nick:\nThat was crazy. Patrick:\nThis guy... Oh! Oh! Oh, he got a little bit. Maison Kasai Chef:\nHere we go. Let's add more meat! We got the Kobe imported from Japan. Patrick:\nThe most expensive cut of meat. Maison Kasai Chef:\nYes. Filet Mignon. A little more Osmo on\nthere. Nick: Love it.\nMaison Kasai Chef: Beef tallow. Add our lobster. Nick:\nUnbelievable. That's an incredible looking\nlobster tail. Patrick:\nOh! Maison Kasai Chef: Another one.\nNick, Patrick & Albert: Oh! Yeah! Maison Kasai Chef:\nWe're just gonna light the lobster. Patrick:\nPoor guy did nothing. Nick: Whoa!\nMaison Kasai Chef: Little train, little train. Patrick:\nYou know, when I was a kid,\nthat would be my favorite part. It's still my favorite part. Maison Kasai Chef:\nHere it is. Nick:\nWow! Patrick:\nWhoa! Albert:\nCheers! Patrick:\nThat is so good. Nick:\nThat's really incredible.\nPatrick: I don't know what's happening in\nmy mouth, but there's a lot of things happening...and I thank you for it. It's like buttery, beautifully cooked. Maison Kasai Chef:\nAlright, here we go. This is the\ntruffle shavings on the Kobe. Nick:\nBon appetit, baby! Dang! Look at that! Patrick:\nIt's like a garden with steak. Mm! That is so good. Maison Kasai Chef:\nAlright. Yeah. So there we go. We're just gonna\nlight it up. There we go. Okay. Patrick:\nOh! Maison Kasai Chef:\nThank you! Patrick:\nCan I do a flip with that? Maison Kasai Chef:\nYeah. Here you go. Nick: No, no, no.\nPatrick: 100%. Nick: Let's head to our next restaurant!\nPatrick: No, watch!\nNick: Up next is Gordon Ramsay's Steak, where we'll be trying Gordon's iconic Beef\nWellington...and Gordon himself actually sent along a little video to tell me exactly what\nto order. Gordon Ramsay:\nHi, Nick! It's Gordon. Now I hear you on the lookout for the\nworld's best steakhouses. Go to Gordon Ramsay's Steak! I promise you, you'll love it. Maybe\ntry the Beef Wellington and then...move away from steak and try that incredible seafood\nplatter! Enjoy! Nick:\nI've also brought along my friend, Q to help\nme eat. QCP:\nWhat's up, guys? Nick:\nFirst course incoming. QCP:\nWe have our hamachi crudo here. We also have\nour prime beef sliders. Prime beef tartare. Where do we begin?\nNick: I'm gonna try a little steak tartare.\nThat is up there with the Top 2 or 3 steak tartares I think I've ever had. QCP:\nThis is on my Top 3. I don't even know the other\n2. Nick:\nAnother slider. QCP:\nSo far...very, very enjoyable. All of it.\nNick: When some people think of steak,\nthey think of \"surf and turf\". So before the \"turf\", the Beef Wellington,\nI wanted to try a little bit of \"surf\". GRS Chef:\nI'm gonna set you up for your next course\nhere. Nick: What?\nQCP: Whoa! GRS Chef:\nWe have our ice shellfish platter. QCP:\nIt's like a wedding cake. Nick:\nThis is a mega seafood platter. It's got oysters, it's got clams. It's got shrimp. It's got lobster. It's got king crab. QCP:\nBest part...I know you love \"mini\" things. We\ngot the Mini Tabasco. Nick:\nCan you blame us for wanting to try this\nthing? I'm gonna start over in king crab land. They made it really easy to just slide\nit right out. QCP:\nWow! Nick:\nI'm gonna do a little lesson for everybody on\noyster etiquette. Give it a little bit of lemon, a touch of cocktail sauce,\nthen slurp. Chew it. Enjoy it. You take that oyster shell,\nand you flip it upside down.\nQCP: Which indicates...that it's empty. Nick:\nI'm gonna grab a shrimp now. Everything's delicious. I don't know how you can't love this. Are you ready for the main\nevent? This is it. Gordon's classic Beef Wellington. It comes\nwith a \"pommes puree\". That's a fancy way of saying potato puree, as well as a few\ndifferent vegetables, a little beef glaze, and of course,\nthe actual Wellington. Perfection. You'd think it'd be hard to cut, because it's\nbeef, but it is like butter. QCP:\nYou gotta make sure you get that puree. Nick:\nOh, man! It's iconic. It's delicious. QCP:\nSo soft. Nick:\nIt's got so many different textures. The\ncrispy puff pastry on the outside and creamy mushroom puree that's right inside that. And then the beef, of course,\nis a nice, beautiful, chewy texture. As it all comes together, it's the perfect bite. This is probably my 10th time having one of\nGordon's Beef Wellingtons, and it is perfect... every time. QCP:\nEvery single time. Nick:\nLet's go to the next restaurant! We are now\nin Paris, France to try steak frites. And I'm here with my friend Charles,\nwho's gonna say the name of the restaurant, 'cause I don't know how. Charles: L'Atelier Entrecote & Volaille.\nNick: This is the Number 1 restaurant in Paris for steak frites... but what really sets it apart is their secret\nsauce, that people fly from all over the world just to try.\nAntoine: Bonjour!\nNick: Bonjour! Charles:\nOh, very French...your \"Bonjour\". This is a typical French bistro. Look at the wood, the mirror and look also\nhow the table are really close together. When you eat, you are really close to\nstrangers. But that's...that's French. Nick:\nThis is Antoine. He's the executive chef. And he's gonna take us through how they make\ntheir steak frites. So he starts off simple by tenderizing the meat\njust lightly, and then adds a little sprinkle of salt. Charles:\nListen! They put the meat on the grill for\n1 minute, then he turns the meat 90 degrees. Nick:\nHe's getting that nice checkerboard pattern\non the beef. Now he takes the meat, once he's finished\ncooking, and brings it up to rest. Charles:\nWhile the steak is taking a nap, we're gonna see the fries. This is the secret. The fries are pre-cooked. And with this technique,\nyou have extra crispy fries outside and a puree inside. Nick:\nInto the hot oil we go. Again, the fries are already pre-cooked. We\njust need to basically crisp the outside now. And he's gonna give them a little shake to\nmake sure they don't stick together. What a great sound! Fun fact: French fries were not\nactually invented in France. You knew that? Charles:\nYeah...but I don't remember the country. Nick:\nThe last thing to do is toss those fries in\nsome salt, preferably Osmo. Oh, isn't that the crunch? You wouldn't think they could taste so\ndifferent from how they taste in the United States. They taste so different. What makes this restaurant and their steak\nfrites so special is this sauce right here. This took them years to perfect. How many people know this recipe? Charles:\nOnly 2 people.\nNick: And he's one of them? Charles: Do you have it?\nAntoine: Maybe. Maybe. Nick:\nThe plating here is simple and traditional,\nlike any other French bistro. This keeps the focus entirely on the food and\nits flavor. A beautiful French bistro just for the 2 of\nus. Nick: Merci!\nCharles: Ooh!\nNick: Oh, look at that! Charles:\nVery classic French presentation. Nick:\nFries in the sauce. Oh! Mm! Charles:\nMhm! Nick:\nOh, the sauce is so complex. Charles:\nYeah. Nick:\nThe first thing that comes to my mind with\nthe sauce is sort of like a creamy French pesto.\nCharles: I know what you mean. Nick:\nI think I taste tarragon too. If you look up close to the sauce,\nyou can see how many different specks of color and ingredients there are there. Charles:\nDo you know you have more than 20 ingredients\nin this sauce? Nick: How do you know that? It's a secret.\nCharles: Shh!\nNick: I'm gonna jump to the meat. Really, really simple. Lightly tenderized, but\nit's already been aged just a little bit. The sauce tastes different, based on what you\neat it with. Charles:\nI just take the perfect bite. Steak, fries and sauce. Nick:\nMhm. That's the best bite.\nCharles: It's like a good song. Nick:\nWhat song would it sound like? Charles:\nKodak Black? Nick:\nI was initially almost a little bit\nskeptical about whether the sauce would be really that good. And it is that good. Charles:\nSo maybe you that watch the video,\nyou say \"Oh, it's just steak and fries\". But steak and fries, perfectly cooked with\nthe sauce... It's an amazing experience. Nick:\nMy first ever meal in French. Definitely a good one.\nCharles: (speaks French)\n[And now you're going to eat another meat.] Nick:\nI have no idea what you're saying. Our final\nsteakhouse is Bazaar Meat, which blends Argentinian style open flame\ncooking with Spanish creativity to serve up some of the most futuristic steak dishes\nyou'll ever see. I've also invited my friend Joe to eat with\nme. Joe: What up?\nNick: He's a world famous music artist,\nand he's got a concert in about an hour... so we gotta go. This is one of the craziest\nkitchens I've ever seen. Bazaar Meat Chef:\nThis is our grill set-up, and it's really, really hot. This basically is our...our \"main pass\". Nick:\nThe \"main pass\" in the restaurant is the\ncontrol center. The food comes through here for you to see it, before it goes out. Joe: Wow!\nNick: I love how everything's wood fired. Nick: You know, before tasting anything that the\nflavor is gonne be...\nBazaar Meat Chef: ...on point. Nick: Yeah.\nBazaar Meat Chef: One last thing before you start eating,\nguys... I need you to pick your steak. We have\nWashugu, Rosewood, Akaushi, Stemple Creek.\nNick: Joe's my guest. I'm gonna let him pick.\nJoe: That one. Nick:\nPerfect. The first dish is a \"foie gras\" cotton\ncandy. Nick: This looks crazy.\nJoe: Cheers!\nNick: Cheers! Airrack:\nOh. Joe: That's interesting.\nNick: You have that pillowy\nmelt in your mouth texture of cotton candy. Then you have the corn nuts,\nwhich are crunchy...and then they have this soft and creamy \"foie gras\".\nJoe: And it tastes like cereal. Nick:\nLike a \"foie gras\" flavored...corn flake. Joe: Yeah. Kind of.\nNick: Course Number 2 Japanese\nA5 Wagyu air bread. I don't know if any of you ever watched the\nNetflix series Chef's Table, but this is the featured dish from that\nrestaurant on that series...and it looks unbelievable. Nick: Oh!\nJoe: That's crazy.\nNick: There's this very light,\nsuper flavor packed cheese foam on the inside, and then the rest is just hollow. That's gonna be hard to beat. This one's called \"Neptune's Pillow\".\nThese are quite literally perfect pillows. You'll notice that it's tuna and not steak. I still think it's gonna be delicious. Joe:\nOoh! That's a 10 out of 10 crunch. Nick:\nThat one went... right off the charts. Joe:\nDish Number 4... Classic steak tartare.\nNick: It comes beautifully presented like this. With a little movie magic...\nPoof! The beef tartare is all mixed together. You first, please. Tartare sandwich. Who made a nicer sandwich? Me or Joe? Joe: Cheers!\nNick: Mm. It tastes like a really,\nreally good soft hamburger. Joe:\nVery expensive slider. Nick:\nCourse Number 5...\nbison carpaccio. Joe:\nThis one looks insane. Nick:\nWhoa! Joe:\nThere's so much going on. Nick:\nYou get hit with a little spice,\nyou get a little bit of kind of blue cheese. You taste the celery,\nand the meat is so incredibly thin that it just kind of melts in your mouth. What's\nhappening? Bazaar Meat Chef:\nWe're going to Japan right now. Nick & Joe:\nOh! Bazaar Meat Chef:\nWe have a...Omi beef. We have a...Satsuma,\nand we have Bushu-gyu. \"Bushu-gyu\" basically translates to \"beef of the\nsamurai\". So this farm used to feed the samurai back in\nthe day. Nick:\nToday we are samurai. Bazaar Meat Chef:\nWe're gonna go ahead and cook a couple of\ntableside. Nick: Listen to that sound!\nBazaar Meat Chef: Going for a flip. Joe: Nice.\nNick: He's only sear for literally just a\ncouple seconds on each side. This type of beef is so incredibly delicate,\nso you cannot overcook it. Joe: We're diving in.\nNick: That is the definition of\nmelt in your mouth. There's so much fat between the actual meat\nand each of these bites that it makes it break apart really easily as you chew. Joe: I feel like I'm back in Japan.\nNick: Our final\ncourse, Course Number 7 is an Akaushi ribeye, which I'm gonna top with a little bit of\ntruffle.\nJoe: Make it rain! Bazaar Meat Chef:\nHonestly, I like eating steak with my hands. Nick: You like eating steak with your hands?\nBazaar Meat Chef: Yeah.\nNick: I'll try the same thing. Oh, incredible. Joe: The truffle too.\nNick: For me, it's the exact level of\ndry age flavor that I want. Not so much that I can't taste the\nactual flavor of the beef anymore, but not too little, where it's just not there.\nAren't you late for your show?\nJoe: One more bite.",
    "start_time": 0.04,
    "end_time": 1783.8200000000002
}