{
    "video_id": "yyw_GTNzXFc",
    "channel_url": "@nickdigiovanni",
    "transcript": "Nick:\nIn this video, I'm trying the most popular\nschool lunches in the world. And while some were delicious... Max:\nThat was one of the best bites I've ever had in\nmy life. Nick:\n...others were not so good. I can't tell what looks worse: us or the food. And we're starting in North America with the\nUnited States, where the typical school lunch is dino\nnuggets, mashed potatoes, fresh fruit and vegetables\nand chocolate milk. Max:\nI remember eating this exact school lunch as\na kid. Nick:\nSomething very classic with American school\nlunches is that they like to turn things into fun shapes. Like making chicken nuggets into\nthe shape of dinosaurs. Max:\nIt just makes them taste better. Nick:\nGo ahead and do the honors! Max:\nObviously, starting with T-Rex. Nick:\nI'm gonna go with the Stegosaurus. A little\ndip in the mashed potatoes. Max:\nThat's a wild move. That brings me back. Nick:\nSo good. So unhealthy. In fact, school lunch in the US is so\nunhealthy that a slice of pizza counts as your serving of vegetables because of the\ntomato sauce. Max:\nThat's really bad. Nick:\nThis is an important thing now,\nMax. Opening the chocolate milk. The key is really that you gotta peel all\nthe way back first and then boom! Just like that. I'll feed you. Max:\nMhm! That is actually incredible. Nick:\nThere's just nothing like getting off the\nplayground, being all sweaty and eating dino nuggets with chocolate milk. One more thing\nwith American school lunches is that oftentimes your parents will write you a\nlittle note in your lunchbox. So I got both of our moms to write us a note. Max: No! Are you serious?\nNick: Yeah. Max:\nIs it actually my mom? Nick:\nIt is really your mom. Max:\nNo way! Nick:\nMy note says: \"Have a great day! I hope you get to play with Max during\nrecess. Love, Mom.\" Max:\nHi, sweetie! Enjoy your blueberries!\" Do I...did I...\nWait! What? Nick:\nShe didn't even give you any blueberries. Max:\n\"Let's read more Harry Potter tonight! Love, Mom. Smiley face.\" How did you get ahold of my mom? Nick:\nFor every school lunch in this video,\nwe're also gonna give it a ranking on a Tier List. So for the United States... Delicious food, but a bit too unhealthy. I think it's fair to put it in \"C\" tier. And now let's move to Canada,\nwhere we'll have pizza, carrot sticks and ice cream\ncup and apple juice. The cool thing is: Fridays in Canadian schools\nare pizza day. All the kids wait all week for pizza day. Max:\nTo be fair, I would too. Nick:\nLook at the mini pepperonis! Max: Yeah.\nNick: Look how cute they are! Max:\nDecent bottom crust though. I'm feeling good about this. Nick: Not bad.\nMax: Look at the thickness of the bread! Nick:\nThe crust is sweet. Max: It's so incredibly bad that it's good.\nNick: Carrot sticks. I feel like you need something to dip them\nin, but...I've never been one to turn down a good\ncarrot stick. Of everything on this platter, though, the thing I love most is the ice\ncream cup. Max:\nThat is a blast from the past. Mhm! It is so distinctive, that fluffiness... Nick:\nMakes me want to melt Max.\nBut what's so amazing is the wooden stick that comes with it. If you actually take the\nwooden stick...and you kind of suck the air out of it, you taste that wooden flavor. Max:\nWow! Ooh! I'm getting it. Nick:\nLast thing: juice box. These straws were\nalways annoying. Max:\nExtremely. Nick: They're just not strong enough.\nMax: Aha!\nNick: Look at this! It's already smushed. I can't get it in. There it is. Max:\nActually, that's pretty good. Nick:\nI don't know if any of you used to do this as\na kid, but once you finish a juice box,\nyou blow it up again... ...and then you put it down and stomp on it. Max: Whoa! Nick: Oh!\nMax: I think it's fair to say Canada's school\nlunch gets a \"C\" tier. \"C\" for Canada. Nick:\nAnd that brings us to Mexico, where we'll have\na ham and cheese \"torta\", Tajin cucumbers, carrot sticks,\nmayonnaise packets and Agua Fresca. One thing about school lunch in Mexico is\nthat lots of students go home to eat with their families, but when they do eat at\nschool, it looks something like this. Max:\nIt looks very healthy. Nick:\nI want to start with the Tajin cucumbers. They look so crunchy and well seasoned. Max:\nWhat am I experiencing right now? Nick:\nThey love Tajin and Chamoy so much in Mexico\nthat kids will actually have keychains on their backpacks like this. If you want a\nlittle more Tajin on your cucumber, just pop it open! Max:\nDon't mind if I do. That's...okay. That's gonna be excessive here. Ooh! Que rico [Tastes good]! Nick:\nOur \"torta\" is just a Mexican sandwich, essentially. You can put a variety of\ndifferent things inside it. But as you can see with this one, we've got all sorts of\nfresh fruits, vegetables... Quick, simple on the go lunch. Max:\nWe were missing out growing up. That right there is a school lunch. Nick:\nSuper flavorful, super fresh. Max:\n10 times better than anything else we've had\ntoday. It's even common to add on a little bit of mayo. Nick:\nAnd the best part is washing it down with\nsome Agua Fresca, which is fruit infused water. Let's see! It's basically just like a cold tea. In\nthe heat that you probably have on a playground in Mexico, this must be extremely\nrefreshing. Max:\nThis would hit the spot. Nick:\nWe're gonna put Mexican school lunch in \"B\"\ntier, and move on now to Jamaica, where a typical school lunch is fried\nchicken, peas and rice, mac and cheese,\nplantains, a side of fruit and fruit punch. Max:\nWe are really leveling up here. Nick:\nYeah. This looks unbelievable. Even this. Look at this thing! I say we divide and conquer. Max:\nI feel like I gotta do mac and cheese on the\nchicken. School lunch or not, that was one of the best\nbites I've ever had in my life. Max: Put some mac and cheese on there! They just\npair so well together.\nNick: Mhm! Oftentimes kids will take their mound of rice,\nand they'll take some of this Jamaican gravy, and they make a little volcano. While you eat that, I'm gonna set up the\ndrink. I love the way they serve the drink in a little pouch like that. Max:\nAnd everybody knows that blue tastes better. Nick:\nIf I had this lunch every single day,\nI would be a very happy student. Max:\n\"Jamaican me crazy\" with this school lunch. It's getting an \"A\" tier. Nick:\nAnd now that we've finished in North America,\nwe'll move on to South America, where we'll start with Brazil to have rice and beans,\nground beef, a side salad, Jell-O\nand cashew juice. Max: This looks amazing. I'm kind of...\nNick: Da-da-da-da-da! Hold on, hold on! In Brazil,\neverybody needs to scan their ID card before they eat. I made us both a Brazilian student\nID, just in case we ever go back to school in Brazil. Max:\nThis is hilarious. Why do I look way more handsome than you? Nick:\nBefore either of us eats,\nI'm gonna scan these. Max, yours isn't scanning. Max: The principal called my mom. Everything's\nfine.\nNick: Sorry, Max! Nick:\nYou can't eat lunch today. Ah! Nick: Mine's scanned. I'm good.\nMax: What? Nick:\nAlright. Where do I begin? Maybe a little\nbit of the beans and rice. Looks like there's some bacon in there. Wow! This rice has been cooked to perfection in\nbacon and bacon fat. And when you pair that with the ground beef...\nit is unbelievably good. Everything tastes so incredibly fresh. And part of the reason is because it's the\nlaw in Brazil that lunch must be cooked fresh every day, and one third of it needs to come\nfrom nearby farms. That makes the food even better. I'm so happy I paid my lunch bill for this\none, because this is good. I've never had cashew juice before. Max:\nLet me guess, it tastes amazing. Nick:\nIt's fruity, but at the same time it's\nnaturally really creamy. It's really good. Last stop here: Jell-O soccer ball. Look at that thing! I feel bad,\nI feel bad. Max:\nAh! Nick:\nI'd ask Max what rank he thinks we should\ngive this, but he's not gonna be any help. So we're gonna put Brazilian school lunch in \"A\"\ntier. That rice was too good. And now let's move to Argentina,\nwhere we've got \"Chicken Milanesa\" with salad, white rice, bread, fresh lemon mayonnaise and\npineapple juice. \"Milanesa\" is this fried and breaded chicken\nhere. And Argentinian people love it so much that\nthey have a national holiday called \"National Milanesa Day\". Max:\nIt looks like something you'd order at a\nrestaurant. Nick:\nEvery \"Milanesa\" comes with fresh lemon,\nand it is never eaten without a huge squeeze of lemon over the top. Hear that crunch? Max:\nCrunch! Nick:\nA lot of students also love adding mayonnaise\nto their \"Milanesa\", so we're gonna try the same. Max:\nThat's a lot of mayo there, Nick. Creaminess\nfrom the mayo and the acidity from that lemon...so good. Nick:\nAnother thing I love here is they put some\nbutter on the rice. There's really nothing like simple buttered white rice. This, for me, is closest to what I would want\nto have at school lunch every single day. You've got carbs, you've got protein,\nyou've got healthy, fresh greens and even this really delicious\nlooking juice box. One of the best juice box sips I've ever had. Max:\nWhat? Nick: I might start buying these, just to have...\nMax: Mhm! Argentina's school lunch... We're going with \"A\" tier. Nick:\nAnd now on to Colombia, where we've got \"Arroz\ncon Pollo\", vegetable soup, plantains,\nhot sauce and passion fruit juice. What do you think? Max:\nI mean, it looks stunning. Nick:\nLunch is the biggest and most important meal\nof the day in Colombia. So this is a big deal right here. Apparently, we're supposed to eat the soup\nfirst. Not my favorite, but it's good. Max: There's something in there that's very\nunique.\nNick: Mhm! The corn is really sweet and tender. Max:\nThat's actually game changer. Nick:\nLet's add a little \"Aji\" to our rice here! Spice things up a little! I love the \"Aji\" on there. Max:\nOoh! A little kick at the end though. Nick:\nThe plantains here are said to be so sweet\nthat the kids actually call them \"banana candy\". So it's almost like a dessert. Max:\nNice crisp on the outside,\nbut kind of dense and chewy. Nick:\nI've always see here for a Colombian school\nlunch, my eyes are drawn to the bagged passion fruit juice. Max:\nHow do we approach that? Nick:\nI honestly think we just toss 2 straws in\nthere and just go for it. Max:\nThis feels dangerous. Mhm! Nick:\nMhm! Max:\nWow! It's almost creamy. Nick:\nThat tastes like somebody juiced it 5\nminutes ago. We're gonna give Columbian school lunch a solid \"B\" tier. Max:\nI'd call it a \"B+\". Nick:\nAnd with that we finished in South America\nand are moving on to Europe, where we'll start in France to eat a\nmulti-course school lunch that includes a salad, some roast chicken and vegetables,\na bread and cheese plate, some fruit for dessert and water. France takes their school lunch very\nseriously. In fact, students get between 1 and 1.5 hours just for lunch. Max: Wow!\nNick: First course is a shredded carrot salad. This is so fancy. Max:\nAlmost too fancy. Nick:\nReally fresh. Max:\n10 times healthier than any school lunch\nI've ever had in America. Nick:\nAnd the rules, by the way,\nfor school lunch in France are very strict. No soda, no candy, no vending machines on\ncampus at all. All the food is cooked from scratch by chefs\nand no more than 4 times a month can you have any fried food. Max:\nThat is impressive. Nick:\nThe second course is roast chicken with\nvegetables. Max:\nIt's simple, but it looks like French food. Nick:\nLet's check the crispy skin! The chicken is incredibly well cooked. Max:\nCrispy skin, juicy meat. Nick:\nThe craziest part is: you get one of these\nfancy napkins that you'd get in a nice French restaurant. We didn't even talk about the\nfact that this is served on an actual plate. Max:\nI noticed that we've stayed clear of the\nbroccoli. Open up! Nick: Oh, no, no, no, no, no! I thought you'll have it.\nMax: You said yummy. You said yummy. Nick:\nNo, no, no! I...it's...I...I...I... Max:\nWell, yeah... Nick:\nCourse #3...bread and cheese plate. Max:\nI cannot believe they're serving high quality\ncheese at school. Nick:\nWow! Max:\nIt's simple, but it just hits the spot. Nick:\nNow for dessert...a piece of fruit. Max:\nPresentation on point. Nick:\nI know a piece of fruit might seem like such\na lame dessert, but for me, it's actually perfect. We wash it down with a little water. Max:\nA bunch of points for presentation,\nbut just not quite exciting enough. French school lunch is getting \"B\" tier. Nick:\nContinuing on to Italy,\na typical school lunch is \"Chicken al Forno\", tomato pasta, salad and a water. Max:\nMamma mia! This looks like real food. Start here with that \"Chicken al Forno\". Nick:\nI'm gonna have a little bit of this tomato\npasta. Max:\nIt's like a perfect roast chicken. Nick:\nItalian schools always use olive oil instead\nof butter. I'm going to open it up and drizzle it across\nour salad if you're okay with that, Max. It's so fancy for a school lunch to have fresh\nolive oil. Max:\nIt really adds to it. Nick:\nAnd then you see how we have those little\ntomato bits left at the bottom there. You then just take your fresh bread,\nand then you're meant to use it as a mop to make sure you get every last bit of that\nsauce, so that your plate is completely clean. Did you already have some water? Was it good?\nMax: I had a little bit, yeah. Nick:\nDid it taste like Italian water? Max:\nIt tasted exactly like water. Max: Aaah!\nNick: Oh! Whoa! Did you see how it sprayed out? Max: Ah!\nNick: We gotta see that in slow motion. Max:\n(Distorted:) Aaah! Nick:\nItalian school lunch was just slightly above\naverage. So we'll go with \"B\" tier, and move on to Spain,\nwhere lunch is served in a 3 course meal that includes soup and rice,\nfish and salad and a small dessert. Course #1...soup and rice. Max:\nI usually hate soup. That is one of the best\nsoups I've ever had. Nick: Let's go to Course #2!\nMax: Whoa, whoa, whoa!\nNick: What, you want more? Max: It tastes so good.\nNick: For Course #2, we've got fish and a side\nsalad. Fish in Spanish schools is served at least 2\nto 3 times a week. They love fish. Max:\nReally? Cafeteria is definitely...pungent. Nick:\nIt's a little bit of a sad piece of fish. I\nwould have liked some better presentation here. It tastes a lot better than it looks. And then side salad. Who doesn't love a side\nsalad? Max:\nMe. Very healthy. I feel like as a young kid\nthough, I would not be pumped about this. Max at 12 years old, this over pizza... Max: We're going pizza all day.\nNick: Now Course #3...the dessert.\nWe've got flan. Do you like flan? Max:\nI love a good flan. Nick:\nI don't like flan. Max:\nReally? Nick:\nLook at it! It's like Jell-O, but worse. Ew! Nah, I don't like it. Max:\nMhm! That is absolutely fantastic. Nick:\nBefore we give our tier ranking, there's one\nmore thing. In Spain they care so much about what the students think of the food that they\nactually at one school used emojis to let the students rate the meal. So why don't you hold up the 1 or 2 that come\nto mind? I'll do the same. Max:\nI don't know about the first 2 dishes,\nbut that dessert...I'm in love. Nick:\nI'm gonna go with 2. I've got the confused\nemoji. I've also got the fire emoji. I don't understand why they paired that rice\nwith that soup, but the overall experience was fire. Max:\nSpain's school lunch is getting \"B\" tier. Nick:\nAnd this brings us to the United Kingdom,\nwhere students get fish fingers, baked beans,\nchips, a bread roll and grape juice. There's a reason my tray\nlooks better than Max's here, and that's because in the United Kingdom,\nbetter behaved students can earn Golden Table privileges, which come with shiny gold\ntableware and the perk of being served before everyone else. Max:\nThat's not fair. Nick:\nYou should have behaved. Max, I'm gonna\nshow you a little lunch hack that some students do. You take a roll of bread, and you\ncut that roll of bread open, and then you stack on some of these nice\ncrispy fish fingers, then French fries. Max:\nChips, as they say. Nick:\nAnd last but not least,\nI'll put some of those Heinz baked beans over the top. This is a UK lunch hack called a\n\"fish finger sandwich\". Max:\nYou can enjoy your fancy sandwich,\nyour \"gold\" this, that or the other thing. I'm gonna eat\nthem like a normal person. Nick: It also tastes better with the gold tray and\nthe gold plate and the gold placemat.\nMax: Oh, yeah, yeah! For sure, dude. Nick: Wash it down with a little grape juice.\nMax: Mhm!\nNick: I love how fancy my lunch is. Look how much more fun I'm having than Max! You want a bite of my sandwich? Max:\nSure. Nick:\nSike! Max:\nOh! That's called bullying. Alright? Nick:\nI love this lunch. I'd give it a \"B\" tier. Max:\nHonestly...I think it's an \"F\". Nick:\nHe's only saying that because he didn't have\na gold plate. Max:\nI'll meet you at \"D\". Nick:\nFine. The UK's school lunch gets \"D\" tier. And\nwe'll move now to Sweden, which serves meatballs,\nboiled potatoes, crisp bread, lingonberry jam and whole milk. Before we eat... Sweden is famous for having its teachers come\nin and sit with the students to teach proper posture, proper eating habits... So I invited my old history teacher to come\nin and just watch over us while we eat. Nick: How are you?\nTeacher: How are you?\nNick: What's going on, Mr. Petherick? Max: How's it going? Very nice to meet you. Max.\nTeacher: You too.\nMax: I'm a little nervous now. We got a teacher here.\nTeacher: Yeah. Nick:\nWith that, Max... Nick: Dive in!\nMax: You already know I'm going for the\nmeatballs. Nick: I'm gonna go for one of these...\nTeacher: Nice use of the fork, Nick. Max:\nUh-oh! Is that detention? Nick:\nI'm gonna dip it in the jam. This jam...lingonberry jam... It's a little bit less tart than cranberries,\nbut they put it on everything. So you can put it on this crisp bread. You can put it on\nyour meatballs, your potatoes...\nIt's delicious with everything. Max:\nI might do them all together. Teacher:\nBe careful with the spillage there! Max:\nOkay. My bad. Sorry! Uh...\nI'm making a mess. Nick:\nShow Max how it's done, by the way! Teacher: Fork...\nMax: Okay.\nTeacher: ...right into the jam. Max:\nAlright. Nick: Yep. No spillage.\nTeacher: Yeah, no spillage. Nick:\nSee that? Max, go ahead and try it again! A\nlittle bit more polite this time. I'm gonna get some jam. Teacher: Maintain that posture!\nNick: Straight up?\nTeacher: Straight up. Nick: Got it. It's always good to sit up straight\nwhile you're eating. That's true.\nMax: Yep. Nick:\nYou gotta try this, Max. Teacher:\nNo talking with your mouth full. Nick:\nYep. Nick: I forgot.\nMax: The one time there's a teacher here\nwatching, I can't get it together. Nick:\nI'm a huge fan of the school lunch in Sweden\nso far. It's simple. And I love the jam. Max:\nIt really ties it all together. Nick:\nIt's delicious. Mr. Petherick, you got a\nfinal grade for our behavior during this lunch here. Teacher:\nYeah, a solid \"B+\". You know,\nimprovements could always be made. Max:\nI feel like I brought down our grade,\nbut I'll take \"B+\". Teacher: Alright.\nNick: And now that you've graded us,\nevery school lunch is gonna get a ranking on a Tier List. So you want to help us give\nthis one the ranking? Teacher:\nSure. We're gonna give Sweden a \"B\" tier\nranking. Max, come over here for a minute! You did a\ngood job today, but you just gotta keep working on your manners. And if it happens\nagain, you spilling stuff on yourself, I'm gonna have to talk to your mom. Nick:\nMoving on to Finland. We've got pea soup,\nrye bread, carrot and tomato salad,\n\"orange kiissely\" and skim milk. In Finland, they eat in complete silence for\nthe first 10 minutes to encourage mindful eating. So we're gonna do exactly that.\n(Whispers:) Shh! Eat! Max:\nOh! Nick:\nOkay. We can talk now. We did some damage,\nhuh? Max:\nI wish the food tasted better. Nick:\nFinland is famous for offering free school\nlunch to every single student. And every single Thursday is pea soup day\nacross all sorts of places in Finland: hospitals, schools, the military... That's why we have pea soup. Max:\nI know exactly what day I'd be skipping\nschool. Nick:\nI actually happen to disagree. I like the pea\nsoup. I think it's seasoned super,\nsuper well. But I know you're thinking \"F\" tier,\nso I'll settle with you at \"D\" tier. And that brings us to Germany for some\n\"Chicken Schnitzel\", mashed potatoes, peas and water. Wow! I can't tell what looks worse: us or the food. Max:\nOh, boy! Nick:\nWhat do you guys think? I think it's probably\nme and Max. How about this? Subscribe if you think we look worse, and like the video if you think the food looks worse! Before we\neat, I think it's good to let you know that the\nstudents in Germany call this food \"Flugzeugessen\", which means \"airplane food\", because\nit's really bland, comes on a tray and it always tastes the\nsame. Max:\nI'm feeling optimistic. Nick:\nThe \"Schnitzel\" does look pretty good.\nI don't know, Max. Max:\nI'll be honest. It's a little dry. Nick:\nIt's dry with no seasoning. Max:\nLet me help you out with that,\nNick! Nick:\nMhm! If there's anything that can help German\nschool lunch, it is Osmo. Max:\nI'm not just saying this because I like Osmo...\n10 times better. Nick:\nLet's try some peas! Here comes the airplane. Max:\nAaah! Tastes absolutely horrible. Nick:\nThis is mean to feed kids this. I know we're not through every country yet,\nbut this might be the most boring school lunch in the world. Max:\nIt's gotta go \"F\" tier.\nNick: Couldn't agree more. We're moving on\nto Russia to have chicken cutlet, beet salad, beet soup and tea. In some Russian towns,\ngrandmothers come to serve the food. So I've brought in a Russian grandmother to\nserve this one for us. Grandmother:\nDa [Yes]. Max:\nWhat is that?\nNick: I should explain, Max.\nShe doesn't speak any English, so she has absolutely no idea what you're saying. Max:\nWho's this? Grandmother:\n(Speaks Russian:) Oh, such an excellent tea. Tea. Hooray! Nick: I think she's drinking...\nGrandmother: (Speaks Russian:) I shouldn't drink it? It's very good.\n(In English:) Very good. Very good. Nick: Here we go.\nGrandmother: Da [Yes]. Max:\nOkay. Grandmother:\nOh! Nick:\nMax! Do you want to start trying the chicken\ncutlet? I think she's gonna cut it for us. Grandmother:\n(Speaks Russian:) Ooh! You are such a lovely boy. Nick: I'm gonna try this soup, Max. Mhm!\nGrandmother: (Speaks Russian:) That is considered Russian cuisine then. Nick:\nTry it! Nick: Yeah!\nMax: Interesting. Nick:\nA fun fact about Russian school\nlunches that it's actually called \"obed\", which means \"dinner\", because this is the main\nhot meal of the day. And then in Russian tradition,\nyou always have tea. Max:\nOchen' vkusno [Very delicious]. Grandmother:\nOchen' vkusno [Very delicious]. Very good. Da. Nick:\nI would say the food here was a bit basic,\nbut the experience was incredible. So we'll go with a nice even \"C\" tier. And now with Europe done, we'll move on to\nAfrica, where we'll start in Morocco with a vegetable couscous, tomato-cucumber salad,\nfresh figs and mint tea. Max:\nI've just got one thought. Where's the meat,\nNick? Nick:\nNot everything needs meat, Maximus. Max:\nCrazy flavor profile. Nick:\nUnreal. Max: A depth of flavor you wouldn't expect.\nNick: You see? Not everything actually needs meat. I can\ntell this is gonna be filling. Max:\nWe're gonna have to agree to disagree. Nick:\nThe other thing I noticed right away...these\nfresh cucumbers and tomatoes. Max:\nSumming up this meal with one word... It's just fresh. Nick:\nEven that fresh chopped parsley on the\nvegetables elevates this school lunch to a whole new level. Max:\nWhat's going on here, Nick? Nick:\nMorocco is incredibly famous for its tea.\nAnd I'm not sure if you've seen this in videos, but in Moroccan tea culture,\nthe higher the pour, the better the foam. People in Morocco are so\ngood at pouring the tea from high up that kids will actually learn this and practice\nthis at home, because it's a real skill to have. You know, I'm competitive,\nMax. So we're gonna do a little challenge. Who can\npour from higher without spilling? I feel like we're not gonna be able to agree who\ndoes better on this. So we're gonna let you decide. Comment down below who does a better job with this right now!\nNot bad. Create that foam, Max! Nick: No spillage! Oh!\nMax: Oh! Nobody saw that. Nick: Wow! Oh!\nMax: Yeah! Pretty good. Here's a look at my spillage. And now, Nick, you're up. Nick:\nHere we go. Not even close. Here's a look at my results and my spillage. Comment below! We need to know who you think\nwon. Max:\nAs for the rating, Morocco's school lunch is\ngetting a \"B\" tier. Nick:\nMoving on to Nigeria,\na typical school lunch is \"Jollof Rice\", steamed vegetables, stewed chicken and\nChivita Juice. \"Jollof Rice\" is one of the most popular dishes\nin all of West Africa, and I am very excited to try it. Max:\nIt smells insane. You have to try that. Nick:\nIs it amazing? Max:\nSo good. It's so flavorful. Nick: It's the perfect amount of spice.\nMax: Mhm! Nick:\nWatch when I break this chicken too! It is fall\napart tender. Go ahead! Max:\nAmazing. Insanity. Nick:\nIt's a little bit like an Indian curried\nchicken. This chicken, by the way,\nis so popular in West Africa that kids call it \"party chicken\", because it's served at\nparties. People love it that much. And speaking of parties,\na lot of schools actually have a dance party with music during lunchtime,\nso we're gonna do exactly that. Not gonna lie, Max...\nI think Nigeria deserves our very first \"S\" tier. Max:\nWell deserved. Nick:\nNext up is Ethiopia, where a typical school\nlunch is \"injera\" with lentils stew, cooked vegetables and mango juice. Visually, what do we think? Max:\nLooks like a sponge... Nick:\nYes, this is a spongy fermented flatbread. It's traditional in Ethiopia for kids to eat\noff the same tray. So what we can do is just tear the \"injera\". It smells really good. Max:\nAlmost like sourdough. Nick:\nI almost don't want to eat it. I just want to\nplay with it. What we do here is we use our right hand to dip it into the stew,\nsoak up some of the juice in there, and then you eat. Amazing. Those soft chickpeas,\nthe seasoning in there... That's one of the best bites of food I've had\nin a while. I didn't tell Max this yet, but traditionally in Ethiopia,\npeople will give each other what's called a \"gursha\", which is a bite fed by hand,\nand it's a sign of love or friendship. So, Max, please open up! Max:\nWait! Do you love me or you're my friend? Nick:\nHe licked my fingers a little bit. That's\nokay. I'm gonna start going around asking all my friends for \"gursha\". The lentil stew look expertly\ncooked. Max:\nIf those lentils taste good,\nthis might be \"S\" tier. Nick:\nThey're all right.\nMax: They're all right. I still think it\nmight be \"S\" tier. Nick:\nI think the same exact thing. Max:\nI'm just gonna say it. Ethiopia's school lunch... That is an easy \"S\" tier. Nick:\nMoving on to South Africa,\nwe have \"pap and beans\", a Polony sandwich and Ceres juice. Right away, the \"pap\" here almost looks like a\ncircular chicken breast. Max:\nI think it's like an...a half onion to me or\nsomething. Nick:\nThis right here is a thick corn porridge,\nand we're gonna eat it in the traditional style with our hands. We grab some of the \"pap\",\nand you kind of mush it together.\nMax: Aha! Nick:\nOkay? Like this. Hold that with your 4\nfingers, and then you want to go onto the beans,\nand you use your thumb to kind of smush the beans into it. And we've got a beautiful bite\nright there of \"pap and beans\". Then in you go. The flavor combination is so\nunique. It's a little bit earthy. Nick: It's almost like a little bit grainy. But\nthen there's a bit of a sweet corn flavor.\nMax: Is it supposed to taste like that?s Nick:\nThe great thing is: you can wash it down with\nsome Ceres juice. It's a really popular South African brand. Max:\nAlmost like a pineapple flavor. Nick:\nPolony sandwich. We would call it \"Bologna\".\nThey call it \"Polony\". I always like Bologna. Max:\nThere's something about it. It's not premium\nper se, but it's so good. Nick:\nThese might not be my favorite flavors of\nanything we've had, but in ranking this one, I'm gonna give a lot of extra points for the\nexperience of eating it. We'll put South African school lunch right in\nthe middle at \"C\" tier. Next up is Egypt, where we'll have \"ful medames\",\n\"baladi\" bread, carrots and sugar cane juice. Commonly in Egypt, students actually go out\nand buy their lunch from street vendors because there's all sorts of amazing street\nfood in Egypt. And what they most often buy is this thing\nright here called \"ful medames\". Max:\nIt's slow cooked fava beans that are seasoned\nwith lemon juice, olive oil, and different seasonings. Nick:\nAnd this here is \"baladi\" bread or Egypt's\nversion of pita. We'll open this up and then take some of\nthose stewed fava beans to make a pita pocket. Max:\nThere's no beef in here. No meat. It's just beans. Nick:\nJust beans. Max:\nIt's a little bitter. Nick:\nI'm falling somewhere right in the middle\nhere. Before we make any judgments, let's try the sugar cane juice! Kids will normally go\nto street stands for this as well, and get that amazing fresh pressed sugar cane\njuice. I personally love sugar cane juice. This is not quite there, since it's canned,\nbut it's still very good. One other thing: in Egyptian street food culture, the vendors\nwill often hand the kids a free pickle or olive, so I've got one in each hand. Make your choice! Boom! That means I got the olive. Makes it a little\nmore fun. On the one hand, I love that kids are going\nout and getting their food from street vendors. That's such a cool thing to do. Max:\nIt's like a little mini field trip throughout\nthe day. Nick:\nBut on the other hand,\nI just wish it was a little bit more exciting. Max:\nNot my favorite. Egypt's school lunch... We're going with \"D\" tier. Nick:\nAnd that means we finished with Africa. So now let's head to Asia with our first stop\nbeing Japan, where students get \"chicken katsu\ncurry\", rice, \"Miso soup\" and fresh milk. For this section, Max is dressed up as one of\nthe students from the lunch team. Because there are no janitors in Japanese schools,\nthe students take turns serving food, cleaning up and wiping down trays,\nmeaning that the entire school lunch is run by students like Max. They also don't eat in\na cafeteria. Instead, students are served at their desks\nin the classroom, so we're gonna do the same. Thank you! Oh, and before I eat...\nmost kids bring their own chopsticks in cute cases like this. It's a total flex to have cool ones like\nmine. Max, what'd you bring? Max:\nOnly my favorite chopsticks. Nick:\nHello Kitty? Max:\nMine totally got mixed up with someone\nelse's. Nick:\nThis \"chicken katsu curry\" is one of the best\nthings we've seen all day, and I'm not surprised. Listen to this! And now the best part: I get to wash it down\nwith some fresh Japanese milk. This might be the creamiest milk I've ever\nhad. I'm putting Japanese school lunch right up in\n\"A\" tier. Next is South Korea, where we'll have \"pork\nbulgogi\" with \"Doenjang-jjigae soup\", rice, seaweed sheets,\nkimchi, bean sprouts and strawberry milk. Max:\nThis is what I'm talking about. So many side\ndishes, but the South Koreans also nail the meat. Nick:\nWhen I think of South Korean food,\nI think of these massive spreads of food, where you can pick from all these different\ndishes. And this school lunch looks like exactly that. I'm gonna take a seaweed sheet\nhere. Max:\nPut you a little pork on there. You need some kimchi. Rice on there. Nick:\nThank you! A few bean sprouts. I'm gonna go for this one in 1 bite. Boom! I get sweet, I get salty,\nI get sour, I get crispy, I get everything. I'm gonna open up the\nstrawberry milk here. Mhm! Max:\nGood? Nick:\nYeah. The soup is always served piping hot. Sometimes the kids will stir in a little bit\nof rice to try to cool it down. We'd also be expected to finish all this food, because\nSouth Korean schools are very serious about food waste. They have the most high tech\nschool lunch system in the world, and use AI scanners to track the food waste\nevery single day. Max:\nMy plate would be cleared every time. South Korea's school lunch is getting\n\"S\" tier. Nick:\nThat's a hard one to beat. We're moving on to\nIndia, where we have \"vegetable sabzi\",\n\"aloo paratha\", \"roti\", \"achar\" and mango juice. India serves 100 million children school\nlunch every single day, and traditionally it's served in what's\ncalled a \"tiffin\". Max:\nThat is the coolest looking lunchbox I've\never seen. Nick:\nThe problem is: I have no idea how to open it.\nHere. Let's just... Max: I'll take the base.\nNick: That's around. Oh!\nMax: Wow, hey!\nNick: 1...\nMax: 2... Nick:\n3, 4. Kids will bring their own pickled\nvegetables that their parents made. And everyone likes to trade with each other\nto see what other people's pickles taste like. Max:\nI'll smell your pickle. Nick:\nOh, mine smell way better than yours. I'm not\ntrading with you. In India, lunch is also most commonly eaten on a rug on the classroom\nfloor. So here we are. Let's dig in! I'm just gonna\ngrab some of this and get some potato in there.\nMax: That's a strong lack of flexibility right now. I can't even get to the food. Nick:\nDefinitely delicious. Max:\nI got a cramp in my oblique. One second. Nick:\nOoh! This is spicy. Max:\nI don't know if I could last more than,\nlike, half a day in India. This is really tough. Nick:\nYou may need that. Here is a piece of my\npickle. How is it? Max:\nMy mom's are better, but it's pretty good. Nick:\nThere's no way your mom's are better. Max:\nThis recipe has been passed down for\ngenerations. Nick:\nWow! Those are very tasty. Oh, yours are super spicy. Max:\nMy hands are even burnt. I'm sweating. I'm gonna call my mom after\nthis. Nick:\nI need to go drink some milk, so while I can\nstill talk, I'm gonna give Indian school lunch \"A\" tier. Next is Thailand,\nwhere we've got sauteed chicken, rice soup, a fried egg, watermelon,\nand a yogurt drink. Once again, we've got fun shapes for the\nkids. This cute little guy is a little rice\nelephant. Max:\nI thought it was a dog. Nick:\nIn Thailand, you hold your spoon in your\nright hand and use your fork in your left hand to push the food into your spoon,\nand then... You gotta try that. Max:\nReally? Nick:\nThe flavors...off the charts. What a perfectly cooked egg! Max:\nJust takes it over the top. Nick:\nI'm gonna try this soup here. I love the flavor of that. Max:\nAlmost like a \"Miso soup\". Nick:\nIt makes sense that this tastes so fresh,\nbecause the meals in Thailand in school are meant to taste like a home cooked meal. Max:\nGotta try the dumpling. So good. Nick:\nAnd watermelon is a pretty classic side here. You leave the rind on for an easy handle and...\nDelicious. We've got 2 flavors of the classic yogurt\ndrink they love in Thailand. Which one would you like? Blueberry or mixed\nfruit? Max:\nI'll try blueberry. Nick:\nOh! If I didn't know any better,\nI might think that this has gone bad. Max:\nI was just thinking the same thing. Max:\nIt's definitely a little sharp.\nTaking into account the visuals and the incredible taste, Thai school lunch is\ngetting \"A\" tier. Nick:\nAnd next is Vietnam, where a typical school\nlunch is beef stir fry, sweet and sour fish soup,\nrice, dragon fruit and soy milk. What's the first thing you notice when you\nlook at this school lunch? Max:\nFish bones. Nick:\nIn Vietnam, they teach the kids from a young\nage to look out for fish bones and fish skins. So you'll notice there are fish bones\nhere. There's a fish head right here, and there's even a whole shrimp with the head on.\nI kind of wish I got this learning lesson, when I was little. Ooh!\nI love the flavor in this soup. You can tell they use real fish bones to make\nthis. Max:\nIt just has this incredible depth. Nick:\nI'm gonna go for some of that beef stir fry. Max:\nYou really can't go wrong with a beef stir\nfry. Nick:\nOne cool thing here is that most schools in\nVietnam don't allow home pack school lunches, so you have to eat at school,\nwhich I can't tell if I like or don't like. Because on the one hand,\neveryone has the same food, so you're all sharing the same experience. But on the other\nhand, it's kind of fun to trade. Speaking of trades though, the number one thing kids look\nout for at school lunch in Vietnam... the dragon fruit. If you can get your hands\non red dragon fruit, it is considered a prized trade. Max: So if I, Max, got red dragon fruit at lunch,\nyou would really want to trade with me.\nMax: Ngon quá [So delicious]! Nick:\nNow the drink. I haven't had much soy milk in\nmy life, but that's probably the best,\nmost flavorful soy milk I've ever had. Max:\nI'm not usually a fan,\nbut it tastes really fresh. Nick:\nI love Vietnamese food,\nbut we agree this wasn't quite exciting enough. We're gonna put Vietnamese school\nlunch in \"C\" tier. Max:\nStill a solid score. Nick:\nMoving on to Indonesia,\nwe have \"Nasi Goreng\" with egg, sliced cucumber, shrimp crackers,\n\"Sambal\" and a box of tea. I'm loving the shape of this tray. Max:\nAnd the colors. Nick:\nEverything just pops. Max:\nI mean, we have a pink shrimp chip. Nick:\nI just gotta do it. Let's break the egg\nyolk! Max:\nOh, yeah! Nick:\n\"Nasi Goreng\" is one of my favourite dishes in\nthe world, so I'm just gonna go right in. Max:\nDo you eat it like a nacho? Nick:\nI don't see why not. That's a great idea. I'm\ngonna load you up.\nMax: A little bit of the sauce. Nick:\nWait! Did you hear that? Max:\nYeah. Max: That's crazy.\nNick: Listen! When you dip one of these\nshrimp crackers... Max:\nIt's like pop rocks. That \"Sambal\" might be my\nfavorite part. Nick:\nIf you haven't heard of \"Sambal\",\nit's a spicy chili paste. Absolutely delicious. Goes so well on\neverything. This one's maybe a Level 1 spice. And I've also got a Level 2,\na Level 3 and a Level 4. And we're gonna spin this wheel here to see\nwhich one each of us has to taste. Because kids growing up in Indonesian schools\nlike to dare each other to try a spicier and spicier \"Sambal\". Ready? Nick: Oh, you got the least spicy one.\nMax: Ah! Nick... You're up. Nick:\nYou've got to be kidding me. Max:\nLet's go! Woo! Nick:\nGotta eat the whole thing, Max. Max:\nYour turn. Give yourself a nice big scoop! Nick: Fine.\nMax: A little bigger. Yeah. You gotta swallow that. Nick: I need juice.\nMax: Oh! Max:\nThat is...I was gonna go \"C\",\nbut because that was so enjoyable watching Nick suffer, Indonesia's school lunch\nis getting \"B\" tier. Nick:\nNext up is Bangladesh,\nwhere we've got \"Khichuri\", a comforting lentil rice,\nas well as spiced mashed potatoes, a curried egg, raw green chilies and some\nlemonade. We'll eat this traditionally using 3\nfingers, where we'll pick up nice little bits of this. And then in you go. Mhm! I know you well enough to know you're\ngonna love that. Max: Really?\nNick: Oh, yeah! Max:\nThat is packed with flavor. Nick:\nThe spice mashed potatoes here are called\n\"Aloo Bhorta\". And what you do is you also take your fingers\nand you roll it into, like, this nice little ball that you can, then\njust simply...\nOh! I almost choked on it. Just when I thought\nmashed potatoes couldn't get better. Max:\nComparing this to the German mashed potatoes... Night and day. Nick:\nTry the egg. Mhm! That's not what I expected,\nbut it's delicious. Max:\nWhatever that is, definitely elevates the\negg. Nick:\nBefore we give Bangladesh a rating,\nI think one of us needs to eat a green chili. Max:\nHow do you play \"Rock, paper, scissors, shoot\" in\nBangladesh? Nick: You read my mind.\nNick & Max: (Speak Bengali:) Pathor, kagoj, kanchi. Chalo! [Rock, paper, scissors. Shoot!] Nick: Oh, it's a tie.\nNick & Max: (Speak Bengali:) Pathor, kagoj, kanchi. Chalo! [Rock, paper, scissors. Shoot!]\nNick: Oh! Hahaha!\nMax: Ah! This is how it's done. Nick:\nWow! Max:\n(Distorted:) Oh! Nick:\nIs it bad? Max:\nIt is horrible. Nick:\nThat food was delicious. We're going to go \"S\" tier for Bangladesh. Continuing on with China,\nwe're having chicken thighs, boiled veggies, egg drop soup,\nrice and soy milk. Lunch breaks in China are 2 hours,\nmaking it the longest school lunch anywhere in the world. Max:\nNo way! 2 hours? Nick:\nWe might be here for a while. What do we\nthink? Max:\n(Speaks Chinese:) It looks really tasty. Nick:\nYou're going for a chicken thigh? I'm gonna\ngo for a little egg drop soup. Wow! The egg drop soup is packed with flavor. Max:\nIt's like the best chicken thigh I've ever\nhad in my life. Nick:\nIt's very good. Max:\nHow does it taste like that? Nick:\nIf I was at school lunch in China and I was\nallowed to get seconds, you bet I'd be running up and getting as much of this\nchicken as I possibly could. At first, by looking at this, I didn't think it was gonna\nbe quite as good, Max. And this is so far very, very good. Max:\nThere's only one thing left we have to try. Nick:\nI'm not a big soy milk fan. I'll preface it\nwith that. Max:\nMilk should come from cows. Nick:\nIt's...whoa! That's the worst drink we've had all day. Max:\nOoh! Nick:\nI wish there was just water. Max:\nI would take anything at this point over that.\nChina's school lunch... We're going with \"B\" tier. Nick:\nMoving on to the Philippines,\nwe have a \"pork adobo bar\" on set with sauteed cabbage, white rice and Zest-O. Lunch in the Philippines is traditionally\nbrought to school in these lunchboxes called \"Baon\". Max:\nIt's a little bento box or something. Nick:\nYeah, I like it a lot. This is like super\npremium looking. Max:\nThat is my type of food,\nI can tell you already. Nick:\nUse a spoon in the right hand, fork in the\nleft to push in the food. We got a little bit of rice here. Oh,\nlook at that pork belly! It's like fall apart tender pork belly. I can already tell, it's gonna be good. Max:\nCrunchy and tender. Insane. Nick:\nWanna try the drinks? Max:\nSure. It's almost like a Filipino Capri Sun. Does it have the same design flaw,\nthough, that the regular Capri Sun has? It does. My straw went right through the\nback. Got most of it on the tray,\nbut it is delicious. Nick:\nI would say my biggest takeaway of this lunch\nis that it's the most home cooked of anything we've had. And I don't mind that. Max:\nTo me it lacks the X factor,\nbut to your point, it does feel very homey and nutritious. Nick:\nI think it's fair to put Filipino school\nlunch in \"C\" tier. And moving now to Malaysia, we've got \"Nasi Lemak Bungkus\",\nwhich is a coconut milk rice served with chicken, spicy chili paste,\nfried anchovies, roasted peanuts and a soft boiled egg,\nall served with a Milo drink. Max:\nThis is one of the coolest little packets of\nfood I've ever seen. Nick:\nI love the presentation. Max:\nIt's like a little present. Nick:\nShould we unwrap it?\nMax: Let's do it! Being very gentle here.\nI have no idea what's inside. Oh, wow! Nick:\nThis whole thing is eaten with our hands. No\nutensils, no paper plate, no nothing. Max:\nI'm a little thrown off by the little baby\nfish on there. Nick:\nIt's easy, Max. Just get in there,\ngrab some rice, put a little bit of chicken...\nMax: A little bit of sauce on there. Nick:\nMhm! Mhm! Phenomenal. Max:\nThat tastes way better than it looks. Nick:\nMy mouth is just watering from all the\ndifferent flavors that we're getting to eat right now with this. What I'm actually\nwondering is whether a chocolate malt beverage is gonna go well with this. Interesting. It tastes more like a chocolate\nbar in liquid form than it does chocolate milk. Max:\nIt's like a dark chocolate,\ntoo. This one's gotta rank high. Malaysia's school lunch is getting a solid \"B\"\ntier. Nick:\nNext up we have Lebanon,\nwhere we'll have \"za'atar\" flatbread, cucumber sticks, \"labneh\", fruit and a pyramid\njuice box. Max:\nI mean, the food looks okay,\nbut I'm dying to see what's going on with these little juice boxes right here. Nick:\nYeah. I've never seen a pyramid triangle\nshaped drink before. You just gotta bite it off. Mhm! Max:\nWow! Nick:\nThat is some of the freshest tasting\npineapple juice I've ever had. Max:\nI feel like the shape makes it taste better. Nick:\nI want to take a look at this \"za'atar\"\nflatbread. Look at that! It's crispy. You can tell there's gonna be a nice crunch. Max:\nSo much texture, so much flavor. Nick: Listen! \nMax: Nothing like I was expecting. Do it traditionally!\nYou tear off a little bit of the bread, get some of that \"labneh\",\nthrow a little cucumber on top. Get yourself a little roll up. Nick:\nAh! For me, the combination of the seasoning\nas well as that pyramid drink is taking the school lunch to the next level. I also love\nthat dessert is just a simple small banana. I'm amazed by the freshness,\nseasoning, and simplicity of this school lunch. I think we put Lebanon in \"C\" tier. And\nwith Asia finished, we'll jump now to Oceania, where we'll try the\nclassic Australian school lunch of sausage rolls, shapes chips,\nkiwi slices and a breakfast drink. Since Australian students eat outside,\nwe're gonna do the same, but not before putting on our magpie defence helmets. Max:\nWhat is this? Nick:\nWhen eating outside, these birds called\nmagpies, will actually dive bomb and attack your\nhead. So this is a real thing that some people will do to make sure their head\ndoesn't get attacked, while they're eating lunch. Max:\nYou look ridiculous. How do I look? Nick:\nLet's go! First priority... Look out for the magpies! Second priority...eat lunch! Sausage roll? Max:\nSure. Very buttery and flaky. Nick:\nSuper unhealthy, I think. Although you bet,\nI'm washing that down...with some fresh, cold kiwi. And then these shaped chips... Supposedly it's a very popular snack. I shipped a bunch of different flavors\nstraight from Australia. Max:\nI mean, they are shapes. Is that... Nick:\nWhoa! It tastes like if you were to put the\nramen seasoning packet on a cracker. Max:\nVery umami. Nick:\nThese are the best part of the whole tray.\nThis drink here...very famous breakfast shake in Australia. It's supposed to be sort of a\nthick, chocolatey drink. Max:\nI kind of hate it. Nick:\nI don't like it.\nMax: Not good. Nick:\nThis has been a very unpleasant lunch. Nick: Max, look out!\nMax: Whoa!\nNick: People are walking by, while we're filming this. Max:\nIt's a tough one to explain. Nick: How are you?\nWoman: Good. How are you? Nick: Sorry...sorry about this!\nWoman: No, it's fine. Nick:\nI think it's safe to say Australian lunch is\ngoing \"D\" tier. And that means our final school lunch is\nAntarctica, where we'll have \"hoosh\",\na hot stew made from ice, dried meat and biscuits. Max:\nI'm very confused. What am I looking at? Nick:\nBefore we eat the actual dish,\nwhich looks kind of disgusting... I wanted to first show you all the\ningredients in this lunch. These are called \"sledging biscuits\". It's a\nvery hearty biscuit that people use in Antarctica to survive. This is \"pemmican\", a mix of dried meat and\nfat. And this is ice. And if you put it all\ntogether...\nPoof! ...you get something called \"hoosh\". Max:\nThat doesn't look like food. Nick:\nWell, here's the thing. There are technically\nno official schools in Antarctica. If there were, this might be what their school lunch\nwould look like. Max:\nI think I'd drop out if this is what they\nwere serving me. Nick:\nI think we can all understand now why I saved\nthis one for last. Max:\nI just can't see myself putting that in my\nmouth right now. I don't think my arm's in the right position. Nick:\n3, 2, 1.\nMax: Nick, I'm gonna sue. Max: Ooh!\nNick: I will throw up. Max:\nThat's like pre-chewed beef jerky. Nick:\nI can't...I don't think I can eat it. Max:\nOh! Where's the trash can? Nick:\nWash it down with some hot chocolate at\nleast! Better? Max:\nThat makes up for everything. Nick:\nWhat are we giving as our final ranking,\nMax? Max:\nWhat is below an \"F\"? Nick:\nI don't know if I'm allowed to do this,\nbut I am going to add a brand new category to the Tier List...and put Antarctica's School lunch\nin \"Z\" tier. Max:\nIt's as bad as it gets. Nick:\nOne last \"Rock, paper,\nscissor\"? Whoever loses, has to eat the \"hoosh\". Max:\nLet's do it! Nick & Max:\nRock, paper, scissors. Shoot! Max:\nNo!",
    "start_time": 0.04,
    "end_time": 2245.12
}