{
    "video_id": "cqooaQz_BY4",
    "channel_url": "@vaniamaniakids",
    "transcript": "money. Hey. [Music] >> Oh no, it's crushed. >> Ice cream. Ice cream. Who wants ice cream? What? Ice cream. >> Wow. >> Ice cream. Yes, I have a lot of ice cream flavors. Wow. Which flavor would you like? >> I want this one. Thanks. >> You're welcome. Fruits. Fresh fruits. >> What? [Music] H fruits. >> Yes, fresh fruits much healthier than ice cream. >> So, why are fruits healthier than ice cream? >> Fruits have vitamins, they have less sugar, and they're better for your teeth. >> So good. Just look at this delicious and juicy watermelon. >> I would like some watermelon, please. >> Enjoy your watermelon. >> Thanks. >> Yummy. >> Wow. >> Take back your ice cream. I'll choose healthy fruits instead. [Music] >> Ouch. [Music] Lunch break. Delicious. [Music] >> She will never know. My healthy sugarfree ice cream. [Music] Healthy ice cream. No sugar. Healthy ice cream. >> Healthy ice cream. Healthy ice cream. Hurry up and buy until it's all gone. >> Healthy ice cream, you say? >> Yes. Healthy ice cream with no sugar added. Oh, I would like an ice cream, please. >> Which one would you like? >> This one, please. >> Nice choice, Stephy. Would you like some chocolate syrup with no sugar added? >> Yes, please. >> Fresh delicious yogurt dessert. >> Yogurt desserts. Yes. Yogurt dessert that contains berries and nuts. >> M yummy. Can I have this yogurt dessert? >> Sure. [Music] >> A [Music] enjoy your dessert. What is this? >> It's about your sugarfree ice cream. >> What happened? [Music] >> It's way too much sugar. I did terribly wrong. Wow, >> these fruits are really tasty. Yay. >> Stephie, how do you like the fruit desserts? >> Delicious. >> Sorry, Stephie. I shouldn't have cheated on my ice cream. >> It's okay. Everyone makes mistakes. >> The right thing is to learn from them. >> Let's make healthy desserts together. >> Great idea. Always choose healthy snacks, guys. >> Never cheat. Be honest and learn from your mistakes. >> Yummy, yum, yum, yum, yum, yum, yum, yum. >> Huh? >> Dad, can we please have also >> No, this food for adults only. >> Idea. >> Hello, girls. How can I help? >> Hi, I need the magic wand. Do you have one for us? Sure. >> Make your choice. This one. Thank you. Woo. Yes, this is just what I need. Scary, hide. Scary. >> What's wrong, Freddy? >> Daddy looks so scary. >> Don't worry. Daddy will help you. [Music] Stephie, Stephie, don't worry. I took care of the spider. Stephie [Music] are those socks. [Music] [Music] Wow, I like it. Beautiful. M. One more. Why not? [Music] Ooh, nice socks. But I'm still hungry. I need to order some food. Make it quick, please. Thank you. [Music] Hey, scrumptious. [Music] Woo! [Music] Ready to dive. [Music] Call help. My toy ruined. Help me. >> Call help. >> What happened? Ya. >> Slime alert. Help. >> Okay, sure. I look I don't like slime. [Applause] [Music] No, it's unhealthy. [Music] >> Yeah, I cleaned your toy. You can play now. [Music] This is not my chicken. What is that? Socks again. What's going on with my food today? Maybe the burger is fine. Not again. Socks. My favorite hot dog. Let me try. Sucks. Socks again. [Music] But these socks are so cute. I want to put them on. I want more. [Music] All right. But I'm still hungry. [Music] Perfect. >> Mhm. [Music] Let's open. [Music] >> Uncle, come here. >> Uncle. >> Huh? >> Hey, what happened? >> Uncle, can you please help me put this together? >> Sure. [Music] [Music] This much better. [Music] >> M delicious. No, I think it's just cold. >> Socks again. No way. Socks. Guess what? Socks. What should I do with all of these socks? Oh, I know. [Music] I need to order pizza now. [Music] Hello. I want to order some pizza. Thank you. Wow, so fast. >> Hi. Pizza delivery. >> Here you go. >> Thank you. Bye. Finally, I can eat. [Applause] >> Daddy. Daddy, I need help with my laces. >> Sure, I'm coming. [Music] >> Perfect. >> Thank you, Dad. >> Always here to help. Stephie, it's time to eat the yummiest pizza in the world. What? >> Uh-oh. A sock. My pizzas are made from socks. All of them. Oh no. Who took my pizza? I was here all the time. I can't just leave him like this. Let's put them on. Look down. [Music] [Music] Huh? [Music] Just look at this. >> This food isn't good for uncle. >> Wow. [Music] >> Uncle, help me. >> Nothing can stop me this time. >> Oh no, not again. >> Uncle, help me. My car is broken. >> What happened here? My car wheel is off. >> Don't worry, Ya. Uncle can fix it. [Music] [Music] >> Wa! >> Here you go, Ga. Good as new. Yay! [Music] >> Oh no, not socks again. Oh my god, I had $6. Now I have six odd socks. M crissan with chocolate. Oh, looks so good. So nice. But it's not. It's just a socks with a chocolate. Chocolate cake. [Laughter] All right, let's put them on. Pink one. [Music] Apple pie. All right, I had enough. Let's solve that socks mystery. [Music] Oh no, this food is unhealthy. [Music] >> Much better. >> Haha. Gotcha. I knew it was you. >> I'm sorry, Daddy. I tried to save you from the unhealthy food. And I'm really hungry now. >> I've got healthy snacks for you. Just clean the table. >> Okay, [Music] >> Stephie, come here. [Music] Dad, could you bring me something else? >> Sure. [Music] Look, we made a heart for you. >> Wow. >> For me? >> Wow. So lovely. [Music] Yes, >> girls. Stop fooling around. [Music] M. [Music] Well, [Music] I'm cool. I'm sorry for my behavior. >> It's fine, but I have an idea. Look. [Music] Want to try? I have more. What is it all about? >> I'll show you. [Music] So, caterpillars. the head. >> My turn. [Music] >> Are you also thirsty, guys? Yeah, I'm really thirsty. Me, too. [Music] Hey guys, welcome to my Starbucks. We got pastries, we got dessert, we got sandwiches, we got straws, we also got some drinks, juices, and even coffee. No coffee for kids. Coffee for kids not allowed. >> You can't order. Can I order? Can I order? >> Wo wo. One at a time. Who's first? >> Me. I'm first. I'm first. >> Wo. I was so happy with my restaurant. You know what? You go first, please. >> I want one chocolate drink, please. >> $1, please. >> $1. Here you go. >> Thank you. Your trick will be ready in 1 minute. Shake it first. [Music] Then the chocolate milk. >> Wo wo wo. That's so cool. >> Going to mix three now. I forgot the ice. Okay, now it's time to mix. Are you almost done? >> Yeah. Yeah. The drink's coming right up. Okay. Oh, and then some uh chocolate syrup. Would you like some whipped cream? >> I love whipped cream. >> I love whipped cream, too. Would you like some more? >> Yes. >> All right. Okay. Is that good? >> Okay. You know what? You can get some more as well. Uh so, uh if you want some more. >> All right. >> Thank you. >> You're welcome. >> This is the messiest drink I ever seen. Too much blue cream. >> Done. Next customer, please. >> Yes. Yes. My turn. >> Welcome to my restaurant. What would you like to order? >> I want one orange juice, please. >> $1, please. >> Here you go. $1. Thank you. Okay, I'll have a gun in 2 minutes. Okay, I'll be putting this orange slicer. Another one. [Music] Okay, here you go. Would you like some more? >> That's not food. That's not enough. >> Oh, sorry. I'll give you some more. >> What? >> Oh, sorry. My mistake. I'll put in some more. Yeah. Okay. So, if you want more? Uh, is that is that good enough or do you want more? No. Okay. So, you want more? Uh, okay. Is that enough? Yes. Okay. Then you need more. I need another straw. >> All right, you're happy now. Or do you need 10 more straws? >> No, no, no. It's okay. >> Okay, sure. >> You're welcome. >> That was way too much orange juice. Did you also have a problem with your order? >> Yeah. >> Next customer, please. >> Uh-oh. I think it's my turn. One strawberry milkshake, please. >> Before I start anything, $1, please. Let's make your order out fast. All right, let's start with the strawberries. [Applause] [Music] It's lot now. All right, so we got this. But first, we need to put strawberries in the cups. >> Okay, this is good enough. And then we need some syrup in there as well. >> You want whipped cream? >> Yes. One straw, please. [Music] You want a straw? >> Yes, a straw, please. >> All right. Uh, would you like some more >> straws? And uh, would you like some more? >> No. Okay. Well, today's also day is going to be Yes. >> So, yes. >> Okay, that's enough. Thank you. >> All you're welcome. You're straw. >> That's too many straws. >> It's great for sharing. >> Wa! Jason made so many mistakes in his restaurant. >> Yeah, I think it's his first day. Should we help Jason? That's a great idea. Let's go and help Jason. >> Jason. Jason, can we help you with your restaurant? >> Yes, I can actually use some help. >> Welcome to my restaurant. Who wants some drinks? Who wants some fruits? Who wants some desserts? >> I got the best tea. >> Oo, I'm thirsty. Ooh, this looks like a great place for a drink. Hello. Can I order a drink, please? >> Yes. Yes, you can order a drink. >> What would you like, please? >> I want the best drink you guys have. >> Uh, I got an idea. We mix everything together. >> Everybody get ready. Set. Go. All right. Go, go, go. Everyone, go. Get the syrup in. Get the syrup in. [Music] Okay. This is great. Great. Great. Great. Great. Great job. Great job. And that's enough. Yep. Some orange juice. Well, >> wo. That is looking very good, everybody. >> All right. Time to mix it. >> Yes. Mix it. >> Let's go. >> Can't wait to drink it. >> We need money, please. >> Here you go. >> Me, too. >> Oh, you want money, too? Sure thing. Here you go. >> Me, too. >> Oh, yeah. Here you go. >> I want even more money. >> Oh, you need more money. Oh, okay. Take all of it. Okay. Here you go. Here you go. All right, everybody. The drink's ready. Let's start preparing. >> Let's go. [Applause] >> All right. [Music] >> Wo! This is the best drink I've ever had in my life. Thank you guys. >> Yay! We did it. >> We made the best drink in the world. >> Thank you. My customers are now finally happy. You're welcome. >> You see everybody, teamwork makes the dream work.",
    "start_time": 1.28,
    "end_time": 1368.24
}