{
    "video_id": "tPcwheOY3G0",
    "channel_url": "@vaniamaniakids",
    "transcript": "This is an ad from Mattel. [Music] >> Team Shark rules. Team Dino. >> Team Shark's better. >> No, Team Dino is better. >> Team Shark rules. Tiger shark. Gangster. Great bite, five alarm, >> team dino drool, megaex, raises, bone shaker, bigfoot. Let's play the cardboard maze challenge and see who is stronger, team sharks or team dinos. >> Yes. >> Let's pick legionex. [Music] Tiger shark. [Music] Wow. Wow. >> Wow. [Music] >> All right. Quick cardboard mace tour. >> Wow. Let's see who wins. Team sharks or team dinos. >> Ew. Alex, watch the spiders. >> Okay. >> Oh, Alec, look at this tiger shark. Me negx. Let's see who's first, Liam. All right. >> Tiger shark versus Megaax. >> Go big. Go wheels. >> Great versus rage sword. >> Oh no, I missed. [Music] >> All right, gangster. Let's see what you got. >> Let's smash it all. Bone shaker. Gunser versus Bone Shaker. [Music] >> Five alarm versus Bigfoot. >> Nice shot. >> Yes. Thank you. My turn. >> Team Sharks. Team Dinos, let's go. >> Sharks. >> Good job. >> But it's time for something hot. [Music] >> It feels a little bit warmer now. Tell me about it. >> Oh no, the floor is over. Yes, but nothing can stop Team Sharks. >> That's the spirit. >> Yes, I won. Come on, Alex. Time to have some fun. >> Oopsie. Oh, no. No. What do I do now? I don't know, Alex. [Music] I think I have an idea. Team Dinos. Yes, I did it. I'm so proud of you, Alex. But I still won. >> All right, let's go. >> Almost there. Liam and Alex are so close to the dragon. [Applause] [Music] >> Wow. I can't believe it's all made out of cardboard. Be careful. >> Are you ready for the new challenge? [Applause] [Music] >> Go big. Go Hot Wheels. >> Team Sharks. >> Team Dino. I'm diving in. [Music] Ah, I need a break. Almost there. >> Yes, I did it first. I pump. >> First place here I come. >> What the wheel? >> I'm a rock climbing rock star. >> It's time to level up. [Music] Take this. Ooh, Alex, look what I found. >> Come on. You can do this. >> Thanks. Team Dino says you're welcome. [Music] Wow. [Music] Speed mode activate. [Music] Wo! >> Wow! >> Let's go. >> Yes. [Music] >> Wa! Just look at that. Let's switch to climber mode. Cool. What should we do next? >> Let's activate frenzy mode. That was so much fun. >> But wait, who won today? [Music] >> I can't believe I won. >> Congrats. Not. All right, let's go. >> Are you ready? Here comes the fun. [Music] Liam, let's team up to beat the dragon. >> Okay, >> Liam, hurry up. Get inside. [Music] >> Liam, are you okay? Ooh, I have an idea. Pretty [Music] work. >> Now they're ready for the dragon demolition showdown. Let's get all eight characters into two teams. Tiger Shark, Great Bite, Gungster, Five Alarm, Mega Rex, Rage Hour, Bone Shaker, Bigfoot. Wow. Congratulation, guys. Here comes today's main event. Hooray! Team Shark! Team Dinos! Mega Rex! Tiger Shark! [Music] Let's do it! >> Hooray! I won! >> Great bike! Raisaur! [Music] Demolition. Drunkster. Bone shaker. Okay, let's go. Five alarm. Bigfoot. [Applause] [Music] >> Yay. One more time. >> Get that trophy. Haha. Time to unite and defeat the dragon. Yes, victory. >> Oh, the dragon is demolished. [Applause] [Music] >> This was an ad for Mattel. [Music] Each sold separately. [Music]",
    "start_time": 3.2,
    "end_time": 577.749
}