{
    "video_id": "kNsOZPmraXw",
    "channel_url": "@vaniamaniakids",
    "transcript": "Money, money. >> Maria, let's play. Dress up. >> No, Dasha. I'm busy. >> Please. Please. I'm begging you. Please. >> No. >> Maria, let's play. >> I'm on my phone. >> Let's play. >> Maria, Dasha, what's the matter? I just wanted to play dress up >> and I just wanted to chill on my phone. >> Maria Dash, I found the solution. You just have to find something you both will enjoy. >> Yeah. >> Okay. >> Okay, girls. Have fun. [Music] >> My head. [Music] Oh my head. >> Let's play dress up now. >> No, I'm on my phone. >> I'm going to go and play now. >> Okay, have fun. Dress up is for babies. I wish I have someone to play with. I will use my imagination. [Music] Wow. Wow. Wow. [Music] I'll just play with my makeol. >> I look like a baby in this. I need to change. M I like this one. [Music] It's too big. H But I wore it yesterday. [Music] No, no, no. I need to change. [Music] H Oh, that's exactly what I need. Where's my phone? Oh, here it is. [Music] [Applause] This is so much better. Huh? Huh? What? I'm Maria. Maria? I mean Gasha. >> What? You are me and I am you. >> So what? >> Dasha, did you do your homework? >> Not yet. >> Huh? >> Aha. [Music] Blue circle. Red square. Blue circle. Red square, yellow triangle. Easy peasy. [Music] >> Nope. Maria, I need help. >> Oh no, he's calling Maria again. >> Oh, Maria, can you scratch my back, please? >> Sure. [Music] Lower. Lower. Oh, yes. Yes. Just like that. [Music] >> Huh? What's wrong, Maria? >> Yeah. Yeah. Delivery today. Yes. >> We have to switch back. >> No, I'm okay with that. >> Come on. We have to do the same thing. [Music] Yay! I'm back. >> Yes, I'm back, too. Here's your phone. >> Finally. Good. I have to change right now. Maria, wait. Let's play dress up. Dasha, give back my dress. Stephie, it's my dress. But you took it from me. It was mine. No, it's mine. Give it back. Give it back. >> Huh? What's going on? >> It's mine. [Music] >> Yes. [Music] [Applause] [Music] Ta. >> Wow. >> Wow. I love it, Alex. Thank you. You're welcome. You look amazing. Cool. Smile. I need a picture of this. [Music] Now I'm open. [Music] >> Dasha, I saw it first. No, Stephie, you're wrong. I saw it first. >> This is mine. No, mine. I took it first. No, it's mine. It's my backpack. Hand it back. No. Get to me. [Music] Oh no. >> Alex, are you okay? >> I'm fine. I'm okay. [Music] I can't wait to see if Dasha likes it. Final touch. >> Dasha, I made this for you. Wow. Wow. I love it, Alex. >> Cool. But my bag is way better. My bag is better. No, mine is way better. >> Mine is new. [Music] Wow. >> I think it's time for new shoes, Dasha. All right. I'll take this. I'll take this. I'll take this. And I'll take this. Hey, and I'll take this. This is my labu shoes. H. But I want them, too. Give me back my labu slippers. >> Are you kidding me? I got it first, but it's mine. No, it's not. >> No. Give it back. You give it back. [Music] >> So big. So small. This is not my size. Hey, Dasha. Steph, you have to swap your shoes. Yay! >> This is much better size, isn't it? Yes. But my shoes look better. >> No, mine. No, mine. >> A a wow. >> This one. It's mine. I took it first. >> No, you didn't. This is my even more favorite one. Give it to me. Mine. >> Oh no. Look what you have done, Stephie. It's all because of you. But you did that. It's your fault. It's your fault. >> It's okay, girls. Let's clean it up. [Music] >> Look, that's easy. Thank you, Alex. That's so kind of you. You're welcome. Look at this. >> Wow. Wow. >> What's this? It's for you girls, but you have to share. >> I wanted to play first. >> I got it first. >> Wo! Woah! Woah! Woah! >> If you don't share it, I'll just keep it. >> It's so fun. [Applause] [Music] My favorite love boo. [Music] >> Wow, I want this toy. >> Oh, such a cute little boo boo. Yes, it is. Can I see? Stephy, it's my toy. It's mine. No, just give it to me. I got it first. No, give it to me. Yes, it's mine. This little boo is mine. >> Oh, [Applause] again. Think, think, think, think. Oh, I know. Yes. Hello. Yes. [Applause] [Music] >> Wow. >> No. Hi. It's going to be >> mine. No, it's mine. It's mine first. No, I got it. Dasha, Stephy, look who's here. giant lab boo. [Applause] >> So cute. >> Let's dance. [Music] And Dasha, I wanted to say I'm really sorry for my behavior today. I know I wasn't at my best. Of course, Stephy, please forgive me, too. [Music] >> That's a stuffy surprise. Wo! Wow. What is this? >> A level with dessert. This is so sweet, Alex. Let's have some tea. [Music] [Applause] Sisters, let's keep it friendly and calm. >> Okay, Alex. >> By the way, my tea is better. Okay, let's eat this dessert. Pretty good. Mine is still better. >> Oh no. >> Huh? >> What do you think it is? It's a rich school. Let's go inside. Let's go. >> Wo! Everything is made from gold. I like this school already. [Music] Wow. Wo. [Music] So cool. [Music] >> Good morning, brilliant minds of rich school. It's time to study and drive. Hello. Hi. Hi. Chemistry. Let's start our golden chemistry lesson. [Music] Today I'll show you the rain of gold experiment. What? Rain of gold. >> Let's mix these two ingredients together. That doesn't look like gold. >> Just wait and you will see it soon enough. Huh? [Music] And when it cools, you've got the rain of gold. And now, kids, I'll show you how to turn this into gold. >> Wow. Wo, >> that looks impressive. But let me throw in an experiment from my regular school. >> Okay, >> let's begin. >> Wo! >> Wo! >> Oh my god, look at that. >> Wo! >> Wo! >> I've never seen anything like this before. >> Can I touch it? >> No. It's very cold. >> All right. >> Nicely done, Stafy. You've got an A. Physical [Music] education. Rich school. Time for physical education. Come on in. [Music] All right. Football game. Let's begin. [Music] Football. [Music] What's this? >> Oh, basketball. Let's bring the hand. >> Go, go, go, go. >> Now, let me try. >> No. >> Guys, these don't look like balls at all. I'll show you. >> This is a real football. Let's play, guys. >> But it's not goal. All right. [Music] [Applause] >> Now, let's play basketball. [Music] >> Wo, wo, go. [Applause] [Music] [Applause] I really like your strange round ball. So innovative. >> Yay. >> Enjoy. >> Art lesson. All right, rich school students. Time to get creative. Welcome to art class. >> I love art. >> Me, too. >> Oh, yeah. Let's begin. I'm going to paint my bear gold rich school style, right? >> I'm taking the bear in gold gems. That's luxury, isn't it? >> Wait till you see my cool idea. >> All right, go and create something amazing. You've got an hour. >> I have an hour, too. [Music] Let's go. >> First, we need to give it a good shave. [Music] [Music] All right, show me your masterpieces. >> Meet my gold jack bear. Isn't it beautiful? >> Now, check out my gold painted bear. >> Just like me. >> Check out my superhero styled bear. [Music] Wow, so unique and creative, Stephy. That's an A. >> Oh, thank you. >> Huh? >> Lunchtime. [Music] >> See you at lunch. >> Okay. [Music] Hello. Hello. >> Welcome to Gold Canteen. What may I get for you today? >> Ooh. Can I please get a golden burger with fries, golden nuggets, and golden donuts? >> Same. Me, too. Me, too. [Music] and a golden donut. [Music] >> All your food is made of gold. >> Yes, Stephie. What would you like? >> Can I have a golden apple, please? >> Sure, Stephie. [Music] Ew. >> You know what? I'm actually good. Thanks. >> Uh, okay. >> This prank is going to be epic. [Music] >> Hey guys, I have nothing to do. Can I join you? >> Yeah, sure. Take a seat. Ow. [Music] Stick. Take it off. >> Uh, I'm sorry. It was just a joke. >> Okay, I forgive you. But please don't do it again. I have real food. >> Real food? What do you mean? >> Let me show you. [Music] Wa. >> You could even try it if you want. [Music] >> M delicious. >> Bonap fanatics. Let's start our phonetics lesson. >> Okay. [Music] What are you doing? >> Okay, kids, repeat after me. A >> A B E B C >> C D E F D E F >> What's wrong, Stephie? Don't you have your gold letter stickers? Take it. >> Thanks. G H I >> Let's continue. H I J K >> A B C D E F G H I >> J K L M M N O B Who did this? >> It wasn't me. I promise they started it. >> Stephie, principal wants to see you now. [Music] [Laughter] [Music] >> Yes, sure. >> Come here, Stephie. >> Hi, principal. >> Hello. I've heard a lot of great things about you from our teachers, and I wanted to ask if you'd consider to stay with us. >> I'd love to stay, but my world needs me. >> By the way, I have a terrible mustache. Uh, got to run. >> Really? Excuse me. [Music] >> I love my world, my school, my friends. Uh-oh. Homework. >> Hi, class. Hello teacher. >> Please welcome our new student Yea. [Music] >> Hi everyone. Please take your seat. [Music] Hey, look what I have. [Music] Hey, look at my pen and notebook. >> Wow, so cool. I like it so much. >> I know. [Music] >> Students, it's time to present your science projects. Today I'll show you a volcano eruption. >> Wow, impressive. Let's see. >> Huh? I need to add some more. [Music] Oops. [Music] Dasha try different proportion next time. Okay. >> Okay. [Music] >> Alex, you are next. >> Wow. What is this? >> Today I present the planets of the solar system. >> H very interesting. galaxy. You can start. [Music] >> The sun lies at the center of the solar system. >> There are eight planets in the solar system. >> Mhm. >> This is Mercury, Venus, Earth, Mars. Nice try, Alex. But you've got the names of the planets wrong. Take your seat, please. >> Okay. [Music] >> Yeah, it's your turn now. >> Today, I want to present a digestive system. >> Wow, impressive. Could you show us how it works, please? >> Sure. [Music] The digestive system breaks down food into tiny pieces so our body can use it for energy and growth. >> Wo! Wow! >> Great job, Ya. That's an A. >> Yeah. Thanks. >> Students, that's all for today. See you. >> Dasha, Alex, would you like to hang out after school today? No, I'm very busy today. >> What about you, Alex? Can you go with me? >> Yeah, I'm busy, too. >> Yeah, but I got something for you. >> Really? >> Wow. What is this? [Music] Hi D. >> Hi dear. What happened? Can you please buy me some fancy school supplies like other kids have from school? >> Sorry, Eva. We don't have enough money for this at the moment. I have to work. >> Okay, Dad. [Music] >> Good morning, teacher. >> Good morning, Alex. Take your seat. Good morning teacher. >> Good morning Dasha. Take your seat please. >> Hi teacher. >> Hi yellow. Please come. [Music] >> Look at my golden chain. >> Look at my new smart watch. >> Wow. So cool smart watch. >> Hey look at my bracelets. [Music] Oh, >> and my new cool necklace. >> Wow. Can I have a closer look? >> What? Of course not. >> Oh, it's time to practice English, students. Alex, come to table, please. Alex, use the letters and compose the word windy. >> Okay, [Music] >> I'm done. >> Unfortunately, you did a mistake. Take a seat, Alex. >> Oh no. >> Dasha, you are next. Come here, please. [Music] >> Dasha, you need to compose word rainy. Okay, >> I'm done. >> Unfortunately, Dasha, you did a mistake. Take a seat. >> Whatever. >> Yea, it's your turn now. Please come to the table. Yea, can you compose and spell the word snowy? >> Sure. [Music] Well done, Ha. That's an A. >> Yay. [Music] >> Students, the lesson is over. See you tomorrow. >> Today, I'm going to a Barbie party after school. >> I'm going to a Spider-Man party today after school. >> Can I join you guys? >> No. No. [Music] Daddy. Dad. >> What happened? Yella, >> I got such a good grade at school today. >> Wow, I'm so proud of you, Yella. My superstar. >> Hey, Dad. My classmates have so cool accessories. Can I have some, too? >> Sorry, Yella, but we don't have enough money for this. It's okay, Dad. I understand. [Music] [Music] Alex, look at her. Let me take a picture of that. >> Cool. >> Students, today we have a beginner yoga class. Dasha, Alex, hide your gadgets, please. [Music] Dasha, Alex, schools are not allowed in the school. I need to talk to your parents. >> Oh no. >> Dasha, Alex, I just spoke to your teacher and he told me everything about your bad behavior and poor performance at school. So, you will be punished. Please give me your phones and all your accessories. [Music] Are you okay, my dear? >> No. Kids make fun of me at school. >> I hear you, honey. Kids can be so mean sometimes, but I have something for you that might cheer you up. >> Oh my god. Thank you, Dad. >> I work so hard, Yella. And you have a such good grades in the school. So, this is my gift for you. Wow. Thanks, Ted. You're the best. [Music] >> Hi, everyone. [Music] >> Wow. [Music] >> Wo. Cool pencils. Wow, >> I really like them too. >> Really? I can share with you. >> Thank you, Eva. Thank you, Eva. Yea, forgive me for my behavior. Yea, I'm so sorry for being mean to you. >> Thanks, guys. It means a lot to me. >> Students, we have a test today. Students, time is up. Bring me your test. [Music] >> Wow. Congratulations, students. Today you all have an egg. [Music] >> Hooray. >> Yeah. >> All that fancy stuff kept us from studying. >> Yes. From now on, our school is priority. >> Remember that the most important thing in school is knowledge and friendship, not fashionable clothing gadgets. >> Dasha, can you take care of Patty, please? >> I really need to go now. [Music] >> Of course. Yeah, but don't worry. >> Thanks, Dasha. Bye. >> I'll take a very good care of you, Penny. First, I'll feed you. Wait a second and I will come. [Music] >> Let's feed the cat. What? Penny is not here. [Music] Oh no, Penny's missing. I need to find Penny. Let's check her favorite spot. [Music] >> Penny? No, it's not Penny either. I need the missing cat's poster. Let's check the front door. Oh no, the door is open. Penny, Penny, Penny, Penny, I found you, Kitty. Kitty, Kitty, Penny, where are you? Where are you, Kitty? No kitty here. [Music] What happened, Dasha? >> I can't find Penny anywhere. I think she's missing. >> Have an idea how to find her. Let's go, Dasha. >> Yes, let's go. Dad, >> cats like scratching. Let's make scratcher for Penny. Yes, dad. Nice idea. [Music] Now, let's choose thread color. Blue, yellow, red, green. >> Great choice, Dasha. [Music] >> It's working. >> Wow. Dasha, let's head so Penny doesn't get scared. Haha. [Music] >> Oh no, we fell asleep. Dad, wake up. Wake up. [Music] >> Oh no, Penn is not here. >> Don't worry, Dasha. I have a better idea. Let's go. >> Wow. >> Let's try tunnel for cats. >> Cool. Penn is going to love this. >> And now Dasha, we need to hide. >> Okay, [Music] >> maybe it's Penny. [Applause] >> Let's check. [Music] I think Penny is somewhere here. [Applause] >> Alex. Yeah, it's me. I really like your tunnel. A P Hey, not here. >> Don't worry, Dasha. I have another idea. Let's go. Let's make a cat house. Okay, let's do it. >> Wow. >> Wow. Such a beautiful cat's house. >> Let's put Penny's favorite toys. [Music] Now, Dasha, let's hide so Penny doesn't get scared. [Music] >> I think it's Penny. [Music] Is it you, Penny? >> Is it you, Penny? [Music] >> Just a toy, not Penny. >> Did you hear that? Huh? [Music] Let's go. [Music] Penny, you're so naughty. Finally, we found you. >> Oh, hi there. How are you doing? >> Uh, we are just fine. >> Be responsible for your animals. A >> well done. Now let's put them all together. [Music] Awesome. [Applause] [Music] >> Hey, can you go play somewhere else? >> Okay. Okay. Hedge. [Music] >> Oopsie. >> Oh no, my doll. >> I'm so sorry, Dasha. >> No worries. We will try to find your dolls. You will. [Music] >> Oh, look. What is that? Hurry up. I already missed my doll. [Music] >> Oo, let's go, Stephie. [Music] >> This one looks so cold. [Music] >> Wow. [Music] Look, maybe our dolls are there. >> This is a shark toy. >> I think it's here. [Music] >> I don't think this is a doll. It's just a ball. >> We have three more left. Let's check it. >> Also not a doll. Just an elephant. H. Maybe it's this one. A baby bottle. Well, this is not a doll. This is our last chance. Let's see what's inside. Um, it's just some purse. It's not a doll. [Music] >> Maria, we're missing one more bathtub. Let's check it out. Yeah. [Music] Mhm. >> Gotcha. >> We found Dasha's two first dolls. Let's get them. [Music] >> Marsha, we found two of your dolls. >> Well done. [Music] >> Okay. [Music] Thank you, girls. One more left. [Music] >> Jesse, I think Dasha's dolls might be in there. >> Let's check it inside. [Music] >> Stephie, maybe the dolls are in here. >> Yeah, let's check it out. [Music] I found something. I also found something. >> But these are not dolls. Let's check for something else. [Music] >> Oh, where are they? >> Huh? >> We looked everywhere. We can't find them. [Music] >> We found two more dolls. >> Wo! [Music] Bash! We found two more dolls. >> Okay. [Music] Thank you, girls. Two more dolls are left. All right. Yeah. [Music] O y [Music] Let's see if there are any dolls here. Woohoo! [Music] >> Oh, it's just a car. [Music] >> I think I found it. Oh, it's just a little toy. >> Last chance. [Music] What's that? Hooray! I found a doll, but only one. >> Gotcha. [Music] >> I found another doll. >> Good job, Maria. Finally, we found the last two dolls. [Music] Oh wow, [Music] >> Zasha, we found the last two dolls. >> Oh wow. >> Last doll. [Music] >> Thank you for finding my doll. [Music] >> Dasha, we're sorry for breaking your bed tower. Guys, make sure to admit to your mistake >> and help others. >> Girls, let's play with the ball while my dolls are sleeping. >> All right. [Applause] [Music] [Applause] >> Oh, no. Not this again. You know what? I'll go to my dolls [Music] >> and we should find a better place to play ball. Let's go. >> My doll. [Music] >> Paw Patrol. >> Huh? [Music] >> What have you done? >> Too much phone is bad for you. Is it a phone jail? >> Correct. Your phones will go to the jail if you use it the wrong way. >> No. >> Oh, yeah. [Music] Done. Let's try it. [Music] It's undercooked. It needs to cook a little longer. [Music] Hello, Dasha. I'm fine. Thank you. Yes, of course. Lovely. Of course. Yeah, I'm cooking. >> Attention. File alarm. Yeah, today [Music] >> Stephie, you cannot use your phone while you cooking or eating. >> Oopsie. >> You've used your phone wrong, Stephie. So, it's going to the jail. Give me your phone. >> Okay. [Music] [Music] [Applause] What a beautiful tower. I'm such a master. [Music] [Applause] [Music] Yes, sharers. Everything is fine. >> Oh no, my tower. >> Oopsie. [Music] >> Alex, you cannot use your phone while you're driving. Hang it on. >> Okay. >> You use your phone wrong, so it's going to jail. [Music] Homework is so boring. >> Let's have some fun with my phone. Let's make a cool dance video. >> Together. >> It's party time. >> E A R T Y. Z A R T Y >> R T Y >> was it time to have some fun. >> Can you feel it? >> Maria Maria, >> you had to finish your homework. >> You've used your phone wrong, so it's going to jail. No, my phone. [Music] Yes. Hello. [Music] Yeah, Maria. Taking five chocolates. Yeah, great idea. [Music] Oopsie. >> What have you done? >> Stop. Your phone is going to jail. Give me a drink. [Music] Oh no, my phone. How will I survive without my phone? >> Let's destroy these phone jails. >> It doesn't work. We need a bigger hammer. >> Don't worry. I got you. [Music] Huh? >> What? >> The rule breakers. Let's catch them. >> Sorry, officer. We shouldn't have done this. >> We are sorry. >> It's okay, but never break the rules again. >> Okay. [Music] The jails are open now. You can take your phones back. >> Yay! >> H actually guys, I was thinking maybe we should go play hide and seek outside. >> Great idea. >> Let's go. [Music] >> Wo! Remember using phone too much can hurt your eyes, affect your sleep and keep you from playing outside. [Music] >> Okay. >> Wow. [Music] >> M yummy. [Music] >> Yeah. Woo! >> Wow! >> Cool. [Music] >> Yay! [Music] Hey, where's my marshmallow? >> Huh? Violet, what's going on? because you go camping. >> Okay, let's go and change your pajamas. >> Yay, daddy. But I'll change myself. >> Okay. >> Yum, yum, yum, yum, yum, yum, yum. [Music] >> But I never dress myself. >> No, no, no, no, no. Cuckoo. [Music] Are you ready, Alex? Oh, no. >> Oops. >> Let me help you, Alex, to put on your pants. >> Yay! >> Alex, you need to put two legs in two holes. Understand? >> Yes, daddy. [Music] Cool. >> Okay. >> Good job, Plex. [Applause] [Music] >> No, no, no, no, no. Yes. Yes. Good boy. Let me help you, Alice. You need to put in your arms. [Music] >> Cool. >> Thank you, Dad. >> Dad, I need to grab a hat. >> Huh? >> Aha. Woo! [Music] What is this? [Music] What? [Music] [Laughter] Oh, >> I still need to find my hat. >> Uh-uh. >> No, no, no. It's too hot outside for this. >> Okay, Daddy. >> You need a summer hat. Alex, choose the one you like. [Music] Wow, >> cool. >> Dad, I need to put my shoes on. [Music] >> Uh-oh. [Music] >> Oh no. >> This will help you, Alex. [Music] James said, \"Now I know.\" [Music] A >> good job, Alex. Let's go. Alex, let's apply sunscreen. >> Wow. Wow. Wow. >> Aha. Hey, let's take care of our eyes. [Music] [Laughter] >> Alex, you look so cute. Let's take a picture together. [Music] And now we're ready to go. >> Dad, you forgot about the tent. >> The tent? We forgot the tent. Yeah. [Music] Hello students. >> Hi teacher. >> Hi teacher. >> Hello teacher. >> Attention class. Welcome our new student Alex. >> Hello everybody. [Music] Uh, you're so small. >> Yes. You're like a little finger. >> Oh, no. [Music] >> Kids, be nice. >> Oh, no. Attention class. Who lives in the bamboo forest? >> Mimi, I know. >> Me. >> Excuse me. I know. I know. Please. >> You, Alex. >> It's Fanta. >> Correct. Alex. [Music] >> Which emotion is missing on the picture? [Music] >> Me. Me. me up here. >> Cool. >> You Alex. >> What? >> Joy. >> Correct. Alex. >> Oh no. >> Hey, be nice. >> Who the man carries on his back? >> I know. I know. >> I know. I know. Please choose me. I know. I can answer. What? >> Cool. >> You can answer, Alex. >> A baby. >> Correct, Alex. Well done. Give it to me. Give it. >> Oh, no. >> Who did it? Sorry, >> Alex. Come to the whiteboard. >> Okay. >> Oh, no. [Music] >> Okay. [Music] Done. >> Lunch time. [Music] >> Hey, stop it. >> Stop. [Music] No. >> Hey, it's mine. [Music] >> I will teach you. Very hot. >> Oh no. [Music] Oh no. >> Oh no. [Music] >> Huh? Huh? Idea. Time to rock. [Music] >> Not yet. [Music] >> Cool. Awesome. [Music] Wow. Cool. Huh? >> Wow. I'm rushing. >> Okay. >> What? >> Let's be friends. >> Mhm. Mhm. [Music] [Applause] [Music] Wow. Today I use sticker art to teach kids good habits. >> Wake up. Wake up. Wake up. [Music] [Applause] Oh, look at this, guys. Let's go. [Music] >> Wo! Game on. >> Let's go. [Music] >> Dasha, Alex, Stephie, let's follow the clue. [Music] >> Ooh, what's there? >> Let's go. Wow. >> Wow. >> Wo. Ooh, that's cool. [Music] >> Huh? >> What should we do about it? >> Oh, look. >> Let's follow the path. >> Yeah. [Music] Oh, I have a better idea. [Music] Let's make a cool design. [Music] Looks cool. It looks so cool. [Music] [Music] Do you like your new car design? >> I like it so much. Thanks, Stephie. >> You're welcome. >> Bye-bye. >> Bye-bye. [Music] I have to wash it. [Music] All clean. Oh no. Let's fix this. [Music] Done. [Music] >> I want to watch TV. No TV. Hilarious. [Music] Nice. Ivan, that's enough TV for the day. >> Yeah, right. Move away. Come on. [Music] >> Hey, no way. [Music] >> Let's have a break from TV. Ivan. No, I have a better idea. >> Hey, come here. [Music] >> H I'm not a ghost, Sephi. Are you? >> No, I I'm not a ghost. >> Let's go in then. [Music] [Music] [Applause] [Music] What is that? [Music] [Applause] [Music] What happened here? [Music] Thank you, Dad, for such a creative day. >> You're welcome. [Music] >> Huh? [Music] Aha. Not. [Music] [Applause] [Music] >> Stop it, guys. Please. What are you laughing at? >> What's wrong with your hair? >> What happened to my hair? >> What? What? This is not my hair. >> Don't worry, Maria. Stay here. >> Wow. [Music] [Applause] [Music] [Applause] >> Daddy. Daddy Ria needs your help. >> I'm fing [Music] >> Look what happened, Dad. I want my hair back. A >> Don't worry, Maria. I've got a solution for you. Bye-bye. [Music] My hair, my lovely hair is back. >> What? Dad, >> what? What? What? What happened to my hair? Oh no. >> What a strange dream. >> Maria, wake up. Maria. >> Huh? >> What's up with your hands, Maria? >> What's up with my hands? [Music] >> Take this off of me. Take this off of me. >> No worries, Maria. >> What? [Music] >> That feels so much better. Thank you, Dad. What's wrong with your hands? What? Oh no, your feet. [Music] [Music] What a nightmare. [Music] H interesting. Let's try. Hm. Red. But I wanted blue. Still no blue. Oops. [Applause] [Music] Hey, I'm sleeping here. What? [Music] What happened? Hair. So gross. Now hair is everywhere. Ivan, what happened here? >> I don't know. I was trying to get the blue gumball, but the machine fell down and then bam, candies all over the floor. And then I see hair everywhere. >> Oh, the gumball machine. Now I understand. [Music] Ah, all this happened because of harmful candies. Let's get rid of the gumball machine. [Music] Mystery solved. Now, let's just go play in the pool. >> Yeah. >> Wow. [Music] >> Luke, no. Don't eat it. Don't eat it. >> No. >> Wow. Oopsie. [Music] >> I want to ride. I want to ride that >> paper. Let's play it again and find out the order. >> Go, go, go. >> They are first. >> Safety first. >> Okay, let's go. No, no, no. [Music] >> All right. >> Bye-bye. >> Perfect spot for a picnic. >> Yay. >> Wow. Let's play cake. Yay. It's not food. It's slime. M. Such a tasty burger. Wow. Oh, wow. [Music] >> What is this? >> Take this. Someone help. >> What is this? Huh? Hello. >> Hello. Yeah. [Music] >> Bye-bye. >> I like this spot. [Music] [Applause] Let's play [Music] pancakes. Not real. Oh no. Uh-oh. [Music] [Applause] Huh? Where's my basket now? >> My turn. [Music] >> Show me it. >> Yeah. >> Excellent. [Music] >> Bye-bye. Woohoo! >> I think this is a great place for a picnic. >> Wow. >> Yummy. >> This is not drinks. This is squish toys. I was so thirsty. [Music] This is so relaxing. Uh-oh. [Music] >> Wow. What's happened? I will find my basket. [Music] >> Where's my basket? >> My turn. >> Help me. Help me. A huge skeleton scared me and I lost my basket. >> What? >> Guys, imagine if it was raining balls outside and I lost my basket. >> I lost my basket and my phone. >> It's impossible, guys. No. >> I'm really hungry now. >> Oh, I can share with you guys. I have plenty of food. Help yourself. >> Wow. Wow. Yeah. [Music] >> This is a joke. >> This is a fake fool. Come with me and have a real picnic. >> Yay! >> Ta! Look at that place. It's a great place, but we have no picnic food. >> No worries. I have a lot of food. Thank you. >> That's great, Dasha. I hope it's not fake food again. >> Let's go. >> Wow. [Music] >> Oh, yes. >> M. Wow. >> Yes. I like it. Oh no. [Music] >> It's mine. I saw it first. [Music] >> You stop it. [Music] >> H >> I have an idea. >> Aha. Wow. [Music] >> Green will be for Alice. >> Thank you, Ivan. >> Red is for Dasha. >> Thank you, brother. >> Finally done. >> Wow. [Music] Wow. >> Awesome. [Music] >> I'm in love with the blue color. >> I love green color. >> Woohoo. >> Red is my favorite color. >> Now, let's pick up shoes. >> Yeah. >> Let's go. Go, >> go, go. [Music] >> Oh, yes. H. >> No. >> Huh? >> No. [Music] >> No. I don't know. >> Yes. I love this shoes. Oo. >> It's my shoes. It's my shoes. >> No. It's my shoes. >> Oh no. Girl, stop it. Don't do it. Don't do it. I want shoes like this. >> I want the same shoes. >> I have an idea. >> H blue is for Maria. Red is for Dasha. [Music] >> Wow. >> How did he do that? [Music] Blue color fits me perfectly. >> I like green so much. >> Wow. >> Red color is my favorite. >> Woohoo. >> Time to pick a bat. Let's go. >> Wow. [Music] >> M. That doesn't suit me. >> H >> not really the one I want. >> Not my style. >> Oh yes. >> I like this one. >> It will be mine. >> Oh y to me. Girls, don't act like that. >> I also want the same suitcase. >> H I know what to do. [Music] >> Mhm. Perfect. [Applause] Oh, yes. Wow. I'm in love with my blue suitcase. >> It's amazing. >> Thank you, >> girls. Now, it's time to pick a headwear. Ooh. Wow. [Music] H. It's not my time. H I don't like [Music] just what I need. >> Um h >> I want to be a princess. >> No, I'm a princess. [Music] >> Oh no, they did it again. [Music] Girls, stop asking like that. >> I want the same crown but red. I want green. >> Okay, girls. I have something interesting for you. >> Wow. >> Ooh. >> Red crown for Princess Dasha. Green crown for Princess Alice. >> Woohoo. Here you are, girls. You're all my princesses. >> Thank you. >> Thank you, Ivan. >> Now it's time for makeup. >> Go, go, go. >> Wow. [Music] >> This is all mine. >> Awesome. >> What? >> No, this belongs to me. >> What? >> Mine. >> Give it back. [Music] Girls, stop it. >> I want to have my makeup box. I want my tool. >> We can find the solution. >> Yay. >> Now every girl has her own makeup box. >> Yoohoo. >> This box is for real princess. >> Oh, yes. I like it so much. >> My box is amazing. [Applause] [Music] >> Oh yes. >> Now we are real princess. [Music] >> Sh. I have prepared a surprise for girls. >> Yeah. >> Hi guys. Look, Avan has brought us flowers. >> Is it for me? >> Oh, for me? >> Oh, for me >> for Maria. >> Oh, yes. >> For Ellis. >> H. And for Dasha, >> I did my best. Now you have to reach a compromise on your own. >> I know what to do. Excellent. [Music] >> Green is for Ellie. Blue is for Maria. Red B is for me. [Music] I'm glad we found compromise. Green for Alice. [Music] So cute. >> Red is for Dasha. [Applause] [Music] [Applause] >> Thank you, Maria. >> And blue for me. [Music] >> Oh, yes. >> Wow. I'm so proud of you. You reached the compromise on your own. Ivan, thank you for this lesson. >> You're best brother. >> Remember, a compromise is always better than a conflict. >> Ice cream. >> Give me some ice cream, please. >> Ice cream. Ice cream. >> No. All the ice cream belongs to me. [Music] >> Yummy. >> Kiwi. Blueberry. Pineapple. Watermelon. [Music] Wow. [Music] [Applause] >> Yummy. >> Oh, yes. M. [Music] [Applause] [Music] Oh yes. >> Oh no. >> Oh no. My ice cream. No worries. I can make another one. >> Aha. >> Hey, excuse me. >> What? >> This one doesn't work. Let's try another flavor. Still doesn't work. Now I don't have any ice cream. >> Awesome. >> Wow. >> Aha. >> Wow. [Applause] >> Woo. Orange. >> Green. >> Excellent. [Music] Yellow [Music] color red. >> Wow. >> Oh, gumball machine. Can I have one candy, please? >> No, it's mine. Combo machine. >> No way. >> Mine machine. Woo! [Music] >> Orange juice. >> Aha! >> Grape juice. >> Yum. Woohoo! M drinks. I'm so thirsty. Can I have one drink, please? Please, please, please, please. Noah, you didn't share your ice cream with me. Aha. Hey. M. Aha. >> Wow. >> Yummy. >> One. [Applause] Two. [Music] Go. Three. My favorite. [Music] >> Wow. Donut machine. Stephie, can I have one donut, please? >> No, you didn't share your ice cream with me earlier. >> Aha. [Music] >> Wow. >> Fantastic. >> Wow. Green kiwi. >> Yummy. >> Orange mandarin. [Music] >> Blueberry. >> Aha. >> Yummy. Chocolate fountains. Fruits. Can I have some, please? >> No. Chocolate fountains belong to me. You didn't show you asking when I asked you earlier. So my answer is no. No. [Music] >> Marie, what's wrong? Why are you so sad? >> My ice cream machine is broken. I can't use it now. Dasha, Alex, Iv, and Stephie did not share with me drinks, candies, donuts, and chocolate fountain. >> They didn't share with you? >> No way. How bad of them. Come on, let's go, Alex. No more candies for you because I didn't share it with Mana. >> Hey, >> no more candy. >> Don't mind. >> Oh, no. >> Also, no more donuts for you because you didn't share it with Maria. >> Huh? >> What? No more drinks for you because you didn't share it with Maria. >> What? >> No more chocolate fountain because I didn't share with Maria. >> No way. >> Stop. He didn't share with me because I didn't share with the others. It's not his fault. >> I misunderstood. You can take your machine back. >> Fantastic. My apologies. >> No problem. >> Okay, thank you, >> Dasha. I was wrong. >> No problem. >> I'm sorry. I misunderstood. >> Okay, Daddy. >> Oh, yes. >> It is good you are honest and we've sorted things out. But it's bad that you didn't share the ice cream with the other kids. >> Now I understand. Forgive me for my behavior. >> It's okay. Come on. I will help you to fix your ice cream machine. [Music] >> Done. [Music] >> Thank you so much, Dad. >> Right. My machine is working now, so I can share with all of my siblings. >> Excellent idea, Maria. >> Hey, everybody, come here. I want to share ice cream with you. >> Yay! I'm the first one. >> Watermelon. >> Excellent. >> Woohoo! >> Wow! Woo! Blueberry. Yummy. [Music] Yummy. >> Oh yes. I want to share too. >> Chocolate donuts, please. >> Okay. >> Excellent. >> M. I want to share too. Grape juice. [Music] Yay. >> I'm so proud of you kids. You have to share with each other without expecting anything in return because >> sharing is caring. [Music] Wow. >> Oh, yes. Aha. [Music] >> Oh, yeah. Okay. >> Wow. >> Hello. >> Bye. Good morning, teacher. >> Good morning. [Music] >> Yes. >> Good morning, Maria. >> Good morning. >> Move your desk closer to me so we can sit together. >> Yeah. Aha. [Music] >> I'll tell you something juicy right now. [Music] Sorry, I need to move back to my place. [Music] >> E. >> Huh? Oh, no. >> Why are you so sad? >> Nobody wants to sit next to me, and I don't know why. I didn't do anything wrong. >> I think I know why. >> Can I come to your place tonight? >> Sure. Woohoo! >> Hello, Alias. >> Oops. [Music] >> No way. >> Hi, Maria. I'm so glad you came. >> Alice, what is this mess? Why don't you clean your room? >> I don't know. I don't like to clean my room. >> I don't know. I don't like to clean my room. >> Oops. >> I have an idea. Ta. >> Every cleaning can be turned into fun game. Aha. [Music] >> Oops. Ew. >> It's so dirty. [Music] [Music] [Applause] [Music] By the way, I brought you a gift. >> Wow. [Music] >> Wow. >> Why is it so big? >> Oh, I messed up. Oops. >> This is what you need. >> Excellent. >> Thank you. But I brush my teeth rarely. I don't like it. I brush my teeth like this. [Music] >> Done. >> That's not right, Alice. If you don't brush your teeth properly, you will have a bad breath and no one will sit next to you. >> Okay, Maria, I think you're right. [Music] >> Maria, I brushed my teeth. Now I will always do it. Well done. >> Good morning, teacher. Good morning, Maria. >> Good morning. >> Huggy, [Music] huggy. [Music] >> Oh, Alice, you got me dirty. What happened to your clue? >> Uh, I don't know. Maybe it happened when I ate chocolate last week. >> Last week? >> No way. >> Can I come by your place tonight? Sure. >> Hello. >> Hi, Alice. I brought you a gift. [Music] >> Wow, Alice, your room is so clean. Great job. >> Yeah, it's thanks to you. Thank you for your help. >> Can I go to your closet? >> Sure. [Music] >> Oh, >> Alice, you need to be careful with your glue. >> I just didn't have time to fold them. >> Oh, no. Excuse me. >> Wow. >> All their clothes are dirty. Look at this. Oh yeah, you're right. Let's wash it. >> Let's go. >> Go, go, go. [Music] Aha. [Applause] Wow. >> Oh, yes. Look, now it's clean and tidy. >> Yeah. Thank you for help, bestie. >> Hello everyone. [Music] >> Wow, your clothes are so clean. But what's going on in your hair? What's wrong with my hair? >> Look at yourself. >> Huh? H >> Do you have a comb? >> I don't need I always comb my hair like this. >> Oh, yes. I understood. Come to my place tonight. I will help you. >> Okie dokie. >> Hi. >> Hello, Ellis. Please sit down here. >> Wow. [Music] Clean. Ooh. Ooh. Ooh. [Music] >> Don't complain. When I finish, you will be beautiful. >> Finish. Look at yourself. >> Wow. Maria, you were right. My hair looks so beautiful now. >> Wait, why do you look so tired? >> I almost didn't sleep yesterday. I was doing my homework. >> Alis, that's not right. Sleeping is a must. >> Aha. >> Here, I have something for you. >> Wow. >> Thank you. >> It worked. I feel three years younger. >> And now look, I have amazing stuff for hairstyles. >> Awesome. >> Wow, it's so cool. Let's do each other's hair. Yoohoo. [Music] >> Wow. >> Oh, yes. Wow. [Music] Woohoo! Oh, yes. >> Awesome. [Music] >> Done. We had so much fun. >> Yeah. Thank you, Maria. Guys, take care of yourself. >> Good morning, kids. >> Hi, teacher. >> Have a seat, please. >> Oh, yes. Fantastic. Wow. Wow. >> I'm ready. >> Wow. >> Oh, guys, meet our new student, Ivan. >> Wow. >> Oh, no. >> Hey, be careful. >> Hey, excuse me. >> Sorry. Are we good? H >> yes. >> Oops. Oh yo. [Music] >> Oh no. >> What is that? >> Gotcha. >> Oh no. What should I do? >> Don't worry. I have something for you. >> Excellent. >> Here. >> Thank you. >> Wow. >> Aha. >> Thank you, Ellis. You're welcome. >> It's time for test. Wow. >> Aha. >> You have 10 minutes. >> Oh no. >> Oh no. Excuse me. I forgot my pen. >> Oops. >> No worries. I have a spare one. [Music] It is. Thank you for the pet. This is for you. Thank you. [Music] >> Hm. H. [Music] >> What's that? >> Oops. >> Uh, nothing. >> Hey, >> junk food is forbidden. Give it to me. >> Okay. >> Ivan gave it to me. Pranks are not tolerated in my class. >> It will not happen again. >> Get back to work. >> It sure will. >> Oh no. >> H. No way. Aha. >> Idea. Wow. >> Aha. >> Wow. >> Wow. Wow. >> Oh no. [Music] >> Surprise. >> Wow. Wow. No way. Who did this? >> Oops. It's not me. Check there. >> Wait a minute. What's this? >> Wow. >> I've never seen it before. >> Clean all this mess. >> Oh yo yo yo yo. >> Okay, enjoy. >> Don't worry. I'll help you. [Music] Woohoo! Yes! >> Oh, yes. [Music] >> Excuse me. >> Ouch. What are you doing, Anna? >> Are you okay? Let me help you. >> Thanks. here. >> Thank you, my bestie. >> Let's go to the school cafe. >> Yay. [Music] >> Wow. >> Excellent. >> I'm so annoying. >> I know. He sucks. [Music] >> Hi. >> Hello there. What do you want? >> Can I have burger? >> Yeah, sure. Give me a plate. >> Grape, carrots, and lettuce >> and tomatoes. [Music] >> Here you go. >> Thank you. >> Hi, Ellis. What's for you? >> Um, can I have uh the green burger and the yellow one? Uh, grapes, carrots, uh lettuce, and tomatoes. >> Two burgers. Yeah. >> Okay. Here you go. >> Thank you. [Music] >> Wow. [Music] >> Wow. What's this? >> It looks so nice. >> Choose one. >> Can I choose this? >> Sure. >> This one. >> Mhm. Yeah. Here you go. >> Thank you. And can I also have one soda, please? >> Sure. >> Here you go. Wait a minute. This is the money. 300 bucks. >> No way. >> Oh. Hey. [Music] Oops. >> Oops. No way. >> Oh no, my food. My 300 bucks. >> Uh-oh. >> Haha. Gotcha. >> Excuse me. >> Don't worry. I can share. >> Thank you. You're my bestie. Me, you're my bestie. >> Hey, >> Ivon, you'll regret this. [Music] >> Maria, look. How do you like it? >> Wow, it's so nice. >> Can I help you? >> Sure. Hey. Uhoh. >> Wow. >> Oops. >> Oh no, my drawing. >> Oh no. >> Huh? Don't worry. We can take a new sheet and I'll help you. >> Thank you. >> Mr. Teacher, come here. >> Hello. We need to use because this one is ruined. >> Sure. I have something for you. [Music] >> You are welcome. >> Thank you, teacher. >> Wow. >> Wow. >> He deserves this. >> Oh no. my knee. >> Please help me to get up. >> Maria, we should help him. >> Okay. [Music] >> Ew. What's that? [Music] Ivan, what did you do? Thank you for helping. >> Wow. >> Uh-huh. >> That's it. We need revenge. >> But how should we do it? >> H. >> Yeah. [Music] >> Oops. >> No way. Oh, little baby got scared. [Music] >> The wonderful world. >> Oh, yes. >> Ivan, could you please help me open this can? I'm not strong enough. >> Give me that, you noodle. Oh yes. [Music] >> Wow. Thank you. Bye. >> Oh no, >> loser. [Music] >> I have an idea. This will help us. Let's go. We need to hide a camera here. Fantastic. >> Okay, it works. Let's go. [Music] [Music] >> Oh no. [Music] Hello students. [Music] Oh no. [Music] [Music] >> Who did this? >> Oh no. >> Ivan, did you do this? >> I'll never do something like this. >> This not a girl. >> Uh-oh. Let me prove you. >> Oh no. Hey >> Alis, how could you? >> It's not Alis. I have a proof. >> Wow. >> Hey. >> Uh-oh. Oops. What? Ivan? >> No way. >> I will call your parents. And today you stay after school to clean all the classroom. [Applause] [Music] >> It should be sparkling clean. The lesson is over for today. >> No way. [Music] >> Bye. Music. [Music] Sorry, girls. I treated you badly. I was wrong. I just wanted to act cool cuz it's my first day at school. >> Don't cry. We didn't want to make you sad. >> You just bullied us. You don't need to try to be cool. Just be yourself. >> Let's be friends. >> Be friends. >> Yes. and friends help each other. >> So, we'll help you to clean the classroom. >> Yes. >> Good morning, kids. We are learning alphabet today. >> Aha. [Music] >> Mana, [Music] where is Vana? Hm. [Music] Woohoo! Wa! [Music] You late to school and you have puppets. No, no puppets in the class. [Music] No puppet in class. >> Okay. Okay. >> Funny. In school, we need to study. >> Open your notebooks and let's write down the alphabet. Woo! Aha! Woohoo! [Music] Wow. [Music] >> And the first letter is A for apple. >> Wow. [Music] >> I'm ready. >> Me, too. And the next letter is B. B for banana. >> Wow. [Music] >> Can I take a look? >> Yeah. >> Wow. Such a good girl. Good for you. Can I have a look? >> No. >> Give me that. Give me that. Oh no, not again, puppet. Write down the letters. [Music] The next letter is an H. >> Wow. >> H. Woohoo. Ba, it's your turn. >> What? Wow. >> What? Pop it again. >> No, it's a t-shirt from Italian designer. >> I said no. Pop it in the glass. Give it to me. >> No. Why is lunchtime? Hey. [Music] >> Wow. >> Aha. >> Wow. >> Wow. Wow. >> Yeah. >> How many times should I tell you? No. Pop it in the glass. >> No, it's candy. Pop it. >> Candy pop it. [Music] Woohoo. [Applause] Yeah. Wo. [Music] [Applause] Yippee! Aha! >> Woohoo! Cool. Wo! >> It's wo! >> No, no, no. Let's make a healthy puppet. >> Wow! Woohoo! >> This baby Yoda puppet is made out of color juice. And this unicorn made out of juice and grape. >> Let's taste it. >> Yes. >> Wow. Woo. [Music] >> Wow. Can I try? [Music] Tastes so good. M. Thank you, Maya. Not.",
    "start_time": 0.88,
    "end_time": 7195.84
}