{
    "video_id": "pKaxs7IyIXE",
    "channel_url": "@vaniamaniakids",
    "transcript": "Money, money, >> just look at those dinos. >> Guys, let's make this dino as big as Scorpius Rex. [Music] Where are all my dinos? I have to fix this before they wreck everything. [Music] I'll hide here. This is Lapos. He lived about 200 million years ago. It's one of the earliest meat eatating dinosaurs. His fossils were found in France. Time to go back. Here we cut QT. Now let's go. Only eight left. I hear the dinosaurs. Wow. This is Carnotaurus. Carnotaurus had big horns and a strong light scalp for biting. [Music] Time to go back, Carnio. [Music] Let's go. Seven diamonds left to find. Huh? This is Scorpio Rex. Let's take a closer look. It was the first hybrid dinosaur ever created and it can reproduce on its own. It's a mutant. It's a mix of four dinos and a tree frog. It's really fast. It's dangerous and it has venomous spikes on its tail. I hope it doesn't see me. [Music] Let's go back. You naughty scorpious mix. [Music] This room is so fun. Let's climb this wall. [Music] [Applause] What is that? [Music] What is my wand? I have to find my wand. I cannot find it. It's a Hearzaurus. It's a meat eatating dinosaur, so I got to be careful. >> Gotcha. >> This was close. Finally, you're a toy. >> Stay here. Don't go anywhere. [Music] [Applause] This is prestucus. Prestosucus was related to crocodiles. Prescus had a deep long head to hold strong jaws. Finally, you're a toy again. [Applause] [Music] [Applause] [Music] [Applause] Wait, I hear something. Let's go check. [Music] This is Iguana Don, one of the three dinos left. Iguana is a plant eater. He can walk on two legs or four legs. [Music] All right, sweetheart. It's time to go home. [Music] Let's go get more. [Music] Wow, this is a super park here. Let's grab a cart. I'll keep my ones here for now. Let's go shopping. Let's take a banana. A beach. I love beaches. Ooh, what is this? What is that? Did you hear that? I think that's a dino. Let's go check. [Music] Wow, this is Huang Herosaurus. Time to turn you back into a toy. Wait, where's my what? It was one of the early large of dinosaurs and fossils were found in China. >> Where's my what? Where is it? Audience, did you hear? Where's my wallet? I forgot it. I left it in my court. Here it dummy. Time to turn you into a dino toy. Let's go back. [Music] Finally, I can rest in here. Oh my god. Oh my goodness. This is Sarasukus. Circus was a huge ancient crocodile living in rivers and lakes. It had around 100 teeth for grabbing fish and even dinosaurs. Time to return it back. [Music] Let's go get the last one. Who is it? Oh my god. This is Tyroposaurus. Tyroposaurus was closely related to T-Rex. Its fossils were found in Asia. [Music] Finally, all dinos collected. [Music] [Applause] I love our dinosaurs collection. This is so cool. >> Lunch time in Dominus Rex. [Music] Yum, yum, yum, yum. Time to eat. Helosaurus. Yum, yum, yum, yum. Dasha Alex, our Stegosaurus is much smaller than Indominus Rex and Aldosaurus. I have an idea how to make it bigger. [Music] Oh no, our dinosaurs are everywhere. I need to get my wants back before they destroy the house. [Music] That's Stegosaurus. Stegosaurus had large bone plates on its back. [Music] Yes, it works. Let's put Stegosaurus on its place. [Music] >> I found a dinosaur. Give me the wand. >> This is it. lived 150 million years ago. The name Allosaurus means different lizard. It's one of the most famous meats eating dinosaur. Yes. [Music] Gotcha. Let's take you back. This is Bahadosaurus. Nobody knows why they needed those spikes. Bahadosaurus is one of the weirdest looking dinosaurs. Let's go back. Bahadosaurus. [Music] Do you see that? Oh my. This is Spinosaurus. Named for its 7 ft long spine. Lived about 100 million years ago. Yeah, got it. Let's get you back, Spinosaurus. [Music] Wo! This is Griosupus. Griosucus isn't a dinosaur, but a massive extinct crocodilian. All right, let's do this. >> Yeah. Gotcha. Goodos. It's time to go back. [Music] >> Wow. This is Bear's office. This dinosaur is famous for his long crest. >> Yes, it worked. >> Okay, Dino, let's go. Where are the dinosaurs? There. Look at this. Wow. It's a Theosinosaurus. Its name means skiff lizard because it had massive claws up to three feet. Yikes. [Applause] [Music] Gotcha. Let's go. >> Did you hear that? It's coming from the living room. [Music] I'll get back to you in a second. [Music] Wow. What again? No way. This is Mosasaurus. The mosaurus was an oceanic ax predator, but it was not a dinosaur. It was a giant marine reptile. [Music] Let's get you inside. What? One more. [Music] Wow. Triceratops. Its name Triceratops literally means three horned face. Two big ones above the eyes and one smaller one on the nose. It was massive, about 30 ft long, 10 ft tall, and could weigh up to 12 tons. Gotcha. Triceratops. Let's get you back in place. What? Where is it coming from? [Music] Wa! Pterodactyl. Did you know that pterodactyls are not dinosaurs? They're actually flying reptiles belong to a separate group called the paterazaurs. [Applause] [Music] [Applause] [Music] [Applause] [Music] Let's get you back. [Music] Wa! It's Brachiosaurus. Wow, such a long neck. Brahosaurus could munch leaves from trees up to 40 ft high where other dinos couldn't reach. Yes. [Music] Gotcha. Do you hear that? [Music] >> This is an Indominus Rex. It's a fictional dinosaur, not a real dinosaur. Wow. It has deadly traits like strength, intelligence, camouflage, and thermal masking. [Music] [Applause] Let's get you back. >> This is T-Rex. Ah, help. Another one. >> Run, Alex. I see one more. [Music] [Music] Stephie, >> don't worry, guys. I'm here to help. >> Yes. Yes. Help us quick. [Music] [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Thank you, Stephie. Stephie, that was a lucky hunt. No worries. Let's go back home. [Music] Guys, let's not mess with the dinosaur sizes anymore. >> Oh, yes. Wait a minute. Brachiosaurus is missing. I think I forgot it outside. Oh no. >> Oh no. Dinosaurs. [Music] >> This card is awesome. >> Raptor. So cool. This is totally worrisome. [Music] >> What is happening? >> Don't worry. I got this. [Music] >> Oh no. Dasha, Alex, run. [Music] That's Alex, don't worry. The magic wand will turn the dinosaur back into the toy. >> Why is it? >> Oh no, I lost it. >> Don't worry, just stay here. >> No, it's too dangerous. Be careful. >> This is Heron's house. It was one of the earliest dinosaurs ever discovered. It lived over 230 million years ago. It was cute but fast and dangerous dinosaur. [Music] Got my wand. >> Yay. >> Yes. Yes. Hooray! >> Guys, let's put this here back. >> Dasha, Alex, let's find all the dinosaurs. But remember, with this magic wand, we can turn any dinosaur into a toy. >> Sounds dangerous, but fun. >> Okay, let's do it. >> Time to go for a monster hunt. >> Where is it? Where's the dinosaur? Did you hear that? >> Wow. This is quadla cockals. Wow. It was not a dinosaur. It was a terasaur. It was the size of a small airplane. [Music] [Applause] Yeah, [Music] this is so fun. [Music] This is Majangaurus. It has a short snout and lots of teeth. It had a little horn on his head. [Applause] [Music] Let's return you back now. [Music] >> This is Dr. Blue. She has a blue stripe running down her body. That's how she got her nape. >> Oh no. [Music] >> Let's turn you back. Dino, time to go back where you belong. [Music] Wow, this is courageous. Its name means helmet lizard. It had a big crest that looked like a helmet. [Music] Gotcha. [Music] Such a busy wall, huh? This is Boreala Pela. It had a lots of protection. So cool. [Music] Let's return you, dino. [Music] I'm building a shelter so no dino can reach me. This is interrupt. This dino didn't exist. It was made in a lab. It's a villain dino. Scary, clever, and totally wild. [Applause] Let's get you back. [Music] >> We're playing a game. [Music] [Music] This is paraptor. Its name means far thief. Scientists believe it was covered with feathers. This rupture was small but speedy. [Music] [Applause] >> Yes. Yahoo! [Music] [Applause] [Music] >> Oh yeah, this is so sweet to me. It had two horns and it was the size of a cow. [Music] Time to go back. [Music] [Music] >> It was the size of a dog, but in the movies it's much bigger. Just for fun. [Music] Let's get you back. [Music] This is the storous Rex. It's not a real dinosaur. [Music] It's so scary. This tortoise was made on the lab and it's super powerful. Yes. [Music] Heat. Heat. [Music] [Music] This is Alismosaurus. It had a very long neck with 72 bones, longer than any other animal on the planet. Let's return you home. [Music] >> This is Yanguanosaurus. He can go as long as a school bus. [Music] Let's go get it. [Music] Yeah, just like that. >> This is generosaurus. >> It looks like a mini T-Rex. [Applause] >> This is his name means meat eatating wolf because of his horns. [Music] [Applause] Look at his little cute arms. Let's go. [Music] >> Yay! We did it. [Music] Yeah, look what I found. >> No, no, no, no. Okay, okay, okay. [Music] >> Wow, Dasha. Alex, let's check what's inside. >> Dinosaur toys. [Applause] I have an idea. Let's make these dinosaur toys so big like those sculptures. [Applause] >> Let's start with Spinosaurus. [Music] [Applause] >> Wa! So big. Where are the dinosaurs? Alex, run. [Music] >> They're so big. That was so scary, guys. Maria, all of the dinosaur chairs are gone. What do we do now? >> Yes, Dasha, there are lots of dinosaurs out there. Let's use this wand to turn them back. >> Let's go. >> This is a mahibiosaur. This dinosa part of the T-Rex family, but it looked earlier and it was smaller and faster. It goes and ridges possibly used for display or battle. Scary. Let's bring you back to the suitcase. [Music] This is its name means fish hunter. [Music] If naturator had two sail like bum on his back and live near water. They were great swimmers and ate fish. [Applause] [Music] Let's go back to the suitcase. Cool. Yay. Where should I go? Where's the dinosaurs? This is name. Its name means new hunter. I hope he doesn't see me because of nature has very good smell. [Music] Let's go back to the suitcase. [Music] >> Ah, these are just toys. Cool. [Music] >> Good thing it's just a plush toy, not a real dino. Such a cool decoration. Impressive. >> Oh no, it's a real dime. [Music] >> Don't you know the diametron lived before the dinosaurs over 290 million years ago? [Music] >> Let's catch him. Yes. Got it. Let's return you to the suitcase. [Music] >> Oh no, I saw the forest. I need to hide. I hope he doesn't see me. He saw me. Aloor's tail had a big heavy club. Look at his back. >> It has bony plates like a armor. [Music] >> Yes. [Music] >> Time to go back to the suitcase. [Music] >> Oh, look. This is my Azora. Sorry, but I have to take you back. [Music] [Applause] [Music] >> This is Beck's spine axe. There's still a lot we don't know about it. Scientists only discovered a little bit part of its skeleton. It had tall back spikes, likely a part of a small sale. [Music] >> Chill out. It's time to go home. [Music] [Applause] >> I want to get some candy. I hope there's no dinosaurs inside. [Music] Huh? This is Sinosopus. It was the first horned dinosaur found in China and the only one from Asia. [Music] >> Time to go back. >> Look, hit your brother. >> Yay. Huh? I hear a dinosaur. Should be somewhere here. [Applause] So close. This is a serentosaurus. His name means horned lizard. Look at his horns. Scary. It had a nose horn like a dragon. Serentosaurus had a long flexible tail just like a crocodile. [Music] Let me turn you back to the suitcase. [Music] >> Look, here's the real dinosaur. This is Diblandus. Its name means double bean. Look at this super long tail and neck. It was a plant eater and it was eating leaves. I don't like it in leaves. >> It's so huge. I'm going to give it to Maria. [Music] >> Dasha. Alex, we need to find the last dinosaur. [Music] >> Look at those babies. Huh? >> But this is not a dinosaur. [Music] >> Where could the last dinosaur be? >> This is a dinosaur. No, it's a crocodile. [Music] >> Let's turn this dino back quickly before it catches us. [Music] Dasha, Alex, come. We've caught the last dinosaur. >> Done. >> Hooray. >> Let's go home now. >> This is a bee. >> Wa! A bee. >> This is a mantis. [Music] Interesting. >> This is Ladybug. This is a spider. >> Now, let me try. >> Let me change the channel. >> No, I want to watch this. [Music] [Music] Oh no, Dasha. All the bugs escaped. >> We need to stop them together. >> Huh? Okay. [Music] Oh no, be >> I have a plan B. >> Let's try honeycombs. [Applause] >> It worked. Alex, let's catch them now. Come on, Alex. >> Yeah. Yeah. Yeah. [Music] >> Yes. You catched all the bees. >> Thank you so much, guys. Thank you. Take it off of me. >> One, two, three. Huh? Help. >> Help. >> What's happened, Alex? >> Yeah, but there's a man somewhere here. No worries, Alex. I'll find it. [Music] >> Maybe he's here. [Music] Alex, I see it up there. Gotcha. [Music] >> Thank you so much. Oh, [Music] >> this is for Alex. Huh? What's going on? Yellowa. Yellowa, help me. Yellowa. >> What is happening here? >> Yellow, help me. My head is flying away. >> Look. >> Sure, I'll catch it. One more time. >> Let's see who's there. >> Okay, it's Ladybug. >> Let's put it in a jar. [Music] >> Done. >> Let's do some work. [Music] Ah, spider. Spiders. Spiders everywhere. [Music] >> Yellow. Yellow. Please help me. Please help me. >> Oh my god. No worries. I'll help you. [Music] Is that it? >> Uh-huh. Uh-huh. No, it's not. [Music] >> One more. >> It's so big. >> Yes, it is. [Music] >> We finally collected all the bugs. >> Dasha, let's return all of the bugs into the habitat. [Music] Oh no, not this again. Help. Help. Someone help me, please. >> Let's try some magic, Alex. >> Okay. Abracadabra. >> Who? No, it doesn't work. >> You're right, Alex. Let's go to bed. >> Okay, [Music] where's our animals? >> Oh no, they're gone. Huh? What's that noise? Let's go check. [Music] >> You hear that, Alex? Yes. >> Look, a tiger. [Music] [Applause] [Music] Try again. [Music] [Music] Oh my. >> What do we do now? >> Yeah, but I'm scared. Our toys came to life. >> I know what to do. Come on. >> Let's feed the animals and turn them back into toys with this magic wand. >> That's a brilliant idea, Ya. Tiger. >> Okay, Alex, here's the plan. I throw the stick to distract the tiger and you turn him into a toy. >> Okay. >> Kitty kitty, you want some steak, kitty? Hey, kitty. Kitty. [Music] You did it. Hooray. Tyler is back. [Music] >> Oh, look. It's a hippo. Did you know he hippos are mostly plant eaters, but they also like plants as a treat? Santa Hippo. [Music] Let's use this moment. Hippo, [Music] let's catch this monkey. Yay! Let's go put it. Mandrean monkeys are the most colorful monkeys with bright faces and rainbow bottoms. [Music] [Applause] Elephant. [Music] Elephants fluff their ears to stay cool like building fans. Cool, huh? Oh. Wow. >> Elephant spray water to cool off and get clean. [Music] >> Gotcha. Elephant. >> Look at this small elephant. >> Elephant. [Music] >> Do you hear that? It must be something big. Oh, what a nice cute bear. Um, he looks really hungry. We should feed him. Bears really like fish. [Music] Did you know bears can smell food over 20 m away? It's like sniffing a sandwich from another town. Just look at him. Let's go, Pudding. Welcome back, Mr. Bear. [Music] Oh my god, a giraffe. His neck is so long. [Music] [Applause] [Music] Giraffs have the longest necks, up to 2 m long, taller than the moss grown-ups. [Music] Ooh, someone lost the wand. Time to play with my toys. [Music] Oh, let's try the magic wand. Abracadabra. Boom. Bing bamboo. Hm. Doesn't work. [Music] >> Hey, Ya. >> Hey, Dasha. Have you seen my wand? >> Yeah, but it's not working. >> Where's my toy? Someone took it. Was that to you, Ya? >> I know, but lately I found my wand. Now I have to tell you something. The house is >> What was that? [Music] Look at those monsters. [Music] Yeah, but I can't believe you lost the wand. What do we do now? >> Oh, I have an idea. [Music] >> Dasha, I got the one. >> Come on. Come on, Ya. Come on. [Music] Thank you. That was so cool. >> No problem, Dasha. But promise you won't take my bone again. >> Ah, yes. A giant snake is coming. [Music] I'm so scared of snakes. >> Me, too. >> Yeah, but use your wand. [Music] >> Yay. >> Such a big snake. >> Let's go put it on its place. >> Snake. This is lion and rhino. They look really aggressive. Let's change them into toys quick. [Applause] Hooray. [Music] Let's go poop them. Rhino and lion. [Music] Finally, I collected all my toys. [Music] Alligator. How did he get here? [Applause] [Music] Now, this is definitely the last story. [Music] >> Hi, it's just me, Ya. >> What a beautiful day for fishing. >> Hi, Ivan. Hey, >> sorry I [Music] caught something. Wow, my first fish. [Music] Come fishy fishy. [Applause] Oh yeah, [Music] my second fish. [Music] >> Oh no. Oh no. >> You're hungry? Go grab a bite. >> Ooh, maybe I can cook some fish for lunch. Let's see what you caught today, Alex. Hey, >> Alex. This fish is too small. I'm too hungry. We need to catch a bigger one. >> Huh? A bigger one? >> Alex, stay here. I'll be back in a minute. >> H What is he up to? >> Let's see what's in here. >> Huh? >> It's empty. [Music] idea. It must be somewhere here. >> What is this, Alex? >> I need to find a cart now. >> What is this for? Ivan. >> You will find out soon. [Music] What are you doing? >> Don't worry, Alex. It's time to catch a big fish. >> No. Stop. Oh no, >> Ivan. I'm not sure that's a good idea. >> Stop whining, Alex. It will be okay. >> Oh, I think I got something. Oh, it's something big. Alice, I need your help. Come on, [Music] >> Vinn. Wait a second. I think I can help you. [Music] Alex, help me. [Music] >> Finally, I caught you, naughty fish. >> No, please let me go. And three wishes are yours. >> My wish is to have a big fish for lunch. >> Yes. [Music] Are you a magical fish? Please grant my wish. Hands >> off, Alex. The fish is mine and I'm cooking it for lunch. >> No, >> my fishy. >> Such a big fish. Now I just need to find a frying pan. Ooh, perfect. You know what? I don't think it's going to fit. But actually, I have a better idea. [Music] >> Now, time for the recipe book. H I need to find the most exquisite fish recipe. [Music] Ooh, [Music] found it. >> Huh? >> Huh? >> What is this? This is not my fish. Alex, come here. >> Alex, oh, let's hide there, >> Alex. [Music] H. Where is Alex and my fish? >> Huh?  you little. >> Give back my fish. >> No, this is my fish. >> It's my fish. Give it back. >> Yeah. Give back my fish. No. Give it back. This is my fish. [Music] He's not. >> Hey, what are you doing? >> Hey, give me back my fish. >> Catch me if you come. [Music] >> Hey, help. Help me. Woo! [Music] >> Oopsy daisies. >> Time to turn. >> Hey, Alex. Alex, stop. Hey. [Music] Hey, >> that's my fish. >> Hey, get back here, >> Alex. Hey, stop. Stop. Stop. Alex, stop. >> Hey, stop. Stop. Alex, stop. >> Oh, no. >> Hey, no, my fish. No, [Music] but I'm still so hungry. >> I think we could just order a pizza. >> Let's go. >> Dasha, can you take care of Patty, please? >> I really need to go now. [Music] >> Of course. Yeah, but don't worry. Thanks, Dasha. Bye. >> I'll take a very good care of you, Penny. >> First, I'll feed you. Wait a second and I will come. [Music] >> Let's feed the cat. What? Penny is not here. [Music] Oh no, Penny's missing. I need to find Penny. Let's check her favorite spot. [Music] Penny. No, it's not Penny either. I need the missing cat's poster. Let's check the front door. >> Oh no, the door is open. Penny, Penny, Penny, Penny, I found you, Kitty. Kitty, Kitty, Penny, where are you? Where are you kitty? No kitty here. [Music] >> What happened, Dasha? >> I can't find Penny anywhere. I think she's missing. >> I have an idea how to find her. Let's go, Dasha. >> Yes, let's go, Dad. >> Cats like scratching. Let's make scratcher for Penny. >> Yes, Dad. Nice idea. Now, let's choose thread color. Blue, yellow, red, green. >> Great choice, Dasha. [Music] >> It's working. Wow. Dasha, let's hide so Penny doesn't get scared. [Music] >> Oh no, we fell asleep. Dad, wake up. Wake up. [Music] >> Oh no, Penn is not here. >> Don't worry, Dasha. I have a better idea. Let's go. >> Wow. >> Let's try tunnel for cats. >> Penn is going to love this. >> And now Dasha, we need to hide. >> Okay. [Music] >> Maybe it's Penny. [Applause] Let's check. [Music] I think Penny is somewhere here. [Applause] >> Alex. Yeah, it's me. I really like your tunnel. >> A P is not here. >> Don't worry, Dasha. I have another idea. Let's go. >> Let's make a cat house. >> Okay, let's do it. >> Wow. >> Wow. Such a beautiful cat house. >> Let's put Penny's favorite toys. [Music] Now, Dasha, let's hide so Penny doesn't get scared. [Music] >> I think it's Penny. [Music] H [Music] Is it you, Penny? >> Is it you, Penny? [Music] >> Just a toy, not Penny. Did you hear that? Huh? Let's [Music] go. [Music] >> Penny, you're so naughty. Finally, we found you. >> Oh, hi there. How are you doing? >> Uh, we are just fine. >> Be responsible for your animals. >> Woohoo! Ah! Who is here? >> There's a monster under my bed. I need to hide. [Music] >> Someone please help me. >> Help me. >> Is it Alex's voice? >> Alex, what is happening here? >> There's a terrible monster under my bed. >> Don't worry, Alex. >> Alex, monster don't exist. It's just your imagination. You don't believe me? Look under the bed. >> Monster, it's time for breakfast. >> Well, that's a surprise. Huh? >> You could left some for us. >> Yeah, but let's call >> grown-ups for help. >> No, we will handle it ourselves. You know what? Let's feed him some more. Maybe then he will leave. Okay, I'll make something to eat. [Music] >> Aha. [Music] Yummy. One, two. Wow. [Music] >> Wow. >> The food is finished. >> Oh, nice, Alex. So, here's the plan. I put the food and you catch the monster. Okay, I'm ready. >> The food is gone. >> Now we will get him in no time. >> Yeah, but he's still here. Oh yo yo yo. There's no one here. Maybe he's full and he left. >> He's here 100%. Give me that brush. >> Go, go, go. >> Alex, stop it. There is no one there. Hold on, Alex. >> Monster in the brush. >> I'm even more scared now. Hurry up, Ya. >> That's it, monster. Enough hiding under the bed. [Music] I'll catch you [Music] monster. My god. >> Alex, help me. Hey, [Music] a he's really strong and his claws are huge. We can't defeat him that easy. >> He's going to get it now. >> 1 2 3 >> Huh? >> Who is there? Ya. [Music] >> Why are you trying to hit me? >> What are you doing here? Dad, be careful. There's monsters there. >> There are no monsters there. It was me. >> Huh? >> What about the food? Who ate all the food and the vacuum brush? >> It was me. I was fixing the bed. I was too hungry. Couldn't resist. >> Turns out I just see things. I knew it. Alex. >> Kids, remember there are no monsters. All of these characters are made in our heads. So, the monsters live in my head. Get them out. >> No, no, no. There is no monsters at all. Our heads just make them up to scare us. A >> although there's one monster that does exist. >> What kind of monster? >> The tickler. And now he's going to tickle you. [Applause] Yahoo! One 2 3 4 5 [Music] >> What is this? A hurricane? Alex, quickly hide in my house. [Music] What a mess. >> Oh no, numbers and balls scattered. >> So what shall we do now? >> Nothing. We will find them. >> Yay. [Music] Blue balls are already >> yellow balls have also been collected. [Music] [Applause] Red balls are in the house. [Music] >> Dad, that was cool. >> Oh yeah. >> Next one. Purple. >> Wo. Number one. >> Yay. Cool. [Music] [Applause] [Music] Oh, eyes look fruit. Maybe there is a digit under there. >> Let's check. >> No. [Music] Hm. [Music] >> Banana yellow [Music] dragon fruit, grapes, [Music] apple. [Music] Thank you. >> Wo! Number two. >> Wow! Another digit found. >> Yay! [Music] [Applause] A [Music] >> wa! Alex, these are balloons. Alex, let's count how many there are. One, two, three, four, five. >> Five. >> Let's find out what is inside. >> Yeah. >> Wow. >> Wo. >> Next one. >> Are you ready? >> Yeah. [Music] >> What is it? >> The red one. >> Yeah. Wait. >> Wo. >> You want to try? >> Yes. I'll be careful. >> Be careful. >> Wow. >> Wow. Look, Alex. >> Number three. >> There is just a few digits to find. >> Yeah. [Music] We will not find the number anywhere. >> We need to look carefully. >> Alex, I found it. >> But you have to get it out of there. La. [Music] Yay. Wow. >> Four. Yay. >> Four. >> All the kids are collected. [Applause] [Music] >> Yeah. We're still missing a jet. >> Alex, I have surprise for you. [Music] [Music] [Music] Oh no. >> Alex, come back. >> Oh no. >> See, Sophie, help. Help, please. Dasha. Alex, what happened? Slie, look. You have to run there. [Music] >> Google clockie. [Music] >> Wow. [Music] >> What did this button mean? >> Cool. Oh no. >> Ph. [Music] >> Wow. [Music] >> Awesome. Cool. >> Oh no. [Music] I got the key. >> Cool. [Music] Hooray. [Applause] >> Hey, Stephy, don't forget about us. >> Oh, I sash a shirt. >> Oh, no. [Music] Wow. [Music] I think I'm doing everything right. [Music] >> Oh no. [Music] Awesome. Yay. [Music] [Applause] Let's get out of here. before something bad happens. [Music] >> Oh my gosh. And look, I got the blue key. [Music] >> Yay. [Music] Oh no. What do I do now? [Music] Yes, it worked. >> Wow. Cool. Awesome. [Music] >> Yeah, you did it, Stephie. [Music] Run. >> Hey, it's mine. >> Give it to me. Give it to >> Give it to me. Hey, give it to me. [Music] Wa. [Music] Awesome. >> Wow. [Music] Woo. Wow. [Music] Wa! So bright. >> Stephie, don't play any dangerous. >> I see no danger in this. [Music] I think there's someone there. [Music] Okay. [Music] >> I lost my bracelets here. >> What? Hey, Maria, have you seen the mermaid here? Ivan, there can't be any mermaids in our pool. >> I know. Let's play sink or float and throw some toys into the pool. >> Yay! >> I found it. >> Nothing bad will happen if I play here a bit. >> Wow. [Music] Daddy, where are you? >> Daddy, you can't be here. Let's go. Come on, let's play. [Music] >> Huh? Lol. This is exactly what I need. [Music] What? Bullying in the sink. Okay, it will come in handy. >> Huh? >> Hello. Would you wrap my back, please? >> Stephie, get out, please. >> No, I want to stay and make friends with humans. >> Fine. Stay here again. [Music] >> Let's find out which objects sink and which objects float. [Music] >> Your plane is floating. >> Let's check the toilet. [Music] >> It's floating. >> How about this truck? [Music] [Music] Oh no, this is so dangerous. I have to help Dasha. >> H Oh, I know. I have to catch the mermaid and then I will prove it to everyone. [Music] Come on, little mermaid. I'll get you. Oh. Oh. Oh. Come on. [Music] A They tried to trick me, but I'll trick them instead. I've got a plan. I'm going to get you, little mermaid. [Music] >> What is it? Jail. Get me out. >> Aha! I knew it. A real mermaid. >> Get me out. I just wanted to be friends with you. >> I was right. Maria, Alex, come here. I caught a real mermaid. I was right. I was right. >> Somebody help me. Help. >> Oh no. Stephie is in the jail. I need to help her out. [Music] >> Oh no, my house is broken. >> Help. Help me someone. >> I need to save Stephie. Look. [Music] >> Wait. What's that? >> I told you, Stephie. I'm sorry, Dasha. Help me to get out. Trying. I'm trying. [Music] >> Aha. >> Oh no. I'm trouble too. >> Now I have two mermaid. >> Stop it. I just wanted to be your friend. >> You want to be friends? Okay, let's be friends. [Music] I'm free. >> Yay! Thank you for letting me out. Let's swim together. [Music] >> Always be friendly with others. >> All right, now bedtime. Let me go and grab you a book to read. Stay here. Here comes the fairy tale for my baby shark. Oh no. Where are my baby sharks? I have to find them. Wow. Let's find the sharks. [Music] It's time for shopping. First, I need to find X. [Music] What's next? Next is pumpkin. [Music] [Applause] [Music] Where is tomato? Here it is. Next is banana. [Music] The last one is pepper. Wow, it's such a long clue. >> You can go first. [Music] >> Thank you. >> Hello. How can I help you today? >> Very strange. [Music] Excuse me, Dasha. Have you seen any baby sharks? >> Yes, I stoked them in the store. >> Thank you. I will leave this just in case. Thanks for the clue. I have to find them. [Music] There's nobody here. Ooh, those naughty baby sharks. [Music] Buna petite. >> Thank you. >> Have a nice day. >> Yeah, you too. [Music] >> Wait, what is that? A shark with a vacuum cleaner. I should probably get some sleep. >> Grandma, have you seen my baby sharks? >> No, Ste, I haven't. >> Where did those sharks go? [Music] >> They were here. I can feel it. What's that? Is that a shark tooth? Yes. This is my first clue. [Music] [Music] I saw a shark. What's that? [Music] Just arrow. [Music] This is my imagination. [Music] Huh? [Music] What? [Music] >> Looks fun. I should join them. [Music] >> H What are you reading? >> The Cinderella story. >> They will marry. >> Hey, don't spoil it. >> Oopsie. Sorry. Hey, can I join you? That's enough exercises for me. >> I can't get past that level. Let me help you with that. >> Wow, that was amazing. Thank you. >> You're welcome. [Music] What's going on here? I was worried about you. You're all supposed to be in bed. Oops. Oops. Oops. Oops. Oops. Oopsie. We're just having fun. And they lived happily ever after. This is much better. Don't make your parents worried for you. [Music] >> Oh, guys, guys, hide there. Fast, fast. Hold on. [Music] Wait. I have an idea, but I need your help. [Music] >> Yeah. [Music] Now, let's run. [Music] [Applause] [Music] [Music] >> Gosh, Ivan, I have an idea. Help me out. >> Okay. What is it? >> Let's put the tires here. >> Okay. Aha. >> Faster. Faster. >> Yeah, >> that's good enough. >> Great job, guys. >> Let's run. [Music] [Music] Oh, I went faster. Come on. [Music] [Music] Look, we can use this lockers to block the front door. Come on. >> Yeah. [Music] Yeah. I have the lollipop. [Music] They left. >> I think they were just scared of us. >> Yes, we are safe. >> I'm so stressed out protecting this candy. >> Here, take this puppet. It should help. >> Okay, >> I'm not stressed out anymore. [Music] Someone is ringing the doorbell. Do you hear? >> Wait, look. After this, I'll go check it out. Hey. Huh? [Music] What is this? [Music] >> Maria, I need your help. We received a huge package. I'm coming. [Music] >> What a huge package. >> Hm. I wonder what's inside. Ivan, >> I don't know. Maybe someone sent us a surprise. >> Surprise? I hope it's a giant dollhouse. >> No, I hope it's a new ATV. >> Ha. [Music] Come on, fast. Look, look, look. We can use these balls to slow down the gorillas. [Music] You guys are lollipop. Let's go. Let's go. Come on. [Music] Na na na na na. We still got the lollipop and candy. [Music] >> The other gorilla. [Music] No, they stole our candy. I was saving her for that. >> Don't worry, Ivan. I'll call the police and they will catch them quickly. >> Hello. Police speaking. >> Three gorillas, yellow, pink, and green ones went in our house and saw a candy. We want you to catch them. Please. >> Yes, please. >> Don't worry. We will catch them. >> I need to print the photo of the criminals. Let's catch those criminals. [Music] Stop. Stop. Stop. Stop. Gorilla. Stop. Gorilla. These gorillas. Alex. Alex. Three gorillas are running towards you. Stop them. Okay. Stop now. [Music] Aha. [Music] >> You can't break the law. >> Mhm. >> Here's your property. Thank you for your service. >> And don't eat so many sweets. It's bad for your teeth. >> Where is Luke? >> Oh no. >> Aha. >> Old sock. >> Ew. >> Come on, let's go. >> Luke, let's play in this place. >> Why is this here? >> Where is Luke? >> Oh no, the door is open. Dasha, Alex, Stephie, come here. [Music] >> Guys, what's happened? Our dog is missing. >> Guys, Luke ran out. >> Oh no. >> He's probably in the house. >> Okay, let's find Luke. >> Luke, where are you? Where can this dog be? I have to think like Luke. Maybe Lucas is hungry and he went to find some food. Oh, I know. I have to prepare Luke's favorite food. [Music] Very strange. I have to look more funny. That's what I need. [Music] Okay. >> Why dogs even like it? >> I have your favorite food you >> This looks like a popcorn. Maybe Luc isn't there. Huh? [Music] >> Maybe Luke is taking a bath. Nothing here. Maybe it's [Music] suggest the robots. Where are you? Luke. Aha. This is Luke's favorite toys. Maybe he's inside. >> Woohoo. Oh, I found Luke toys. Did anybody see him? >> No. Did you see Luke? >> No. Now. >> Okay. >> Maybe you Mr. Stitch. >> I didn't see Luke. I just read fairy tales. >> Hey, doggy. Are you here? >> Luke. Luke. H. Look. >> Nothing. Let me check the other side. >> Okay. Huh? He's definitely not here. I only found this old sock. Here. >> Any luck? Did you find Luke? >> No, I only found his toys. >> I only found his sock. >> I know what to do. We have to print posters and put them outside. Maybe it will help to find Luke. >> Brilliant idea, sister. Let's get into it. >> Done. Now I need to print it. Okay. Our lovely dog. Okay, guys. You go that way. I'll go that way. Come on. Let's go. [Music] >> Luke. Luke, where are you? [Music] >> Me and Alex couldn't find Luke. >> Me neither. >> Where is Luke? I didn't find him, too. >> Did you hear that? >> Yes. >> Let's go check it out. >> Oh, look. Look here. >> Look, we found Luke. Woo! [Music] >> Guys, love and take care of your pets. >> What is >> Oh, so many balloons. Guys, stop. I think this is it. [Music] [Applause] >> 3 2 1 go. [Applause] [Music] >> What is this, >> guys? Look what I found. An invitation to Dubai Safari Park. >> Kids, where are you? >> Huh? [Music] There's so many things. >> Hey. Huh? >> M. You forgot something. You can't go without me. Sorry, Dad. >> Welcome to Dubai Safari Park. >> Yay. >> We're going to have such a great day, Jason. >> Yeah, especially the zebras. >> You're excited for them? >> Yeah. >> Hey, Jason, look who's here as well. Why don't we say hi to them? >> Okay, I'll say hi. >> Let's go. >> Let's have some fun. >> Let's explore the behind thescenes package all together. Oh, hi guys. >> Hi. Hi. >> Jason, you can't do that. It's not nice. >> I'm sorry, guys. It was just a joke. >> No worries. Would you like to explore the Dubai Safari Park with us today? Sure. Let's go. >> Okay. >> Let's go, Alex. Hello. Hello. >> I've got a better idea. Uh, no. No. Yes. >> Wa. [Music] >> Why don't they want yummy? >> Maria, you cannot bring your own food. It will feed it to the animals. The animal caretakers give them a specific diet and they cannot be fed by regular food. >> I guess you're right. I'll eat it by myself. >> No, Maria, you will not. Swiss are not good for teeth. >> I'm so excited. What's next? >> Time to play with slime. [Music] >> Uh-oh. Daddy, you have to clean your hands here. Look, >> look, it's Lava. >> Lava. Look at >> Hey, no running across the bridge. We are sorry. [Music] >> Limmer. [Applause] >> I think they want us to feed them. >> He's so cute. >> Look how you need to dance. >> I like to move it. Move it. I like to move it. Move it. >> Huh? Alex, Stephie, do not tease the animals. Okay. >> Sorry, Dad. >> Okay. [Music] >> Wa! [Music] >> Wa! Look at him. >> Wow. >> Let's feed the chameleon. [Music] >> What a petite. His tongue is so long. Let's shoot a fun video with a snake from my channel. [Music] >> Yes, I did it. >> No shooting videos with the snakes, Ivan. It's dangerous. >> Oh, sorry, Dad. I didn't know. >> Wow. [Music] Look, rhinos. >> Don't be scared, Maria. >> Feeding animals is so cool. >> Stay here. Stay here. Stop. Stop. Stop. You can't use that. Use this proper brush. >> Okay. [Applause] [Music] Let's try to feed him. >> Nicely done, kids. Elephant loves it. >> Jason, would you like to shower the elephant? >> I'd love to. Let's try. >> Wow, this is so fun. >> Oh, guys, need to hurry up. Our next stop is Safari Journey Bus. Let's go. Sarah, Jason, Ivan, Maria, Stafy, Tasha, Alex, where is Alex? Alex, >> never climb the fence. It's very dangerous. >> Sorry, Daddy. >> Okay. >> Wait, look. >> Wow. >> What? >> What? >> There's a giraffe on the bus. >> No way. But [Music] [Applause] >> I want to sit next to the window. >> Is my place. >> No, I want to sit. >> I want >> I want to sit. I want to sit. >> Sasha, Stafy, Alex, stop. Stop it. One passenger per seat. Oh, here. >> Alex, here. >> Yeah, >> that's better. >> Yes. >> Wow. Oh, wow. >> Wow. >> Hi, King. There's a giraffe right there. He's so tall. >> Wow. [Music] >> I don't even know what the name of this animal. >> I know what the animal is. >> Gazelle. >> Wow. So beautiful. I got to take a picture. [Music] It's so bright. >> Maria, stop. No flash photography. >> Sorry. [Music] >> Stafy, do not knock on the glass. >> Oopsie. >> You can just wave. [Music] I'm very hungry. >> I want to eat really much. >> Hungry? Actually, I got some snacks. >> Keep in mind, eating so much sweets is very unhealthy. >> Huh, >> kids? >> Oops. >> You can't eat so much sweets. No littering in the bus. Clean it up. >> Sorry. Okay, we'll clean it up. Come on, guys. Good job, guys. Let's go. >> Guys, I really enjoyed visiting Dubai Safari Park. >> Me too. Me too. >> Yep. It was fun. Guys, you must visit this place. Actually, Dad, maybe I should celebrate my birthday in Dubai Safari Park and dine in the wild or try jungle capture. >> We'll definitely think about it. But if you promise to follow the rules, >> I promise. I promise, Dad. >> Get your tickets now at the official Dubai Safari Park website. And don't forget to follow Dubai Safari Park on social media. >> Help! Help! Today we're going to study about bugs. >> Okay. >> This is an ant. [Music] >> This is a bee. Wa. And this is a mantis. >> It's lunch time. >> Where have all the bugs gone? Help [Music] me. Help. Help. Help me. >> Oh no. D needs our help. [Music] >> The house is full of bugs. I don't know what to do. >> Daddy, we will save you. [Music] I need to head. >> Poor daddy. >> See you. >> Guys, we have to save our house from bugs. >> Uh, we have to split up. >> Let's collect all the bugs. 1 2 3 go. [Music] >> There should definitely be bugs here. Wait, did you hear that? [Music] H Did you want to eat all my fruits? M. Huh? Gotcha. [Music] Hey. Huh? >> Hey, Bob. I know you're here. >> Huh? There you are. Did you want to wash your hands? [Music] H. [Music] Aha. Did you want to hide here? [Laughter] [Music] I need to check this room. Maybe you're here. Oo football stadium. [Music] >> No. Aha. I think I found the musician. [Music] Huh? Huh? [Music] These are not bugs. They're ducks. [Music] I think I found something. [Music] I will not share my room with you. Yeah. H. [Music] [Applause] >> Aha. [Music] You're not our pet. >> I think I hear something. [Music] Huh? Found you. [Music] Hm. [Music] Aha. Such a big bug. Aha. I will find you all. [Music] What is that smell? [Music] Huh? [Music] I think you don't belong here. [Music] OMG, [Music] this bug is enormous. How do I even catch you? Wow. >> Uh-oh. [Music] Okay. Bye, I guess. [Music] >> Wow. [Applause] [Music] Just look how many bugs we have collected. >> Let's learn more about bugs. This is a rhinosaurus beetle. This is a grasshopper. Their whiskers are logged into their bodies. >> This is a bee. It has five eyes, but it cannot see red. This is a mantis. >> Mhm. >> Let's build a tower of insects. [Music] >> Okay. [Music] [Music] Yeah. >> Wow. [Music] idea. [Music] We need to find Alex and Dasha. >> Oh no. [Music] Woohoo. [Music] Wow. [Music] M we need to find [Music] M. [Music] [Music] Oh, banana. Yummy. [Applause] [Music] [Applause] for you. Uh-oh. [Applause] [Music] [Applause] Doo doo doo doo doo doo. [Applause] [Music] Wow. Wow. [Music] Wow. [Music] Wow. >> Wow. [Music] >> Wow. [Music] [Applause] [Music] >> Wow. >> Wow. >> Nice. [Applause] [Music] Yummy. [Music] Oh. [Music] Wow. [Music] [Applause] [Music] catch her. >> Uh-oh. [Music] Uh-oh. >> Oh no. [Music] Uh-oh. >> Ah, Maya, help. >> Uh-oh. Oh, yes. Oh, no. Woohoo! We saw a strange woman here. Heat. [Applause] [Music] [Applause] Heat. [Music] Huh? [Music] Wow. Woohoo. Yummy. Yummy. Uh-oh. [Music] Uh-oh. [Music] [Applause] Uh-oh. [Music] [Music] [Applause] Oh yes. Wow. Woohoo. [Music] [Applause] [Music]",
    "start_time": 0.8,
    "end_time": 7378.859
}