{
    "video_id": "e5UX6ezGm5o",
    "channel_url": "@vaniamaniakids",
    "transcript": "Money, money. Oh no. >> Sty, your baby's crying. Oh no. >> It's okay, my baby. Please stop crying. Sh. >> Grandma will hear you. Oh, perfect. This is much better. Finally, no. Subscribe, please. Hey, Stafy. Oh, I have an idea. [Music] [Music] It's okay, baby. Don't cry. >> Let's make a grief for the baby. Okay. >> Wow. [Music] Done blankety. [Music] Let's put the baby in this creek. Okay. >> Thank you, Alex. Huh? It's grandma. Let's go to the bed quickly. >> Oh, no. [Music] That was really close. >> Yeah, Alex, nap time now. [Music] [Applause] >> Oh no. [Music] >> Oh no, not this again. It's okay, baby. Don't cry. [Music] Oh, maybe the baby is hungry. I don't know. I'll be back. Huh? [Music] Shh. [Music] Oh. [Music] Don't cry. Don't cry. >> Alex, I have food. >> Yeah. Nice. [Music] >> This one is for daddy. [Applause] Oopsie. >> I don't think baby likes it. Let's try some milk. [Music] Baby is falling asleep. [Music] [Applause] >> Oh no. >> Casey. Alex, it's nap time. [Music] Have a nice sniff, Stephie. You too, Alex. So uncomfortable. [Music] Huh? Again. [Music] Oh no. Stop crying. Stop crying. So bad. Oh no, >> my baby's crying too. >> I think the baby just pooped. Wait, I have an idea. [Music] Huh? Where are you going, Alex? Maybe they need to poop. Oh, yes. [Music] Wow, [Music] >> it's worked. >> It's grandma. >> Oh no. >> Let's go, guys. >> Stop right there. >> Oopsie. Sorry, Grandma. We're supposed to be in beds, but we're playing instead. Okay, go to bed now. You can play after your nap. >> A nap helps you rest and feel full of energy to play and learn all day long. [Music] >> Good night, Alex. [Music] >> I can wait. What's wrong, Alex? Are you scared of the dark? >> Yes. >> Don't worry. Monsters are not real. It's all your imagination. [Music] >> It's all my imagination. >> Oh no. [Music] Oh no. [Music] >> Wake up. Wake up. Wake up. Wake up. >> Alex, you again. >> I can't sleep. I'm afraid of the monster. >> Don't worry, Alex. Let's go check it together. [Music] There's a monster with red eyes. >> Oh, Alex, this is not a monster. It's your favorite toy. >> It's just a toy. >> Yes. >> You must remember this, Alex. Monsters don't exist. >> Okay, Ivan, >> don't be scared. Good night. >> Oh no. >> What is this? [Music] >> A monster. A monster. I wake up. Wake up. Wake up. >> What? Alice, >> I can't sleep. There's something under my bed. >> It's okay, Alex. Let's go check it together. [Music] >> It's under the bed. >> Oh, Alex, it's just a car. Oh, it's my car. [Music] >> Okay, Alex, it's time for bed. Let's go. [Music] Good night, Alex. [Music] [Music] Oh no. Help me. Help! Help! >> What's wrong, Alex? >> There's a scary monster in the closet. >> What? There's no monster in your closet. >> Is it a nightlight? >> Yes. See, there's nothing to worry about. [Music] You must remember this, Alex. Monsters don't exist. >> Can you sing for me, please? >> Aw, sure, Alex. Twinkle, twinkle, little star, how I wonder who you are. I'm not afraid. [Music] Monsters don't exist.",
    "start_time": 0.8,
    "end_time": 591.5600000000001
}