{
    "video_id": "SHRLsnmyX68",
    "channel_url": "@billieeilish",
    "transcript": "I'm dying. I'm actually dying. It's a video, Christina. Oh, it's a video. Trevor's [ __ ] up right now. Oh my god. Wait, wait. It's unsafe for someone over the age of 30, but I'm trying. I did nothing. No, I'm gonna I'm actually going to break my knee. Um, let's go to a show. [Music] Yeah. Hey. Oh, I take a video through the hole. Close. Yes. Oh, [Music] okay. 4 3 2 1 go. [Music] Oh my gosh, that's my mom in a forest in Amsterdam. In the woods trying not to get a tick. I don't think they have ticks here. You are so pretty. I love you. My gosh, what beautiful weather. My dad. What's that camera? Yeah, watch out in your head. Ow. Oh, that's a terrible sandwich. Terrible sandwich, by the way. Really terrible. You did. It started blank and then there's been all this, but now it's twice as much as it was in 23. That's very moving. Hey, my dad's going to cry. Oh, whenever. Wow. Isn't it amazing what nature does? It's a video. So cute. [Laughter] boy. Too too high. You just did it. You just did a jump. Can you do it? Do it. The a jump. [Laughter] Oh my god, that's so funny. Hello, Billy. [Music] Have you heard that before? No. You've never I probably heard it on Glee. No, that they did. What? What? What? What? Wait, wait, wait. It's dry. All right, Lauren just dropped her phone fully into the just right into the water. Down it went. And then our our hero. Where did our hero go? Oh, there he is. He just fully dunked himself under water. Water. The ice cream sign. Where? Where? Can we get ice cream? Oh my god. Oh my god. Oh my god. No. No. Natural dogs. Terror. Really bad. A really really bad [Laughter] How are you doing that? [Laughter] [Music] [Applause] [Laughter] [Applause] Do yours. Do yours, Judah. [Music] [Music] Can't. You're like an ink. Sorry. She's growing fine. She down the street of support and feed. Wow. [Music] I'm ready. Stand by for starter show in five. Hey, [Music] [Applause] [Applause] [Music] [Applause] Well, the lights rolled. I know. We were all up there like then I take I took my ear and was completely Yeah. Oh my god. Let him see everything. I'm just kidding. Age long mystery. I had to work on it with Apple so many times. Those do not look that good. What's happening? Oh, I love this. You having fun? Yeah. 30 minutes. So, we need to get off this. Don't record me telling people what to do. Too late. Why? Cuz I'm already recording. No. Why? Why not record? I'm already recording. Why would I Why would I be saying why don't record that? Absolutely. Wait. [Laughter] Abe has worn these pants every single day for the past six months. Did you get that for me? That's so that was sort of like a pudding with pudding. Hello doggies. [Music] Oh my god. I You don't see him? Oh, I see it. He's not going to get dizzy. I need to Google this. O, go, buddy. There you go. Shut the hell up, babe. Find a toilet. God, what the hell is going on? The next morning, the corners of my mouth. Solo can't do it either. [Music] Hi, you're awesome. How are you? You can go to the right again. I'm stalking. Yeah, there it is. There it is. A Oh my god. There. Hi. Love you so much. Endlessly. Lauren, do you want to go look at it? Philly wall. I wish I could just go up there. [Applause] [Music] [Music] Does she go with you every time? Really? You like to hang out? [Music] Hi 4 3 [Music] [Applause] [Music] [Applause] Are [Applause] [Applause] you heat? [Applause] [Music] That was a video. [Applause] [Applause] [Music] [Applause] We're going. We're going. Guess where we're going. It smells really good. Where are we going, Ava? Burger out. You like that? girl. Good morning. We left when it was gonna tell you. God, that's [ __ ] funny to me. Holy [ __ ] Good morning. It's a video. [Music] Seems like something I would absolutely hate. You would not like this. Oh my god. Can I tell you a fun fact about that flavor though? Here she goes. Update the flavor. I think they do cuz I wanted to use it up. Oh my god. Oh my god. Oh my god. You look like the tin man. Oh, you can. Oh, you can.",
    "start_time": 2.8,
    "end_time": 796.92
}