{
    "video_id": "ONuu78PLd7U",
    "channel_url": "@talkingtom",
    "transcript": "Welcome to Talking Hank's Adventure Guide. Today I've left my cozy island, and I'm headed for the open seas! Okay, I'm not there yet, but I will be soon. So get ready for a spectacular sea adventure with me, Captain Hank! Awk! Capitain Hank! Talking Hank's Adventure Guide! Yeah! \"How to go sailing\" If we're going on a spectacular sea adventure, we need to get this boat moving. But safety first. No matter how good of a swimmer you are, if you're on a boat, you should wear a life jacket. That's better. Now... let's get this boat moving! Some boats can be moved by paddling. Some use other methods. But this boat has a sail, so all we need is some wind, and we'll be on our way. Huh? Hmm. No wind. Well, maybe I can... We're on our way! There's nothing like the feeling of sailing over the sea. I do have to make sure I avoid any obstacles. But the sea seems clear. Sailing is a wonderful thing! So wonderful it's making me dizzy. I'm sweating too. What's going on? Oh, boy, the whole world is spinning. I think I got... Seasickness happens because your body feels a different kind of movement than your eyes are seeing. If you get seasick, don't- don't panic. Try to distract yourself from feeling sick. And nothing distracts me more than a nice sailing song like this... ♪  Sailing the sea, sailing the sea. Captain Hank is sailing the sea! He went on a trip on his ship. The sail is tight, the wind is right. Captain Hank is gonna explore A faraway land and a distant shore. And now he's sick no more! ♪ This really was as spectacular sea adventure. Now, before we land, let's hear some sea wisdom from Admiral Sock Puppet. Sock Puppet's gonna tell us what we learned! Yeah! Aye, aye. Today we learned you can move a boat by paddling. But wind is even better if you have a sail. We also learned that getting seasick is no fun. Try to distract yourself with a song! That's good advice, Sock Puppet! I guess today we really got our sea legs. Looks like the Elephant wants a ride. What do you think, Sock Puppet? Should we go again? Awk! Go again!",
    "start_time": 2.066,
    "end_time": 201.441
}