{
    "video_id": "kwW3d1jgTlM",
    "channel_url": "@beastphilanthropy",
    "transcript": "I got five YouTube creators to compete against each other in this Albertson store. Each of them will earn points by competing in seven challenges. And the one who has the most points at the end of this video will win $200,000 for charity. Welcome to the first challenge. Oh my gosh. While wearing these goggles that give you almost no visibility at all, each contestant must make it to the other side of the aisle by walking on the floating cliff bars. If they fall off wall crossing, they will have to restart until they do make it across. The first person to make it across wins the highest amount of points. Also, one more thing I forgot to mention. The floor is lava. So, I'm going to take it slow and easy and just try to get to the finish line without having to reset anything. All right. Okay. Oh, shoot. Yeah. All right, baby. Let's go. I need to just drown everybody else out and just focus. I'm not going to win. I thought I had a strategy, but I guess my strategy was stepping on the lava. I'm so annoyed. Just a dumb mistake. I'm frustrated. All right, I got to pick up. I feel like they're behind me. Wait, did I make it? I made it. Oh my god. You got it. You got it. Wait, can I just jump? You can. Maybe. A cliff bar hates to see me coming. God dang. Oh my god. I only have two points. I have to come out first because if I don't, I'm going to be last. This next challenge might not be the fairest for some of the contestants. Oh my. Okay. Wait, there's a time limit. Look, 3 minutes. Next is the Zoa energy drink challenge. They will have 3 minutes to stack Zoa cans as high as possible. Whoever has the tallest tower at the end wins. You're so much taller. You have such an advantage. I can't even reach that wall. I mean, I'm both the tallest person here and a building creator. Yeah, you're This is going to be embarrassing. Sorry. My hands have been so shaky, too. This is not okay. Oh my gosh. They're all nice, but you know, I'm trying to win this. Oh my gosh. I think Sarah, she's playing this innocent card. If I just keep getting second place and Sarah doesn't get first place, we're in the lead. And that's good. We not really move that fast. You know what I mean? You go a little slow here. I should have played with more Legos as a kid. Oh no. Oh my god, that went by so fast. Oh my gosh, I did not expect that. Calm down. I'm literally shaking. Like, I need to just calm down and focus. I'm doubting myself, not going to lie. No. No. Dang it. Trying to decide whether to just keep it as is or try to put more on. I'm going to stabilize the base and if one of these guys get taller, then I'll add more on. 28 seconds. We have less than 30 seconds left. I can't go up anymore unless I just try to do one on the end. No, that's not good. That's not You know what? I'll take the L on this. I'll take the L. I'll take the L. I'll take the L. I'll take the L. Let mine go. I'll take the L. Let it go. It was You have to let it go, Rebecca. You can't keep holding it. Wait, it didn't. Oh my gosh, I feel terrible. Does that count? I won it until yours fell over and crushed mine. David should have had first place. Rebecca's tower fell into his and it made me have second place. Okay, sorry. It fell over there. Theirs was so much taller than mine. Like there was no way. Hey, it's okay. It's part of the game. And I feel like Beast Philanthropy is really setting that precedent for creators to help make the world a better place. Now that I'm in a space where I can actually compete on behalf of a charity. I can't believe that girl. There's no way. For this challenge, whoever presses their buzzer first gets a turn. There are 12 possible combinations, and you will each go one at a time. picking two numbers that will match the pictures behind and you'll receive two points for every combination you guess right. But if you guess wrong, you will lose two points. 17 and five. Yes. Yes. That's what we needed. I'm still second place. I'm still good. Sarah's the still the target. Uh 11 and 22. This challenge turned out to be more difficult than they expected. Oh no, I'm done. So, the contestants decided to work together to minimize the risk of losing too many points. If everybody wants to go, it'll still be rapid fire, but if no one wants to go, we'll have to go down the line. We have to go down the line and we'll sacrifice ourselves. 21 and 13. Oh, yeah. Good job. Good job. 17 and four. Nice. Oh my god. Sarah is so lucky. Five and 16. Oh, she got it. Wow. You got to definitely be in the finals. Oh my god. What the hell, man? Two and 18. Give me something. There we go, baby. Let's go. I'm on the board. I'm on I'm on the board. I'm on the board. I'm on the board. 15 and nine. Yep. Nice. I knew that one. Oh, okay. Go, go, go. I'll I'll take one. I I haven't gone. She's like, I have so many points. Well, we said we were going down the line and I want to honor that. Sarah's the one to beat right now. I think we all should be looking at her and watching her because if it comes down to it, she's going to get so far ahead of us, we won't be able to catch her. 22 and 7. I love that. 22 and 14. I think she got it. She got it. I might be wrong. I don't remember. I don't remember. Seven of 14. Let's go. All right, I guess. No one else is happy. Okay. 20 and 22. Oh, the Okay. Okay. Six and 22. Nice. What? Unbelievable. How nice. Good job, Rebecca. That was That was rough. All right. I feel like these past challenges I've been doing so good because it's like a lot of skill. This is literally just kind of like guessing. I'm skiing. And you people. Now y'all get to give some. The contestants will now be playing Triscuit turntable. To uncover the secret phase, they'll each take turns to guess a letter. Every correct letter earns a spin on the wheel for extra points. If they guess the phrase correctly, they will win the game and earn 10 points. But every time they guess the phrase wrong, five points will be deducted. I'd like to buy a vow. I All right, let's see it. Let's see it. Come on. Oh. Oh. That's just one. Give me the eye. Give me five. 0 0 zero zero zero zero zero. I felt bad because for Kenigra we were like kind of uh like rooting for her to not get any points. I think all of the contestants are feeling nervous because all of these charities mean a lot to us. So all of us really want to win. Can I get an E? Oh, that's a good one. That's good. That's good. About that one. Oh, two. Oh my gosh. Give me points. Oh, no points. Zero. Zero zero 0. Someone's back there. If she gets another five, I'm quitting. Come on. Come on. No. Don't zero. Yes. All right. I'll take it. I'll take it. I'll take it. This is a high stakes competition. Logically, it would make sense to, you know, just not stress, but it's hard not to. I really want to show up and perform. S. No. S's. Crazy, dude. What kind of words don't have any S's in them? A. Give me the green. There we go. Give me two. Give me three. Oh my god. I'll take two. I'll take two. I got Come on. Come on. Oh, come on. Oh, that's two. That's a two. All right. Now, give me a five. And then I don't need any more points after this. Come on. Yes. That's what I want. That's what I want. Let's go. Thank you for that. I need I would like to guess. Whoa. Wow. Whole grain wheat. What? Coming into this, I genuinely thought I was going to be the worst contestant and I somehow I keep winning and I'm just so grateful. I honestly thought I was going to lose. No, you didn't. I was. So, call Sarah whole grain cuz she's on a roll. Cut that one off. Was S not a good choice? I like this. [Music] We said this. Who came? Someone guessed it. Yes, someone guessed it. The next game is sparkling ice bowling. Each contestant gets one shot to knock over as many pins as possible. The one with the most knockdown wins the challenge. This is a chance for anyone to take the lead. At any point, the tables can turn. I just need to make second place so that I can be in the final round. Negra. Good luck, Negro. Let's go. Oh my goodness. Oh, okay. All right. A bowling pin hates to see me coming. Here we go. I don't I don't want to get hit. Oh. Oh. Oh my. Are you freaking Your boy can't bowl. Is there anything else to say? I mean, if I were David, I'd be pretty disappointed. Becca, you have so nervous for her. Okay. I'm nervous right now. Oh, that's good. That was straight on. That was straight on. I like that. I like that. I wish I was stronger. It makes me want to like lift weights or something. Watch the strike. Watch this. It's going to be a strike. Oh gosh. So much fun. Yeah. The strategy to run. That's good. I like that. Strike. Not bad. Not bad. Yeah, this challenge I need to win or at least get second place if I want to even think about going to the final challenge. Here I go. Here we go. Bro's just stalling. That's not good. What? That's not good. That's not good. I thought the guys were going to dominate this challenge and I cannot believe that neither of them did well. The girls were feeling, you know, Yeah. For one of these contestants, winning $200,000 means more than you think because they are not competing for themselves. So, I'm competing for nourishing neighbors. They find the spaces where hunger exists and then work to provide food to those spaces to break the cycle of hunger. I'm going to be donating the money to American Cancer Society. I chose Sharing Excess. What they're doing is working with everyone that they can to make sure that the food that we just waste go to the people that needs it. I'm competing for Salvation Army. They help with the homelessness in America. The charity that I chose was Hope for Fertility. It gives grants to families who are unable to have children on their own. It's not about me. I have to win for the charity and for this cause. Sharing excess. I am going to win. Next up is the Uts Chip Taste Challenge. They will each be blindfolded and given five flavors to taste out of the 10 options that were provided to the contestants. a correct guess and you get five points, which means there is a possibility of earning 25 points in this challenge. It is now anyone's game. I feel the texture. This is sour cream. [Music] Watchmant a smell. You know, I don't think it was quite spicy enough to be red hot. So, I think I'm going to go with sweet heat barbecue. Dude, this is like a memory game. Okay. Hot honey. It's hot honey. This is the the sweet heat barbecue. I'm going to go with sweet heat. Oh my god. I'm going to go for one more. Sorry. I might be here all day just eating this. Tastes so good. I'm going to go with Hawaiian sweet heat on that one. Final answer. Another day, another disaster. Let's get after it. That's a pickle. If I've ever tasted one, I think it's fried dill pickle. The dill pickle one. That's fried dill pickle. Fried dill pickle for sure. 100%. This is my favorite challenge. This is my favorite challenge for sure. Cheddar sour cream. [Music] Oh, it's got some kick. Oh, dude. I'm going to go red hot. Red hot. I'm feeling very confident that that one is a red hot. I The crab chip. I don't What even is the crab chip? The crab chip. Yeah. Mike's hot honey. [Music] Now my mouth is burning. Maybe that was red hot. I don't know now. Honey barbecue. I feel like that last chip just blasted my tongue. I got to kind of I'm going to go with sour cream and onion. I don't remember, but it's the first sour cream that he said. Okay. I'm pretty sure that one's sour cream and onion. I'm going to go with the crab chip on this one. I actually feel pretty confident in this. It's It's been going well. Regular sour cream. Sour cream and onion for this one. I actually feel pretty confident in this. I'm gonna go with the crab chip. Salt vinegar. Damn it. Cheddar's sour cream. Final answer. That was harder than I thought. And with that, the finalists have been decided. Sarah will compete against Patrick in the final challenge for the $200,000 grand prize. But as always, there will be a twist. I'll be so so happy if I win because it means that I represented such a good cause and it means that I did something good for the world. I'm just excited. Every time the challenge starts, she's quickly analyzing and she's trying to throw everyone else off. Right now, don't pay attention to Sarah and whatever she says and try to beat her in the next challenge. We're almost there. Since I got to win, I might have to screw someone over. This is the Fastables decider. They are now playing for a massive $200,000 prize. No. There are two buzzers, split and take. If both contestants split, then the money is shared 50/50. If one chooses split and the other chooses take, the splitter gets nothing, and the one who chose take gets it all. If both press take, they walk away with nothing. The $200,000 will then be distributed between the other three contestants. What are you thinking here? I don't I don't know what I'm thinking. $200,000? I know. It's a lot. It's a lot. This charity is kind of close. I know. I heard your story. Near and dear to my heart. So, what made me say yes to doing this challenge is because of the charity that's involved with it. My dad passed away with liver cancer and it was horrible and I just want to give the money towards something that is near and dear to me. And I believe that, you know, hopefully with the money we could help try to prevent as many losses as we can. And um it's now or never. It's just so hard cuz it's like I know. I know. I I don't know what you're going to pick either though because it's like a part of me thinks that you would share it with me cuz you know how passionate I am about this, but a part of me is like after hearing your story like why would you not take it all? Right. I mean I did lose my dad to to this horrible cancer and uh I really want to like help this organization a ton. I've made my decision. We could lose it all. Okay. [Music] I knew you didn't think I was going to go. I'm so grateful. I'm so happy to be involved in this and was able to represent such a great charity. I'm so It's still just insane to me that I was able to I was able to win. Guys, we just got $100,000 to my choice of charity. This is insane. This is the least I could do to everybody that's suffering right now with cancer. And um it was all for my dad, too. You know, like what an insane experience. I'm so happy right now. We want to take a moment to say thank you to Beast Philanthropy and everybody else that's involved in this. We just found out that we get another $100,000 and instead of us taking that donation, we decided to split it amongst all the charities because they all matter equally. So, David, Kenigra, Rebecca, come in here. These are for you guys. These are for you guys. For all charities, this was by far the coolest twist ever. And to know that they decided to split it between the charities is something that I will never forget. I'm so happy that as hard as I lost out there, nourishing neighbors can still take a win. And I'm just so stoked to be part of this. I'm so thankful for Beast Philanthropy. I am just [Music] big thanks Beast Philanthropy. This was an amazing twist. This was amazing. Right. I want to give a special thanks to Albertson's for helping make this video possible as well as some other brands that stepped up in a major way like Cliff Bar, Zoa Energy, Halman, Best Foods, Triscuit, Sparkling Ice, UTS, and Fastables. Also, go check out the charities that the contestants were competing for. All will be linked in the description. And as always, shout out to your eyeballs because by watching these videos, you allow us to do projects like",
    "start_time": 0.24,
    "end_time": 1119.8400000000001
}