{
    "video_id": "O6wTcrhkw4o",
    "channel_url": "@beastphilanthropy",
    "transcript": "In Ghana, sadly, countless children are abandoned and fall victim to being captured as slaves to the fishing industry. And after speaking with countless locals, I came to the heartbreaking realization that being rescued is only the beginning of their struggle. Even for those fortunate enough to escape, years of relentless abuse and exploitation have left them in desperate need of medical care. Yet, there are no adequate facilities to provide the treatment they so urgently require. So, we made it our mission to build a brand new surgical center in the heart of Ghana to combat the lack of medical care to help survivors like these two brothers, Ernest and Richmond, who were sold as slaves after being abandoned by their parents and only rescued at the age of 16. When our mom and dad give birth to us, we don't fight them and they leave us. As slaves of the fishing industry, the two were separated and had to survive on their own, not knowing if they will ever see each other again. Sometimes they will try to push you inside the water. If you don't know how to swim, then you are going to die. 20 of my friends, they all die. But luckily, the two brothers were rescued by the Ghana Make a Difference Foundation, also known as GMAD, an organization that combats child slavery here in Ghana. I was very happy that I come to GMAD because what they have done to me, I'm appreciate of that. As it stands, GMAD serves as a shelter for these abused and orphaned children by breaking the chains of their past and providing them a life of love and care. The goal is to rehabilitate and educate them so that when they grow out of adolescence, they are capable of making a new life for themselves. When the brothers were saved, they luckily did not need any medical attention, but this was not the case for many of their peers. So, to find out more, I met up with Austin, the executive director of GMAD, who explained the issue with medical care for the survivors that need it. They have to travel to an overcrowded hospital 30 minutes away from the GMAD compound and wait in long lines of over 600 people. The bottleneck's always been O space. We've never had enough O space. You know, the volunteer surgeons here will perform over 200 major medical operations in 4 and 1/2 days. After seeing so many people wait in line the whole day only to be denied treatment, we immediately began the construction of a new surgical center in the GMAD compound. While the project was underway, I spent more time with the kids and got to see the abundance of life here at the compound. [Music] I'm so happy I met Mr. I was just in shock, but luckily I met a celebrity here one day. The kids that come here to gone to make a difference, they own their stories and it's really powerful because of what they've went through and what they've overcome. Seeing all the warm smiles on each of these children's faces, one could never have guessed that they come from such devastating backgrounds. If it wasn't for Cory and Stacy Hoffman, who founded GMAD 12 years ago, none of this would have been possible. When we first came to Ghana, we realized that there were so many children that had no one to advocate for them. Children need families to thrive. As the construction of the surgical center was nearly complete, we sat down with some of the volunteer surgeons to hear more about their experiences. I think yesterday when we showed up, we had probably around 600 people here begging to be seen. And so, it only takes one time to see that and to not come back. The doctors and surgeons that volunteer to help here often see cases that are so severe they've literally never seen it before in their entire career. You see, you know, we have 60 individuals here that are volunteering their time. They pay their own way. They come back and they want to come back because they feed off the energy of the people and the the manner in which they are so resilient and they overcome. That's what's infectious is watching the people just deal with the hand they've been dealt and and make the best of it. So, after months of construction, we had finally finished building GMAD's new surgical center, and it was now time for the big reveal. In the name of Almighty God, the Son, the Holy Spirit. Amen. With this new surgical center, GMAD will now be able to provide treatment to more children and families of the surrounding community. Now, we have the ability to perform surgeries to folks that need it. [Music] After the grand opening, the folks at GMAT held a celebration outside their newly built surgical center. And the very next night, they were able to save one of the very first patients to be treated in this facility, a young girl named Mary, whose legs were so deformed that she could barely walk. But luckily for her, the New Beast Philanthropy Surgical Center provided the surgeons an adequate facility where they could fix her legs. Mary will be one of many whose lives will change for the better now that the surgeons at GMAD have more capacity to help others. If you'd like to be a part of the incredible work that GMAD is doing, I need you to click the link in description and donate right now. Seriously, with your support, GMAD will be able to get more kids out of slavery and provide them with the love and care they deserve. Go away, Wasp. I'm trying to help people. You should consider it. It would mean a lot to them, and it would honestly mean a lot to me. I also want to say a special thanks to Ox Blue for donating the time-lapse cameras we used in this video. You guys are awesome.",
    "start_time": 0.08,
    "end_time": 326.56
}