{
    "video_id": "otYsUtcZddA",
    "channel_url": "@stokestwins",
    "transcript": "These are conjoined twins. >> I'm Sona. I'm Luna. >> They've never spent a second apart in their entire lives, which means they do everything together. We'll be spending the next 24 hours with them to learn about the struggles of what life is like when your body isn't just yours. We're literally about to meet the conjoined twins for the very first time. I'm super excited. >> Hi. >> Oh, where's the other one? >> Nice to meet you guys. Right away, we noticed how just walking for them had to be a coordinated movement with perfect teamwork. >> Are you okay? >> Okay. Okay. Did only you feel that when you got hit or did you both feel it? >> So, to better understand the struggles they face as two humans who are forced to share one body, we planned 10 activities to experience with them. Starting with their morning routine. Wa! You guys share a nice room. Sona and Mona start their day like most people do by brushing their teeth. >> One handles the toothbrush and the other squirts the toothpaste. Then it's time to hit the toilet. Can you guys both tell when you have to use the restroom? Or is it sometimes only one of you has to go? >> How do you guys shower? No, >> only with the shower. Shower. >> As the conjoined twins were finishing their morning routine, there was one last thing Tanner had to know. >> I actually had a really important question about the toilet. Do both of y'all push that stuff down? Hey, hey, you want to know that stuff? >> Yeah. Next up, we headed to the kitchen to see how conjoined twins eat. Because even though they share one body, they still have two mouths to feed. >> Oh, dang. Stop cooking breakfast, >> dude. I feel like they secretly hate each other. I feel like they definitely get along. No, one twin always secretly hates other. At the end of today, we'll definitely be able to tell because we'll be putting them through a lie detector test and also testing to see if they can actually feel each other's pain. >> So, I got a question. So, how do y'all like your eggs? >> Cuz I like them raw. [Music] >> Oh my god. Wait. I don't know why I thought they were going to sit in two seats. >> One seat. >> One seat. >> Two twins, one ass. So, what happens if one of you decides to eat a lot? Will you both get fat or just half of your body? >> I don't know. >> You tell. >> Do you guys like candy or no? >> Yeah, this is our candy. I want to know what you actually think. >> Oh, this is my favorite candy. >> Really? >> I don't know. You're lying. You're lying. >> Why is that? >> Wait, wait, hold on. Did you taste that when he ate it? Could you taste it? >> No. >> Do you guys eat twice amount of food compared to the average person? >> Yes. >> Wo. It was at this moment the conjoined twins gained Tanner's respect. >> So, does that mean you guys share a stomach then? >> We don't know. >> Do you guys want to get a body scan to see what organs you share? >> Yeah. >> Okay, we'll find out. We headed out to get them a full body scan, and the results would honestly be shocking. But first, Sona and Mona had a surprise of their own. >> Wait, you guys drive? >> Yes. >> I really want to see if they can drive us. I don't believe they can drive. >> Sona and Mona actually owned this car. And despite their uncommon body type, they somehow managed to fit into the driver's seat. Whose foot is the one driving? Is it yours? >> Yes. >> Your foot? >> Ah, so you're the driver. >> Yes, I are the driver. >> He's useless. >> Not useless. He's the putting gear. >> I can't believe this. We're literally getting driven to the doctor's office twins right now. Do you guys have one or two licenses? You guys share one? Just one? >> Yes. You guys really do share everything. >> Yeah. >> So, y'all got one or two? >> What? Who that? >> Next thing we knew, we arrived at the doctor's office for the conjoined twins body scan. We wanted to find out what internal organs look like on two humans who share one body and if it would ever be possible to separate them. >> That's going to be tough. So after the scan, we'll be able to tell exactly what their anatomy looks like, what organs they're sharing, and most importantly, if separation is even possible. >> Are there any external organs you guys share? >> Your hand is very soft. >> Wow. >> The results begin by the end of the day. I'll give you guys a call. >> So much. >> While the doctor loaded up the scans, we decided to run our own experiments. a pain test. Can you guys feel each other's pain? >> Sometimes. Sometimes. >> We're going to find that out for sure. >> We prepared five items that will inflict increasing levels of pain so we can see just how much pain it takes for them to both feel it. Level one, feather. Mona, can you feel this? >> No. >> Sona, can you feel this? >> No. >> Level two, fork. If you guys can feel this at any point, let me know. >> No. >> Level three, ice. >> Moda, can you feel this? Oh, they both felt it. >> What did it feel like? >> Ice. >> Level four. Rubber band. >> Oh. >> Oh, they really are connected. >> Oh, you fell. Another man. >> Well, this next one's over. Level five. Alan, are you sure this is a good idea? 3 2 1. >> For our next activity, we took Sona and Mona shopping to see how they find clothes that fit their unusual body type. You guys want to shop here? >> Yes. Yes. >> And clearly, one was way more excited than the other. One is shopping. The other one is Patrick. But finding shirts that would fit them was literally impossible. Okay, next one. >> We came up empty at every single store. Don't worry, guys. We're going to find something. Alex, I think I have an idea. So, we took him to a tailor shop that makes custom clothing for every body type, even conjoined twins. >> What would you guys actually wear here? >> This is those two. >> They got good fashion. >> Finding shirts, jackets, and vests are a big challenge for Sona and Mona. Every shirt they wear needs to be custom made. >> This is like double the measurements. >> Maybe double measurement, you know, a little something lower. But what the conjoined twins didn't know is that we were secretly getting their measurements for a big surprise at the end of this video. >> All right, I've booked everything I need. Thank you. We wanted to continue shopping, but as the mall got busier, the conjoined twins couldn't get away from the uncomfortable stairs of other people. There's a lot of people. We tried to get away from the crowd, but no one seemed to have any respect for their privacy. So, we came up with a new plan. You guys want to go see a movie? >> So, we headed to the movies to escape the crowds, but we had no idea if Sona and Mona needed to pay for one or two tickets. >> Two tickets or one. >> Even the workers were stumped. So the ticket lady called her manager to find out if we needed to buy one or two tickets and she said yeah >> because we now know conjoined twins can feel each other's pain. We also wanted to see if they have the power to read each other's minds. So twin telepathy is a myth. But is conjoined telepathy real? To test this we're going to ask you guys a question and you're going to answer at the same time. First question, soccer or basketball? >> Twins in YouTube. Locious or fruit blocks? >> Fruit blocks. >> Hey, available in stores. Who's fatter, Alex or Tanner? >> I'm not the fat one anymore. >> Guys or girls? Nice. >> Yeah, >> that's just the way I like it. >> Say anything. >> Hey, we definitely didn't know to say that. >> Now that we know conjoined twins have a shared mind, we wanted to see if their four arms give them a physical advantage at the arcade. So, Sean and Tanner challenged them to see who can win the most tickets in 10 minutes. >> All right, you guys ready to play some basketball? >> Yeah. Let's do it. >> Yeah, boy. >> All right, it's going to be Tanner versus the Twins. Let's go. >> 3 2 1 go. >> Shooting at the same time. It was like competing against two people. So Tanner would have to make twice the shots to win. >> Totally unfair. Why did we do this? >> Next up, air hockey. Oh my god, this is crazy. How is this? Oh my god, you're losing. How is this possible? >> Go, go, go. >> Having four arms and two brains made Sona and Mona pretty much unstoppable at every game. Imagine having four hands to hit every button on a reflex test or having six legs for Twister. >> They got built in. >> But the arcade game the conjoined twins were best at was foosball. >> They practically had a hand for every handle. >> Damn. I can only control two. What is it? I was a there. I don't want to be here anymore. >> So, it's no surprise they had way more tickets than Sean and Tanner to pick out whatever they wanted. That's not fair. That's all we get. And you get a PS5. >> But there was one last game they had to play because we wanted to see if their mental advantage could match their physical advantage. Twin versus twin chess. [Music] Oh my god. We were starting to understand what a day in the life of being a conjoined twin looks like. But the biggest questions still remain. Now it's time to ask you guys questions that everyone is dying to know. Except you two won't be able to lie since you guys agreed to be hooked up to a lie detector. Have you ever kept a secret from your twin? >> Yes. >> That's the truth. But what what secret were you guys? >> Sona, >> do you think you're the more attractive twin? >> Yes. >> Oh, okay. >> You guys look the same. >> Yeah. >> Sona, do you ever get annoyed by Mona? >> No. >> No. That's >> really trying to hide that. >> Oh, you don't like hanging out with Sona sometimes? If you guys had the choice to separate except it would mean losing each other, would you do it? >> Not except not. Not not separate. >> No. Now, is that true? >> Yes. >> That's the truth. Yeah. >> Wow. >> You guys are the ultimate twins. >> You guys love each other. >> Yeah. >> Wow. >> More than you love Sean. >> Yeah. Oh, >> now it's our turn to switch roles and answer one of their questions. >> Do you think we hate each other? [Music] >> And you want to answer at the same time? >> All right. 3 2 1. No. >> That's twin hug. Twin. Twin. Tomorrow morning, we'll finally be getting Sona and Mona's body scan results back from the doctor. But before we get to that, we wanted to see how conjoined twins sleep compared to the average person. >> We both asleep first. >> I sleep first. >> You sleep first. >> You stay on your phone. >> Yes. Do you guys wake up at the same time? >> No, same time. >> Oh, wake up same time. >> Yes. >> What about when you guys have to go pee at night? Oh, >> that means if he doesn't wake up, you'll just use the restroom in bed. >> Yes. >> Lucky for Mona, Sona chose not to pee on him that night. But for all we know, they may actually share a bladder and a dick. Now that it's morning, it's finally time for the results of the scan and to find out the proof about their condition. And you guys have never seen an X-ray of yourselves, right? >> No. >> All right, you guys ready to see them? >> Yes. Yes. >> All right, here it is. [Music] This is you guys. >> As you guys can see here, you guys each have your own spine and it fuses into one joint spine. I know a lot of people are actually skeptical if conjoint twins are even real or not, but there's proof right here. Based off of the body scan, you guys obviously have your own brains. You guys also have your own hearts and lungs. >> Yes. But you guys share kidneys, livers, a stomach, which means if one of you guys eat, the other twin will also feel full. That's not the case with us. I've gotten a little bigger. Yeah, seeing you like that makes me full. Oh, and uh Sean, they actually do share one. >> Two for the price of one. >> I'll take that. >> One more thing about the results. >> Listen, >> separation would not be possible. Yeah, >> because you guys share too many vital organs. >> If you guys were to separate, not one, but both of you wouldn't make it. [Music] >> Oh, wow. Anyways, guys, we actually have a very special gift to give to both of you. Remember when we took your measurements earlier at the tailor? Well, we were actually secretly making you a custom tuxedo. All right, why don't you guys put this on so you can be ready for the other half of the surprise. And let's just say things are about to get spicy. So Sona and Mona need to look extra sharp. >> We set the twins up on a date with a pair of identical twin girls. >> You guys are very handsome. >> Dang, they look good together. >> Wait, wait, wait, guys. Me or them? near them. >> Yeah.",
    "start_time": 0.16,
    "end_time": 910.88
}