{
    "video_id": "sp5wggWA5Xo",
    "channel_url": "@stokestwins",
    "transcript": "Today we're building a secret pool inside the world's strictest school. This place has the most evil teachers, the strictest rules, and the harshest punishments. But the worst part is these students are trapped here with no summer vacation. And it's all because of the principal. So we're building four secret rooms to bring summer to the students. That is as long as we don't get caught by the principal first. Move. What is this game? >> No games. [Music] This is like prison. Now get to class. >> All right, class starts in 2 minutes. So the plan is to hide in the bathroom until the hallways are clear. That way we can skip today's classes to search for secret rooms while Tanner covers for us disguised as one of the students. Starting with science class. >> Hold on. >> You must be the new kid. >> Class, get out. We're doing the pledge. I pledge al to the principal race. I promise to follow his every rule. All right, guys. The hallway should be clear. Come on. Come on. But we'll need to be extra sneaky to avoid getting caught by the principal, who is constantly patrolling the halls for students to terrorize. Hey, look. The principal's office. No one's in there. This office is weird. You'd have to be crazy to build a secret room in a principal's office, which is why it's the perfect place. Nope. Guys, I'm starting to think there's not a secret room in here. I got to look somewhere else fast. Shoot. I definitely think I just broke the mirror. Wait, what? I thought I heard a crack. What if there was something behind it? There's a secret room back here. I was right all along. The principal's office is the perfect place to build my secret sports room. Cat, on the other hand, wants to build a secret snack room where the students can eat all of their favorite foods. >> Oh, cafeteria. I can build my secret room here. There's tons of room for snacks. Oh, this would be perfect for me. Ew. What is that? >> What was that? >> Oh no. Oh no. It's the principal. [Music] H fool's not doing it to you. >> Cat needs to find her secret snack room fast cuz the school food that these kids are eating should be illegal. >> What's up, new kid? You don't know our pledge. >> I do know the pledge. The flag. >> Well, you know everything. How do you help me teach this class? By getting in the tub. In today's class, we will be learning about fear. Bring in the snakes. >> Huh? >> Snakes. >> Pay attention, class. >> Wait, don't do this. >> Holy. That's a big one. >> Stay with me. >> Meanwhile, Allan was searching the school library for a spot big enough to build an entire indoor secret pool. Wait, what is this? Oh my god. These are literally the most secrets for a school. I can definitely find a secret room using this. I got to get out of here. >> Wa! This door is huge. What about a secret underwater gaming room? And I like your way. >> Yeah. >> But it wasn't long before Shawn realized a huge problem. >> I can't hold my breath that long. I got to look somewhere else. >> All right. Looking at the blueprints, there should be a massive secret room behind this locker. And based on the note here, this should be the combination to the lock. Moment of truth. Oh my god. This place literally hasn't been used in a long time. Wait a minute. This room is supposed to be twice the size. And this wall shouldn't even be here. Let's see if I can find the resident secret room. I got to just kick through. I don't even have a weapon. Oh my god. Okay, so this is the actual secret room. I mean, I've never had a secret room that's two stories. My plan is to build a water slide that connects both floors with a massive secret pool at the bottom. This room will literally be the best secret room ever. With class coming to an end soon, Shawn was scrambling to find a spot to build a secret gaming room. I'm still wet. But wait, either I'm getting thick or these stairs are hollow. M, it's hollow. Wait. Building a secret room underneath the stairs is perfect cuz it's so hidden and no one will be able to find it. But first, I need to cut the carpet and check underneath to see if my secret room even exists. There is something underneath here. Now I know for sure that my secret room does exist. Now Cat is the only one left who still needs to find her secret room. So, she decided to search the one place students never go, the teachers lounge. Oh my gosh, this place is huge. And look, there's a vending machine. I can get something for free. Okay, I check it. Ow. I think I just broke the wall. Wait, it looks like there's a hole back here. Oh my gosh, there's room back there. This is going to be my secret room. And I'm going to use this vending machine as my secret entrance. >> Cat used her girl power to find her secret room. But Tanner is going to need to use his fat power to protect himself from these snakes. >> I think a snake just pooped on me. >> Wait, I think I'll just >> And that class is the smell of fear and poop. Go to your next class. >> What's the bell? I have to hide in the hole and put the vending machine back. >> Did we learn our lesson, big boy? Are you going to remember our pledge? [Music] Everyone get to class now. If you're not in class when the bell rings, I'll put you in detention myself. [Music] >> Hey, are you guys almost done? I don't know how much longer this can take. >> Hey, T, calm down. Calm down. We're almost done. Just hang in there. I'll do my best. Let's get down there. Oh, I'm late again. >> All right, let's go to the workshop so we can find our secret rooms. Let's go. And we have to hurry because Tanner was already at his breaking point and the remaining classes are only going to get worse. >> Welcome to B. This week is power week. The first exercise we're doing are sprints until your legs fall off. On your marks, get set. Run. Come on. Faster. >> While Tanner gets in some much needed cardio, the rest of us arrive at the teacher's workshop. >> Guys, come on. The tools are right there. Let's go. Wait, wait, wait. Hold on. So is the teacher. He's got headphones on. He can't hear us. >> Yeah, but if he sees us, he's probably for us. >> You guys, if we get caught, somebody's going to have to distract him. >> I'll be the bait. A lot of men find me desire. >> Yeah, Sean. Let's just hope he doesn't get to that. Let's go. [Music] [Music] Come on, Sean. We got to go. Now that we have the tools we need, it's time to start building our secret rooms. All right, first step, I need to cut a hole big enough that I can get in and out of. Okay, lucky for us, the tools we found in the workshop made building our secret entrances a breeze. >> Dang, my secret room. It's bigger than I thought. There's even more space back here. I could build myself the best secret gaming room. The students are going to love it here. Meanwhile, Allan was still exploring the giant secret room he found inside the lockers. Okay, I'm going to use the locker as my anchor point for the rope. All right, let's hope this works. Hell no. Wait, what? Oh my god, this place is so much bigger than I thought. How am I supposed to build a secret room this big without any help? >> Okay, wait. I know who to call. >> Steve, what's up? Oh, >> listen guys. I need you two to sneak into the school supply room and grab some decorations for our secret rooms. >> Got you. Easy. >> I got you. >> See you guys soon. Be careful. [Music] >> All right, moment of truth. Oh my gosh, this place is huge. I'm thinking I can put some turf on the ground, some soccer ball on each side, a basketball hole there. I'm going to turn this into the ultimate super sports room. >> Look how big that hole is. And I haven't even used my girl power yet. Oh my gosh, look at all this room. Look, my plan is is to turn this room into a secret snack room. Just wait until you see when I'm done. I think somebody just walked into the room. Oh no. What do I do? What do I do? >> What's going on? Something's not right. >> Oh no. They're using the vending machine, but I can't have them know that the vending machine doesn't work. Oh, I have to use my backpack. [Music] Damn machine. That was way too close. >> If you want to sleep around and not get caught, we need to blend in. We need those keys. You distract him and I'll ambush him from behind with him. [Music] Do you be here? Let's go. Let's go. [Music] We got our disguises and the keys to every room at the school. While Bach and Zach headed to the supply room, Tanner was struggling to keep up with the younger kids in PE due to his massive size. >> Keep going. Come on. >> I can't. >> Let me show you how it's done. We're not giving up. >> You just picked up one of the students. Bastard. >> I'm going to throw up. This guy's a psychopath. >> Come on, guys. You don't want to be like this, huh? >> That's right. First place, baby. >> Yeah, that's the way to do it. >> Hey, are you okay? Can I get some water, please? You want some water? >> Sure. Here, have some water. >> All right, everybody, make your way to the wrestling room for the test. >> Little did Tanner know, PE was only getting started. Now that we've completed our secret entrances, Cat called everyone for a meeting in the teachers lounge so we could figure out our next move. Why do we agree to meet here if Cat's not even here? >> I'm in here. Wait, how did you do that? >> Yeah, this is sick. This is your secret entrance in your secret room. Yep. >> Oh, guys, guys, guys, guys. Listen, listen. We need to figure out what to do cuz I don't have anywhere where I can get supplies to decorate my secret room. You guys are stressing for no reason cuz I already called Zach and Bon. So, anything you guys need, let them know. This must be a supply room that I was talking about. Okay, let's supplies. Come on. Monitor. Okay. Uh, cast room. Cas [Music] now the pool right there. The TV. Let's get out of here before someone sees us. Okay. Let's go. Okay. For the final test, if any of you want to pass this class, you're going to have to take me down. >> So, which one of you is it going to be? Guys, which one of you guys are going to do it? >> Shouldn't you do it? You're the biggest one here. >> What? >> Yeah. [Music] >> Yeah. That's what I call a take down. Come on, get up, boy. I am not finished with you. >> Tanner might not make it out of this class alive. Luckily, Zach and Boach were delivering supplies we needed to finish up our secret rooms. >> Ow. Now that I have all the supplies I need, it's time to turn this into the best secret sports room. >> Now it's time to decorate. I'm going to have cool bites, snacks, a bunch of games. Just wait until I'm done with this place cuz it's about to be the ultimate secret gaming room. So, I have my court here that I know is going to go in the middle of the room. But before that, I have to build a slide going into the middle of the room so I can get myself and everything else down there. >> This is going to hurt you a lot more than it's going to hurt me. >> My back. >> What's the matter? Your back hurts? >> Yeah. >> Here, let me help you fix that. [Music] Watch out. Watch out. Let me fix that. I needed that. You know what? Everybody passes because of him. Now get out of here before I change my mind. Okay, I am almost done with my room, but I think I already know my favorite part, and that is the ice cream machine. Look at all the flavors I got. >> All I need to do now is add a few more decorations to finish my secret snack room. >> Now that I'm done, it's time to show you my secret room underneath the stairs. Welcome to my secret gaming room. And I got some LED lights, a nice carpet to stay cozy. And I got my favorite snacks, the Stokes Twist Brew Block Sour, and over here I got my PC to play Roblox. And I can watch anything I want on here, too. I can't believe I turned my secret room from this to this. Now that I'm done with my secret room, it's time to check everyone else's. But in order for me to not get caught, I need a disguise. How do I look? >> All right. Now, I can sneak around the hallway as a teacher. And Shawn will have to be extra sneaky to avoid running into any of the teachers or the principal. >> What will it be? Steak or lobster? A bowl? >> Coming right up. [Music] Wait. You [ __ ] >> Next. >> Meanwhile, Allan had managed to accomplish the impossible. Not only did he build an entire secret room, he also built an entire secret pool inside of it. My secret room is almost done, but I still need to test the slide and make sure it's safe. Three 3 2 1 Oh my god. I went down way too fast. Okay, I just have to add a few more decorations to my secret pool and then it'll finally be done. Back in the cafeteria, Tanner was learning that lunch here wasn't about food or socializing. It was about torture. Hey, new kid, come here. You know what? You look like [Music] the perfect person to cut the ends off my sandwich now. Yes, sir. I don't know why they created ends on sandwiches. I hate them. They're dry. They're crusty. They're nasty. I just like the center. Here you go. Hold up. >> Now have a seat. Sit down. I'm so hungry. I can actually eat this. >> That's it. Lunch is over. Get to class. And if you're late, you're getting detention. Hurry up. Hurry up. >> So, I just got done customizing my Cedar Sports room. For the entrance, I replaced the old mirror with this new oneway mirror. [Music] [Music] Damn, I'm good-look. Wait, is this in here? Maybe that Jenner isn't good for nothing after all. [Music] Oh my gosh, that was way too close. Next up on Tanner schedule is art class where he'll be learning the art of painting realistic human portraits. Once again, class, today we will be painting portraits of our beloved principal, Mr. Graves. All right, it's time to check out Cat Secretar Room. Cat, it's me. Sean, is that you? >> You look crazy. What are you doing here? >> Stop all the way here to check out your secret room. Come on. My room is just the best one yet. >> Dang, this place smells tasty. >> Yeah, this is my secret snack room. You can lick the cotton candy off the wall. >> Yeah. Oh, and we have all these snacks. >> And now for my favorite part, the ice cream machine. >> Oh my god, not so much ice cream. What? I'm happy that I turned my secret room from this to this. >> Hey, K, I'm proud of you. The kids are going to love it. All right, I got to go check on the other one. You supposed to be here. You don't look familiar. What's your name? >> Uh, Benjamin Franklin. >> Back problems? >> Yes. >> You got to stretch it out, my friend. >> Be well. Hey, >> Alex. >> John, what are you doing here? >> It's so big in here. I thought you're one of the teachers. Oh, no. It's just this guy. While you're here, let me give you a secret room tour. Okay. This is a secret sports field. I have turf for the flooring. I have a basketball goal. Unlimited basketballs. >> Give me them balls. >> My favorite snack. And pretty much anything you can think of. I can't believe I was able to turn the secret room inside a principal's office from this to this. But before Shawn visits Allen's secret pool room, let's see how Tanner's art class is going. [Music] >> That looks great. Good job. Wow, that's wonderful. I love it. >> Hey, new kid. >> You think that looks like me? >> I'm sorry, Pis Grave. I'm not done yet. I'll finish it right now. No need because I'm going to finish it for you. >> Okay, I only have Alan's secret room left to check out, but I have a feeling that it's going to be the best one. >> Just in time, dude. I literally just got done. This room is nice. Yeah, it's the best secret room, right? Mine's more fun cuz I get to watch some videos. Before we actually go down the slide, let me give you the official room tour. When you walk inside the lockers, you'll see this giant water slide that goes all the way down to my secret pool. Oh, hey, this thing looks like it goes down fast. We should go down together, Sean. No, no, no. Not holding hands. What the hell? 3 2 1 go. [Applause] [Music] Okay, let me show you the rest of the room. I added LED lights in the pool, around the pool, and a ladder so we can go in and out easier. And the best part, I can literally swim and watch TV at the same time. >> Is this a wig? Wait, you look familiar. Are >> you that fat kid? Friends of those twins. They're not here building secret rooms, are they? >> Alan's cat. He's on the hood. Go hide. >> Thank you. Now I know I'm looking for four secret rooms. Take him to detention now. >> No. Please, not detention. >> I got to go. Oh my god. I got to go. John, hurry. Get out of here. Go. Go. We don't have time. Go. >> Someone just walked into the office. Those kids are doing this again. >> Alex, Allan, Sean, Cat, I'm coming for you. When I find you, you're going to wish you were dead. [Music] >> I'm going to find all four of you in the next hour because I have a date tonight with myself. >> You got this. Welcome to detention. Oh, hell. >> When I finish hunting them down, you can join them in the graveyard. >> Please, let me out. I'll tell you where they're hiding. >> No need. I'll find them myself. I forgot my keys. [Music] Wait a minute. Why do I look so funny? Is there something wrong with me? Did I gain weight? No, I'm perfect. So that must mean there's something wrong with this mirror. Gotcha. You really thought you could build a secret room in my office? >> How dare you? In my office? I thought I taught you a lesson the last time. More detention. More problems. I can't believe this. I give you no detention. Now get out of my office. >> Alex got found. Why would he build his secret room inside the principal's office? >> And now you stay right up there. One down, three to go. >> If Principal Graves can find all four of our secret rooms, there will be nowhere left for the kids here to experience any summer fun. >> There you are. Finally, I can use some help. >> Well, I was just coming over here to check out some noise I heard behind the lockers. >> Which lockers? The one right behind you. [Music] There's nobody in here, but there's about to be. No, no, no. I got to do everything myself these days. That was way too close. Is somebody in the restroom? What was that noise? Out of all the rooms they could choose, they choose the janitor's closet. What the hell happened here? They got damage. useless. You can just stay in here. >> If that's how Principal Graves treats his own staff, I don't even want to know what you'll do to the rest of us. >> Those little brats think they can hide in secret rooms in my school. There's someone coming downstairs. Now, why is there water on my carpet? This is right. Is there a leak from the roof? >> Nope. >> Not my school. I can smell the fear within these stairs. What is that? Where's that light coming from? That must have been a mistake when I rushed earlier. I don't want to get out. He's going to kill me. Whoever is hiding in there, I just want you to know one thing. I herald the schools begin. And I Herald, you're in [Music] surprise. those super all these toys hiding these things from me. What do you think you're doing? >> Oh, yeah. >> I just have one question. Where are they hiding? >> No, I don't know. >> Can you come with me? >> You lock them up. I'll do anything. Shut up. Sean got found and Sean's room was like really good. >> That leaves me two to go. >> Where is everyone? Can I get some help around here? >> Is there anyone in here? [Music] [Music] Principal Graves, when I asked if anyone was in here, why didn't you answer me? I I was I was having a private moment. >> When I'm here protecting this school from FUD, you're in here taking a >> I'm sorry, sir. I'll go help. No need because I think you forgot to flush yourself. Fire wait. That felt good. There was only 24 minutes left until Principal Graves' hot dates, and he was starting to get restless. What happened to my dip and dots? They think they can hide from me. No, they're trapped here with me. Now, why would a sledgehammer be in a trash can? >> Oh, thank God. I want to use a sledgehammer. >> There's too many odd things happening in this room here for it all to be a coincidence. First, the dip and dots. Second, the sledgehammer. And most importantly, the vending machine. And in all my years, I've never gotten the wrong snack. I ordered Cheetos, but I got hot Cheetos instead. There's not even hot Cheetos in this vending machine. So, that must mean this vending machine is a secret entrance >> to a secret room. I'm coming in. [Music] You better say your prayers to me. Don't you go anywhere because I want you to bear witness my destruction of your creation. Oh, sugar. It's bad for you and all my dust. That felt so good. Now you come with me. >> It's literally just me. I hope you're not afraid of the dark. Get in there. >> Now stay in there and shut up. I found three secret rooms. There's one more and you can't hide forever. Alan, where are you? Not my school. [Music] And look at you sitting there useless. >> Okay. >> While they're building secret rooms in my school, >> why don't you have me look in here? You see >> anything at all? Or waste my time. >> With school almost out, Allan only needed to stay hidden for five more minutes. I've double checked everything. There has to be something I missed. Help. Shut up. I'm trying to think. >> Shut up. >> You know what? Get out of here. I said shut up. Wait a second. What is this wire? Is this a hose? Where is this going? What is this? I've never seen this before. That means there's a secret room behind this locker. When I'm done with you, this secret room will become your grave. [Music] It's not on my watch. Thank you, Zack. I appreciate it. >> I couldn't stop. I have to stick to the plan. Two stories. You built a pool in my school and you built a slide. How fun. Zack, I'm not done with you. Get out of here. >> You are going to go down that slide for me. It seems like you're trapped down there and this rope is your only way out. No. Why are you doing this? The truth is I am so lonely. All the other teachers are scared of me. No one talks to me. No one wants to be my friend. They think I'm unstable. I'm fit, a monster. They made me the villain, forcing punishment after punishment. And the better I became at it, the more they feared me, the more they hated me. I was the perfect disciplinarian, yet their greatest nightmare. A victim of my own success. And the crulest part, I don't even get a real name. No, they give me a joke. A curse in the graves. A name that means I was never a man. Some days I feel so alone. I could cry. But what would be the point? Not a single soul in the school would care. So if I am destined to be feared, then you and your secret pool will come with me and you'll take this truth to your grave. [Music] What the principal didn't know was getting caught was always a part of our plan. When Tanner called out our names, >> that one's okay. >> While the principal was destroying our secret rooms, Spock and Zach were salvaging the wreckage to build the ultimate secret room in a spot Principal Graves would never expect. So, all that time Principal Graves spent searching for us bought us the time we needed to help these kids enjoy their summer. [Music] Hello? Is someone there? Help me. [Music]",
    "start_time": 0.24,
    "end_time": 2213.7999999999997
}