{
    "video_id": "sPuDW_GhWuw",
    "channel_url": "@stokestwins",
    "transcript": "This is my twin brother, Alex, who weighs 100 lb more than me. And if he can lose 100 lb with the help of his team, I'll give them $200,000. >> We're about to look like twins again. >> But little did Alex know, this video would be one of the hardest and most challenging journeys he and his team have ever experienced. Before you start, there's a twist. If this other team here, who weighs identical to you guys, can lose the majority of the 100 lb first, then they win the $200,000 instead. >> This is about to be a crazy video. So, the absolute best way to lose weight is through a strict diet and strict exercise. First step, get rid of all the junk food. >> Damn, that's not my food. I think it was Allen's. I rented out this entire state-of-the-art sports facility for a week. It has a soccer field, a basketball court, and a tennis court. >> Cat's strategy is to keep the blue team constantly moving with fun physical activities. >> What you thought you were doing here, buddy? >> While Alex's strategy is the complete opposite, all about putting in the hard work. But this isn't all I have planned for the video. Every day, I'm introducing intense challenges that add money to the prize pool. Speaking of which, it's time to introduce the first challenge to both teams. All right, everyone, take off your blindfolds. >> For this challenge, I built a massive 50ft glue trap. All eight of you guys will run the stickiest race of your life. The first one of you to cross the finish line wins this $10,000 for your team. >> You guys all lay down and I lay down first. Just lay down first. I think we should let them get trapped and we just walk over to the right. That's an Albert Einstein IQ. That's an Alex Stokes IQ play. In three, two, one, go. Almost. >> After only a few seconds on a glue trap, both team strategies are completely falling apart. Hey, he's cheating. Do that. >> Yes. In your face. >> This is the slowest race I've ever seen in my life. Somebody get him off me. Why you doing this? Come on. You're going away. You just won red team $10,000 and they can take home. >> It's all in my leg. >> Red team may have won this challenge, but now it's time to see who's actually in the lead. Welcome to the first weighin. Oh, remember the first team to lose the majority of the 100 lb wins. Since both teams started at 750 lb, the first team to collectively weigh under 700 lb wins. Blue team, so in just one day, you guys lost 7 lb. Red team, step on a scale. You've lost a total of >> 6 lb. Yeah, >> guys, we got to step it up. You guys are only behind because Alex keeps gaining weight. >> He's going to lose weight. >> Alex is fat. >> All right, guys. Get some sleep. I'll see you all tomorrow for the next weigh in. >> It's day two. My team's behind. Go ahead. Lock in. >> You're not going to work. You're doing something wrong. >> Oh yeah. What the hell is that? Meanwhile, Cat is continuing her fun weight loss approach with >> basketball. Hell yeah. >> Sean, where's the balls? >> Yeah, Sean, you always have the balls. >> How can we go to a basketball game with no balls? >> Mess with me. >> That's what I'm talking about. >> Yeah. Come on. Come on, man. You guys, come on. >> Yeah. Damn. >> After a long day of heavy lifting and fun physical activities, it's time to introduce the second challenge. All right, guys. This might be the most brutal one yet. You'll be partaking in the most intense Togear game you've ever played. And the first team to pull the opposing team across the center line wins $10,000. >> I have a strategy, guys. Don't let Don't let anyone know. going to get dragged. >> We have to make sure to be like this and we have to keep doing our legs. All right. So, in Squid Game, they let the other team pull and we just hold our position. And after they tire out, that's when we start pulling. Everyone in position. On your mark, get set, pull. >> For whatever, stay strong. >> We're not getting dragged, so that's good. Shift forward. Hold on. When I say three, two, one, we pull. Okay. Don't you ever lean back. If you lean back, you fall. Three, two, one. Let's go. What did I say? >> It seems like they got better team chemistry. >> There's no way. >> That's what they want to see. They want to see you guys argue. They want to see you guys that looks like you lost me on your challenge, big boy. >> It's not to you >> that I'm sending them business. >> Let's see how much weight each team has lost after 2 days. Blue team, step on a scale. After 2 days, you guys have lost a total of 11 lbs. >> On a scale, >> you guys have lost 12 lbs. I'll see you guys tomorrow for the next weighin. This is start of day three teams ahead. Feeling pretty good, but we got to keep going. >> All right, guys. Whoever slaps the sticky note the highest wins. >> Come on, guys. Let's go. >> That sucks. I'll show you guys how it's done. >> That's right. >> Go, go, go, go. >> You try. >> Okay, Tanner. >> Ready? >> I'll give you $1,000 if you beat me. >> That's easy. Go. Come on, Tanner. >> Let's go. Let's go. Let's go. There is no way. There is no way. There is no way. [Music] Oh. Oh. Help. Help. Somebody help. Oh. Oh. >> What are you doing? >> No. Lose your [ __ ] Get out there. 1 2 3 4 5 Come on. Keep going. Come on. Go. Coincidentally, both teams workouts are getting them ready for the next challenge, which is right now. The challenge behind you is all about strength and endurance. But before I show you what it is, each team will pick a member to compete on their behalf. >> You know what? There's no way. Strength is me. But overall, I think the best of strength and endurance. All right, everyone, turn around and take off your blindfold. For this next challenge, you guys are going to be hanging 20 ft in the air. And whoever lasts the longest wins the $10,000 for their team. >> Let's do it. >> Hopefully everything you two have done in this video has prepared you for this challenge in three 2 way. The muscles don't come easy. Let's go. Let's go. >> Danny, you should have tried harder. >> We picked the wrong chicken. It's officially been 3 days since everyone started this challenge. Are you guys ready to find out how much weight you've lost? >> Blue team, step on the scale. Last time you guys weighed 739 lb. Blue team has lost a total of 16 lb. >> All right, red team, step on the scale. >> Oh my god. 19 lb. >> Which means you guys are 38% of the way there to winning to $200,000. And both teams will have to kick their training up a notch on day four because this next challenge will be a test of their cardiovascular ability. >> So, we're about to see who is fastest on foot. >> And clearly, it's me. >> I'm the fastest one. >> All right. In three, two, one, go. [Applause] >> Yay, you're bad. That's all bull crap. So jump roping is actually one of the best ways to burn calories and lose weight. And we're not stopping till we drop. Okay. >> You know, I actually get asked a lot if I miss being twins and looking alive with Alex. And the answer is honestly yes. But just seeing Alex struggle a lot sometimes because of his weight really really makes me want to help him because his quality of life would be so much better. carry my team on my back right now. Let's see if Alex can back it up in this next challenge or if he's all talk. We are now at a track field because for this next challenge, we're doing a 400 meter relay race. Each person on your team will run 100 m and the first team that crosses the finish line wins $10,000. >> You know, we're going to need a big lead, so it makes sense. I'll go first. Uh, okay. Okay. >> Just don't mess up the lead that cats give us. Okay. >> Don't worry. I can't run straight, but I'm going to do it for you guys. >> I think we started out strong with Manu, and then the fastest needs to go last. >> All right. The fastest me the fastest is going last. For the first 100 m, we have Manu versus Cat. For the 200 m, we have Shawn versus Bates. For the 300 m, we have Zack versus Bach. And for the last 100 m, we have Alex versus Tanner. On your mark, get set, go. Okay, go. Let's go. >> Oh, shoot. He's so fast. >> Go, go, go. Come on, man. Speed up. Go. Come on. Go. >> Go, go, go. Come on. Back. >> Wait. Hurry up. Go, go, go, go, go. Holy crap. Oh [ __ ] >> Go, go, go. Come on. Come on, T. Come on. >> Wait, what? How is Alex so fast? >> Oh, he's going to win. Go, Alex. Come on. Come on. Let's catch it up. Speed it up. >> Wait, who won? Who won? Was that me? We have to watch it. Hey, replay it. >> Oh, it's so close. Lift him up. Lift him up. Lift him up. >> Never mind. Never mind. It's the end of day four. Let's switch things up. Red team, why don't you guys step on a scale first this time? Don't break it. After 4 days, you guys lost a total of 26 lb. >> Yeah. >> Good stuff. Good stuff. Good stuff. Here we go. All right, blue team, step on a scale. >> Let's find out who's in the lead. You guys lost a total of >> also 26 lb. >> Both teams are tied. >> This could be anyone's game. Even though both teams are currently tied, the blue team is starting to seem divided over not having won a single challenge. >> This is about 200k. It's not about friendship or anything. I'm trying to win money, [ __ ] bro. >> I'm not trying to let me tell you, though. Hey, if you talk to us like that, guys, it's not going to leave us work out, though. >> Such a girl. >> I'm the only man in this group. >> It was at that moment that Cat knew a fun approach to weight loss was not going to work out for the blue team today. All right, so you guys do know swimming is the best way to burn calories, so why don't we move our gym underwater? What Alex doesn't know is that this is actually the perfect training for the next challenge. And meanwhile, Cat built the rage room for the blue team to blow off some steam. We've been losing so much and I'm actually pissed. >> Oh yeah, >> we've been losing so much. Are you >> ready? Here's the time to take out all your [Music] If you guys can beat me in a race, I'll give you guys $1,000. >> Alex is double your weight. He barely floss. What the [ __ ] No. All right, it's time to introduce challenge number five. And this challenge will actually be the toughest task of willpower either team has faced yet. All right, guys. Welcome to your next challenge. Each team is going to pick one player to hold their breath. And if they can outlast the other team, they win the $10,000. >> Well, I have the most experience in the water. Obviously, >> it should be me. You got it. >> You got it. Aquaman. Aquaman right here. >> I know that Sean's really good at holding this breath. We did this before. >> You don't know if I feel comfortable going there naked. >> You're not going in there naked. Sean, are you ready? >> Yes. >> Zack, are you ready? >> Never been better. In three, two, one, go. >> Come on. You got it. Come on. >> You're doing so good. >> Oh, he's chilling. Zach is chilling. >> Stay relaxed. Like we said, keep the heart rate down. This is so intense. [Music] I did it. Dang it. >> It's officially been 5 days since we started this challenge. Blue team, step on the scale. Last weighin, you guys weighed 724 lb. And this time you guys weighed 717 lb, which means you've lost a total of 33 lb. >> We'll be fine. Plenty of weight to lose on this team. All right. Well, red team, step on a scale and let's find out. Yesterday, you guys also weighed 724 lb. And now red team weighs 718 lb, which means you guys only lost 6 lb today with a net loss of 32 lb. One lb behind the blue team. What the hell are you guys doing? I'm pushing myself. My team sucks. I'll see you guys tomorrow for the next weigh in. It's day six and I don't know how the hell blue team's ahead, but I've been working my ass off. So, we're going to have to try something different. I think I have an idea. >> So, boxing is actually one of the best ways to lose weight. All right. Same rounds from the last. Ready? Mhm. >> Is that good? >> No. >> All right. Thanks. Come on. Your turn. While red team is hustling, the blue team is celebrating their lead with a welldeserved recovery day. >> Hey, put some work in there. >> Oh yeah, this is good. >> Ow, this kind of hurt. Wait, hold up. I want the strong big boy to massage me. You two swap. Yeah. All right, go ahead and put some muscle in. Oh my god, I feel the difference. Wait a minute. I think I have another bone rising that needs to be cracked. Watching Alex give everything to lose the weight he's gained was actually really inspiring. I just hope one day we can look like twins again. Anyways, now it's time for challenge number six. This next challenge could technically be the easiest $10,000 you've ever won because all you have to do is run, but you have to run longer than everyone else. Oh, each team will choose two runners to run for them, and the last man running will win $10,000 for their team. I'll let you guys strategize and pick your two runners. >> All right, here. >> Let's be real. Look at Alex. He's on their team. >> As team captain, I'm deciding it's going to be Boach and Tanner. You guys are going to be running. >> Okay, fine. All right, I'll do it. >> It's going to have to be Zach. You've been running on the treadmill every time we worked out. You have to do the running. >> Let's do it. >> I'm down. Let's go. Is everybody ready? >> Yes, sir. >> Now I'm winning this. >> On your mark. Go. Blue team. Get set. Might >> go. Go. Come on. Let's go. >> You got this. I'll win this for you guys. >> You almost fell there. >> Increase the speed. >> Easy. >> Oh, it is a little faster. >> No. I can do this all day. >> Not going down. >> That's right. Got to keep talking up there doing nothing. One more thing left. Boss, it's over. Come on, Bob. You got this. I actually have a little surprise for them. This is our new Stoke Swiss fruit block sour blue raspberry and cherry. Wait, we try it. >> It's so good. faster. >> You're getting too close edge. >> Get your head in the game. You got this. >> Oh my gosh. >> This is made with real fruit juice, zero artificial colors or flavors, and completely non-GMO. Another one. >> Where can I get some? You can literally get this now in Walmart, Kroger, HB, and thousands of stores. Or you can click the link in the description to order online. Speed it up. Speed it up. >> Keep running. Don't fall. I'm not going to fall. Who wants the $10,000? Come on. >> Oh my gosh. Look how sweaty he is. Come on. >> I love you, Ver. You got this. >> You just won $10,000 for your team. >> Yes. Alex, I'm sorry. Hey, in all honesty, he lasted a lot longer than I would have, so I can't be mad. It's day six weighins. You guys know how this goes. Step on a scale. >> Blue team, you guys lost a total of 39 lbs. Now, >> red team, step on a scale. You guys have lost a total of >> 41 lbs. >> Hard work pays off. Anyone could literally still win this. Both teams have survived six days of intense training and challenges. But these next few will be the hardest, most brutal ones they faced yet. >> It's morning of day seven and we only need to lose 11 more pounds to win this thing. I'm not taking a second off today. You guys are behind this. You're back. But Alex wasn't the only one who got up early to burn some extra calories. Come on, cat. She's got to be the reason why we lose. >> Dude, be positive. Be nice. >> Be positive, bro. >> Yeah. [Music] It's time to introduce the most intense challenge both teams will face yet. All right, everyone, take off your blindfolds. >> What is this? >> What's your name? This is the earthly hole. What? For this next challenge, all you have to do is keep these 500 lb pillars from touching the ground. Each of you guys will have to pick one player to compete in this challenge. And the person that can hold this up the longest gets to take home the $10,000. >> Okay. >> I've been working out this entire video before this moment. I feel like I got to do this. >> I got to do this. Tanner has won every single challenge. So, I think it should be Tanner. >> No, I think it should be me, right? >> No, Tanner. >> Okay, >> Tanner, are you ready? Let's do it. In three, two, one, go. Oh my god, >> Tanner, your time was 16 seconds. >> Oh, hell no. It was like a minute. What do you mean? >> I could do this in my sleep. >> Alex, this is actually way harder than you think. >> Okay. All right. Yeah. >> Okay, Alex, your time to beat is 16 seconds. And if you can beat that, you win another $10,000 for your team. Are you ready? In three, two, one. Oh my. I can't do this. I can't do this. You're back [Music] out of the world. Where's the time? >> Wait, wait, wait, wait. >> The time was actually 17 seconds. >> Let's go. A >> We're the only one that 200k, so it doesn't matter. >> It's about losing weight. >> That's right. >> $200,000 is better than 10,000 challenges. >> Are you guys ready for the weighin? >> Yeah. Blue team, when you're ready, step on the scale. So, last weigh in, you guys weighed 711 lb. Reveal the weight in 3 2 1. 699 lb with a total weight loss of 51 lb. Guys, guys, guys. Technically, you haven't won the challenge yet. If red team can lose 52 lb, that means they will have lost majority of the 100 lb. >> No way. >> All I'm going to say is these last few days there's no shot. Blue team has lost more weight than us. Red team, step on the scale. The last weigh in, you guys weighed 709 lb with a net loss of 41 lb. Reveal your new weight in 3 2 1. [Music] 72 lb. [Music] I thought we did it. I thought I lost the weight. This was the most intense and challenging physical and emotional journey I've ever been on. And even though I wasn't able to get to the exact weight I wanted to, I got to see all my friends transform themselves in only a week. So, even though I didn't win the money for my team, I'm more motivated than ever to continue my weight loss journey and lock in. When we hit 200 mil, I'll hit 200 lb. [Music]",
    "start_time": 0.24,
    "end_time": 1689.77
}