{
    "video_id": "7DlNBsZPjxM",
    "channel_url": "@kidibli",
    "transcript": "Heat. Heat. [Music] [Music] [Applause] [Music] Heat. [Music] Heat. [Music] [Applause] [Music] Heat. Heat. [Music] [Music] [Applause] [Music] Heat. Hey, Heat. [Music] Well, [Music] heat Heat. Heat. N. [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Heat. Heat. [Music] Huh? Are you Heat. Heat. [Music] Help. Huh? [Music] >> Ambulance. [Music] H. [Music] >> Huh. Aha. >> B. Bulldozer. [Music] C crane. [Music] D. Dump truck. [Music] Yay. >> E excavator. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] F fire [Music] [Applause] Huh? H. Aha. >> G. Garbage truck. [Music] [Applause] [Music] H >> helicopter. [Music] Ice cream truck. >> Jet jet ski. [Music] K. Kayak. [Music] >> Locomotive. [Music] M >> motorcycle. [Music] >> N newspaper truck. [Music] >> O liner. P police car. [Music] >> Wo! >> Q! Queen's coach. >> Ret [Music] [Applause] S. Submarine. >> T tractor. U unicycle. Vespa [Music] W wheel loader. X X X sleigh. [Music] >> Y >> Yacht. >> Wo [Music] Zeppelin. >> See you next time. [Music] [Laughter] [Music] [Music] We need to put the letters in the right order. [Music] A airplane [Music] speed builder. Yeah. [Music] C chicken. Ow. [Music] D dentist. [Music] [Music] Ah! [Applause] Ah! E elephant. Aha. [Music] F. Fire truck. [Music] [Music] G gorilla. [Music] Helicopter. [Music] Ice cream truck. [Music] [Music] Woo! Yay! Get [Music] Hey, kitchen chef. [Music] Yay! [Music] Lion! [Music] M monkey. [Music] Ow. [Music] Nurse. [Music] Oh, off-road vehicle. Huh. [Music] P police car. [Music] Wow. [Music] Cute. Queen's coat. [Music] Rabbit. [Music] Wow. [Music] X sweeper. [Music] Huh. Aha. [Music] T tractor. [Music] [Music] You underground minor. [Music] V set [Music] W for whale. [Music] Wo! >> X X leg. [Music] Wo, [Music] why [Music] D zookeeper. [Music] [Music] [Music] [Music] Oh 911. Come on. [Music] Yeah. [Music] Heat. Heat. [Applause] [Music] [Music] Yeah. [Applause] Woo. [Music] Heat. Heat. [Music] [Music] Yeah. Yeah. [Music] [Applause] [Music] Red means stop. Green means go. Always drive safe and help each other. [Music] This is a spaceship. [Music] Woohoo! [Music] All right. [Music] We placed one energy crystal. Let's search for the other four crystals. [Music] [Music] [Music] [Music] [Music] The moon's surface gravity is weaker because it is far less massive than Earth. Thus, things weigh less on the moon. [Music] [Music] We were on the moon. Now we're on Earth again. In our solar system, we have eight planets. Let's count them. Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune. See you next time. [Music] >> Now, let's have some fun with your monster truck. Yeah. [Music] [Music] Let's extend the obstacle course. [Music] Yeah. [Music] [Music] Hey. Hey. [Music] Yeah. [Music] Yeah, you can always have fun, but please clean your toys in the end. [Music] You did a great job. >> Yeah. [Music] Let's get food for the animals. [Music] Aha! [Music] [Music] Yeah. [Music] All [Music] right. [Music] Yeah. [Music] This is a sheep. [Music] This is a horse. [Music] This is a pig. [Music] This is a cow. >> A cow gives us milk. [Music] >> This is a hen. >> Yeah. [Music] A hen lays eggs. Yeah. [Music] People buy these foods from the farm to cook and bake with. Perfect. [Music] Yeah. Yeah. [Music] Yeah. [Music] >> Yeah. [Music] I don't [Music] [Music] Yeah, >> airplanes use wings to glide through the air, a bit like birds. [Music] >> Look, a helicopter. [Music] [Music] Yeah, >> they have spinning blades on top like a fan which push the air down when they spin. That makes them fly. [Music] Let's test your pilot abilities. [Music] [Music] Heat. Heat. [Applause] [Music] Great job. >> Yeah. [Music] See you next time. [Music] Let's practice sports. Let's start with soccer. [Music] Yeah. Yeah. >> Let's continue with bowling. [Music] Yeah, [Music] let's do cycling. Always wear a helmet and safety gear. >> Yeah. [Music] Let's play golf. [Music] Let's do hurdling. [Music] Yeah, [Music] let's play basketball. [Music] [Music] [Music] Yeah. [Music] Yeah, [Music] there is one last challenge. [Music] Let's play baseball. [Music] Yeah. [Music] Yeah, always stay active and healthy. [Music] Which vehicle do we need? >> We need a fire truck. [Music] Wow. [Music] Wo. [Music] Wow. Wow. [Music] Which vehicle do we need? We need an ambulance. [Music] Wow. [Music] Woohoo. Yeah. [Music] >> Which vehicle do we need? >> We need a police car. >> Wo! [Music] >> Wo! [Music] [Music] [Music] I'm Sorry, but I'm going to clean it up. >> Which vehicle do we need? >> We need a garbage truck. >> Wo! [Music] >> Wo! [Music] Wo! Hey! Wo! [Music] [Music] Hello. Wa! [Music] Which vehicle do we need? We need an excavator. [Music] [Music] [Music] Wow. [Music] [Music] This is a tractor. This is a crane. This is a dump truck. This is a concrete mixer. >> See you next time. [Music] >> Woo. [Music] [Applause] [Music] [Applause] Hello. Ah, [Music] because you wore your safety gear, you prevented injuries. Yeah, I'll make up for my mistakes and fix your car. [Music] [Music] Yeah, you learned that making up for your mistakes is important. Because of that, here is a car for you. Let's learn about traffic safety together. [Music] [Applause] [Music] Red means stop. [Music] [Applause] [Music] Green means gold. [Music] [Music] Yeah. [Music] Hat. [Music] Wow. [Music] [Music] You can always have fun, but afterwards you always need to clean up your Boys, [Music] stop, slow, and go. [Music] [Music] Great job. [Music] Let's activate the lights and sirens. [Music] [Music] [Music] Woohoo! Don't worry. Let's do a dental checkup. [Music] [Music] Yeah. >> See, you don't need to be afraid of dentist. We are here to help you. [Music] >> Let's fix it together. [Music] [Music] Yeah. [Music] Yeah. >> Don't eat too much sugar. Eat more healthy food. >> Yeah. [Music] No, no, no, no, no, no. I'm not very good. My meat doesn't taste great. However, I know someone who can feed you. Really? Yes. How about we go there? Let's go. [Music] >> Wow, look at that. Hi, my friends. It's me, Kitty, K I D I. And today we're going to go on a great adventure. We're going to learn everything there is to know about sharks and rays. [Music] Today we're at Nika, the biggest aquarium in Europe. I hope you're ready cuz I know I am. >> Let's go. Now the thing is sharks are fish. So they have gills, but most importantly, unlike most fish, they have a dorsal fin. You know, that's why we do this symbol when we talk about sharks while diving. And you can really, it's really easy to recognize them. And if you see one peeking through the surface, that means you should run like now. [Music] [Applause] [Music] Now, sharks can be very impressive because they have so many teeth. They can have up to 14 rows of teeth, each just packed. And the most interesting thing is, you know, when you grow up, your baby teeth fall out and your adult teeth come in. Well, they don't have baby teeth. They just have infinite amount of teeth for their entire life. They will lose teeth and then they will come back and ah that really hurts. Well, yeah, they're here to eat food. Yeah, it's painful. Stop. Stop. Learn to be a good boy. I'm hungry. Anyway, I think it's time to see what they actually eat. Why do they need so many teeth? [Music] Ah, look. We're in the kitchen because it's important, you know, to cook and prepare the food for the sharks. And I'm with Kimar. Hi there. So, where's the food? >> In the fridge. >> Great. Let's go there. So, there's some shrimps. Hello, I'm a shimp. But that's not for sharks. No, for sharks, we'll need calamari. It's important when you cook this type of food to put some gloves on. Here we put some vitamins in the food. You know, just like the vitamin you eat in winter so that you don't fall sick. So, Clourmont just did a little incision. He dug in with his knife so that I can hide one little vitamin in it because you know they won't eat the vitamin like that. You need to trick them into eating them. Oh, look at all that. Oh, slippery. It's slippery. Slippery. It's heating time. [Music] >> It's huge. But then again, there's so many socks. They need space. Oh, look at [Music] the seahorse. is one of the oldest existing underwater animals at the dates back almost 40 million years. Oo, that's many, many, many years ago, just after the dinosaurs. Oh, its silhouette reminds of a pony. But the seahorse is indeed a fish that lives in most of the planet seas. And seahorses have a funny head with two mobile eyes, each of which can move independently of the other and they can spot the food from a long distance. The seahorses move very slowly, so they don't have much defense wise. So to remain undetected by their predators, they use camouflage colors to hide in the underwater scenery. Good job, seahorses. It's lunch time. Are you ready, sharks? Lunch time. Friends, it's time. [Music] Now, as you can see, we use a rod to feed them because they are dangerous predators. As you know, the thing with sharks is they well, for this species anyway, they live as a group, which is very cool. And they hunt. And so to do that, they have a good sense of smell, which allow them to smell blood. They would smell a drop of blood in this tank. And they also have some little cells, some perry cells, which allow them to perceive vibrations. [Music] Now one thing which is very interesting with sharks is even though they are huge like they can be the one in those tanks up to 2 m long they don't eat all that much once or twice a week you and I we eat three times a day normally Then they can go a whole week without eating. Yeah. Well, that's important because, you know, we need to stay healthy and fit. You're a shark. You You swim all day long. You're You're always doing workouts. Yeah, but you know, health is important. >> True. I can't argue with that. [Music] Oh, hello there. Oh, it's so it's very soft, but not velvety, just soft. So, there are 630 species of rays in the ocean here. There's like about 10ish. And the thing is, they are cousins to the sharks. That's really interesting. And like the shark, they are very easy to spot. Oh, look, look, look right here. How can you distinguish a ray? Well, that's simple. It's flat. Look at that. You can see there now. And you see they also have gills, but they're not on the side. They're on the top of the head and go through the body. Hello again. Wow. Can you see right there? They're in the ground buried just like there. Now some rays what they do to feed is or they will just you know hide under the ground but sometimes they will shake it up a bit in order to dislodge any muscles and little animals. Oh look in order to feed themselves. Oh wow. They want some belly scratches. Is that what you want? It's really cold. It's It's really cold. My hands freezing. [Music] The underwater SeaWorld has its very own superstar. And it does not need fancy sunglasses to be recognized, but white strength. Please welcome the clownfish. Woo! Here it is. The clownfish are very friendly and have developed a very strong relationship with the anemone, a sea plant. The anemone is a safe shelter for the clown fish. And in return, the clown fish's bright colors will scare away predators and not so yummy for us humans. But the anemone will feast on the clown fish's poop. Now, at the moment, we are mixing some shrimps with some little granules. Those are vitamins. It's important for the rays. You don't want them to be sick. And then you will take this bottle and stuff it with the food. Then you'll add some tank water. You know the one where they live. You'll mix it up and then you'll put the food in the tank. It will create a cloud of food and the rays will just swim and they will just be like that. [Music] It's feeding time. So, we're going to lay on the mattress here and we'll just create that cloud of food in the tank. In a way, we are simulating planktons, a cloud of plankton, and they'll just, you know, a cloud of kale and they'll just swim through it like they're they're doing right now. They are really really fast. Look at them. Woo! Wow, that was great. That was awesome. But we haven't finished yet. We have so much more to see. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Hey there, my little kitty friends. Look what's behind me. Jellyfish. Now, jellyfish are incredible. Look at them. They are so majestic in the water. The interesting things with them is that you find them everywhere in the sea from just under the surface to all down in the deep dark depth of the ocean. And really they've been here for so long. Even at the dinosaurs time they were already here living with the dinosaurs. Look at them still here. They mostly feed on plankton and small fish. Look at that one. See how it flipped over? It's because she's lazy, like very lazy. So, she'll just flip over so that the plankton will just fall into her mouth. [Music] Hi there. We talk about plankton a lot. But what is plankton? Well, it's very easy. In the ocean, you will have tons of microscopic little animals or plants that you can see right there. But if they're microscopic, why can we see them? Well, this is a magnifying glass because when I say microscopic, I mean you can barely even see them with your bare eyes. Now you know what plankton is. The thing I was asking myself is how do jellyfish just come to be? Where do they come from? Well, it's very interesting. Jellyfish lay eggs, but those eggs are weird because they turn into lavi. And those little lavi will just find somewhere to grab onto, you know, to hold tight. And from there will sprout some little jellyfish. They look like plates at that state. And they are so incredibly small that you can barely see them. They are really teeny weeny, weeny, we can't see anything. Coral is not a stone nor a plant, but the quiet jellyfish cousin. Even if you don't see its gills, coral is breathing oxygen and growing as time goes by. Wow. Coral has a very important role underwater. Just like a mason, coral is building long walls called reefs that provide shelter to all small inhabitants of the sea. Like these adorable clown fishes. Oh, hey clown fish. You remind me of someone. Coral comes in various colors from white to red. It feels happy in lukewarm tropical waters exposed to generous light. That's why it's so easy to see it in clear water. Hello my little kitties. At the moment I'm with Flor and Flor has a very important jug. If you look right here, look, there's an adult jellyfish. And now that it's all grown up, it's ready to go in the exposition tank for all the viewers to see. Are you ready? >> Yes. >> Let's see that. This is going to be cool. Look at it. There it goes. Wow. They are just so majestic. I love them. I I really love them. Oh, what's that? No, you still can't stop. I know you're hungry, but you had two breakfast this morning, and that's way too much for you. You are small. No more food for now. Stop it. Look, there's there's a teeny weeny. I think this one is the little brother, actually. Yeah, that's little Tim. And oh, look at this one. She's even smaller. And this one over there. Well, I think this one is the one we just popped in. Hello. Do you like it in there? [Music] And now, my little brainiacs, it's time for the kitty quiz. Three questions on rays, sharks, and jellyfish. Let's see what you've learned. First question, what helps a shark to breathe? Is it a gills or b a snorkel? timer. The question is, how do sharks breathe? Ah, you have an answer. Okay, let's hear it. That's right. Sharks breathe through their gills. G I L L S. Great. Okay, second question. What do small rays eat? Is it a plankton porridge or b cheeseburgers and fries? Time. The question is, what do small rays eat? It's time. And your answer is that's right, my friend. Rays eat plankton. P L A N K T O N. And now for the third and last question. How do jellyfish make babies? Do they A lay eggs or B wait for a stalk to deliver a baby? Time. The question is, how do jellyfish make babies? Ah, it's time. So, yes, that's right. Jellyfish lay eggs. E G G S Fantastic. You did a great job today. And you know what? Just for that, you deserve a little dance. >> Ready, set, grow. Ready, set. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. I'm kidding. Oh, I'm kidding. Ready, set, grow. Ready, set, grow. [Music] Ready, set, grow. Ready, set. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. Ready, set, grow. >> A child of the sun going to have fun. Ready, [Music] set, grow. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. Yeah, I'm kidding. I'm [Music] ready, set, grow. Ready, set, grow. [Music] Heat. [Music] [Music] Heat. [Music] Wow. Wow. Heat. [Music] Heat. [Music] [Applause] [Music] Ouch. [Music] Wow. Heat. Heat. [Music] [Applause] Heat. Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Heat. [Music] Help. Huh? [Music] >> A ambulance. [Music] H. [Music] >> Huh? Aha. >> E. Bulldozer. [Music] C crane. [Music] D. Dump truck. [Music] E excavator [Music] [Applause] no more. [Music] [Applause] [Music] F fire truck. [Applause] [Music] >> Huh? H. Aha. >> G. Garbage truck. [Music] Yay! [Music] >> Helicopter! [Music] Ice cream truck. [Music] Jet jet ski. [Music] >> Kayak. [Music] >> Locomotive. [Music] M >> motorcycle. [Music] >> N newspaper truck. >> Oh, ocean liner. P police car. [Music] >> Wo. >> Q. >> Q. Queen's coach. >> Coach. >> R. Rocket. [Applause] >> S. Submarine. T. Tractor. U unicycle. Vespa [Music] W wheel loader. X X sleigh. [Music] >> Y >> Yacht. >> Wo. [Music] >> Zeppelin. >> See you next time. [Music] [Music] [Music] We need to put the letters in the right order. [Music] A airplane [Music] speed builder. Hey, [Music] C chicken. Ow. [Music] D dentist. [Music] [Music] Wow. [Applause] Wow. E elephant. Aha. [Music] F. Fire truck. [Music] [Music] G gorilla. [Music] Helicopter. [Music] I ice cream truck. [Music] [Music] Woo! Yay! Get [Music] Hey, kitchen chef. [Music] Yay. [Music] L lion. [Music] L monkey monkey. [Music] Nurse. [Music] Oh, off-road vehicle. Huh. [Music] P. Police car. [Music] Wow. [Music] Q. Queen's coat. [Music] R rabbit. [Music] Wow. [Music] X sweeper. [Music] Huh. Aha. [Music] T tractor. [Music] H [Music] you underground minor. [Music] Vet [Music] WH. You [Music] wo >> X X X Hey. [Music] Wo. [Music] Why that [Music] zookeeper? Hey, [Music] [Music] heat. [Music] Oh my blood one. [Music] [Music] Yeah. [Music] [Applause] [Music] Heat. [Music] Yeah. [Applause] Woo. Heat. [Music] Heat. [Music] [Music] Yeah. Yeah. [Music] Heat. [Applause] [Music] Red means stop. Green means go. Always drive safe and help each other. [Music] This is a spaceship. [Music] Woohoo! [Music] Happy birthday. [Music] [Music] We placed one energy crystal. Let's search for the other four crystals. [Music] [Music] [Music] [Music] [Music] The moon's surface gravity. is weaker because it is far less massive than Earth. Thus, things weigh less on the moon. [Music] [Music] We were on the moon. Now we're on Earth again. In our solar system, we have eight planets. Let's count them. Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune. See you next time. [Music] >> Now, let's have some fun with your monster truck. >> Yeah. [Music] [Music] Let's extend the obstacle course. [Music] Yeah. [Music] [Music] Yeah. [Music] Heat. [Music] Yeah, you can always have fun, but please clean your toys in the end. [Music] >> You did a great job. >> Yeah. [Music] Let's get food for the animals. [Music] Aha! [Music] [Music] Yeah. [Music] Oh my god. [Music] What's that? [Music] [Music] This is a sheep. [Music] This is a horse. [Music] This is a pig. [Music] This is a cow. >> A cow gives us milk. [Music] This is a hen. Yeah. [Music] A hen lays eggs. Yeah. [Music] People buy these foods from the farm to cook and bake with. [Music] Yeah. Yeah. [Music] Yeah. [Music] >> Yeah. [Music] Time to [Music] [Music] Yeah, >> airplanes use wings to glide through the air, a bit like birds. [Music] >> Look, a helicopter. [Music] Yeah, >> they have spinning blades on top like a fan which push the air down when they spin. That makes them fly. [Music] Let's test your pilot ability. [Music] Heat. [Music] [Music] Heat. [Applause] [Music] Great job. Yeah. [Music] See you next time. [Music] Let's practice sports. Let's start with soccer. [Music] H. Yeah. Yeah. >> Let's continue with bowling. [Music] >> Yeah, [Music] let's do cycling. Always wear a helmet and safety gear. >> Yeah. [Music] Let's play golf. [Music] Let's do hurdling. [Music] [Music] Yeah, [Music] let's play basketball. [Music] Heat. Heat. [Music] [Music] [Music] Yeah. [Music] Yeah. [Music] There is one last challenge. Let's play baseball. [Music] Yeah. [Music] Yeah. Always stay active and healthy. [Music] Which vehicle do we need? We need a fire truck. >> Wow. [Music] Wow. [Music] Wow. [Music] Wow. [Music] Which vehicle do we need? We need an ambulance. >> Wow. [Music] [Music] Yeah. [Music] >> Which vehicle do we need? >> We need a police car. >> Wo! >> Wo! Heat. Heat. [Music] [Music] [Music] [Applause] [Music] I'm sorry, but I'm going to clean it up. >> Which vehicle do we need? We need a garbage truck. >> Wo! [Music] >> Wo! [Music] Wow. [Music] Wo! [Music] [Music] Yeah. W. [Music] Which vehicle do we need? We need an excavator. [Music] Heat. Heat. [Music] [Music] [Music] Wow. [Music] [Music] This is a tractor. This is a crane. This is a dump truck. This is a concrete mixer. >> See you next time. [Music] [Applause] [Music] [Applause] That's bad. [Music] Because you wore your safety gear, you prevented injuries. >> Yeah. I'll make up for my mistakes and fix your car. [Music] Yeah, you learned that making up for your mistakes is important. Because of that, here is a car for you. Let's learn about traffic safety together. [Music] [Applause] [Music] Red means stop. [Music] [Applause] [Music] Green means gold. Heat. Heat. [Music] [Music] Wow. [Music] Ah. Heat. Heat. [Music] You can always have fun, but afterwards you always need to clean up your toys. [Music] Stop, slow, and go. [Music] [Music] Great job. Let's activate the lights and sirens. [Music] [Music] [Music] Yeah. [Applause] W. Don't worry. Let's do a dental checkup. [Music] Wow. [Music] >> Yeah. >> See, you don't need to be afraid of dentists. We are here to help you. [Music] Let's mix it together. [Music] [Music] Yeah. [Music] Yeah. >> Don't eat too much sugar. Eat more healthy food. Yeah. [Music] No, no, no, no, no, no. I'm not very good. My meat doesn't taste great. However, I know someone who can feed you. Really? Yes. How about we go there? Let's go. [Music] Ready, set, go. >> Wow, look at that. Hi, my friends. It's me, Kitty. K I D I. And today we're going to go on a great adventure. We're going to learn everything there is to know about sharks and rays. [Music] Today we're at Nika, the biggest aquarium in Europe. I hope you're ready cuz I know I am. >> Let's go. Now the thing is sharks are fish so they have gills but most importantly unlike most fish they have a dorsal fin you know that's why we do this symbol when we talk about sharks while diving and you can really it's really easy to recognize them and if you see one peeking through the surface that means you should run like Ow. [Music] [Applause] [Music] Now, sharks can be very impressive because they have so many teeth. They can have up to 14 rows of teeth each, just packed. And the most interesting thing is, you know, when you grow up, your baby teeth fall out and your adult teeth come in. Well, they don't have baby teeth. They just have infinite amount of teeth. For their entire life, they will lose teeth and then they will come back. And that really hurts. Well, yeah, they're here to eat food. Yeah, it's painful. No, no, no, no. Stop. Stop. Learn to be a good boy. I'm hungry. Anyway, I think it's time to see what they actually eat. Why do they need so many teeth? Look, we're in the kitchen because it's important, you know, to cook and prepare the food for the sharks. And I'm with Kimar. Hi there. So, where's the food? >> In the fridge. >> Great. Let's go there. Ooh. So, there's some shrimps. Hello, I miss. But that's not for sharks. No, for sharks, we'll need calamari. It's important when you cook this type of food to put some gloves on. Here, we put some vitamins in the food. You know, just like the vitamin you eat in winter so that you don't fall sick. So, Clear just did a little incision. He dug in with his knife so that I can hide one little vitamin in it because you know they won't eat the vitamin like that. You need to trick them into eating them. >> Oh, look at all that. Oh, it's slippy. It's slithery. Slippy. >> It's heating time. [Music] It's huge. But then again, there's so many socks. They need space. Oh, look at [Music] the seahorse is one of the oldest existing underwater animals and that dates back almost 40 million years. Oh, that's many, many, many years ago, just after the dinosaurs. Oh, its silhouette reminds of a pony, but the seahorse is indeed a fish that lives in most of the planet seas. And seahorses have a funny head with two mobile eyes, each of which can move independently of the other and they can spot the food from a long distance. The seahorses move very slowly, so they don't have much defense wise. So to remain undetected by their predators, they use camouflage colors to hide in the underwater scenery. Good job, seahorses. >> It's lunch time. Are you ready, sharks? Lunch time. Friends, it's lunch time. It's lunch time. [Music] Now, as you can see, we use a rod to feed them because they are dangerous predators. As you know, the thing with sharks is they well, for this species anyway, they live as a group, which is very cool. And they hunt. And so to do that, they have a good sense of smell, which allowed them to smell blood. They would smell a drop of blood in this tank. And they also have some little cells, some hairy cells, which allow them to perceive vibrations. [Music] Now one thing which is very interesting with sharks is even though they are huge like they can be the one in those tanks up to 2 m long they don't eat all that much once or twice a week you and I we eat three times a day normally Then they can go a whole week without eating. Yeah. Well, that's important because, you know, we need to stay healthy and fit. You're shark. You You swim all day long. You're You're always doing workouts. Yeah, but you know, health is important. >> True. I can't argue with that. [Music] Oh, hello there. Oh, it's so it's very soft, but not velvety, just soft. So, there are 630 species of rays in the ocean here. There's like about 10ish. And the thing is, they are cousins to the sharks. That's really interesting. And like the shark, they are very easy to spot. Oh, look, look, look right here. How can you distinguish a ray? Well, that's simple. It's flat. Look at that. You can see there now. And you see they also have gills, but they're not on the side. They're on the top of the head and go through the body. Hello again. Wow. Can you see right there? They're in the ground buried just like there. Now some rays what they do to feed is or they will just you know hide under the ground but sometimes they will shake it up a bit in order to dislodge any muscles and little animals. Oh look in order to feed themselves. Oh wow. They want some belly scratches. Is that what you want? It's really cold. It's It's really cold. My hands freezing. [Music] The underwater seaorld has its very own superstar. And it does not need fancy sunglasses to be recognized, but white stripes. Please welcome the clownfish. Woo! Here it is. The clownfish are very friendly and have developed a very strong relationship with the anemone, a sea plant. The anemone is a safe shelter for the clownfish. And in return, the clown fish's bright colors will scare away predators and not so yummy for us humans. But the anemone will feast on the clown fish's poop. Now, at the moment, we are mixing some shrimps with some little granules. Those are vitamins. It's important for the rays. You don't want them to be sick. And then you will take this bottle and stuff it with the food. Then you'll add some tank water. You know, the one where they live. You'll mix it up and then you'll put the food in the tank. It will create a cloud of food and the rays will just swim. And there would just be like that. [Music] It's feeding time. So, we're going to lay on the mattress here and we'll just create that cloud of food in the tank. In a way, we are simulating planktons, a cloud of plankton, and they'll just, you know, a cloud of kale and they'll just swim through it like they're they're doing right now. They are really really fast. Look at them. [Music] Woo! [Music] Wow, that was great. That was awesome. But we haven't finished yet. We have so much more to see. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Hey there, my little kitty friends. Look what's behind me. Jellyfish. Now, jellyfish are incredible. Look at them. They are so majestic in the water. The interesting things with them is that you find them everywhere in the sea from just under the surface to all down in the deep dark depth of the ocean. And really, they've been here for so long. Even at the dinosaurs time, they were already here living with the dinosaurs. Look at them still here. They mostly feed on plankton and small fish. Look at that one. See how it flipped over? It's because she's lazy, like very lazy. So, she'll just flip over so that the plankton will just fall into her mouth. [Music] Hi there. We talk about plankton a lot. But what is plankton? Well, it's very easy. In the ocean, you will have tons of microscopic little animals or plants that you can see right there. But if they're microscopic, why can we see them? Well, this is a magnifying glass because when I say microscopic, I mean you can barely even see them with your bare eyes. Now you know what plankton is. The thing I was asking myself is how do jellyfish just come to be? Where do they come from? Well, it's very interesting. Jellyfish lay eggs, but those eggs are weird because they turn into lavi. And those little lavi will just find somewhere to grab onto, you know, to hold tight. And from there will sprout some little jellyfish. They look like plates at that state. And they are so incredibly small that you can barely see them. They are really teeny weeny weeny weeny chips. >> Coral is not a stone nor a plant, but the quiet jellyfish cousin. Even if you don't see its gills, coral is breathing oxygen and growing as time goes by. Wow. Coral has a very important role underwater. Just like a mason, coral is building long walls called reefs that provide shelter to all small inhabitants of the sea. Like these adorable clown fishes. Oh, hey clown fish. You remind me of someone. Coral comes in various colors from white to red. It feels happy in lukewarm tropical waters exposed to generous light. That's why it's so easy to see it in clear water. Hello my little kitties. At the moment I'm with Flor and Flor has a very important jug. If you look right here, look, there's an adult jellyfish. And now that it's all grown up, it's ready to go in the exposition tank for all the viewers to see. Are you ready? >> Yes. >> Let's see that. This is going to be cool. Look at it. There it goes. Wow. They are just so majestic. I love them. I I really love that. Oh, what's that? No, you still can't. Stop. I know you're hungry, but you had two breakfast this morning, and that's way too much for you. You are small. No more food for now. Stop it. Look, there's there's a teeny weeny one. I think this one is the little brother, actually. Yeah, that's little Tim. And oh, look at this one. She's even smaller. And this one over there. Well, I think this one is the one we just popped in. Hello. Do you like it in there? [Music] And now, my little brainiacs, it's time for the kitty quiz. Three questions on rays, sharks, and jellyfish. Let's see what you've learned. First question, what helps a shark to breathe? Is it a gills or b a snorkel timer? The question is, how do sharks breathe? Ah, you have an answer. Okay, let's hear it. That's right. Sharks breathe through their gills. G I L L S. Great. Okay, second question. What do small rays eat? Is it a plankton porridge or b cheeseburgers and fries? Time. The question is, what do small rays eat? It's time. And your answer is that's right, my friend. Rays eat plankton. P L A N K T O N. And now for the third and last question. How do jellyfish make babies? Do they A lay eggs or B wait for a stalk to deliver a baby? Time. The question is, how do jellyfish make babies? Ah, it's time. So, >> yes, that's right. Jellyfish lay eggs. E G G S. Fantastic. You did a great job today. And you know what? Just for that, you deserve a little dance. >> Ready, set, ready, set. >> I'm kidding. Yeah, I'm kidding. [Music] I'm kidding. Oh, I'm kidding. I'm kidding. I'm kidding. Oh, I'm kidding. Ready, set, grow. Ready, set, grow. [Music] Ready, set, grow. Ready, set. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. Ready, set, grow. The child of the sun going to have fun. My adventure is >> ready, set. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. Ready, set, grow. Ready, set, grow. [Music] [Music] Hey, [Music] [Music] Heat. Heat. Heat. Heat. [Music] Yeah. [Music] [Applause] [Music] Heat. [Music] Wow. [Music] Heat. [Music] Heat. Heat. N. [Music] Heat. [Music] Heat. [Applause] [Music] Heat. [Music] [Applause] [Music] Hey, heat. Hey, heat. Heat. [Music] Heat. Heat. Heat. [Music] Help. [Music] >> Help. Huh? [Music] >> A ambulance. [Music] H. [Music] >> Huh? Aha. >> E. Bulldozer. [Music] C crane. [Music] D. Dump truck. [Music] Yay. >> E excavator. [Music] [Applause] [Applause] [Music] [Applause] [Music] F fire crack. [Applause] [Music] >> Huh? H. >> Aha. >> G. Garbage truck. [Music] [Applause] [Music] H helicopter. [Music] Ice cream truck. [Music] >> Jet jet ski. [Music] Kayak. [Music] Locative [Music] >> M motorcycle. [Music] >> N newspaper truck. >> O liner. P police car. [Music] >> Wo. >> Q. >> Q. Queen's coach. >> Coach. >> R. Rocket. [Applause] [Music] >> S. Submarine. >> T. Tractor. [Music] U unicycle. Vespa [Music] W wheel loader. X X sleigh. [Music] >> Y >> Yacht. >> Wo. [Music] >> Zeppelin. See you next time. [Music] [Music] [Music] We need to put the letters in the right order. [Music] A airplane [Music] speed builder. Hey, [Music] C chicken. Ow. [Music] D dentist. [Music] [Music] Heat. Heat. [Applause] E elephant. Aha. [Music] F. Fire truck. [Music] [Music] G gorilla. [Music] Helicopter. [Music] I ice cream truck. [Music] [Music] Woo! Yay! Get. [Music] Hey, kitchen chef. [Music] Yay! [Music] Lion! [Music] M monkey. [Music] Ow. [Music] Nurse. [Music] Oh, off-road vehicle. Huh? [Music] P. Police car. [Music] Wow. [Music] Q. Queen's coat. [Music] R rabbit. Wow. [Music] X sweeper. [Music] Huh. Aha. [Music] T tractor. [Music] H [Music] you underground minor. [Music] V set. [Music] H Wale. [Music] W X X leg. [Music] Wo. [Music] Why that [Music] zookeeper? Hey. [Music] [Music] [Music] Oh my blood one. [Music] Yeah. [Music] [Applause] [Music] [Applause] Heat. [Music] Yeah. [Applause] [Music] Woo. Heat. [Music] Heat. [Music] [Music] Yeah. Yeah. [Music] [Applause] [Music] Red means stop. Green means go. Always drive safe and help each other. This is a spaceship. [Music] Woohoo! [Music] Happy birthday. [Music] We placed one energy crystal. Let's search for the other four crystals. [Music] Heat. Heat. [Music] [Music] [Music] The moon's surface gravity is weaker because it is far less massive than Earth. Thus, things weigh less on the moon. [Music] [Music] We were on the moon. Now we're on Earth again. In our solar system, we have eight planets. Let's count them. Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune. See you next time. [Music] >> Now, let's have some fun with your monster truck. Yeah. [Music] [Music] Let's extend the obstacle course. [Music] Yeah. [Music] Heat. [Music] Yeah. [Music] Yeah, you can always have fun, but Please clean your toys in the end. [Music] >> You did a great job. >> Yeah. [Music] Let's get food for the animals. [Music] Aha. [Music] [Music] Yeah. [Music] Oh my god. [Music] What's that? [Music] [Music] This is a sheep. [Music] This is a horse. [Music] This is a pig. [Music] This is a cow. >> A cow gives us milk. [Music] This is a hen. >> Yeah. [Music] A hen lays eggs. Yeah. [Music] People buy these foods from the farm to cook and bake with. [Music] Yeah. Yeah. [Music] Yeah. [Music] >> Yeah. [Music] I don't [Music] [Music] Yeah, >> airplanes use wings to glide through the air. A bit like birds. [Music] >> Look, a helicopter. [Music] [Music] Yeah, >> they have spinning blades on top like a fan which push the air down when they spin. That makes them fly. [Music] Let's test your pilot abilities. [Music] [Music] [Applause] [Music] Great job. >> Yeah. [Music] See you next time. [Music] Let's practice sports. Let's start with soccer. [Music] H. Yeah. Yeah. >> Let's continue with bowling. [Music] >> Yeah, [Music] >> let's do cycling. Always wear a helmet and safety gear. >> Yeah. [Music] Let's play golf. [Music] Let's do hurdling. [Music] Yeah, [Music] let's play basketball. [Music] [Music] [Music] Yeah. [Music] Yeah. [Music] There is one last challenge. Let's play baseball. [Music] Yeah. [Music] Yeah. Always stay active and healthy. [Music] Which vehicle do we need? >> We need a fire truck. >> Wo! [Music] Oh. [Music] >> Wo. [Music] Wow. [Music] Which vehicle do we need? >> We need an ambulance. >> Wow. [Music] [Music] [Music] Yeah. [Music] >> Which vehicle do we need? We need a police car. >> Wo! [Music] Wo! [Music] [Music] [Music] [Applause] [Music] I'm sorry, but I'm going to clean it up. Which vehicle do we need? We need a garbage truck. >> Wow. [Music] >> Wo. [Music] [Music] Wo! [Music] Wo! [Music] [Music] >> Wo! [Music] Which vehicle do we need? We need an excavator. [Music] [Music] [Music] Wow. [Music] [Music] This is a tractor. This is a crane. This is a dump truck. This is a concrete mixer. [Music] >> See you next time. [Music] [Applause] [Music] [Applause] [Music] Because you wore your safety gear, you prevented injuries. Yeah, I'll make up for my mistakes and fix your car. [Music] Yeah, you learned that making up for your mistakes is important. Because of that, here is a car for you. Let's learn about traffic safety together. [Music] [Applause] [Music] Red means stop. [Music] [Applause] [Music] Green means gold. [Music] [Music] Yeah. [Music] Wow. Heat. [Music] You can always have fun, but afterwards you always need to clean up your toys. [Music] Stop, slow, and go. [Music] >> Great job. [Music] Let's activate the lights and sirens. [Music] [Music] [Music] Yeah. Woohoo. Don't worry. Let's do a dental checkup. [Music] Wow. [Music] >> Yeah. >> See, you don't need to be afraid of dentist. We are here to help you. [Music] >> Let's fix it together. [Music] [Music] Yeah. [Music] Hey. Hey. [Music] Yow! >> Don't eat too much sugar. Eat more healthy food. >> Yow! [Music] No, no, no, no, no, no. I'm not very good. My meat doesn't taste great. However, I know someone who can feed you. Really? Yes. How about we go there? Let's go. [Music] >> Wow, look at that. Hi, my friends. It's me, Kitty. K I D I. And today we're going to go on a great adventure. We're going to learn everything there is to know about sharks and rays. [Music] Today we're at Nika, the biggest aquarium in Europe. I hope you're ready cuz I know I am. >> Let's go. Now the thing is sharks are fish. So they have gills. But most importantly, unlike most fish, they have a dorsal fin. You know, that's why we do this symbol when we talk about sharks while diving. And you can really, it's really easy to recognize them. And if you see one peeking through the surface, that means you should run like now. [Music] [Applause] [Music] Now, sharks can be very impressive because they have so many teeth. They can have up to 14 rows of teeth, each just packed. And the most interesting thing is, you know, when you grow up, your baby teeth fall out and your adult teeth come in. Well, they don't have baby teeth. They just have infinite amount of teeth. for their entire life. They will lose teeth and then they will come back and ow. Ah, that really hurts. Well, yeah, they're here to eat food. Yeah, it's painful. Stop. Stop. Learn to be a good boy. I'm hungry. Anyway, I think it's time to see what they actually eat. Why do they need so many teeth? [Music] Look, we're in the kitchen. because it's important, you know, to cook and prepare the food for the sharks. And I'm with Kimar. Hi there. So, where's the food? >> In the fridge. >> Great. Let's go there. So, there's some shrimps. Hello, I'm shrimp. But that's not for sharks. No, for sharks, we'll need calamari. It's important when you cook this type of food to put some gloves on. Here, we put some vitamins in the food. You know, just like the vitamin you eat in winter so that you don't fall sick. So, Kleen just did a little incision. He dug in with his knife so that I can hide one little vitamin in it because you know they won't eat the vitamin like that. You need to trick them into eating them. Oh, look at all that. Oh, it's slippy. It's slippy. Slippy. It's heating time. [Music] It's huge. But then again, there's so many socks. They need space. Oh, look at [Music] the seahorse. is one of the oldest existing underwater animals at the dates back almost 40 million years. Oo, that's many, many, many years ago, just after the dinosaurs. Oh, its silhouette reminds of a pony. But the seahorse is indeed a fish that lives in most of the planet seas. And seahorses have a funny head with two mobile eyes, each of which can move independently of the other and they can spot the food from a long distance. The seahorses move very slowly, so they don't have much defense wise. So to remain undetected by their predators, they use camouflage colors to hide in the underwater scenery. Good job, seahorses. >> It's lunch time. Are you ready, sharks? Lunch time. Friends, it's lunch time. It's lunch time. [Music] Now, as you can see, we use a rod to feed them because they are dangerous predators. As you know, the thing with sharks is they well, for this species anyway, they live as a group, which is very cool. And they hunt. And so to do that, they have a good sense of smell, which allow them to smell blood. They would smell a drop of blood in this tank. And they also have some little cells, some hairy cells, which allow them to perceive vibrations. [Music] Now one thing which is very interesting with sharks is even though they are huge like they can be the one in those tanks up to 2 m long they don't eat all that much once or twice a week you and I we eat three times a day normally Then they can go a whole week without eating. Yeah. Well, that's important because, you know, we need to stay healthy and fit. You're shark. You You swim all day long. You're You're always doing workouts. Yeah, but you know, health is important. >> True. I can't argue with that. [Music] Oh, hello there. Oh, it's so it's very soft, but not velvety, just soft. So, there are 630 species of rays in the ocean here. There's like about 10ish. And the thing is, they are cousins to the sharks. That's really interesting. And like the shark, they are very easy to spot. Oh, look, look, look right here. How can you distinguish a ray? Well, that's simple. It's flat. Look at that. You can see there now. And you see they also have gills, but they're not on the side. They're on the top of the head and go through the body. Hello again. Wow. Can you see right there? They're in the ground buried just like there. Now some rays what they do to feed is or they will just you know hide under the ground but sometimes they will shake it up a bit in order to dislodge any muscles and little animals. Oh look in order to feed themselves. Oh wow. They want some belly scratches. Is that what you want? It's really cold. It's It's really cold. My hands freezing. [Music] The underwater seaorld has its very own superstar. And it does not need fancy sunglasses to be recognized, but white stripes. Please welcome the clownfish. Woo! Here it is. The clownfish are very friendly and have developed a very strong relationship with the anemone, a sea plant. The anemone is a safe shelter for the clownfish. And in return, the clown fish's bright colors will scare away predators and not so yummy for us humans. But the anemone will feast on the clown fish's poop. Now, at the moment, we are mixing some shrimps with some little granules. Those are vitamins. It's important for the rays. if you don't want them to be sick. And then you will take this bottle and stuff it with the food. Then you'll add some tank water. You know the one where they live. You'll mix it up and then you'll put the food in the tank. It will create a cloud of food and the rays will just swim and they will just be like that. [Music] It's feeding time. So, we're going to lay on the mattress here and we'll just create that cloud of food in the tank. In a way, we are simulating planktons, a cloud of plankton, and they'll just, you know, a cloud of kale and they'll just swim through it like they're they're doing right now. They are really really fast. Look at them. [Music] [Music] Wow, that was great. That was awesome. But we haven't finished yet. We have so much more to see. [Applause] [Music] [Applause] [Music] [Applause] [Music] Hey there, my little kitty friends. Look what's behind me. Jellyfish. Now, jellyfish are incredible. Look at them. They are so majestic in the water. The interesting things with them is that you find them everywhere in the sea from just under the surface to all down in the deep dark depth of the ocean. And really, they've been here for so long. Even at the dinosaurs time, they were already here living with the dinosaurs. Look at them still here. They mostly feed on plankton and small fish. Look at that one. See how it flipped over? It's because she's lazy, like very lazy. So, she'll just flip over so that the plankton will just fall into her mouth. [Music] Hi there. We talk about plankton a lot. But what is plankton? Well, it's very easy. In the ocean, you will have tons of microscopic little animals or plants that you can see right there. But if they're microscopic, why can we see them? Well, this is a magnifying glass because when I say microscopic, I mean you can barely even see them with your bare eyes. Now you know what plankton is. The thing I was asking myself is how do jellyfish just come to be? Where do they come from? Well, it's very interesting. Jellyfish lay eggs, but those eggs are weird because they turn into lavi. And those little lavi will just find somewhere to grab onto, you know, to hold tight. And from there will sprout some little jellyfish. They look like plates at that state. And they are so incredibly small that you can barely see them. They are really teeny weeny, weeny, we really cute. Coral is not a stone nor a plant, but the quiet jellyfish cousin. Even if you don't see its gills, coral is breathing oxygen and growing as time goes by. Wow. Coral has a very important role underwater. Just like a mason, coral is building long walls called reefs that provide shelter to all small inhabitants of the sea. Like these adorable clown fishes. Oh, hey clown fish. You remind me of someone. Coral comes in various colors from white to red. It feels happy in lukewarm tropical waters exposed to generous light. That's why it's so easy to see it in clear water. Hello, my little kitties. At the moment, I'm with Floron. And Flor has a very important jug. If you look right here, look, there's an adult jellyfish. And now that it's all grown up, it's ready to go in the exposition tank for all the viewers to see. Are you ready? >> Yes. >> Let's see that. This is going to be cool. Look at it. There it goes. Wow. They are just so majestic. I love them. I I really love them. Oh, what's that? No, you still can't stop. I know you're hungry, but you had two breakfast this morning, and that's way too much for you. You are small. No more food for now. Stop it. Look, there's there's a teeny weeny one. I think this one is the little brother, actually. Yeah, that's little Tim. And oh, look at this one. She's even smaller. And this one over there. Well, I think this one is the one we just popped in. Hello. Do you like it in there? [Music] And now, my little brainiacs, it's time for the kitty quiz. Three questions on rays, sharks, and jellyfish. Let's see what you've learned. First question. What helps a shark to breathe? Is it a gills or b a snorkel? Timer. The question is, how do sharks breathe? Ah, you have an answer. Okay, let's hear it. That's right. Sharks breathe through their gills. G I L L S. Great. Okay, second question. What do small rays eat? Is it a plankton porridge or b cheeseburgers and fries? Time. The question is, what do small rays eat? It's time. And your answer is that's right, my friend. Rays eat plankton. P L A N K T O N. And now for the third and last question. How do jellyfish make babies? Do they A lay eggs or B wait for a stalk to deliver a baby? Time. The question is, how do jellyfish make babies? Ah, it's time. So, yes, that's right. Jellyfish lay eggs. E G G S Fantastic. You did a great job today. And you know what? Just for that, you deserve a little dance. >> Ready, set, grow. Ready, set. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. I'm kidding. Oh, I'm kidding. Ready, set, grow. Ready, set, grow. [Music] Ready, set, grow. Ready, set, now. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. Yeah, I'm kidding. Oh, I'm kidding. Ready, set, grow. >> The child of the sun going to have fun. I want you. >> Ready, set, grow. >> I'm kidding. Yeah, I'm kidding. I'm kidding. Oh, I'm kidding. I'm kidding. Yeah, I'm kidding. Oh, I'm kidding. Ready, set, grow. Ready, set, grow. [Music] Heat. Heat. [Music] [Music] [Applause] [Music] Heat. [Music] Heat. [Music] [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] Heat. Heat. Heat. Heat. [Music] Yeah. Heat. [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] Heat. Heat. [Music] [Applause] [Music] [Music] Huh? Heat. Heat. [Music] Help. [Music] >> Help. Huh? [Music] >> A ambulance. [Music] H. [Music] >> Huh. Uh-huh. >> B. Bulldozer. [Music] C crane. [Music] D. Dump truck. [Music] Yay. >> E excavator. [Music] [Applause] [Applause] [Music] [Applause] [Music] F. Fire truck. [Applause] [Music] >> Huh? H. Aha. >> G. Garbage truck. Ah, [Music] [Applause] [Music] >> h helicopter. [Music] Ice cream truck. [Music] >> Jet jet ski. [Music] Kayak. [Music] >> Locomotive. [Music] M motorcycle. [Music] >> N newspaper truck. >> O liner. P police car. [Music] >> Wo! >> Q Queen's coach. >> Ret [Music] [Applause] S. Submarine. >> T tractor. >> U unicycle. Vespa [Music] W wheel loader. X X sleigh. [Music] >> Yacht. >> Wo. [Music] >> Zeppelin. >> See you next time. [Music] [Music] [Music] We need to put the letters in the right order. [Music] A airplane [Music] speed builder. Yeah. [Music] C chicken. Ow. [Music] D dentist. [Music] [Music] Ah! [Applause] Ah! E elephant. Aha. [Music] F. Fire truck. [Music] [Music] G gorilla. [Music] Helicopter. [Music] Ice cream truck. [Music] [Music] Woo! Yay! Get [Music] Hey, kitchen chef. [Music] Yay! [Music] Lion! [Music] H monkey. [Music] Ow. [Music] Nurse. [Music] Oh, off-road vehicle. Huh. [Music] P police car. [Music] W [Music] Queen's coat. [Music] Rabbit. [Music] Wow. [Music] X sweeper. [Music] Huh. Aha. [Music] T tractor. [Music] [Music] U underground minor. [Music] B set [Music] W for whale. [Music] Wo! >> X X leg. [Music] Wow. [Music] Why that [Music] B zookeeper? Hey, [Music] hey, hey. [Music]",
    "start_time": 0.0,
    "end_time": 14438.27
}