{
    "video_id": "VhAJ-T42nHU",
    "channel_url": "@lucasandmarcus",
    "transcript": "Yo, who's moving in? Wait, someone moving out? Wait, everyone's already moved out. Wait, wait, wait, wait, wait. This is not making sense. I can't see who's in the U-Haul truck. Hello. Wait a second. Wait, who's here? Wait, who's in there? Hold up. [Applause] >> Hello. >> Lucas, Levon. >> Oh, Steve. What are you doing here? >> What are you guys doing here? >> Wait, we didn't know that anyone >> Hi, Steve. >> Hi, guys. >> Wait, we didn't know that anyone was home. >> What's with the U-Haul truck, guys? Uh we're actually moving out of the country. Uh we're moving away for good. >> Yeah. >> What are you guys talking about? >> As you know, we just got married. Um this is my wife or husband and wife now. And we're really trying to like start our life together like for good, have kids eventually. So we just want to get out of the area. And >> yeah, I feel like it's right for our relationship now as like a married couple. We definitely have to like, you know, spread our wings a little bit. >> Yeah. Like we have our rings on, too. And a lot of you guys saw the wedding video, of course. Go check that out in this video. I think Oh, man. You guys are awesome with the pranks, man. Seriously. >> Wait, what? >> I think we have some boxes from Amazon. >> Get talk to him, too. >> No, I'm going to come in with you cuz we have to hurry up cuz we might have to catch a flight soon. >> It It's not a prank, by the way. >> So, yeah, we actually didn't know that anyone was going to be here like uh like at the house here, by the way. >> I mean, I'm just chilling here watching some TV. >> We do kind of turn away cuz like Sorry, Steve. I'm not trying to like be rude or anything, but we have the movers meeting us at the new location. >> No worries. You guys are never rude. It's okay. >> If you want to help us, I mean, you don't have to, but >> Okay, sounds good, guys. >> Boxes on Amazon, too. >> What the? >> No way. No way. No way, bro. Uh-oh. Wait a second. Hold on. Hold on. Hold on. Hold Where's Marcus? I got to call him right now. Dude, Marcus, dude, answer the phone. Oh my god. Wow. Do you guys need help or anything? Uh, >> we are still waiting on a couple more packages, but >> do you know Wait, right. >> Do you know where my uh my black and gray sweater is? >> I'm happy for that. Dude, you have so many of those. I don't know which one you're talking about. >> Cuz he has a lot of stuff here at this house. >> We have a couple more stuff that they should put this in. >> Your closet is still full of clothes in there. >> Yeah, that's that's what we have to hurry up cuz I got to we got to get some clothes. >> Okay. Um, so guys, where are you guys exactly moving again? >> We don't really want to tell anyone yet. >> Yeah, cuz we want we don't want to like freak anyone out yet. >> So, wait, you guys are moving, right? >> Yeah. moving out of way. >> Wait, but like what about your honeymoon? >> The honeymoon? We still have to plan that. You know what I mean? I know a lot of like we still have to plan the honeymoon. We actually don't know where to go yet. Do you have any ideas where we can go for the honeymoon? >> Some I mean somewhere tropical like that. You both enjoy that, you know? >> Yeah, we still have to think about that. But I mean, right now we're just mainly focused on like moving everything. And >> how long how long have you guys been thinking about this? I mean, just as before we got married, before the wedding. That's what we were thinking about. >> Have you guys told anyone? >> No. We actually didn't know you're going to be here. That's the thing. >> Yeah. No, I mean, >> you don't tell anyone. Okay, Steve. No one knows we're leaving. Let's go get some more stuff. >> We were going to send you guys like a postcard or something to let you guys know. But maybe it's better that we saw him, right? Like tell him. >> Yeah. But as long as he doesn't tell anyone, you know, he he saw us. So, let's hurry up. We have to get more stuff. Do you need anything from the house? >> Guys, I'm just going to be chilling here. If you guys need my help, just let me know, okay? >> Then we might we might need your help in like 5 minutes. >> I need help. >> Okay, Marcus, you need to answer this phone right now, bro. >> What's up, >> Marcus? Marcus, can you hear me? Can you hear me? >> Yeah. Why Why are you whispering? >> Dude, you're not going to believe what's going on right now. And I need you to get to the HQ right now. I'm not kidding. >> Why? The creepy man. >> No. Wait, what? >> No creepy nothing's there. >> No. Have you talked to Lucas recently? >> No, I haven't. Why? I >> Lucas is here with a with a U-Haul truck with Ivonne, and they said they're planning to move, but not moving out of like near like away from their house. They're moving out of the country. Like, that's what they're talking about. I'm not even kidding, bro. I'm not even kidding, bro. I know. I know it's hard for you to believe, >> dude. Look at this. Look at this. I'm not even kidding. Look. You see the truck? Yeah, that's it. What's going on, >> bro? What do you mean? What am I you Bro, they're trying to They're moving out stuff out the out the room. They're grabbing your you guys' old clothes. He's grabbing them right now. >> Let me see the truck right now. >> Bro, look. Look at this. Look at this. >> Let me boxes in there and stuff. >> Yeah, they just moved in a couple boxes, bro. I'm not kidding. Like, get over here. >> It was a prank. >> No, I mean I of course I I like geeked out. I was like, \"Oh, yeah, yeah, yeah. Oh, it's so funny. They're like, \"Nah, this is serious. You haven't told anybody. Like, you need to get here to like right now.\" >> Can you not? >> I see. >> Nothing. Nothing. Nothing. >> Who you talking to? >> Nobody. >> No. Tell Marcus about this. >> I know. I know. A lot of people probably think it's a prank. It's not. So, you know what I mean. I don't want to prank anymore. >> Since when you wanted to do this, >> well, like I said, the wedding my life with my wife. >> I I get that. But is was this was this a mutual idea or was this? >> It was both 50/50. Me and Yeah, Ivon's idea. So, I'm tired of the pranks. I don't I'm moving away for good at least for a couple months already. >> What about the channel? Huh? >> The channel. Marcus could just do it. He likes to prank and stuff, >> bro. It's Lucas and Marcus. Not Marcus. >> Those be Marcus. >> What' you say? >> My other suitcase with my stuff in it. Where's that? I can't find it. >> The suitcase. Oh, it wasn't in there. >> Are you gonna have to transfer to come for the the pizza? >> Oh, the car, right? >> Are you taking You're taking the pizza, right? Didn't you make the >> I'll probably take one or two cars. Yeah. Over there. But it might take some time to get the cars over there. >> Um guys, you should probably check your the bedroom upstairs. You probably guys left some stuff there. >> Yeah, I just I just took the Yeah, but I can't find the suitcase. >> Don't know if I put my stuff in it. There's still some space to put more stuff upstairs from upstairs. >> Oh, yeah. Excuse me, Steve. >> Yeah. Yeah, you're good. You're good. You're good. Are you guys like in a rush or something? Like what's going on? >> Yeah, kind of. Yeah, we're going on a rush here. >> Wait, why? >> Cuz we have to we have to catch our flight. You know what I mean? >> So, who's who's taking all the stuff? Do you you got a driver or something? >> Mover. We have to meet the movers. So, we have a long drive. We have to meet the movers. They're going to drive all of our stuff while we take a flight. >> Oh, yeah. He's texting me. >> We're late. >> Yeah. >> How How is the traffic now? >> We're like an hour and a half away. We have to go to the city, DC. >> Anyway, I don't know if we're going to make No. Can Can you tell them like can we like push it back a little bit? We're going to be late. >> Push back the flight. >> I feel like you guys are guys, but our flight takes off in 2 hours. >> I don't want to interrupt or anything, but it seems like you guys are trying to hide this from everyone. >> Yeah, >> cuz why are you rushing it? >> And what? This is not no prank. I don't This is not a prank. >> Obviously, you have a U-Haul here, but I'm just saying, guys, >> stop. What? What? Steve, >> bro, why didn't you just tell anybody? >> Stressed out. We're trying to >> You guys are already stressed, it seems like. So, >> where where's the suitcase at? I don't know who I came out here to ask you. I can't find it. >> Guys, I'm sure if you guys told everyone that I'm pretty sure they would understand, you know. >> I don't think they would. >> No, they won't. Cuz we just got married and wedding and now we're moving moving away. >> People are going to try to hold us back and >> No one's going to hold you back if this is what you want. >> Is that all? Is that all we need then? >> You should have just >> Steve. >> What? >> Steve, I told you not to tell anyone. Steve, >> dude, he has access. He has access to the front to the front gate cameras. He has access to the cameras. He probably seen what you're doing, bro. >> Gosh. Now he's really going to talk us out of it. >> Yeah. Should we get >> Guys, if this is what you want, no one's going to talk you out of it. >> We got to go get blue and we got to head out. >> Okay, cuz we got to >> Why would I do Okay. >> Where you going? >> Hold up, bro. They're literally running. Oh, they is he just moving his stuff to like his Ivon's house? >> So he said he has a mover ready to drive the U-Haul with all their stuff and they have to catch a flight like today. >> They're literally running away. >> So they're moving out of Ivon's house. >> I don't know. >> Where are they moving to? >> They said they're moving out of the country. I don't know. Maybe Mexico somewhere >> actually. Like why you didn't tell me why? >> I don't know. I just told them. I was like I told him like, \"Yo, why don't you just tell everybody? I'm sure we would all understand so we can plan this out. We just went to your wedding. We're all happy for you. Just tell us what's going on.\" They're grabbing all everything that they can and they're going to have someone drive up their stuff to wherever there is. >> Just follow them. I mean, >> bro, it's up to you. >> But you need to talk. Let >> me talk to him. >> Yeah, bro. Cuz this it's not looking good at all. >> Just be nice. Just be nice. >> Yo, what's going on? >> Yo, how yo you told him >> the gate? The cameras. >> What do you want? Where you going? We're moving away. We're moving away. A husband and wife are going out of the country. We're moving away. >> What? Why don't you tell me? >> Cuz you don't need to know. It's my own personal life. Why would I tell you anything? All right, cuz we're twins. >> We Where are you guys moving to? >> We're not going to tell anybody. >> We don't want anyone to know right now. Sorry. Look, we love you guys. We got to head out. >> Where you going, though? Like, what? You can just leave like that. >> Just tell mom and dad that we're heading out. >> What do you mean just heading out? Where you going? We don't want to say you're probably watching probably going to do our own vlog stuff or whatever. >> It's not how things work, bro. Like, where you going? Why are you hiding it from us? >> See you. >> See you guys. >> I'll probably see you soon. Maybe in a couple months, honestly. >> A couple of months. >> We're just taking a break from, you know, >> see you guys. >> Thanks for being supportive, guys. >> See you, >> guys. Which one? >> Look, I love y'all and I hope you have a great time, but we could have handled this a lot easier and a lot better. >> Well, just let us figure out some stuff and then we'll we'll let you guys know. Where's it going? >> We'll tell his parents eventually, but we just want to like focus on us right now and like >> Yeah, like our relationship, our marriage is very important. >> Guys, we we love that. You just should have just told us. But it's okay. Just >> like I said, we don't want anybody to talk us out of it. >> No, >> just go. Just go. See, that's what I'm talking about. >> We'll be back soon. We'll call each other and stuff. >> Yeah. >> The keys on the car doing it, right? >> I mean, he brought a U-Haul. >> We got to follow them. Wherever they go, we're following them. >> Okay, then let's do it. >> Marcus, we're going to have to figure out a way to talk them out of this. >> No, we'll follow them. Let's go. >> Come on. Don't forget to lock the thing. >> Oh, no. I'm locking it. Yeah, I'm locking it. >> You just have to pick up the one package. >> What? >> You have to pick up the one package. >> Where's it at? >> At the Amazon lock. >> I'm coming. >> Okay. Give a little bit of space and after that we start following them. Okay. >> Following me? >> Yeah. Yeah, of course. [Music] >> Whoa, they're in a rush. Yeah, I know. You're on bad terms right now. >> It's like that. >> Wait, just this way. You just going to turn on and tell me it's a prank? No. Right. >> Cuz like Cuz usually like how >> Marus I I don't think this is a joke. >> How How am I supposed to You don't think so? >> They have a U-Haul truck. They just put in stuff in there. That's a lot of effort for a prank, bro. I'm being serious. You're going to have to talk to them out of this. >> Just follow them a little bit. >> Yeah. What? >> Cuz like usually like he'll come out or something like that. Haha. Yeah, it's no none of that this time, bro. Yeah, I know. I don't want to scare you, but this is true. >> And you're not messing with me either, >> Marcus. I was just chilling in here, dude. Like, >> you saw And then what? >> And then, you know, I started seeing a U-Haul truck. I was like, wait, what's going on? Is what is this a joke? What? What is this? And I was like, is someone moving in and moving out? Then I saw Lucas and Ivonne. Then I was like, wait, >> I'm just confused. >> See him? I'm just confused how he didn't tell me >> because cuz they were hiding it from everybody. >> They were trying to run away. It >> was good enough distance. >> Yeah, I think so. Just give it a little more space. >> They didn't want anyone to know. They were shot when I was here. I don't know what to do. >> Okay. Whenever he gets to whoever is moving their stuff with the truck, we need to get there and convince him out of it. Like I don't know, bro. Like I just if it's true, it's true. Like I don't you know he's a he's married now. He's a grown man. Like >> I get that. >> I don't know. I don't want to I don't want to stop him from from what he what he wants to do in life. >> I get that too. But then there's L there's the channel. There's so many other things. >> I know. But I'd rather him be happy than if if that's what he wants to do, you know? just turn around. >> Like, you know, like I'm not going to I'm not going to be that kind of guy to stop him. Like, >> Marcus, >> what? >> I I get what you're saying, but still, we need to figure out a plan. >> What plan, bro? There's no plan. I We'll figure it out. Like, >> I mean, I guess I mean, bro, you know, Mu was here. I got you. But >> I just hope he's happy. That's That's the most important. We'll go from there. Maybe he'll call me and you know, maybe you just just wanted to go. You didn't want to tell me. >> Okay, I trust you. If this is what you think is right, then then so be it. >> What am I going to do? Stop them and be like, \"Well, why are we moving?\" And then then we're going to get even more heated at each other. >> I mean, they they could still do what they want to do. We We could have just came up with a plan, you know? That that's all we needed. >> Yeah. No, I wish he told me, but I mean I'm not I'm not gonna, you know, I'm not gonna if that's his decision. Like, it is what it is. >> I get that. I get that. I get that. I get that. You know, I do. >> But no, obviously I still love them. You know, it's good. Like, we'll figure it out for sure. I mean, I guess we'll see if he tells me it's a prank or not. I mean, I'm expecting his call in a couple days. Like, I don't know. I guess we'll see, right? >> Marus, >> then that would be very crazy if it's a prank. Like >> this is I mean let's just be hopeful at this point. That's all we can do, right? >> Yeah. >> All right.",
    "start_time": 0.16,
    "end_time": 934.7199999999999
}