{
    "video_id": "8m2De-LVnJc",
    "channel_url": "@lucasandmarcus",
    "transcript": "We're coming out. What's going on? >> What's up? >> What is he talking about? >> I don't know. >> Take this. >> Who's here? >> Creepy man's girlfriend. >> What? >> She's back. She's coming closer. >> What do you want now? >> Wait, wait, wait, wait. Hold up. >> What is she doing? We're just >> I don't know. She's just calling us over down calling us down there. >> Is everything okay? >> She's holding a flower and the baby in her hand again. >> I don't think she's okay. >> Bro, this sounds like a No, this is a setup. >> You think so? This is a setup for sure. Marcus, you're not pranking me again, are you? This is not kind of prank. Come on. You've been pranking me in the last video. In this video, you stole my dog, too. No. No. I'm sorry, but this is I don't know. No, this is not prank wars, right? >> No, this is I swear it's not. >> Don't be messing with me. >> I'm not messing with you. How can we help you? What do you want? >> Wait, what? >> What? >> You understand what she's saying or no? >> What? We're done. We're done. Nah, stop playing games. >> No, no, she's not saying that, I think. Look, >> just come come to the door. >> Something's wrong. >> Let's talk to her. >> Yeah, right. >> Where's the creepy man? >> She's always been pretty kind, you know, but >> Yeah, >> but she has her moment. >> What? >> So, wait. Ask her again. >> Where's the creepy man? >> What? >> What do you mean? What does this mean? What does that mean? >> Hey, back up. She's pulling out. Back up. Come here. Come here. You sure? Come here. >> It's just a note. It's just a note. >> Nah, she's pulling out something out of the baby. >> You sure? She pulled out something. >> Hold up. Something's wrong. >> What did you say? You just come down. >> Just come up here. Just come up here. >> Are you Are you messing with me or this kind of >> She's not messing with you. I see Marcus. >> Okay. >> You see something, Marcus? What does she do? >> No, I don't know. She What do you want? >> What does that say? >> She says, \"Come down.\" >> Maybe a note from the creepy man. >> All right, we'll come down. >> Well, honestly, lately, when was the last time you seen them together, though? >> You know what I mean? She's always by herself. >> No. You think this is a trap, Marcus? >> I don't know. I mean, that's why you have to be careful. >> Okay, come on. >> She looks like she's sobbing. >> What do you want? >> Hey, watch out, Blue. Watch out. Oh, it says he's dead. >> What? >> Oh my god. >> Who's dead? Margus, the creepy man. >> Okay, that makes sense why she has the flowers. Do >> we believe that? Well, she doesn't look okay. >> Well, yeah, if you think about we haven't seen him in a while. >> When has it been the last time? It's been a while. >> I mean, no, the last time was what? You and the wedding and this video? >> Yeah, the wedding. That was like over a month ago, right? >> Right. At this point, it has been. >> Oh, she's pulling something out of the baby. Maybe she needs help, right? But she is crazy, though. How can we trust that? Is this some kind of flank? I mean, >> it could be. Let's get our >> three of us. Yeah. Just Just grab something. >> Yeah. >> All right, back up. We're coming out. >> Yeah. >> Do we trust it? >> I mean, it's three of us, huh? It's just her. >> Where do you want us to go? >> She's calling us over there. >> Okay. >> Grab something. Grab something. I think she's harmless. >> Well, you want us to come. Oh, Morgan, let's follow her right now. She's harmless. Keep going. >> Yeah. Come on. Come on. Come on. >> Hold up. Slow down. >> Slow down. We're coming. We're coming. >> We're coming. Okay. Hey, where you going? Let's >> just follow her. Where you going? Nah, something's off tonight. I don't care. So, I don't I don't trust >> What are you doing with that flower tree? >> Grabbing a flower. >> Why are you stealing flowers from our tree? >> Hold up. Do you want to guide us to where you want us want us to go? Just go ahead, please. We'll follow you. >> Back up. >> It's okay. It's okay. Just follow her. Dude, she's never done that. Marcus, it's okay. It's a flower. >> All right, we're following you. >> I don't know, guys. It seems for real. Part of me feels like she's actually sad. >> Is she trying to say like that man died? >> That's what it seems. >> I mean, she said he's dead. >> Is this another folks though? Is this another prank? >> I don't know. >> I don't think so. >> But really, do think about it. When has been the last time? >> Where's she going? Yeah. I mean, we haven't seen her. >> Something's something's not right. What is that? >> Hold up. >> See that? >> See that? Come on. Come on. Come on. Come on. Come on. Trap. >> Are you sure? >> Yeah. We can't trust We can't trust a cookie, man. >> I mean, three of us, right? >> What is that? >> What is she doing? She's kissing him. >> It's a tombstone, guys. [Music] Let's get a little closer. >> Yeah. >> How did he die? >> Where's he at? Is he actually dead? >> He back up a little bit, bro. We can't talk. When When's the last time you you saw him? After everything you did, you think we're going to lay a flower on him? Where's he at? Hey, creepy man. Where you at? You see him anywhere? No, that's his face. >> Lucas, I don't I I generally don't think he's at he's here anymore. >> What if he just moved away so he doesn't have to take care of the baby? You know what I mean? >> I hear you, but something's off. I can feel sad energy coming from her. Genuine sad energy. What if something happened to him out here? You know, who knows? >> Yeah. When is the last time we've seen him? The wedding, right? >> We put our flowers down. >> Yeah. >> I don't know. Is this a prank? How do we actually know? >> At the end of the day, though, it's not going to hurt us if we lay down a flower. >> Yeah. No. >> No. That's true. >> We just want to be Oh, it's like the P man's girlfriend's like pranking us out of nowhere and we came out here just to do that. >> We got to expect that. >> We got to expect that. >> We should expect it, but it it won't hurt. I mean, she can't do nothing. She's harmless. She's holding a >> Back up. Back up. Back up. >> I want to set it down when she's not standing there. >> Let's do it one by one. One by one. >> Yeah. Creepy lady, listen. Just give us some space and we'll lay down the flowers. We'll we'll give our respect. Okay. >> Well, he's not like in our yard, is he? Or should just put that there now? >> I don't know. >> Stand up. Back up. Back up. We're going to put the flowers down, but we can't get too close to you because we don't know where you're >> just just, you know. >> We We'll give you We'll give creepy man his respect. Just please give us some space. Okay. >> Go first. >> Lucas, go ahead. >> Sorry for your loss, son. If this is real or not, we don't know obviously. But >> yeah, listen, we we we we hope that this is not a prank, right? And that you're not about to Who knows? We don't want the creeping man to be jumping out of nowhere, but we hope that you're okay. But we can't help you if that's what you expect out of us. We don't know what to do. You know, how how did this happen? Do you know how it happened? When did you hear the news? Oh, she's grieving. That's real grieving. You think the creepy man like I don't know. I'm just thinking crazy cuz like you think the creepy man told her to come here to try to prank us cuz I think that would be his his first prank. But I don't know. I don't want to say everything's going to be a prank. You know what I mean? >> I I do agree. I mean again I just something feels different this time. Or is it just me? >> I don't know. >> What do you guys think? >> I don't know. I guess the only way to know is we want to go throughout the week. Next week we see if he shows up or not, right? >> That's true. If he doesn't show up, then we know it's true, man. >> You could use one of my flowers to to like >> Yeah, man. Well, >> hey, Kirby, man, wherever you're at. Um know we have bad moments, but >> pay my respects, man. You know, man. >> Yeah. Regardless, >> I just hope it's not a prank. >> Yeah. I hope this is not a joke, cuz it's kind of serious. kind of wish it was cuz I wish they didn't. No. >> Yeah, that's >> I don't know. It's not seeming like a prank, guys. I mean, that's the baby daddy of the baby. You know what I mean? But >> yeah, >> when was the last time we've seen that? >> Feel like something some ever since New York, something happened in between, you know? Yeah. >> Like what if you got in trouble >> in New York? Yeah. Like you said, he gets in a lot of trouble, right? >> Yeah. [Music] >> Pay. Did she just want us to pay our respects? >> Maybe. Yeah. There's no way this happened here. >> Where's she going? Right. >> Okay. >> I don't know. I don't I don't really know. >> He's somewhere around here. >> No. No shot. He would have showed up already. That was the perfect time. Using us the flowers. Like, >> you know what I mean? >> You think it's a prank? I think it is. >> I think it's a plane, bro. I don't trust I don't trust a creepy man. He does creep. >> I don't either. I don't want to I don't >> I get what you're saying, but why would she go through all that trouble? >> I don't know. Well, if maybe he's up to it, too. >> What? >> Well, maybe he's lying to her, saying that he he's gone, but he's actually not gone. >> So many factors. >> What if he's planning to Okay, I could say this. I could say this. >> He could be planning to play dead so he can sneak on us. >> Yeah. You know, cuz Oh, we get him out of his mind. >> Yeah. You know, Halloween is coming up. You know, he's probably going to show up again. >> Oh, god. >> You know what I mean? >> It's so true. >> Yeah. >> All right. Well, I love you guys so much. Thank you guys so much for watching. We're going to stay on top of this. >> Yeah, for sure. Go watch our last couple videos to see what what he's done, all the bad things he's done. >> Let's just stay cautious regardless if it's true or not.",
    "start_time": 0.08,
    "end_time": 637.68
}