{
    "video_id": "qGZgAMIJFZQ",
    "channel_url": "@lucasandmarcus",
    "transcript": "Now, this is crazy. What I'm about to do is insane. So, I'm about to steal Lucas and Ivon's puppy. Blue. >> This is crazy. So, Lucas and Ivon, they're not at Ivon's house. They're at the HQ. So, I parked my car right here so they don't know it's me who stole Blue. So, I got to I got to run all the way over there. Hopefully, they're not in sight. And I'm about to steal Blue. >> Lucas, why? >> I'm about to get both of them mad. Lucas and Ivon. So, you just recently kidnapped Ivonne >> in this video. Yeah. >> Which is pretty crazy. But now I'm about to make both of them mad and both of them scared. The prank will have begun. So, >> what if they call the cops on you? >> I got to escape. >> Oh my god. Yeah. Let's You got to escape from your own house. That's very smart. >> Yeah. >> All right. >> So, wait. What's your game plan then? What are we doing? >> I mean, I just I just got to sneak in the house and and get blue. >> Okay. Now, let's imagine if you're one of these thieves, how would you do it? I don't know. I'm kind of scared, bro. >> I mean, you shippy, bro. They call 911 is is is a rat. >> Let me put in the code. Okay. Go ahead. Do your do your thing. Did it work? >> It worked. Come on. I mean, yeah. At some point, I'll just have to go in there and you have to stay just to stay far back cuz then they're going to see you, you know. >> No. Yeah. If they they see me, they they will know what's going on. >> How do I look? >> I look Yeah. I mean, bro, like a thief. >> Good. >> Yeah. Just hide your hair. Remember people, they see your hair, they they they're know they're going to know it's you. Is >> that good? >> Yeah. Yeah, that's good. Can you see something? You see anything? >> I got to get closer. >> Yeah. >> This is crazy. >> Yeah, it is though. It's just like I'm expecting you to have some type of plan. >> That's my plan. Getting sneaking in and and stealing blue. >> Okay, I guess. >> Good thing I turn off my location. >> You did, right? >> Yeah. I only have his location. That's how I know he's here. >> Does he have an idea of what you're doing right now? >> No. >> Oh god. Keep your head down, bro. Like, do you know they can see us from here? >> I don't think they're in the living room. They're probably upstairs. >> Oh, you think they're like taking a nap or something? >> Let me see if I can zoom in. >> Yeah. Try to see if you can see anything. >> You see it? >> No, >> I don't see anyone. >> Okay. Okay. What's the best way to get in? >> I don't know. It's probably best if like just hide behind that bush and just stay there, right? >> Yeah. Cuz we can't like we can't be seen by two people. >> Let's use the Let's use the trampoline as cover and come around this angle. >> Yeah. Right. >> Yeah. Come on. >> Cuz we could go in the field. They're going to see us easily. >> Yeah. >> Keep your body down. Keep your down. Come on. >> Behind the bush. Behind the bush. Hide. Hide. Hide. I don't see them. >> Yeah, me either. >> My heart. I need a break. I can't like see through the I got to get a little closer. >> Okay. >> Just don't get caught. >> Oh my gosh. Blue. >> Yo. No way. >> Yeah. Look. >> Okay. >> You see her? >> Yeah. Yeah, I see her. Okay. There's the package. We got to secure her and leave. Let's see if uh the the door's unlocked in the in the back. >> Okay, come on. Come on. Come on. Hurry up. Hopefully she follows us. Problem is Lucas. Where is he? >> He's probably upstairs. All the way up there. You can't see us. You can't see like the gate or anything from there. >> Yeah. >> No, of course it's locked. We always lock them. There's two ways. Going through the top with the ladder. Let me let me check in the end door. Like inside cameras. >> Oh, that's true. >> Yeah. Now that I have Wi-Fi here, I mean, there's no one in here. I don't see anyone right here. >> Ah, this is just a fountain. Okay. I think you should just leave. >> Okay. So, you just wait for you? >> Yeah. Just just maybe just hide behind the bushes cuz if he sees two people, it's done. >> Okay. Okay. >> You know what I mean? >> So, where do you want me to wait? where we were at. >> Yeah. Probably where the trees are. >> Okay. I'll just wait for you there. >> Okay. >> All right. And just come with Blue. >> Once you see me with Blue though, >> we'll run. >> Like once you see me with her, just run before me. >> Run before you. Yeah. >> Okay. >> All right. >> All right. Go. Go. Go. Go. >> All right. >> Good luck. All right. Hopefully, one door is unlocked. Let's see. This is crazy, guys. Like, it's it's intense. My heart's beating so bad. Lucas is in that window right there. So luckily it's closed. Let me see if I can see him. Oh, I see blue. Blue's right there. Oh, hey Blue. We have no idea what's about to happen, but this door's unlocked. It's not unlocked. I'm going to go a magnet. Hey. Hey, F. Unlock it. Unlock it. >> What's going on? >> Stay here. >> Okay. >> Oh no. Hopefully he doesn't get caught, bro. Okay. Oh my god. Is he grabbing her? Is he grabbing her? Oh my god. Come on. Oh my god. He got her. He got her. Go. Go. Okay. Okay. Go. Go. Go. Go. Go. Come on. Hurry up, boy. Bro, we got to hurry up, bro. Oh my god. Okay, probably got about 10 minutes before he figures out that Loo's gone. Okay, Lucas, let's go. I'm trying. >> You know Lucas doesn't play about blue, bro. You got to hurry up. Okay. All right. Let's go. Let's go. Okay, you made out of bed. Good stuff. Come on. >> All right, come on. >> Yo, watch out. Hook you up real quick. Come on. >> All right, let's get out of here, bro. >> Good stuff. >> Let's go. Let's go. Let's go. >> I don't know what they're going to think. I mean, >> if they find me, if if if they find out that I didn't, >> Marcus, I'll be honest with you. At some point, he's going to find out. >> He's going to be doing the same thing you would have done. He's going to look at the camera. He's going to see someone taking Blue and it's going to take a little bit of time before he figures out like it was you. >> Maybe he'll keep Blue overnight. >> I Oh, what? >> All right. Figure it out, bro. Come up with something. No, no, no. Pick it up. He's going to be suspicious if you don't answer the first time. Trust. >> No, but now he's going to be suspicious right now if I don't if I don't pick up right now. >> I mean, >> I'll just be like I'll just I canceled it. >> Oh my god. Watch. He's going to be like, \"Why don't you answer me the first time?\" >> Cuz I know I don't know what to say. >> Are you sure? >> Okay. >> He's calling me again. >> Okay. Answer. >> Yo. >> Yeah. Mark, what's up? Can you hear me? >> Yeah, I can hear you. What's up? >> Yeah. What? What? What are you doing? Where you at? >> I'm just chilling. I'm about to get some food. What about you? >> I'm just uh I just can't find Blue right now. Did anyone stop by the HQ? Like the house? Does anyone stop by? >> No. No, I don't think so. Check. You want to check the cameras? >> Yeah, she was right beside me. Blue. Blue. I just can't find her. Like I don't know if she ran out on ran out on me, but I didn't open any doors. >> Yeah, I don't know. I wasn't I wasn't there. Just check the cameras. >> All right. All right. Let me know if you swing by the HQ and let me know if you see you or anything. I'm gonna try to look for her. >> Did you not get my first call? Why didn't you pick up the first time I called you? >> I had no connection internet. I had no Wi-Fi. >> All right. All right. See, hold on. Let me try to look for her. >> Blue. Blue. >> Let me know if you find her. >> All right. Bye. >> You know he's going to figure out that it was you, right? Why'd you tell him to check the camera? >> Cuz then if I didn't, it would just be less suspicious. I mean, I had to >> He's going to But I get that. But now he's definitely going to kill you. >> Which camera is he going to look at? >> He's going to look at all of them cuz he's looking for blue and then he's going to see the gate camera. Watch. He's going to show up at your doorstep looking for blue. Watch. I promise you. >> Nah. Don't jinx it. Don't jinx it. >> All right. >> Don't jinx it. He's calling me again. >> Oh my god. >> I have to pick up, right? >> See, I told you. >> Yeah. Answer. Answer. >> Yo, >> dude. I just can't find blue. Okay. >> What do you mean? I have Marcus on the on the on the phone, too. Marus, can you hear us? >> Yeah, I can hear you guys. >> Do you know where's at? >> No, I don't. I'm not even there. >> I told him to check the cameras. >> The camel's not working right now. It's not messing with us. >> I'm not messing with you. What do you mean? >> Did you take blue? >> No, I didn't take >> I just You can't find her. Did you take her, Logan? Stop messing with us. >> I'm not messing with you. I didn't take her. >> And where is she at? >> I don't know. But you I'm going to stop by his house and see if >> Yeah, he probably did take her. He's been pulling pranks all the time. >> Oh, yeah. Stop by. I didn't take her. Stop by. >> Go check his house. You guys have been so mad at >> you guys are losing connection. >> No, I know you can hear by >> I told you, bro. It didn't even take more than 5 minutes. >> No, but they don't know that I have her yet. You know what I mean? >> But they're hunched, bro. They're already They're telling you they're going to come over. Watch. >> Oh, Winston's going to give it away. >> Hey, Win, stop. >> What do we do now? Huh? Right, Blue? >> Nothing. When I think about that, >> you really thought about getting her, right? >> Stealing her. Yeah. >> Oh, no. No. He's calling me again. I can't pick up. I'm not going to pick up. Why? Cuz >> what's going on? >> Stole her. >> What? >> I stole her. >> Why? >> Because when? Wait, what? >> I stole her >> from where? >> From Lucas and Ivonne. >> They're not going to be happy about that. >> Yeah. I don't I don't I didn't plan after. I think they're on their way right now. >> But they don't know I have her yet. So, should we just hide in that room? >> You can, but I know they're going to be really mad at you. >> See, I told you >> I don't want to be a part of it. >> Okay. >> I don't want them that I was any part. >> No. No. No. You're not. You're not. You're not. You're not. You're not. >> He is here. >> Okay. Well, then what do we do? >> Okay. So, how do we hide her? >> Should I just hide her in here? >> I mean, the moment they say blue, please. >> But don't don't uh I don't want him to see the camera you filming now. So, let me just talk to him. Just be like a >> No, I'm I'm going to put it somewhere. I'm going to put it somewhere. I'm going to hide. >> No, I don't want him I don't want him to come in yet. Maybe just hide downstairs. >> Okay. Okay. Okay. Just grab Blue. Grab Blue. >> Oh, Marcus. Yo, Marcus. He's at the door. >> Yeah. Yo, what's up? >> What's up? >> The sky is beautiful. >> Yeah, the sky is beautiful. Not blue. >> Wait, she's not here. >> I know you did it. You keep pranking me this week. No, she's not here. >> No, you keep pranking me. Stop playing with me. Where's Blue at? Blue. Blue. >> Yeah, she's not here. >> Blue. >> Now you kidnapped my wife and now you you ste my stealing my dog, too. Don't be trying to play with me. >> All right, come in. >> Blue. >> Blue. >> I actually can't find it. I didn't find it for like I was looking for why you blame it on me now. >> Blue come on you like this. [Music] >> Blue. Yo, are you serious? >> She ran out. She ran out. >> This you want to play? Nah. See, I can't believe you're helping him, too. It wasn't my It It was my plan. It was my plan. >> Honestly, Ivana's freaking out. I'm freaking out, too. You think you're going to keep pranking me this week or what? That's not even fun. Look, >> she ran out of the door. What you want me to do? >> That's not even funny. Are you serious? >> Yo, chill. No, it's not funny. >> I I found Blue. Margus. Margus and Steve took her. I'm coming home now. >> Just >> Wait, what? >> Yeah. >> I'm sorry. I'm sorry. >> No. Yeah, Morgus had her. >> Not funny. I'm going to prank y'all back. >> Yeah, I'm serious. She's just laying out. Yeah, he wants to keep pranking us. He thinks it's funny. >> I know. That's what I'm saying. I'm coming home now. >> I told you. >> Bye. >> I don't know. No, we got to pick him back. This is This is not funny anymore. >> All right. Well, that didn't work out too well. Well, at least No, it didn't. >> If your cars ends up stolen, just just know it was them or something. I don't know, bro. >> All right. I love you guys so much. Thank you so much for watching. And we didn't keep it long enough, bro. >> You ran out the door, bro. >> No, it's okay. It's not your fault. It's It's hard to keep her like in the in the room. But love you guys. Go watch our last video to see what's going on. It wasn't bad. It was It was a good print.",
    "start_time": 0.08,
    "end_time": 869.76
}