{
    "video_id": "VxDnlheuAwY",
    "channel_url": "@toysandcolors",
    "transcript": "Let's go, buddy. Oh no. [Music] What happened, kid? Miss Beth, the door's broken. >> That's okay. Just get inside. >> Hello, Uncle Luke. >> I'm here. >> That was fast. >> Let me fix it. >> Okay, fine. Let's start our math. >> One for you and one for you. What's the pity? >> Wow. >> Okay, PJ. >> Sorry, Mr. Luke. Are you done? >> It's too broken. I don't think I can fix it. >> Sorry. >> Guess I can leave the door open. >> Okay, kids. There's no more noise. >> Thank you, Miss Bez. [Music] >> Why so cold? Me too. I think we should close the door. It's too cold in there. Okay, let me close the door. [Music] Oh no, it's broken. It cannot close. Kids, can we just study like it's loaded? >> Yeah. Ah, let's go to another room. Okay, there's your backpack. [Music] We can study. Uh-oh. >> And the wall broken is red. >> We can study here. >> You're right. Ah, let's move to another room again. >> Come on, kids. >> All right. Wow, this is a nice room. >> Yeah. Now we can study. Then can you finish your math, please? [Music] >> Huh? >> I don't think to finish working anymore. >> Oh no, >> it's too hot. >> Me, too. Let's worry about this after lunch. Okay, Miss B. >> Welcome. Welcome to the cafeteria. >> Yay. >> Pick the food that you want. >> Thank you, Mr. Luke. I'll get chicken. I'll get apple. >> Huh? All the food. [Music] >> The chair is broken. >> Oh no, it fell off again. Hi everyone. Oh no, it's a police officer. Kids, can you go outside and wait, please? >> Yes, sir. >> All right, I need to check the school. >> Oh no. >> What? Are the food a burnt? >> Yeah. >> And the chairs broken? >> Yes. >> This room is so cold. It's because the door is broken. >> Let's check another room. Okay. Police. >> Why is this room so hot? >> Because our fan is broken. >> But you need to fix it. >> I know. I I will, officer. >> Let's check another one. >> What? >> Oh no. >> There's a lot of spider webs and broken logs. I think you need to close your school. >> What? No, officer. How can the kids learn? >> And how can they eat? They can't eat butt food and cannot study and walk and move. >> So fix this so you can reopen again. >> All right. See you later. >> A >> M. Are you okay? >> What's wrong? >> The school will close until it's fixed. Sorry kids. >> A >> Let's go. >> The school is closed. How can we study Kaden? >> I know. Ah, let's help Miss Beth to rebuild the school. >> Good idea. I can make food. Let's go. I'll make the sh [Music] [Applause] >> Wow. [Music] >> Awesome. >> Kayen, are you done? >> Yeah, I'm done. Then let's go back to school. Yay! >> I think we are done. >> I'm done too. But where's Miss Beth and Mr. Luke? >> Let's go find them. >> Okay. I think they are here. >> Oh, Maddie, look. Let me help Miss B. >> Okay, Maddie. Look, let me help you. >> I don't think you can help. It's too broken. >> Don't worry. Trust me. >> Wow. Better than like my tools. >> It works. Amazing. Thank you, Kayen. >> You're welcome. >> Miss, I can help. >> Thank you. >> I think we're all done. I'll call the police officers. >> Let me check. >> Well, the food is not burnt anymore. >> Oh, you also fixed this chair. >> Yes. Cool. [Music] Perfect. >> Yes. All the rooms are nice and clean, so you can open your school now. >> Yay. Thank you, police officer. >> Glad that the school open again, right, Maddie? >> Yeah. Come on in. It won't be cold anymore in this room. The door spits. One Lego. And add one more Lego. How many do you have? two. >> Good job. >> M [Music] >> kids, do you like our school now? >> Yeah. Nice and clean. >> Wow. [Music] >> Huh? Huh? Hey, it's early and I'm sleeping. It's 6:00 a.m. I'm trying to sleep. >> Uh-oh. I'm so sorry. >> Now I can go back to sleep. >> Go to present. [Music] It smells so good. Mama, fly. Go away. Fly off. Huh? Slice. Huh? E. >> Ellie, stop cooking. Please. We need a sleep. >> Uh-oh. Sorry. >> House for sale. House for sale. House for sale. >> I want to buy this house. Is it for sale? >> How much is this enough? Uh, yeah. This is enough. >> Here you go. >> Thank you. Bye. >> Bye. Yeah. >> Yeah. And now I can sleep better. Me, too. [Music] >> Huh? [Music] >> Oh, yeah. >> Huh? [Music] >> Excuse me. I'm trying to sleep. >> It's only 11:00 p.m. >> Yeah. Huh? [Music] [Music] Oh no. [Music] >> Excuse me. be able to clean up the trash after the party. >> That is not my responsibility. I need to sleep. >> Oh no, someone parked in front of my car and in front of my car too. >> Can you move your car, please? >> Clean up, please. >> That's the way I park my car. And I won't clean up. I need to go to sleep. >> Huh? [Music] That's so tiring. I remember when Ellie used to help us a lot. Yay. [Music] Phew, that was a lot of work. >> We should ask Ellie to buy the house back. >> Ellie. Ellie. Ellie. >> Hm. >> Can you buy the house back? We really want you to come back. >> Yeah, please. >> Sorry, I have no money and I have to take care of my garden. >> You know what? I have an idea. >> Awesome. [Music] >> Fruit for sale. Fruits for sale. Here's the orange and peach. >> Thank you. >> Cool. Ellie, you have enough money to buy back the house. >> Thank you. You can have your house back. >> Thank you. >> Bye. >> Bye. >> Yay. >> Ellie, welcome back. You are a great neighbor. >> Thank you for helping me. This is the best community. >> Yeah. >> Where can I park? >> Huh? Now you can park your car. my luggage. >> Don't worry, I'll get it. >> Awesome. >> Hello. >> Reservation for Ellie. >> H. Let me check. That's right here. >> Upstairs with the view. >> Um, first floor of a window. >> Thank you. Not bad. Wow. This is a huge present. >> Huh? A present. A I want a present, too. Oh, there's nothing in there. This chair is so comfy, >> huh? Comfy. I should relax. How about some fresh air? >> Ew. >> Everything is bad. Where's my luggage? >> Uh, so sorry. >> Can I get a different room, please? >> Uh, let me check what I have. How about this room? M >> I don't like it. >> How about this one? >> No, I don't like this either. >> How about some free lunch while I fix this? >> Okay, >> I'm here. >> You have a customer at the restaurant. >> Oh. Uh, is anyone in here? Oo. Wo. Which one should I try? I'll get water. Great choice. Enjoy your soda. I want water. Not soda. Water. Water. Water. Oh, one second. I don't want soda. I want water. Oh. [Music] Hi, Ellie. Here's the menu. Thank you. I'll get a salad, please. Okay. Why is the table so messy? M salad. How do I make one? A little bit of lettuce, few pieces of bread, and this. Here you go. What? This is a salad. >> I'm sorry. Let me try again. H I know this lettuce and let this maybe a little bit of this is chocolate, not salad. Oh, this is so bad. Just let me clean up. >> No, thank you. [Music] [Applause] [Music] I need help. >> Ooh, I'm over here. Let's try. Uh, this is too close. Uh, this is uncomfortable. Ah, that's fair. >> Huh? [Music] >> This is very bad. [Music] >> Oh, Ellie, here's your luggage. >> Thanks, but I'm leaving. >> What? Why? You're leaving? >> Everything went bad. [Music] A [Music] >> Huh? >> A >> Ellie, I just started working here. I'm new. >> Me, too. I think I know what happened. Ellie will love her gift. >> Huh? A gift? I didn't get a gift. >> Anyways, I got to go back to work. I think I need to call for help. Oo, a movie theater. >> Sorry, Ellie. We can make it better. >> Uh, I got you a new room. How about you go take a nap upstairs? >> Okay. [Music] >> Here's your present for staying at the hotel. >> Thank you. Wow. [Music] >> Amazing. >> The big wolf. >> Oh no. Wait. Wait. >> What happened? Big wolf is chasing me. What? >> Neighbor. Uh-oh. >> Hey, wait. Help. Help. >> Huh? What happened? >> The big bad wolf was chasing us. >> Get in my house. Hey, >> oh no, the wolf. >> You can't destroy my house. >> Huh? Let's call the police. >> Yes. >> Police. The big that wolf wants to destroy our house. Hey. Yeah. Stop right there. >> Huh? >> Yeah. You're going to jail. >> Good job. >> Come on. Let's go. Come on. Keep it going. >> Bye, Wolf. >> Let's see the judge. >> What? >> What happened here, Wolf? Explain. >> Yeah. Wolf. Tell it to the judge. >> The wolf destroyed our houses. >> Yeah. >> No, no, no. I didn't do it. I remember I had a cold that morning. Oh, I wanted tea, but my tea box was empty. So, I went to my neighbor's house. And then I sneezed. [Music] So, I went to another house and I sneezed again. >> Hey, hey, wait, wait. >> And that's what happened. No, not no. The wolf destroyed our houses. >> Yeah, yeah, yeah, yeah. Order. >> Silence. The judge is going to make a decision. >> Guilty. >> The wolf doesn't go to jail, but the wolf has to rebuild the houses. >> Woohoo! Sorry, piggies, for destroying your houses. >> Okay, we forgive you. >> I'll help to rebuild your home. >> Let's go. Awesome. [Music] >> Oh no. >> What are we going to do? >> I will get more wood. >> Okay. >> Wood. I have wood. I have more wood. >> Perfect. Ready? Wow. Now, let's make the wood house. Let's go. >> Yeah. Let's build it. [Music] >> We're done. >> My house is done. Good. I'm hungry. >> I can get food for you. >> Okay, thank you. >> Hi. >> Hi. Welcome to my store. I want to buy some food for my piggy friend. Good. I have a lot of food over there. Oo, >> here you go. Thank you. Ooh, chicken. >> Jenny. Jenny, do you have eggs? You want eggs? Here you go. Okay. $13. We're going to eat good. Your total is $20. There you go. Thank you. Bye. >> Hello. I have food. >> Oh, thank you. >> No problem. >> I would make food for you. Oh, yummy. >> But I'm cold. >> I can get wood. >> Thank you. Bye. >> Wood. >> Hey, a bear. Let's make food. [Music] Food is ready. >> Here's the one. >> Thank you. Let's eat. M yummy. L >> Wolf, you can stay in our house. >> Thank you. >> Sorry for calling the police. You are a good wolf. Fire water. >> The team of super awesome heroes fight and serve. The colorful rangers. >> I want those stones. >> Oh no. >> Uh-oh. Somebody needs help. >> Hi, I'm Jerry and I'm the green ranger. I need good soil. I don't have fruits and vegetables. >> No worries. The green ranger can help. >> Thank you. >> Wow. >> Only colorful rangers can do it. >> Thank you, Colorful Ranger. >> No problem. Bye. >> Bye. >> Thank you. >> Huh? Who are you? >> I'm Thanos. Give me that stone. Give me it. >> No. >> Give it to me. >> No. I got it. >> Oh no, my colorful stone. >> Help. >> Uh-oh. Someone needs help. Blue Ranger is here to help. >> Thank you. >> No problem. >> Hey, you give me that stone. >> No. No. >> Give me the stone. >> No. >> I got it. >> Oh no. But now I need fire. >> Uh-oh. Somebody needs help. Red major can help fire. [Music] Oo, thank you. No problem. >> Hey, you give me that stone. >> Huh? No. No. >> Hand it over. Give it to me. >> No. Now I've got the red stone. >> Oh, no. I need help. >> What happened? Thanos has my stone. Mine, too. Let's recover, then. Let's go. Finally, I have the colorful stones. >> Hey, you give us our stones back. >> Get him if you can. >> I'm tired. >> He's too strong. >> He's escaping. Let's go. [Music] >> Oh no. Oh no. my fruits and vegetables. [Music] But >> oh no, where are the colorful rangers? [Music] >> Delicious. >> Thanos. >> Oh no, my steak. >> I don't like steak. >> Where are the colorful rangers? Hey you. Oh yeah. Oh no. >> Oh no. >> Danos, give us back our stone. No. No. No. >> He's too powerful. >> I can do this. >> Wow. My blue stone. I got the blue stone. >> I still have the red and green stone. >> You don't have enough power. >> Thanos. Thanos. [Music] >> No. What are you doing, >> Mom? I'm playing. >> No, no, no. Thanos, come back and do your homework. Get us back there, toys. Here you go, Power Rangers. >> Thank you. >> Nice, kid. Let's go, Banos. Do your homework. >> Yeah. [Music] >> Go Banos. >> I'll be back for you. >> Welcome to the car wash. >> What will it be? >> H wash, dry, vacuum. Full service, please. It's time to wash. >> Yeah. >> All right. Well, I guess I'll sit down and wait. >> Now, a little bit of soap. >> Time for some orange soap. >> Now for some pink soap. [Music] This car is dirty. And now for a rinse. >> Uncle Tim, there's no water. >> Oh, Ellie, the hose is caught under the tire. [Applause] >> You got it, Ellie. Come on. Pull. It won't cut off. >> It's finally off. [Music] >> It's soaked. >> I'm so sorry. And it's so dirty inside. Ew. [Music] A a room stew, huh? Time to vacuum. >> This is hard work. >> Oh, I'm so sorry, Uncle Roy. >> Ellie, look at the hose. Oh, Ellie. >> Oh, there's trash in my car. >> Don't worry, Uncle Roy. I'll get the trash out. [Applause] >> Ellie, we have more customers. >> What's the hold up? >> Taking forever. There, that's all the trash. Now it's time to drive. [Music] Ella, make it go faster. Uh, >> okay. >> Even faster. >> Okay. >> Oh, no. [Applause] Ah, turn it off. It's so windy. >> You're off. You're off. >> My car is worse than before. >> A >> Oh no. What am I going to do? >> Don't worry, Ellie. We can help you. >> Awesome. >> Ellie, here's some funs for you guys. That comes soap. >> Here, you can drive the car with these rags. >> Yay! >> They're all good. >> Wow. This is the cleanest it's ever been. >> Wow. Great job, Ellie. And thanks for helping you two. Bye. [Music] Colors.",
    "start_time": 1.28,
    "end_time": 1646.44
}