{
    "video_id": "6MLtiMfcaVY",
    "channel_url": "@toysandcolors",
    "transcript": "Yay! Wow! >> Awesome. >> Yay! My phone's so cool. >> It's just a can. [Music] >> Where's my toy? [Music] >> Wee! My toy is so fun. Wee! Yes. >> That is way to your butt. >> Ben, can you help me? >> Okay, Uncle. >> Here's my chance. >> Huh? Where's my toy? >> A not here either. I have to ask Lily. Lily, have you seen my toy? >> No, Ben. My toy disappeared, too. >> What? Guess we have to make new toys then. >> Okay. [Music] >> Wo. [Applause] >> Let's make another toy, Lily. >> Okay. [Music] >> Ta. [Music] Go go go go go. [Music] That's what I even thought. Let me take another one. >> Wow, >> that's even more boring. I'm taking a nap, then. [Music] >> Yay! We did it. >> Wo! >> Awesome. [Music] Lily, let's race. >> Okay. Go, go, go, go, go, go, go, go, go. >> Yay! I win. >> Good job. Then let's race again. >> Too much fun. >> I have a plan. [Applause] [Laughter] Huh? What's going on? >> Let's check it out. [Laughter] [Music] >> All right. A lot of kids. >> We have to clean up. >> Okay. >> Now I have all the toys. It can't find anymore. H. This is what >> fun. >> They have to clean up and they're having fun. That's impossible. [Music] >> Yay. [Music] >> Hi, Ben. Hi, Lily. >> Hi, Grass. >> Sorry I took your toys and made a mess. >> But why did you do that? >> It's because I never have any fun. >> How about help us clean up? Cleaning up. That's not fun. >> Just try it. >> Okay. >> Try this, Ralph. >> Okay. Yeah. [Music] [Applause] I didn't know that cleaning up was so much fun. >> Sorry I was so mean. >> That's okay, Grouch. Now we can play together. >> Yeah. >> Go. >> Woah, woah, woah, woah. Amazing. >> Wo! This is a close race. [Music] >> Wo! >> Wo! Wo! >> Wo! That's so fun. >> Turn on another one. Turn on another one. [Music] >> Go, go, go, go, go, go. >> Yay! Thanks, friends. Now I know that playing together is more fun. >> No problem, Grouch. One more round. >> Yeah. [Music] >> Barbie and Ken. >> Barbie. Ken. >> Oh no. >> Okay. >> Let me show you. [Music] Pen, let me help you. Some milk in here and in here. M. Now you eat this and drink this. [Music] M. [Music] Barbie, let me help. >> Just use a spoon for cereal, not a fork. >> Thank you. [Music] >> Yay. [Applause] Let's play catch. Uh, try again. Try again. Uh-oh. >> Uh, try it, Barbie. >> Uh, don't worry. I'll show you. Do this. [Music] >> Cool. >> Awesome. [Music] >> Here, Barbie. >> Wow. [Music] [Applause] [Music] H actually I could make an airplane. [Applause] [Music] Uhoh. >> Ken, you're not supposed to tear paper and make paper airplanes. >> Sorry, Mr. Roy. >> Clean up. [Music] >> I'm done. >> Good job. [Music] Huh? >> Barbie, stop. >> Huh? >> You're not supposed to be doing music in class. >> I'm sorry. >> All right, time to focus. [Applause] >> Time to go to sleep. >> I want blue bed. >> I want pink bed. [Music] Pink bed for you. >> Thank you. >> Blue bed for you. >> Thank you. >> Finally, time to go in bed. >> Good night. >> Good night. >> Good night. [Music] Good morning, Barbie and Ken. Huh? You two became dolls again? But anyways, come back sometime to play with me. [Music] >> Kids, Monty's coming. Clean up. >> Go, go, go. [Music] Kids. >> Hi, Auntie. >> Yes, auntie. >> Huh? What's under your bed? >> Nothing. [Music] >> Oh, nothing. Huh? Kids, team up. Or no, no games. >> Or no slime. >> Okay. >> Okay. I'm hungry. Yeah, me too. >> I have something. >> What is that? >> Wow. Ooh. >> Ooh. >> Awesome. >> Cool. >> Go, go, go. Super duper kids. Shh. Yes. Auntie, your room better be clean. >> Okay, come on. Hey, I was looking for this. Don't let the penguin fall. >> Wow. [Music] Could you help? Quick, clean up. >> I'm distracted. >> Nancy, I got the bag. [Music] >> Eric. >> Uh-oh. >> Oh, thanks. >> You're welcome, Auntie. >> Let me go get Wendy and Eric. >> No, stay right here. Stay. Stay. Stay. >> Why slime? Uh, >> we're trying to clean it up here. Let me do it. [Music] >> Thanks, Ellie. Are you done cleaning your room? Yes. I'm coming up. I'm coming. >> Eric, the room's not clean. >> Oh no. >> Go, go, go. [Music] Kids, I need help in the kitchen. >> Okay. [Music] >> What is this? >> I thought you were cleaning your room. >> Sorry, >> we will help Eric clean. >> Promise. Thanks for your help. >> Okay. [Music] >> Done. >> Wow, it's clean. Here's your bus back. Yes. Thank you. Here are your games. >> Yes. Thank you. >> Here's your slime back. Yay. >> Super duper. >> Awesome. A! >> Oh no! >> Oh no! Don't worry, Mario. Gotcha! On the way. >> You'll never win. >> Not this time, Bowser. >> Oh, no you don't. Wait, wait, wait. Wo! >> You missed. >> I won. >> Yeah. Good job, Lindsay. Here's your trophy. >> Thank you. >> You'll never get this. >> Wait, what's wrong with my car? >> Our car is broken, too. We can't help her. >> Yeah. >> A Bowser got away. >> Come on. Let's go fix our cars. Look at the trophy. >> You'll have to win it back. >> I don't think we can win. >> Yeah, I know what this >> I can get us some new cars. >> It needs a little more work. [Music] Cosmo. M for Mario. B for Barbie. Wednesday. [Music] >> It's missing something. >> That'll do it. Thank you, Mario. Ready. This will be easy. >> Go. Huh? [Music] >> Oh no. I'll help you. Got you. Thank you. >> Oh no. A >> You'll never win. >> Oh no, you're not. >> I got you, Mario. I got you, Barbie. [Music] He's moving way too fast. Use this. >> Mine, too. >> Thank you. >> Use it. Win the race for us. >> She did it. She did it. Yay. >> I won't take that. >> No. Huh? No. >> With me? >> Yeah. >> You couldn't have daddy without >> You may have your trophy, but I have your princess. >> Get back, my princess. >> Never. And how are you going to get up here? Huh? >> Here, use my power. >> Thank you, princess. Ooh, >> this is perfect for me. >> Let's go save the princess. >> Ooh, I like this place. >> Maybe it's not a nice place after all. >> I kind of like it. >> We need to go save Princess Peach. >> That was a close one. Come on. Princess, we're here. >> Oh, no you don't. >> Yeah. >> Give us back our princess. >> Yeah. >> Okay. You want fairy square? Here's your princess. >> We did it. We saved the princess. Bye. >> Awesome. [Music] Blackberry. Where's Blackberry? Where's Blackberry? >> Where's banana? Uh-oh. >> Uncle Max. >> H. >> Did you take my pet? >> Mine disappeared, too. >> Uh, what are you talking about? I'm just reading a book. But uncle, you were always scared of snakes. >> Me scared of snakes. I'm >> not scared of snakes. >> Then who took our pants? >> I don't know. >> Huh? What's that? >> Let's go. [Music] >> Let's check under the bed. [Applause] Hello. >> Stop right there. >> Time out. Then return that snake. >> Huh? A >> time out for 5 minutes. >> Why did you take our pets? >> Because I want more reptiles for my collection. >> That's very bad. You can always ask. >> A I'm sorry. >> We got our pets back. >> Yay. >> So cute. >> Uncle, are you scared of her? >> Cool. A >> scared? I'm not scared. I'm going to go get some water. [Music] That's a really big sick. I'm not thirsty anymore. Let me get a snack. [Music] I don't want a snack anymore. I should go to sleep. Tickle. [Music] Huh? Who's tickling me? Stop. Alex. Eric. I'm not joking. Huh? [Music] >> Uncle scared of snakes. >> You have to do something. Hi. Today I'm going to help your uncle Max get familiar with these reptiles. So this girl here is our Burmese python. Her name is Banana and she is super sweet. When these animals are young, they like to climb high up in trees and they eat eggs and birds. But then when they grow up and the tree branches can no longer support them, they move down to the ground. At that point, they like to eat more rabbits and squirrels. And this is our African salad tortoise. His name is Wall-E. These animals are herbivores. That means they like to eat their fruits and vegetables. They like to eat strawberries and carrots and celery and watermelon. And something really interesting about the sata is that they can feel when we touch their shell. Because of that, when we pet them, we should pet them like this. So that way it feels like they're getting a back massage with our scratches. [Music] Carlos here is the African bullfrog. They are the second largest species of frog in the world. So, these frogs actually don't jump like normal frogs. The reason being is because he's too heavy that they can't push their legs hard enough to jump their big belly off the ground. So, they just drag themselves when they jump. Wo! And this is our Argentinian teu blackberry. Argentinian migos are about as smart as the average six-year-old. Oo. They act like puppies and kittens. So when people have them as pets, they can be housed and a lot of times they run free around the house. And this one is our blue tongue skink. Her name is Patty. She has a bright blue tongue for giving kisses. Bright colors will generally mean that an animal is poisonous. This scene here is just pretending to be poisonous with her bright blue tongue. She knows that when predators see it, they would rather keep walking and look for something else to eat than risk eating a potentially poisonous animal and getting sick. So that keeps her from being lunch. And now we have our friend Sally. Sally is a redne tarantula. And you never want to pet a tarantula. The reason being is that all those hairs on her body that make her look like she's soft and fluffy are not soft and fluffy. In fact, if we were to touch those hairs, they could prick into our skin and make us very itchy. This defends her from predators in the wild, so that way nothing will want to eat her. Tarantulas have eight legs, but they also have eight eyes. Those eight eyes allow them to see 360° every direction. So even if she's looking at you, she can still see us behind her. >> That's cool. >> That's really interesting. Uncle not afraid of them, right? >> I was never afraid of them. [Applause] [Applause] [Music] Maddie, there could be a stranger. Let's see who it is. >> Hi. >> Do you know the secret knock? You could be a stranger. >> I sure do. [Music] >> Who could it be? Hey, happy Halloween. >> It's Uncle Roy. >> Here you go. >> Yay. >> Uncle Roy is here. >> Hey, look. I have candy. >> Cool. >> Wo. Thanks, Uncle Roy. Do you want to play Jenga with me? >> Jenga? Yeah. Let's go. >> Concentrate, Andrea. You can do this. Got it. I got it. >> Do it. >> Oh no. >> I'll get it. >> Andrea, wait. Andrea, wait for me. [Music] >> Always have a grown-up with you when you open the door. Let's see who it is. >> Who's that? Do you know the secret knock? >> Secret knock? H. Ah. >> That's not it. >> It's a stranger. >> Oh, wait, wait, wait. [Music] >> Yes, it's me, Uncle Max. Happy Halloween. >> Thank you. >> Let's party. All right. [Applause] Go. Maddie, back up. Maddie, Maddie, >> Uncle Max is here and I got candy. >> Yay. >> Uncle Max, do you want to play? >> Sure. [Applause] >> Someone's at the door. >> Go get it. Girls, wait. Girls, wait. Hey, that's a secret knock. >> It's me, Emma, >> and me, Uncle Jason. >> Oh, you made it just in time. >> Awesome. A party. >> Ready to dance? >> Yeah. >> Yeah. [Music] >> Yay. Yay! [Music] >> I'm hungry. >> Me, too. >> Huh? I'll get it. Let's see who it is. >> Hello. >> Hello. >> Do you know the secret knock? >> Secret knock? I don't have one. >> No knock. >> Let's see who it is. >> Hi. >> Pizza delivery. >> Oh, pizza. Thank you. the pizza. [Applause] >> Wow. >> Are you kids ready for trick-or-treating? >> Yeah. >> Remember kids, never answer the door without an adult. And happy Halloween.",
    "start_time": 0.32,
    "end_time": 1549.24
}