{
    "video_id": "dmNC3ZrF5RQ",
    "channel_url": "@jordanmatter",
    "transcript": "It's going live. >> We're live. We're live. >> We're live. >> Hello everybody. >> Are we I don't know. >> Okay. We're backstage uh for American Dream Mall for Sailor's Sephora skincare launch, Sincerely Yours, which is live right now at sephora.com and sincerely.com. So, you can buy it right this minute. And I think there might be a few people waiting for us outside. >> Yeah, I heard about that. >> Yeah, I heard there's some people. Okay. So, so the rest of By the way, just so you know, when Sorish talks on the mic, she's always going to do this. She's going to forget to do She'll do this. >> Can you hear me? >> I I can hear you. >> All right. I'll talk exactly like this. >> Okay. Are you going to be sassy the whole time, too? >> Yeah. >> She's going to be sassy the whole time, too. Okay. So, Sish is super excited to spend the day with me. >> I mean, with you guys. I think you guys can all see us on the screen. So, maybe is it time for us to come out? >> Yeah. >> Should we come out and say hi to everybody? >> I think we should. >> All right. You know what I'm going to do? I'm going to go out first. I don't even know if they really want to see you. So, I'm going to go out first. >> You're right. I think you should go out first because you'll make the big thing, right? And when they see you a little bit >> Exactly. Like, what's even the point of you coming? I'm going to go out and see if they even want to see you. But I'm going to go first. >> You just take all the time. >> Yeah. I'm going to take all the time. They don't need They don't even need to. So, guys, I'm going to come out and see you right now. Sish, I don't think you even need to see her, but I'll find out when I get on stage. >> All right. Here we go. See, here's >> And she's just going to be back there. See? Okay. Let's go. Let's go. Say hi to everybody. We got a lot of special guests coming out. You can see them all here. Thank you everybody. We're going to go live now. >> All right. Here we go. >> Come and show the perspective of what this is like. >> Okay. So guys, >> we got up yesterday morning having no idea how many people would be here. >> And now we've just heard that there are over 30,000 people here. Over 30,000 people here. And we're going to go out and say hi to them right now. I'm freaking out. Taylor seems pretty chill about the whole thing. Um, all right. I don't know where I'm going, but I think I think I'm on the screen right now. So, if I'm on the screen, I'm seeing you guys in like 10 seconds. Hold on. Look, this is the grandfather. And look at the t-shirt. >> I'm Salish and Hudson's grandpa. Okay, let's go out. Here we go. >> Colin, you good? >> Yeah. >> Colin's coming on stage with me. Oh, this is a long walk. Sorry, guys. If they're watching this whole thing on screen, this is super boring. C can we walk a little faster? >> All right, we're in the back area and I guess this is how we get out to the front of the stage. >> And guys, I'm about to see you and meet you for the first time. I saw a lot of you sleeping out last night. I can't even tell you how cool that is. And I'm really excited to meet you in a few seconds whenever we get done slowly walking. >> Good to see you. >> Good to see you. >> Don't mess with her. Okay, I'm hearing screaming. I'm hearing screaming now. >> My mouth is dry. I'm actually nervous right now. Okay. Love you. Come on. Okay. Thank you. Bye, Dell. Here we go. Oh, wow. Swing to that. Show them. [Applause] [Applause] Yeah. Heat. [Applause] Are you kidding me? [Applause] Oh, heat, heat. [Applause] Heat. [Applause] Heat. [Applause] [Music] [Applause] We have a lot to do. We have special [Applause] Heat. [Applause] Heat. [Applause] Okay. As you know, [Applause] Next Saturday will be available in stores. [Applause] I will say that I will say sorry. [Applause] [Applause] [Applause] a while and then right now [Applause] Guess the video and then we're going to bring a mask up here with two people and then you guys have to guess which one what his name or her name is. Okay. So, you guys shout out to Let's go. Let's go. Let's go. Are you ready for the first [Applause] go? Heat. Heat. Heat. Heat. about a year and a half ago. But you know, everybody else want to seriously. So, let's give it up for July and every committed to meeting as many of you as possible. So, I'm going to be here all day talking to as many of you as I can and we're going to go all over and I'll say hi to you. All right, here are our three contestants. Are you guys ready? You ready? Okay. Now, we're going to bring out the mask creator and you're going to see if you can figure out how they walk who they are. [Music] [Applause] Okay, Chad, do you guys have any idea who is so this game and then you're going to go back and say hi to you guys? All right. for this game. Let's go. Okay. For this game, you each get to ask a question. Okay. Do you have a question? >> No. All right. I'll start at this end. You can ask this. I will give you a hint. This person is a very well-known creator and I believe all of you have seen their work. [Applause] Is this person in their 20s? Wait, do they have a microphone? They have a voice microphone microphone. All right, hold on. We need to get you the voice modulating microphone. All right. We're testing the microphone. Testing testing. Heat. Heat. They can't hear it. I'm going to have to do it. All right. Are you in your 20s? >> Yes. This person is in their 20s. Okay. What is your question? >> Do you have light or dark hair? >> Do you have light or dark hair? >> Dark hair. How many subscribers does he have? >> Oh, how many subscribers do you have? 39 million. Okay. Wait. No. No. Not yet. One round of questions each. >> Okay. Um, does he have a really pretty sister? >> Okay. First of all, you're assuming this is a male. Why? Because he looks like a male. Okay. Assuming you're a man, do you have a really pretty sister? Some people say so, I guess. No more questions. You have one right now. Think about >> um [Applause] is his hair straight? >> What is his hair straight or curly? [Applause] Straight. How many of you think you know who this is? How many of you think you know? Okay. All right. All right. What is the prize for her? What did she get this? What? Okay. All right. Ready? If you are correct in your guess, then you will get one of every sincerely yours product full size. If you're correct with this guess right now, right, I'm going to say have you say the name and then you can reveal yourself. Okay. All right. One, two, three. Who's behind the mask? >> Grant Rivera. Is it? Wait, hold on. No, we couldn't get Brent Rivera here, could we? No. Brent Rivera lives in LA. He wouldn't fly 3,000 m to be here, would he? Well, let's find out. If it's B Rivera, you can stand up and pull your mask off. It's No. This is madness. All right. Is this not crazy? All right. Hold on. Every chat. Chat. Say hi to Brent. All right. Thank you. Three. Thank you guys. Wait. Wait. High fives. High fives. Way to go. Way to go. Good guess. Way to go. All right. I guess your pretty sister gave it away. >> Yeah. >> I don't know. Are you ready to take over now? >> Brent is going to play another game for somebody. Why don't you give some high fives to start? Give me some high fives. Brent drove not flew 3,000 miles to be here today. Thank you so much. Okay. is going to talk to you about his amazing chips friend and he's going to play a game with three subscribers. Where? Where are they? >> What? What? Do we have I'm going to do this 30 seconds. I have to 30 seconds. All right, Brett. We have to do this really fast. Okay, so we got to get moving on this show because we've got to clear this space soon and Sus is coming out soon. All right, go ahead. All right, guys. What's up? How's it going? All right. Okay, come right here. All right, we have three of you guys on the stage right now. Each of you guys have a levels bag. We got nacho cheese, we got cinnamon churo, and we got chili lime. All right. One of these bags has a golden ticket and one of you guys are going to get a a year supply of levels. Okay. All right. So, one by one you guys will open it. Okay. And see if you guys will have a golden ticket. We'll start with you. [Music] >> I'm sending back to go see. Go back to [Applause] heat. [Applause] Heat. Heat. Yeah. [Music] Heat. [Applause] [Music] All right, we're going to Salish. [Music] All right, Salish. >> Salish, >> you could be here. Ko, actually. Ko, can you wait right here and be ready? Yeah, I'll pull you out. >> Wait, what? >> Where is Sish? >> Wait, what? >> Matter. This is live. >> What's up live? I'm talking about in >> Yeah, I need stop. >> All right, we are live. Are we coming in? >> Is that the YouTube live? >> It is YouTube live. >> YouTube live. >> Hey. >> All right. Coming in, >> bro. I actually Hey, get out of here. >> Wait, what am I doing? You're going up. >> You're up next now. somewhere. No, no, you're over here next. >> Oh, >> not out there. >> What can I say? I'm just so >> muted. I'm scared. >> I'm scared. Is that live? >> It's live. >> Hi guys. I saw you freaking out over my dad, but there's not much to freak out about because he's kind of boring. What do you guys think? >> Is here. Hi, T. >> Hi, guys. How are y'all? >> I think they're good. How are you? >> Nobody cares. Um, all right. So, what's there to talk about? >> Well, you want to give us some headers? >> Like, what's your favorite color? >> Yeah. What's your favorite color? Let me guess. Latte color. >> Yellow. >> I knew it. Yellow looks so bad on you. >> No offense. Like, I didn't think yellow could look worse. She has told that to me so many times. I can't forget about it. >> He wore this stupid yellow outfit and it looked so she >> Wait, wait, wait, wait. She thought I picked it out. I was filming. They gave me >> a yellow track. They gave me a yellow treas. >> Okay. Anything? >> Um, >> I have a question. I saw a lot of people uh there were videos and pictures of you guys at the beach. Oh, we were at the beach. How was that, Ko? >> What happened? >> Well, okay. How can I explain this? >> Tsunami and her were drowning. >> That's what happened. >> Well, Tsunami came because Ko and I were going to hang out and then Tsunami and I were on a FaceTime and then I was like, \"Sunsami, do you want to come?\" She was like, \"Yeah.\" So then she came. Right, Ko? >> Right. Right. >> And we went body surf. Well, y'all don't know what body surfing is. >> Bro, you did not go body surfing. It went 2 ft. >> Also, there was a fish. >> There was a huge current, right? And Kay, Sue, and I were staying like to like stomachs because there was a huge current and he was like, \"Oh, I'm going to go deep.\" And he kept on going deep. And it was so stupid because there was a huge current. >> Okay, guys, it's not deep. Also, I I'm a surfer and I've been surfing since I was like little, like I was 9 years old. So, I >> stop talking. So, I know how to work the ocean. You don't? >> Wa! He knows how to work. >> I am a wonder. >> You're so cool. >> Okay. What else? >> What else? >> A Oh, I'll sing a song. Ready? >> Yeah. Let's hear it. >> Let me think of one. >> What's your go? >> Why don't you ask everyone if you have any questions? >> Do you have any questions? While you have questions, I'm going to sing my song. Jingle bell, jingle bell, jingle bell. >> Never mind. I'm not going to be singing your song. Okay, I'll sing a different song. Jingle red, jingle, jingle, >> original. Sing original. >> That was original. >> No. What about you songs? What about >> Let's do that. >> Oh, I my sweet thing. Goodbye, green eyes. >> Was that good? Guys, did you know I have a story today? Ready? >> Little story time. So I was supposed to wake up at like 7 6 7 you know and so P and I P and I have been sharing a room right because why not right and so I set my alarm for 7 7:20 and 7:30 because I knew what if I don't wake up right and I were talking about it like 3 like what if I don't wake up and we were like whatever. So, the alarm is off. I guess it didn't go off because it's still set in California time, which it would go off at 10:00 in California time for 7. Wo! Wait. And so Payton and I didn't wake up and we were supposed to leave at like 8:30 or 8:40. And so then her mom calls us at 8:30 and Payton hears it. So she like is on the phone and Payton's mom is like, \"When are you guys going to come down?\" Pton's like, \"We just woke up at 8:30. We were supposed to leave at 8:30, so I had no time to get ready and I burnt myself with the curling iron >> and it really hurts. >> But yeah, guys, that's my story time. No, you don't get the mic. What do you want to say? What do you want to say? What do you want to say? >> I have nothing to say. I just wanted to hold the mic. >> Hi guys. >> Okay. Wow. >> Wow. She folded so >> folded over you. >> No, >> guys. Um, what do you think the most popular question is right now? >> Are you guys dating? Did I get it? >> You were right. >> Wa. Really? Um, no. We are not dating. >> Next question. Next question. >> Next question. >> Are you guys ready to be on stage? >> No. How many? >> Hey guys, I'm just going to let you know. Um, I normally I'm a little scared, guys, but hopefully I say something right, but I don't really know what I'm going to say yet. But yeah, I do. >> But no, you got this. >> Okay, thank you. You don't >> say there's a lot of people. >> Wow. >> Um, >> there's a lot of people here, by the way, guys. >> Yeah, Colin just said that. Thank you, though. Like I walked out and it was like deafening. Like it was so loud. >> Like guys, Colin walked out and it was deafening. >> Okay, now look at how bad his tan is. He's self tanned and it does not look good. >> Dang. Everyone's asking where you can get. It's limited edition. >> Yeah, this hoodie is limited edition, but I love it, guys. It's so soft. It's amazing. And it has all these really cute patches. So, let us know put it for sale. Yeah, if people really want it, maybe we could >> Yeah, if people really want it, maybe we could put it for sale because guys, >> give us a sweatshirt tour. >> Can you see it? >> Can you see patch number one? >> We got patch. >> Patch number two. >> Patch patch. >> Patch patch. >> Patch patch. Patch >> patch. >> There are a lot of patches and I love it. >> It's my favorite hoodie right now that I have. But I'm pretty sure right now. >> Where's my hoodie at? >> You don't get one. I'm pretty sure. Were you in line? No, you weren't in line. >> Yes, I was the first. I was here before everybody else. You weren't in line. If you were in line, maybe you would get one. But >> KO, I got to run over what you're going to do. I'm going to tell you what you're going to do. >> Bye, Ko. Bye, kiddo. >> Bye. >> But yeah, I think I'm wearing Rowan's hoodie right now. And it's a little big because Rowan is a little big. >> Oh my god. >> He's tall. >> You also got stains all over it. >> I guess I'm just going to >> Wow, you were the mystery guest, weren't you? >> Yeah, I was. And I was out there and um Sish, they don't want me. They want you out there. >> Really? I'm pretty sure they wanted you. They looked kind of crazy for you. They looked really excited, >> but then they started chanting Salish. And so I was like, you know what? Like I'll just I'll just I'm just going to leave the stage and let and let you come out. >> Oh, thank you. >> Yeah. When are you supposed to come out? >> Um I I'm not sure. I think in a couple minutes. I don't know. >> Are you nervous? >> When do you know if I'm coming out? >> They're going to come grab you. So you should >> Oh, they're going to come grab me. >> I have to be ready. So do you have any ideas of what I should say? >> Hm. I think you should say something about, you know, obviously like there's a lot of people there. So, you know, you could just kind of say hi to the crowd. look up around everywhere and like just wave, you know, and then maybe um >> Yeah, like maybe just have them like start chanting, you know, sincerely yours. Sincerely yours, you know. >> Oh, that's a good idea. >> Yeah, I feel like people would, you know, >> perfect. So, it's a it's the launch is today, right, in Sephora? >> Yes, the launch is today. Today, it's online and on September 12th, it's in stores. >> Are you excited? >> I'm very excited. >> That's crazy. That's like so cool. Congratulations. >> Thank you so much. Congrats on levels. >> Oh, thank you. >> I've seen all about it. >> Yeah. I mean, so, okay, so, um, when you go out there, what's like the what's the first thing you're going to do? Are you going to like >> I mean, >> get everyone hyped. Are you going to, >> you know? I I haven't thought about this too much. I'm not sure. I haven't thought about going on stage yet. I kind of forgot about that part. Do you have like stage fright or are you like >> I mean you could say >> I I think just like honestly I was scared like in school like going in doing something in front of a classroom but like this is like so easy. >> Yeah. Yeah. >> There's only like >> there's only like triple in the classroom. >> Yeah. There's only like 100,000 more people. >> No. But yeah, it should be it should be fun. I'm excited for you. >> Yeah. Yeah. So we're on the This is your live. I'll I'll let you take control here. >> Thank you so much. Well, thank you for joining. Thank you for being here. >> Yeah. I'm going to go grab a snack. Okay. >> Okay. Have fun. >> All right. Bye, S. >> All right. Bye. >> All right, guys. >> I didn't drop it. >> You did it. I did it. >> I didn't see. >> Good job. I didn't drop it. It was pretty good. >> Good job. My stick. My bow stack. Her pole. >> Yeah, my pole. I was telling them how we woke up at 8:30. >> Yeah, we woke up at 8:30 and we were supposed to leave at 8:30. >> Maybe because we were blowing party pop. Wait, party blowers. >> Yeah, guys, it was her It's her birthday today. And I decorated our bedroom for her birthday yesterday. And when she got there, it was all decorated. And then when I got there, it was like 3:00 a.m. or 2:00 a.m. And we started blowing the party blower thing. >> Yeah, it was pretty fun. >> Yeah. I don't think the neighbors were too happy. No, I think they're they're going to call the cops on us. >> Yeah, they told us they were going to call the police on us, but it's okay. Whatever. >> Well, how are you doing, Payton? I'm good. Now that that's over, the stress is gone. I'm I'm good. Yay. Now it's your turn. >> Yay. >> Do you have any advice for Sish? >> Yeah. Um, you got this. Uh, that's all I have. >> Wow. Thank you. That is really helpful. So, how like was my motivational speech towards you like helpful? Yeah, it was very helpful. I don't think I could have done it without Thank you. >> Everyone's wishing you a happy birthday. >> Yeah, everyone's wishing you happy. >> Oh, thanks guys. >> That's so what? >> She's old now. She's 17. >> I'm youngsty, right? >> Payton can drive. But guys, I'm getting my permit on October 13th at 3:50. She did her like test thing on driver's ed at like 3:00 in the morning. >> Yeah. Like two nights ago, I did my driver's ed at like 3:00 or 4 in the morning. >> I won 82%. But that was with like Payton helping me, so I might be cooked. >> No, you got this. You got this. >> Thank you. >> Yeah, I'm 17 now. Crazy. >> Yeah. Also, my brother, but like that's >> whatever. >> Guys, famous birthdays posted me, but they didn't post Paxton. >> Happy birthday, Paxton. We love you, too. Don't worry, we didn't forget about you. I don't even think he's watching. >> Where is he? I don't know. >> So, do you want to sing happy birthday? >> Uh, no. Copyright >> cuz I'll sound too much like the song, >> right? No, that's good. Good call. Good call. >> Yeah. Thank you. >> Really saving the day there. >> Yeah, we could get copyrighted. >> Did you guys You went to the ninja park yesterday, right? >> I did, guys. You should go check out her ninja parks. They are so fun, bro. Like yesterday it was so fun. It was really big, too. >> Yeah, it was pretty awesome. We were there all day and I met so many people, so that was fun. Yeah, they were all so sweet to you. >> Yeah. Thanks, guys. Are you excited to go on stage? I'm very excited. >> Are you nervous? Just a little. >> That's okay. They love you, right, guys? Show me some love. >> I'm not sure what to say. Oh, Payton, do you have hoop earrings that you could give to Sish? >> That's such a random question. Guys, I forgot about my hoop earrings. And it's just not It's not good. >> Is it just naked? >> Yes, I'm naked. No, don't zoom in. >> I'm zooming on the hoops. >> It's There's one hoop, but normally I put two. >> I can't see. >> Wow. >> Yeah, that's so cool. >> I'm very tired. Like, I'm not even tired, but my eyes are tired. >> What time did you get to sleep? >> Three, I think. >> I know. My eyes are like shutting. >> Yeah, me too. Like 3:30 or 6:30. >> I think once you go out there, you'll wake up. >> We had like 3 hours of sleep. >> Yeah, >> except I slept on the >> Oh, I know. We were hours of sleep, but then we slept >> I don't know what happened to your alarm. >> I think No, no, I think it's because I said it. I think it's because it's still in California time. So, if it rings at 10 a.m. today, then we know it's still in California time. >> Yeah. See, a lot of people are asking if sincerely yours is going to be available in other countries, but you not yet. But they >> not yet, but hopefully they will be soon. >> What? >> What? >> What's not yet? >> Oh, sorry guys. Sincerely, yours is not available in other countries yet, but >> I think pretty soon. >> Is this live right now? >> It is live. >> Oh, >> we've been live this whole time. Payton. >> Oh, I >> chat. The chat's been asking questions. >> What are they asking? Chat. >> Hey, Chad. >> Okay. >> Someone said, \"Can you say hi, Kennedy?\" >> Hi, Kennedy. >> Kennedy is my dad's middle name. >> Jordan Kennedy. >> Matter. >> Yes. Hi, Julia. >> Hi, guys. >> Can you give a shout out to Sunny? >> Oh, what's up, Sunny? >> Hey, Sunny. >> I know. I love the name Sunny. >> Do you want to read? Do you want to read the jacket? >> Yeah. >> Oh, that's what we look like. Guys, let's talk about awesome chopped chopped. >> Yeah, don't look at that part. >> I don't like see seven chat. Oh, shoot. I logged out. >> Six, seven. >> Is Sish and Ko dating? >> No, >> we're not dating. >> Yeah. Okay, >> I'm not dating anybody. >> Yeah. >> Yeah. H where's Noodle, >> guys? He couldn't come. We invited him, but he was busy. >> Say, you're going to be getting ready for >> Happy birthday. >> So, I'm going to I'm going to take the >> Okay, bye guys. >> I'm going to take the mic. >> Got this. Thank you, Payton. >> You're going to come in for live. >> Thank you. >> Oh, hello. >> Hello. >> We have some chatting to do. >> Okay, let's all the questions. First of all, where's Nadal? First of all, Nadal is in California cuz he's getting ready for Lucas's party and I told him to come here. So, Nadal, if you're watching this, bro, you suck. >> Are you and all friends? >> Yeah. >> Yeah. No secret be like >> more than I'm just kidding. I'm just kidding. >> I'm messing with you. We're just friends. >> Um, are you and dating? >> No. >> I need I I need to use this. You're not dating? No. >> Are you sure? >> Yes. >> You promise? >> Yes. >> I think there's some lying happening. Okay. Um, >> do you miss Sish already since she left? >> Yeah. >> 67. Who said 67? 67, baby. >> Sorry. >> How old are you? >> 15. >> Wow. You're little. >> I'm 17. Did you know that? Wait, what? >> Yeah, >> you're 17. >> Yeah, >> I'm unc status. >> Wow. >> I know. >> Dang. >> I know. >> What's it like to be >> Do you like Oh, what's it like? It's basically like I'm 15 except I'm 2 years older. >> You got to tell me what it feels like when you're 18. >> Probably going to feel the same, but yeah, I will. Um, happy birthday. Thanks, guys. Happy birthday. >> Thanks, Ko. They're saying, \"Where is Ko?\" >> What? Oh, I'm not here. It's a 20 second delay. >> Oh, he's >> Do you like Sish? >> Yes. >> Do you want to be more than friends? >> Put it away. Keep answering. That's good. >> Okay. >> It's time for sales. Let's go. Let's go, guys. >> You got this. >> Bye. Wait, what am I doing? >> You got it. >> Wait, what am I doing? >> Wait, >> you're gonna follow S to the stage. >> Oh, I'm following S. Okay. >> Do I take the mic? >> Hi, guys. >> Oh my gosh. Wait, let's run. Come on. Keep up, Colin. Don't be so slow. [Music] >> I'm just saying as far as like >> holy oral laws, bro. Oh, never mind. side and not your shot, guys. Excuse me. Excuse me. Excuse me. Excuse me. Watch out for >> Thank you. >> Hi guys. I heard you're being a little crazy right now, which is very sweet, but I'm going to tell you on stage as well. >> But guys, we don't want to get this shut down. So, if everybody could please just calm down a little bit, thank you so much. But if you could just calm down a little bit so that we can keep on going with our show because we don't want to get this shut down. >> Wait, wait, wait, wait, wait. Guys, >> wait. Is so fast. You need to stay back. Okay, >> we're not going to go out with her. Not yet. >> Sorry. Thank you. >> Here, you talk to >> Okay, call the mic. Good luck. >> I know she has to switch over here. Talk to her now. Talk to her now. Okay, guys. This is Are you Are you excited? >> My part. >> You got this. Come here. >> So fast. >> You got this. You're okay. >> There's an Oh my gosh. >> As soon as she comes out, they need to hand >> Can they hear us from this mic? Can they hear us downstairs? >> No, they live. >> Thank you. >> We need the mic. We need the mic. >> That's That's the live >> mic. Are they Oh, [Applause] heat. [Music] Thank you so much. I really appreciate it. Thank you so much. All right, I just wanted to say really quickly, guys. Basically, we have a lot more of this show to do, but if we don't quiet down a little bit, then we might I don't want anybody to get hurt or anything. So, we just have to be a little bit quieter. Okay. Thank you so much. So, yeah. Thank you guys so much for being here. Thank you so much. >> Yeah. Can you believe how many people love me? >> Yeah. A lot of people here for me. >> Yeah. >> For me. All right. Now, are you ready to play? Who knows me better? >> Yes. >> All right. All right. So, guys, ready? This is incredible. Thank you so much. I appreciate all of you guys. >> Sorry, we have to have you all step back again. >> Thank you so much. >> This is the most >> there's a lot of you here. Wow. >> Thank you guys. Thank you. Okay, so If all of you can step back, >> if you guys would everybody please step back just a couple steps. Thank you so much. >> I think you're going to really love this, but we need you to step back. >> We don't want anybody to get hurt. We want everybody to stay safe. >> Thank you so much. >> Thank you guys. Could you please step back a little bit? Thank you so much. Bye. You look so good. You want to tell them anything about Sincerely Yours? >> Yes, guys. Sincerely yours. We've been working about a year and a half on it. It's insane. I love it so much. It's so good for like sensitive skin. My skin is so sensitive and it's so good for my skin and I love it so much and I love everybody on the team that helped make it. Thank you guys so much. Thank you. >> Remember, let's talk to the chef. You can buy it right now at sincerely.com orph.com. Are you guys sincerely yours? Chad, it's going to sell out. You want stop saying cool, right? Say chat. >> All right. Are we ready for our next guest? >> Are we ready? >> Guys, thank you so so much for being here. Thank you. Bye. Thank you guys so much everybody. Let's give it up. [Applause] Everybody's going. I can't even hear. Can you hear me? Can you? I can't even hear myself. This is insane. This is crazy. How are you guys doing? >> I know. This is crazy. >> Are you all excited for this drop? >> Thank you. >> Ko, do you like yours? >> Yes. >> Yeah. Guys, he uses it every day. >> I do. I literally do. All right. I'm going to interrupt you now. This is Gabby. Come on. >> Hi. And this is Ko. >> How many of you know who Ko is? They're just friends, right? Just friends. >> Okay, we're going to play a game of who knows me better, a super fan or I asked her questions on Instagram and I'm going to pull them up right now and >> hi guys. I love your poster. Thank you so much, Super. Thank you for coming from Michigan. That's crazy. Thank you so much. >> All right, here you go. >> All right. Ready? What I'm going to do? I'm going to ask the question. Okay. And then whoever raises their hand first gets to answer it. Are you guys ready? >> Come on, guys. You got this. >> All of these questions are from you guys on Instagram. Here we go. >> Guys, Kayla, I'm nervous. >> What is Sailor's favorite color? Yes, you got that. >> Okay, >> good job. >> Do you know that? >> All right. Um, here we go. Who is Dish's favorite family member? Um, >> Hudson. Yes. >> Yes, she got it. >> Okay, last question. This question determines who wins. Last question. Are you ready? If you're a super fan, you know this. When is Salish's birthday? >> Come on. >> Oh my god. He doesn't know it. Ko doesn't know it. What? Okay. I'm trying. Okay. What? Hold on. What? Last question. Wait, guys. Guys, she has never told me her birthday once. >> All right. Last question. What is the name of Sish's new dog? >> What do you think? >> What do you got? >> Boomer. Mo. Okay. You're gonna get it anyway, even though he got it right. Congratulations. She won. All right, here we go. >> This is sincerity. >> Hey guys, it's me, S. I'm so excited to finally say sincerely created for team. Every formula was created with dermatology. So, it's barrier friendly, clinically tested, and safe for sensitive skin. It's skin care you can actually trust and it looks amazing and feels amazing, too. You can get it now only at Sephora and at yours.com. >> It was so hard keeping this a secret from you guys. So, I'm so excited that you can finally try some. Thank you guys. >> I don't know. We're getting shut down. We can We can rec again. I'm trying to understand your [Applause] step to your right. [Applause] >> Actually, just live stream while we need >> technical difficulties. Pause one moment, please. And we're back. Oh, hey guys. [Applause] Heat up here. Heat. [Applause] Heat. Yeah. Heat. [Applause] Heat. [Applause] [Applause] Heat. Show's over. Thanks for coming everyone. >> It's great. >> Can I go outside or no? Get control to your right. To your right. To your right. Step to your right. Step to your right. [Music] [Applause] Heat up here. [Music] [Music] Heat. Heat. Heat. [Applause] Heat. [Applause] [Applause] Heat up here. [Applause] Heat. [Music] [Applause] Heat. [Applause] Heat [Applause] up here. [Applause] Heat. [Music] Heat. [Applause] [Music] A [Applause] [Applause] Heat. Heat. Yeah. Heat. [Music] Heat. Heat. Heat. Heat. [Applause] All right, switch with me. Take >> walk and talk. >> All right, I'll explain what's happening. So guys, >> thank you guys so much for being here. Unfortunately, we had to pause everything. So right now, we're taking you back to the green room. You'll see Salish. You'll see Jordan. If you missed it, Jordan got pied in the face. So let's check out what happened. >> I missed it. I want to be there for that. >> I know. It's a good good time. >> Uh, do they know we're coming? >> They do know we're coming. Okay. Wow, that was crazy. >> That was actually nuts. >> That was insane. I don't know if Silverhead. >> Hey, sorry. >> Hey guys, if I were you, I can get out. >> All righty, guys. >> All right, give us 10 seconds and then we'll be back in the green room. See sailor se [Music] >> live coming through. Live coming through. >> Live coming through. >> Live coming. >> Live coming through. >> How's it going, guys? >> All right. All right. That was a ton of fun. That was a ton of fun out there. >> Okay. >> So, we're back on live. >> Where the mic? >> Oh, where the mic? Where's the mic? Rowan, for the live. the microwave. [Music] >> You're unmuted, Jordan. >> Okay. All right. We're back on live. Come on in here, Colin. So, we just got shut down by the state police. Um, there was the the kids were so incredibly excited and that was amazing, but they basically told me that I had to end the show, so I just got a pie. But, there was a whole another thing we're supposed to do that we couldn't do. But, I hope you guys have been enjoying this. Let's just go check in with Salish. Um, >> okay. >> There's a lot of cake around here. >> Hi. >> Well, you got pi, didn't you? >> I got pied pretty bad. Yeah. Do we have um Is there anybody with uh >> your >> So, I got cut in the head. So, they banged me pretty hard if you saw that. Uh, so I got a head cut, but Ko was really sweet and he cleaned me up >> just like a son-in-law would do. Wild. That's wild. >> But I have an excuse cuz I got banged in the head. That's why I said that. Okay. >> Um Um Okay. So, I I think probably at this point it makes the most sense to end the live, right? Um we we're going to end the live shortly. Just want to say uh we we had a plan to go to Sephora to go to the popup. Right now, we can't do any of those things >> because of the insane number of people that are there and their incredible enthusiasm. Right. Like that was >> it's insane >> that I I've never >> When you went out there, what did you think? >> I did not think there was going to be this many people. I thought there was going to be like 10 20 people. Matt, >> I was thinking maybe we would get like 500, but like the the degree of enthusiasm for the content. Thank you guys so much. >> Thank you so much. >> And I appreciate it's obviously all for me. And I just want you to know like you should give a little love to Sish too. >> Yeah, guys. I I need some more love. >> Like she works hard on the channel, too. It's not just me. >> Yeah, he's just Yeah, you're getting too much love dancing. Okay, so we're going to sign off here and we we will hopefully be able to drop a full video with this experience behind the scenes. Her building up to it. Yesterday she was saying, \"Oh yeah, nobody's going to come.\" Yesterday. So big change. Now we got to see if we can meet as many people as possible. >> I'm not leaving. >> I'm going to stay as long as they stay until >> until we can see them. >> As many people as possible. And that's going to take a while cuz there's tens of thousands of people. We'll we'll also get an official count. We'll let you guys know. Thank you so much for watching. Remember, right now you can shop sincerely.com and sephora.com. Get sincerely yours cuz all these folks are getting it. Get it before it sells out. And then in stores in Sephora next Saturday. >> September 12th. >> September 12th. >> Yes. >> Thank you so much. >> Thank you guys. >> Bye. Bye. Thank you. >> Show. Yeah. Shop online right now. Thank you. We're going to keep going. We're going to keep talking until we get and Okay. And I guess something's happening. They're killing it. And I got a note and I don't know how to do lives. Bye. I've never done before. Thank you. Shop online right now. Teen Skin for teens, made by teens. Best out there. >> Sensitive skin. >> Sincerely yours. Great for sensitive skin. Thank you so much. Take care, guys. Bye. >> No. >> Oh yeah. Let's actually get a hug. Okay. Ko, give me a hug. Okay. Somebody give me a hug. Yeah. >> Oh no. It's in her hair. >> Hey, I'll dab you up. I'll dab you up. >> Oh, you got to go get Look, you got to rescue her hair, Ko. Be a gentleman. Yeah, the state's open. >> No, don't open. >> Yeah. Okay. Bye, guys. Thank you. >> Bye.",
    "start_time": 0.16,
    "end_time": 3524.16
}