{
    "video_id": "lsKOY8b15Sg",
    "channel_url": "@jordanmatter",
    "transcript": "Today I transform this truck into a secret \nSephora while I transform my truck into a   water park. A mystery judge will pick \na winner and that person will get the   Matter Cup. I think that this cup belongs to.. \nBut it's not going to be easy. Oh god. There's   no way this is happening right now. Let me \njust say we have a bumpy road in front of us. There is no way I'm going \nto win. We have to meet the   mystery judge in 5 hours. 1 2 3 go. Come on Rohan. Come on. Drive. Drive. Drive. What are you? What \nthe frick? Why is this not staying actually? Come   on, Ro. Go, go, go. How do you go? Go, Ro go. Ow. \nOw. Oh. Boom. Wait. Salish. What are you building?   I'm not telling you. All right. Well, what I'm \nbuilding is the best thing ever. You're going to   lose for sure. I'm getting the surprise end of the \nyear. I'm getting it. I'm winning Matter Cup. Come   on. Okay, Salish is already a little ahead of me. \nNot a good sign. Rohan is obviously helping her,   but I might be able to get somebody to help me, \ntoo. I've been thinking about this for a while,   and I'm going to build an entire Sephora in this \ntruck. I'm going to build an entire water park   right in this truck. Not exactly sure how to do \nthat yet, but Ben Azelart is letting me use his   warehouse, and he told me everything I would \nneed for a water park is there. We finally   got to Sephora, but I still need to get all of \nthe Sincerely Yours products. So, go to your   local Sephora, go to the next big thing wall, and \ndo you see this? That's like actually crazy. I'm   so grateful that Sincerely Yours is in Sephora. \nBut hopefully in the future, it will be on a much   bigger section. And that's why the display in the \ntruck is what I hope the display looks like in   the future. It's the only one sold out here on the \nwall. So, what am I going to do? If it's sold out   at your local Sephora, too, scan this QR code and \nyou can buy it there. I did not think about this   at all, but I have an idea. Let's go. Let's go. I \nhave a bunch of sincerely yours at my house. So,   I guess we got to go home. This is going to waste \nso much time. That's what's going to make it so   special. If you saw last week's video with the \nStokes Twins, you know that Salish won the Matter   Cup again. And now she leads 12 to7. I don't \nreally care about the Matter Cup. But whoever   gets more Matter Cups at the end of the year gets \na really amazing mystery prize, and I really want   it. He told me there'd be everything I would need \nfor a water park in here, but didn't exactly tell   me where. So, I got to look through his warehouse. \nWhere are we, Ro? I don't know. I thought I must   have made the wrong turn. All right. He said \nthere was like a sick pool that would be perfect   for a water park. A lot of stuff here, Ben. Oh, \nyeah. Everybody come to my free water park. You   think that's enough? All right. Come on. We got to \ngo. We got to go. Come on. Come on. Come go. Hi,   Boomy. Let's go. Let's go. Let's go. Okay. \nYes. All right. I got a hoodie. Small, medium,   and large. And I got the sincerely yours bags. \nNow, let's go. Come on. We barely have any time,   so we got to go. Where is his water park \nstuff? Woah. Okay, that's just a little creepy.   Ben Azelart is letting Salish and me both use his \nwarehouse. It has tools. It has anything I could   use for a water park if I can find it. So, thank \nyou, Ben. We just got all of this sincerely yours.   And we got all of the hoodies from my house. And \nI got one in each size. So, whoever the judges   can wear their perfect size. There it is. Pool. \nWow. This isn't going to fit in a truck. Okay.   I got to FaceTime Ben. Hey, Ben. When you said \nyou had water park stuff, all you meant was this   one thing. Just this huge pool. It's a giant \npool. What do you want me to do? Well, I know,   but I can't fit in the truck. So now I've got \nnothing and I'm going to lose. Oh, have you seen   that David Dobrik video where they use like the \ntarp? Yes. Do you have a tarp? I have a tarp in   the back. And Ben, you're coming by later to test \nout my water park, right? I will be there. Thank   you. Thank you so much. Okay, that's a good idea. \nIt looks a little dangerous though, so I'm going   to have to test it with not me. I'm going to call \nDel and the team because they're helping me for   the rest of the transformation. I've been planning \nthis all week with Del, so we already have a lot   of things ready to go. Okay, obviously I've got as \nmany tarps as I want. This is perfect. We're going   to set up the entire back of the U-Haul as one big \nwater park ride. Tarp is complete. Next is soap.   This is like a very, very crazy slip and slide. \nOkay, it's uh it's slippery. I can't do it. I got   to drive the truck. So, I got to get somebody else \nto do it. And I know just the person. Not exactly   a person. It's the Ben dummy. Have fun, Ben. Let's \ngo for a ride. I want to see how dummy Ben handles   this ride. Woo! What do you think your dad is \ndoing? Woah! Woah! I have no idea what he's doing. Time to review the footage. If this is an awesome \nride, I'm pretty much done with my water park. Oh,   I can't have a mystery judge do this. I don't \neven know who it is. What if they're like a   kid? There's no Oh, no. It's him. Come on, \nbro. Come on. Come on. Come on. Come on.   Come on. That was such a good idea. Now I have \nno plan. And to make things even worse for me,   Salish just arrived so she can start building her \ntruck. Hey, Dad. Hey, say what are you doing? I   was reviewing footage about something and my ride \nis going to be awesome. I can tell you're lying,   Dad. No, it's going to be so good. What \nare you doing? I'm not telling you. No,   no, Dad. I know you're lying. What are you \nactually doing? Okay, I'll tell you. I'm   doing a water park. And was the ride good? \nYeah, it was incredible. So, it was bad. No,   it was incredible. Yes. Bye. Now is my chance \nto see what she's planning to build. Wait,   Dad. No no no no. Nothing's over there. Ha! \nManual for the car. Okay, no worries. Go back   into your truck. Bye, Dad. I need to up my game. \nSalish looks confident. So, I've got an idea. I'm   going to a water park to investigate the best \npossible ride. I'm building a water park in a   truck. Good luck beating that Salish. Matter Cup \nis mine. Cool. Good for you. Have fun. Okay, bye.   I'm going to win. I don't know what I'm doing. All \nright. My dad's going to the water park right now,   which means I can get ahead on the build. I have \nto find the best one or two rides and then try to   recreate them in the back of that truck. Hey Say,\nI have all this stuff. I have the sincerely yours   sign. I have the paint. We have a ton of stuff \nto make this transformation better than your   dad. Thank you so much Del. Okay, let's go. All \nright, guys. This looks great. Let's go. My number   one goal is to build a perfect Sephora. Like, if \nyou were in there, you would actually think it   would be a real Sephora. Like, it needs to be \nperfect. I really hope that the mystery judge   loves skincare and makeup because if they do, \nI'm definitely going to win. Oh, did you hear   that? What? What was that sound? Oh. Okay. Wait, \ndo you hear that clanking? What is that? Oh, yeah.   That's not good. That's not good at all. I don't \nknow. It sounds like a tire. I can't tell. What's   up? Why did it come up? Wait, Dude. It's not \nIt's not What is up? Yeah, my truck just broke,   which means I need a new one. It's stuck. This is \nleaking all over the place. I have no idea how far   away a U-Haul is. This is going to take me so far \nout of the way. Come on, let's go. I think there   should be some stripes somewhere. Maybe like all \non this wall to really like it give Sephora vibes,   you know. For the sincerely yours section, I'm \ngoing to fill that up with products. And I'm   just going to fill the entire Sephora up with \nother products. Del, what do you think? Let's   add a few shelves here, some extra stickers on \nthat wall, some lighting over top, and a really   beautiful floor. And I think you have an amazing \npop up Sephora. Okay, that sounds good. Thanks,   Del. I was on my way to the water park. Now I have \nto divert myself to the U-Haul. Hope they have   another 26 ft U-Haul to get and then go to the \nwater park. So, this has super delayed me. I don't   even know how to do Map Quest with a side road and \nthen go- Map Quest? Wait that's old. Map Quest?   Okay, you're showing your age. Okay, I mean Google \nMaps. So, first we have to attach it and then   we'll paint it or we'll add vinyl and all of that \nfun stuff. And now that things are really bad,   they're going to get even worse. Collin, there's \nno way this is happening right now. Oh man,   Salish is going to be so ahead of me. Oh my god. \nWait, he's calling in. No, no, no, no. What? Hey man, I thought you had a body back here. \nNo, no, no, no, no. That's just a dummy. We   were doing a thing for YouTube where it was just \nsliding around. Man, it got me for a second. Oh,   I'm sorry, officer. I'm sorry. Clearly, \nthe bigger issue is you have water coming   out your truck. Things can fall out the truck, \nwhich can cause a big hazard. Car accidents. I   know. I'm so so sorry. What happened was uh I \nwas driving and then I realized it was broken   and I was on my way to U-Haul to get a new one. \nSit tight. Give me one second. Okay. Thank you,   officer. You got to be kidding me. That's so \npretty. I love butter yellow. It's like one of   my favorite colors. Don't spill on me. Don't spill \non me. I want to be a painter when I'm older. This   is a lot of paint. Look at how nice this is. \nSo, I just finished this, but what should I do?   I have some black and white long stickers to give \nyou the support pattern. Do you want to go start   that? Yeah, let's go. Come on. Come on. What is \nhe doing? Okay, this is not really a great start   to the day. Salish is so far ahead of me. Say, \ntime's ticking. I know, Ro, but we can't really go   fast on this. It looks so good. Oh my gosh, dude. \nOkay. All right, sir. Yes. Signature right here,   please. Okay. This is freaking me out. Um, thanks \nfor your cooperation. Thank you for being so nice   about this. Here you go, sir. Okay. All right. \nGood to go. Okay. Bye. I cannot believe I just   got two tickets. Two tickets. I got to chill. I \nhaven't even started building anything yet. Salish   is probably already done. This is a nightmare. \nU-Haul. U-haul. We're right there. Do you guys   have any more 26 ft trucks? All right. Got the \nnew U-Haul. That's what it's supposed to look like   right there, Collin. Here we go. This looks like a \nreal Sephora. Say, we got to set up the products.   You ready? All right. Yeah. Let's go. Let's go. \nCome on, guys. Honestly, I'm losing by so much   in the Matter Cup this year. I have got to win \nthis by the end of the year because if I don't,   I don't get the prize. And I'm telling you right \nnow, the prize is like the coolest thing we've   ever given away on this channel. Now, I'm going to \nbring in these shelves for all the products. Now,   we're going to stack some sincerely yours \nproducts. These are the moisturizers. These   are the sunscreens. And we got to go get the other \nproduct. Rohan when we go to the mystery judge,   you're going to have to drive very slowly. \nWe are now at Great Wolf Lodge. We're going   to run in very quick, test the water park, \ntalk to some people, see what they like,   see if I can come up with any good ideas. Wait, \nRohan, we only got sincerely yours. You didn't   get any makeup? I completely forgot. We need \nother products. We've been here before. Last   time with Nidal overnight. Hey, I watch you \non Youtube! Thank you. Let me ask you guys,   what's your favorite part of a water park? \nSlides. Slides. Lounging by the pool. What   do you like more, slides or chill? Slides. Slides. \nSlides. Okay. Like, why didn't we just get it the   first time? Because I forgot, Rohan. Obviously, I \nwant Sincerely Yours to be a big part of my mobile   Sephora, but I also want to include all my other \nfavorite makeup brands. One of these. Foundation,   Body Glow, some blush. I actually love this \nbronzer so much because it makes my makeup   look so good. And the foundation I've heard is \nso good and it stays on for a long time. Guys,   I love Patrick Ta so much. The blush is so \npretty and the bronzer. I love this blush   so much. It stays on for so long and it looks \nso natural. Then I also love these lip glosses   so I'll get a couple of these. Hey, we need \nto check this out. But we also need like 10   more bins of it. So I'll fill it five. You fill it \nfive. Okay. Thank you, Ro. Can you hear me? Yeah! Do you guys like the lazy river or do you \nlike a big slide? Slide. Okay. Thank you.   Bye. Listen. Come here everybody. Should \nI try to build a water slide? Yeah! Okay.   Thank you guys. Let's go team Jordan. Okay guys, this is where the sincerely yours is \nsupposed to be in the Sephora, but they don't   have it here. So, if your guys' Sephora doesn't \nhave it, then make sure you ask them for it so we   can hopefully get it in every Sephora. And that's \nwhy I'm turning the truck into a Sephora so that   hopefully one day my sincerely yours section in \nSephora can look like how it does in the truck.   I got to FaceTime somebody and see if I can get \nsome help cuz now I know I have to build a slide.   Drew Dirkson has done some of the most incredible \nbuilds on YouTube. So, if anyone can help me, it's   him. Drew. Hi. I'm in a really tough situation. \nYou see all these people? Oh my god. Yes. I am   doing a competition against Salish and I need to \nbuild a water park in a 26 ft U-Haul. Do you have   that water slide that you used in your last video? \nI don't have that water slide that I just used,   but I do have another one that I'm building right \nnow. Let me make some adjustments. I definitely   think we can make it fit in the truck. Are \nyou kidding me right now? Yeah, I got you. Thank you, Drew. Thank you. I will see you at \nBen's warehouse right now. Okay. I'm usually   terrified of fast rides, but I have to overcome \nmy fears today to make sure I know exactly how   to build this slide. Nobody told me I was going to \nget my hair wet. What I just learned is the faster   the better with a water slide. No idea how we're \ngoing to be able to do that with a 26 ft truck,   but Drew's probably on his way. It just took \nme another 30 minutes to get through that water   slide. Of course, took 15 minutes just to do the \nhair. So, let's go. Thank you so much. [Music] All   right, guys. This is starting to look like a \nreal Sephora. This is the color picker. Ooh,   kind of like the blue. Light yellow. \nYellow. Oh, wait. Salish's U-Haul is   right here. What is she doing? Salish, what \nare you doing? What are you doing? Wait, wait,   wait. What is that? You building a Sephora? \nNope. With a full on sincerely yours thing?   No. What the What? Oh my god. I've got a lot of \nwork to do. Jordan. Drew, you're here already?   Yes. Put that in the back of the truck. Jordan, \ncome with me. Okay. Okay. Oh, thank you. We   have to go get more stuff. Yes. These are the two \nsincerely yours photos. I'm going to hang them up,   I think. Guys, that's me. Oh my gosh. No. Wait. \nI love that. Ben's girlfriend Hannah is a Sephora   expert and she's going to come over and make \nsure everything looks good. Look, look what   she's doing. That's a Sephora store. I'm telling \nyou right now, if the mystery guest is a dude,   you're kind of cooked. Yeah. Well, all I see over \nhere is just a little grass with some blue paint   on it. Good job. Hurry. Come on. Come on. Let's \ngo. The whole thing is we're doing this huge   Matter Cup competition at the end of the year. \nOkay. So, whoever wins the most matter cups by   December 31st wins a massive prize. So, I really \nneed to win because I am down currently 12 to7.   Okay, we really need to make this thing good. \nThe Sephora is almost finished. Let me give   you guys a tour here. It's my favorite section. \nSincerely yours. It's the best section obviously.   And the Sincerely Yours section is the biggest \nsection. Then we have Makeup by Mario. One of my   favorite makeup brands. Some Soul de Janeiro. \nWe've got Rhode. Sincerely yours is better,   but you know. And then we got Summer Fridays. Then \nwe have Patrick Ta. I love Patrick Ta so much.   That's my tour. But I'm hoping that once Hannah \ncomes, she has a suggestion to make it even   better. Drew, how do you know this is going to \nfit, man? Educated guess. Jordan, please fit.   Please fit. Please fit. Boom. There's no freaking \nway it fits. Are you kidding me! I told you it was going to work. All right, walk it \nin. Yes. As my water park comes together,   I'm starting to feel confident that I've got a \nreal shot at this. Salish, you're going down,   little girl. And I'm ready for you. Hi. Okay. \nCan you help me and like tell me if anything   needs to be better? Yes. Three, two, one. Wait, \nthis is crazy. Thank you. We got everything in   here. Isn't this your brand? It is. Soothing \nserum mist. Let's try it out. It's like kind   of cutecumbery. Oo, it smells really good. \nThank you. Feels good, too. We have makeup,   perfume, your skin care, but this area over \nhere is looking a little empty. And you know,   every Sephora kind of has their own makeup \nstation. That's such a good idea. Do you   think Ben has one like in the warehouse? I think \nhe might. To the warehouse. Let's go. All right,   Jordan, go ahead and spray the soap on it. \nAll right. What's the soap? Makes it faster.   Yep. Beautiful. All right. Ready? All right. \nOh, okay. Okay. Thank you, Jordan. Okay. Go.   Go get him. Let's see how it goes. I don't \nknow if it's going to be that fast. Oh, god. This slide is fast, but we've got a lot \nof work to do to catch up to Salish or   I'm going to lose the matter cup. If we find \nthe vanity, we have to be super sneaky about   it because Ben is on team Jordan today. \nIf he finds out that we stole the vanity,   he probably wouldn't be too happy. Let's check \nin here. No. What about in here? There's nothing   in here. We got to go quicker. Let's go. Let's \ngo. We put some extra padding down. This is a   slip and slide. We're going to try and make \nthe ride extend even further cuz that looked   like it hurt. No, wait. There's one right here. \nOkay. Shh. We have to be quiet. Come on. Sh. Go, go, go, go, go. Okay. Okay. Great. \nAll right. And all right. The makeup   vanity is in. And now this room is complete. \nWait. Dad. Dad. What? Nothing. Nothing. Why   are you stealing from me? I'm not stealing \nanything. Your own daughter's Sephora. Dad,   how could you do that? It's just not fair. \nHow did you get all this stuff? Like,   this isn't fair. Life is not fair, Ben. Yay. \nAll right. Are you ready for a water slide? I'm   excited. You ready for a mobile water park? I'm \nso nervous. There we go. Open. Not bad, right? Yo,   that's huge. Now, what I need you to do is this. \nOkay. Today, I need you to be team Jordan. Can I   get a team Jordan on you? You know what? Today, \nI'll be team Jordan. Let's go. Let's go. Let's   go. I love it. Team Jordan. Team Jordan for the \nwin. Listen, before you go, maybe a little bit.   Okay. I just want to make sure that you slide \nwell. Okay, here we go. Oh, that looks nice and   all right. I'm honestly terrified. I'm terrified \nfor you. That's why I haven't done it yet. 3 2 1 It worked. That was awesome. Ben has made like a \n100 water parks in his day. They're always epic.   There's nobody better for a mobile water park than \nBen. Why don't you go for a swim in the pool? You   can dive in. It's like 6 inches deep. This is \nactually what they call a rain shower. Yeah,   I like that. and you go underwater and \nyou listen the rain shower. Give it a try. Isn't that kind of nice? I'm kind of drowning \nright now. You're losing. I love the slide. Okay,   but obviously water parks have food. Food. So, \nif the mystery judge likes food and they like   water parks, I win. Thank you, Ben. Good \nluck. Okay. Okay. Actually, no. No. No.   My Sephora is about to be open and everything \nlooks perfect. I'm definitely going to win,   but only if the mystery judge loves Sephora. \nCome on, let's go. Let's go. Come on, Rohan.   Get in the car. Where are we going? The mall. \nYes, the mall. As soon as we get to the mall,   I'm going to go to the Sephora and try and find \nsome Sephora kids to show them the transformation   so that I can practice running the store and they \ncould give me some advice about what I should   change. I sent Drew out to buy two food stands \nwhile I'm going to Target to get the food. Ben,   great idea. This is the finisher I \nneed, but we are super late, Collin,   so we got to hurry up. I'm thinking lemonade. \nWho doesn't like lemonade? And ice cream. Cuz   lemonade's easy to make and ice cream. You got \nto have ice cream if you're going to a water   park. If you don't who the mystery judge is to \nknow what kind of ice cream they would like- So,   I'm just going to get a bunch of different uh \nindividuals. Jordan Matter! How are you guys?   Thank you. Let me ask you guys a question. Okay. \nIf you were going to a water park, what would be   your favorite thing to do? Go down the slide.\nNow, what kind of food would you expect there?   Lemonade and ice cream. Would that work \nfor you? All right. So, I'll get popsicles,   too. Thank you, guys. Popsicles. That very \nmuch looks like a water park popsicle. You   got yogurt bars? I don't know, man. I'm just \npanicking right now. Get this shot, Collin. Got it from both angles. Boom. You're \nSalish's dad, right? Let me ask you a   question real quick. What's my \nname? It's- I know it. I know   it. I know it. This is killing \nme right now. Is it Jordan? Yes! Let's go. Let's go. All right, guys. We just got \nto the mall and I got to go to the Sephora and   find some Sephora kids to test my Sephora. \nLet's go. I need to hang a U-ey here and go   right around. Oh my gosh. No. What was that? \nNo. Okay, it's not that bad. I dented it, but   it's not worth going back to fix- dude! Why are we \ndoing trucks? I just smashed it twice and now it's   shaking again. I wonder why. Look at this. Are you \nkidding me? This is the second U-Haul I've broken   in one afternoon. Hi, I was just wondering if you \nlike Sephora? No not really sorry. No? Okay, thank   you. Let's keep looking. Hi, I was just wondering \nif you want to come to my mobile Sephora? Sorry,   I got to go. if you wanted to come try it out? \nSure. I just launched a skincare brand called   Sincerely Yours, and it's not in all Sephoras. So, \nperfect. Okay, let's go. This could all actually   come together. I'm going to have a pool, a water \nslide. That is sick! And now two different food   stands that could be better than Sephora depending \non the mystery judge. If the mystery judge is like   a beauty influencer or something, I'm cooked. But \nif it's like a Ben type of guy, I could easily win   this thing. Thank you guys so much for coming. I \nhave something super exciting to show you guys.   Are you ready to see this amazing transformation? \nOh, yeah. I turned this truck into a Sephora. Oh, that's a Sephora? Guys don't look. \nTurn around. Turn around. Don't look.   Don't look. What happened? Everything looks \nterrible. Salish I told you we were driving   too fast. What is going on? If this is what \nmy Sephora looks like by the end of the day,   there is no way I'm going to win. Well, I need \nto fix this up and get some real advice from   the Sephora kids. Okay, here we go. You good? \nDon't slip on it. I I know. I've got slides on.   Why are you wearing slides? I don't know. Yeah, \nyou know, I'm not really a carpenter guy. And   nice. We got to hurry up. We are running \nout of time. Here we go. Coming together. All right. Forget about everything that \nhappened earlier. This is my Sephora. This is so cute. Oh, this is cute. Give me the \nwhole thing. I love it. I'm taking this a to   the mystery judge in like an hour, so I need to \nget some advice. Anything you guys would change?   No. It's literally perfect. Okay. Oh my gosh, \nguys. Come look. Oh my gosh. Okay. Well, it looks   like they like the brand. So, this is a mist. Each \nof you guys can take one of them. I can take it.   It can go over makeup and it sprays really nicely. \nThen this is a cleanser. It's great for gentle.   And guys, this is a moisturizer and it pumps. \nAnybody want to try this? Yes! That feels so good.   Thank you. Can we get one of these, too? I mean.. \nI still kind of need the products. Wait guys. Oh. Um. Oh my god. Guys, I still- guys wait- \nguys guys. I need my products back. I don't have   any products anymore. I learned that they really \nliked this Sephora because they took everything,   but I also need to get some tape so that \nwhen we drive to the mystery judge's house,   everything doesn't fall over. Drew, I just got \nthe text. I know who the mystery judge is. Please   tell me it's in our favor. Please tell me it's \nin our favor. Does that help us or hurt us? Does   she like water slides? I know she likes makeup. \nThat's not a good thing. I know this is bad. We   got to go over there. We got to go right now. Why \ndon't you tell me why- Now, let's stress. I just   found out who the mystery judge is. I'm going \nto win. I'm going to win. I'm going to win. I'm   going to win. It's an address and I'm pretty sure \nI know who lives there. So, let's go. Rohan, We're   going to win. We're going to win. We're going \nto win. Bring it over. Wait. Wait. I'm losing   my slide. They weren't the best shoes to wear. \nWhy are you wearing flip flops? Okay. We're good.   Maybe what I need is a name change. What do you \nguys think? This doesn't look like anything now,   but when we get to, we're going to set it up and \nwe're going to win the Matter Cup. Can you just   tell me who's the mystery judge? Where are we \ngoing? I can't tell you, Ro. Why can't you tell   me? Because I can't tell you. It must be someone \nwho likes Sephora. All right, Drew. Let's go into   Taco Bell. Do you have Baja Blast? How long will \nthese last before they start melting? Probably   15 minutes. 15 minutes? 10 minutes probably. 10 \nminutes. 15 minutes. Okay. All right. Thank you.   All right. We got to go. They're going to start \nmelting. Salish has built a beautiful Sephora   and she's going to an influencer who loves \nbeauty. So, what could possibly go wrong? Did you hear that? It doesn't matter, Ro. We \ntaped it. Let's just go. Come on. I invited 10   expert Sephora girls to help impress the judge in \nour pop-up store. We're here. We have to get set   up. Go, go, go, go. I know. I know. Hi. Hi. Thank \nyou so much for being here. Thank you. Thank you.   Thank you. Thank you. You guys need to be my \nSephora employees. Yeah. Let's go. Let's go.   Hey. Woohoo. I'm competing with my dad. He made \na water park in his truck, but I made something   so much better. Do you want to see? Yeah. This. \nWoah. Rohan. No. You're terrible driving. I told   you I heard something. All right, guys. Can you \nhelp me fix this up? I think we should start off   by picking up the shelves. That's good. I kind \nof thought that taping all the products down   would fix everything, but I guess not. 5 minutes \nuntil the mystery judge comes out. Okay, Rohan,   I know. Oh my gosh. Oh my gosh. I'm going to \ngo ask the mystery judge for a broom. Let's   go. Presenting the mystery judge. Hi, Lexi. Hey, \nSalish. Are you ready to show me your truck? Oh,   almost. But I need a broom really quick. Okay. \nThank you so much. All right, here's the broom.   I'm just going to clean up and let's go Sandy. \nThank you so much. Everything looks amazing. I'm   going to finish up this glass and then I'll teach \nyou how to become Sephora employees. Okay. I am   really behind in the Matter Cup competition for \nthe year. Plus, I know that Salish is kind of   not nice to you. Like, could you play some \nclips? Shouldn't you be like married right   now with like grandchildren already? She's even \ncalled you short. Yeah, we're going to play that   clip. How tall are you? Like 4'10\". I'm actually \n5'1\". You are not 5'1\". Yes, I am. Look at your   huge- Don't show these. Yes, look at them. I know \nthat you might need this win, but I'm a judge and   I'm taking my job seriously today. May the best \ntruck win. Are you even 5 foot yet? Yeah. Can you   see what she's saying to you? You're 4'11\" 4'10\"? \nOkay. I don't even need to see your truck. Jordan   wins. Let's go. Is that true? Is that real? No, \nit's not. It's not. I need to see them first. Why   don't you go to the little Sephora thing first. \nNo, not yet. We're not ready yet. This is a bad   sign. Let's see what happened. Uh-oh. Could be \nworse. We got to set this up, guys. We don't have   much time. Did you hear the way Salish was talking \nto Lexi? Lexi might vote for me just out of spite.   Let's go. Let's make a good experience. Okay, \nready? Team Jordan, let's go. Stop flexing. Okay,   you're right. We have 10 minutes to set this \nup. That's how much time Salish is going to   take with Lexi in Sephora before she comes for \nher water park experience. This is not looking   good. I need to teach you how to be my employees. \nOkay. Okay. We got to be really nice, helpful. Do   you know what this is? Blush. Blush. Yeah? Okay. \nGot to talk really good about the products. The   final thing, I love all of these brands, but the \nbest brand in here is.. Sincerely Yours. I think   we're all ready. Come on. Let's go. Every cone is \nbroken and it's got like soap on it. Del, try to   make sure that the food doesn't have soap on it. I \ngot you. Oh, okay. Hold on. Don't hurt yourselves.   I've got slides so-- Oh my god. Okay. It's a \nlittle slippery. I shouldn't have worn slides   today. That's just the answer. I told you not to \nwear slides! Oh, that hurt my butt. You didn't get   that on camera, did you? Oh, great. I bet they're \ngoing to use it, too. Drew, this is awesome. I   cannot believe you came through for me. Good. \nPerfect. I'm ready to see it. Ready? Okay. 3 2 1 Oh my gosh, it's a Sephora. Okay, this looks \namazing. Maybe my Sephora doesn't look as good   as it did because stuff broke and the girls \nstole my products, but I think I still have   a chance to win. Lexi says she doesn't like \nwater slides and this thing goes super fast,   so I'm concerned. All right, girls. You're so much \nprettier in person. I love your earrings. Thanks.   Yeah, your hair is gorgeous. Oh my gosh, \nI love her necklace. So pretty. All right,   guys. All right. Thank you so much. You can wait \noutside for us. Thank you. They were a nice touch.   Very professional. This is my Sephora. And here's \na bin. Oh, wow. You can pick out anything you   want. Is this a Sephora bin? It kind of just looks \nlike a trash bin. No, it's a Sephora. Salish,   you literally have like every single brand that's \nin a Sephora in this truck. I'm impressed. I love   Makeup by Mario. I need some more eyeshadow. \nSo, I'm going to take some of that. I will also   be taking a lip product. You're gaining so many \npoints. I don't even care if you think I'm short.   You can be mean to me all you want as long as I \nget this free stuff. Yeah. Yeah, definitely. Wow,   you're really going in for it. Wow, the glazing \nmist. This is one of the best Sephora experiences   I've ever had. What happened to this photo? \nYeah. Nothing. Watch out. Watch out. Watch out.   Watch out. Woah. Salish, you almost killed me. I'm \nsorry. Didn't mean to do that. Minus five points.   This doesn't look nearly as pretty as Salish's, \nbut hopefully the ride is fun, this is fun, the   food is good, and she loves water parks. That's \nwhat I'm banking on. Otherwise, I'm going to be   down a lot for the matter cup. The Baja Blasts. \nI know for a fact that Lexi likes Baja Blast. So,   let's hope that puts her over the edge for the \nwater park. It's getting dark. She's got to be   able to see when she does the water slide, right? \nSo, I wish they would hurry up. This is definitely   the best section. Honestly, I do agree. This is \nthe best section in Sephora right now. Thank you.   Okay, hold on. Wait. All right, Dad. First of all, \nyou paid a bunch of girls to give her compliments.   Second of all, this is really nice. Hold on. \nShe's about to give me free products. Yeah. Dad,   wait. So, give me a second. We even got you a \nhoodie. Oh, and it's adorable. Look at these   little patches. I was thinking maybe I could get \nsome other free stuff. Yeah, you can take anything   you would like. Oh, really? Oh my gosh. Okay, I'm \ngoing to need some more of this. Love this stuff.   Yeah, take everything. Okay. Yeah, I'm just going \nto kinda Well Salish I mean, I've seen what I need   to see-- no no no, I have one more thing. Come on. \nLet's just like put some like lip gloss on you.   Thank you, Salish. At real Sephoras, they charge \nyou money, but I just do it for free, you know?   That's true. That's a lovely-- Stop talking! Okay. \nThank you, Salish. Wow. Yeah. You're welcome.   You're getting on my teeth. It's Yeah, it's in my \ngums and it's on my teeth. No. One more thing. Oh,   okay. Yeah. I think that's just like perfume. Time \nis up. You're like doing makeup together? Yep. Oh,   man. You got product, too? Oh, yeah. I got a bunch \nof free stuff. It's amazing in here. I think that   went well. All right, I'm definitely going to win. \nOh, Salish, I told you to fix that photo. I told I   told you to fix that. There's stuff falling apart \nin there. But you know what? I got a ton of free   product, so it is what it is. Guys, you like \nwater slides, right? I love water slides. Well,   let's go. Okay, come on in. You're not really \ndressed for a water park, though. I'm not getting   wet, right? Well, it's a water park. Oh. Oh. \nda-da-da-da! Wow. [Music] It might not be the   most aesthetic. I'm seeing one thing that's \ngoing to get you some points. Okay. Would you   like one? I would love one. Cheers. Cheers. Plus \nfive points. Plus five points. Let's go. Okay. So,   the aesthetic wasn't great, but at least you \ngot your favorite drink. Yeah. This all looks   really good. You know, we got the ice cream \ncones, the lemonade in the middle. Would you   like some dippin' dots? One thing that Salish's \ntruck did not have is food. I'll give you an ice   cream cone. I'm not sure if that's how it should \nbe, but Okay. Yeah. Del, try to make sure that   the food doesn't have soap on it. It's good, \nright? Yeah. So, I'll take this from you. You   know what? I'll give that back to you when you \nget into the pool. Guys, I'm going to try and   sabotage my dad. You know how at water parks like \nthey push each other in the water? No. Uh, no. it'll be fun. Hold your nose. I wanna go back to \nSephora. It's going to be fun. No. Okay. Hold your   nose. Hold your nose. Hold your nose. Oh, no. \nHold your nose. Oh, wait. No, that wasn't fun? I don't think I like it. Dad, you're \nnot making her very happy. Okay,   this is going badly. Yeah. I don't want \nto play. If the water slide is super fun.   Do you think still I'll have a chance? Your \nlast chance is this water slide. Okay. It's   going to be amazing. I better have a lot \nof fun. I want to go back to Sephora. You   got Drew down there to catch you if you \ngo too far. I'm here to keep Lexi safe. Are we good? I hit my shin a little, but \nOkay, I'll get over it. This is really   really going bad. Lexi almost-- Yeah. \nYou know what, Jordan? I don't even need   to use the slide right now. No it's super \nfun. It's not even a competition anymore.   Have fun. Thanks. Woo! Yay! So much fun! \n[Music] Jordan! Okay, here we go. [Music] All right. All right. All right. All \nright. Wow. I am having so much fun.   She does not look like she's having fun. \nI just want to go back to Sephora. Uh-oh.   That's a bad sign. But you know why, \nLexi? It's cuz you didn't do it fast   enough. One more time. Are you ready? \nNo. Three. Two. One go. Oh my gosh! Yeah! Wow. Thanks, Jordan. Felt like everything went \nwrong, but fingers crossed we somehow pulled   this off. And now we're going to find out who \nwon the Matter Cup this week. Hold on guys. I just want to remind you water parks are fun-- \nyeah and I just want to remind you, you can have   whatever products you want. Oh, that is so \nnot fair. Are you kidding me? Anything you   want. Whatever I hear right now, it's not \ngoing to change the decision I've already   made in my head. I think that this cup \nbelongs to Salish. Yes! Yes. Thank you.   Your Sephora was amazing. I honestly think \nyou could have won just because I like your   brand Sincerely yours so much. Anyways, \nyou should have seen it over there. Yeah,   I know. I saw it. It was terrible. \nThe ice cream was melted. Yeah, and the ladder broke. Sandy, go to end cards. No, not \nyet, Okay? I fell on my face. The ladder broke.   Yeah, the slide you didn't move. The slide, \nI had to go on the slide-- Sandy end cards!",
    "start_time": 0.16,
    "end_time": 2004.0800000000002
}