{
    "video_id": "ELZNfgG4Iq4",
    "channel_url": "@jordanmatter",
    "transcript": "Today, my daughter Salish is going on five dates \nin 24 hours. But of course, there's a twist to it.   I've prepared a bunch of challenges to test Kaido. \nOh, you know how much you matter to me. This is so   awkward. I just want to prove to you that I'm the \none for you. Did you guys kiss on your date? So,   I can see if he's the right one to date my little \ngirl or if he's just playing with her feelings.   What's your name? Casey. K. Nice to meet you. Um, \nwould you want to hang out sometime or like go on   a date? Oh, I'm like, thank you. If he passes all \nthe tests, I will pay for a dream date wherever   they want to go. But the real question is when \nhe asks her, will she say yes? Would you like   to go out again? Starting with go-karts. Whoever \nloses this race has to pay. What? Are you ready?   I'm not paying. Come on. Let's go. Whoa. Wait. \nhands in the first 5 seconds of a date. Oh,   this is going to be a long day for me. Sage \nand kaido recently went on their first date.   And after the date, kaido sent me a very nice text \nasking if he could take my daughter out again. Oh,   here they go. Here they go. Here they go. So, I \nsaid, \"Where would you want to take her?\" And he   sent me five dates. All of which they're doing \ntoday. salish, you're going down. You know that,   right? No, you're going down. Now, I'm going to \nguess that kaido is a faster driver than Salish   given her history. Which one's the brake? He's \ndriven a but he's have to make a very important   decision. Does he win and make Salish pay or does \nhe intentionally lose so that he can pay? Okay,   she is not winning this, bro. Bye. I don't \nknow. I want to pay. The first test of kaido   is generosity. Guys, she's losing this. She's \npaying for this whole thing. What? Wait a minute.   Now he's cooking her. Guys, I just saw Jordan. \nHe does not look happy. Very good at this time.   I thought he was letting her win, but no. Now \nhe's just winning. Is he going to make salish pay   for this date? I'm winning this. She's paid for \nthis whole thing, bro. This is easy money. He was   driving with his arms back like, \"This is so easy. \nI'm cooking her.\" What? Are you kidding me? Uh,   no. He's taunting. Salish! Win. He's taunting \nyou. This is not my first time racing. I've   been doing this since I was like 11. She just \ncrashed. Oh my god. Kaido's always said he's   super generous. He pays for everything all \nthe time. He's told me that multiple times.   And right now he's about to make salish pay for \nthe first date. salish, please beat him. Please.   He's taunting you. Don't hit things. All right, \nI think we're nearing the final lap and it looks   like Kaido is going to take it home and Salish has \nto pay for this first date. Go. Oh, thanks. Oh,   he let me do it. salish, go take the win. Oh, \nhe's counting down. He's not going to be able   to win. I think he just gave it to her. I like \nbeing competitive. That's like what I do. Am I   going to win behind? Wait, if he comes back from \nthis, that would be crazy. He gave her a 7second   head start in the last lap. They're neck and neck. \nYeah, little girl. Look, he's closing the gap. Oh, did they see that turn? He just took the \nlead at the last minute. There is no way. No,   he's winning now. I told you guys this is not my \nfirst time racing. Checker flag. It's all over.   And that was the one. kaido won the whole thing. \nSalish has to pay for the first date. He failed   my first test. I hate kaido. Not a good look, \nkaido. Definitely lost that challenge. That's   pretty sad. Thought thought you were going \nto do better than that. You're pretty sad,   guys. She lost the race. She lost the \nbet. Now she has to pay. I hate you.   It's going to be expensive, too. I have to \npay $53. Well, look, I'm saving a whole $3. Okay, I'm just kidding. No, no, Kaido. They're \nfighting. They're fighting. No, I'm just kidding.   I'm just kidding. I can't let you pay. I can't let \nyou pay. Oh, he's paying. All right, I paid. Got   it. Thank you. Okay. I didn't see that coming. So, \nhe won and he paid. I'll take the receipt, please.   Thank you, kaido. Of course. Thank you. Appreciate \nit. Thank you. Oh, you're such a good person. So,   he proved he's competitive and generous. Two \ngood qualities. Okay. He passed that challenge   and he moves on to the next date. When I'm 16, \npeople better get off of those roads. [Music] Wait, how was your guys' dinner on Monday? We \nwent to Din tai fung, then we did VR, and then we   went to a movie. What movie? Weapons. Bertram \nis my favorite character. He's so funny. I feel   like Jesse is the for your time, though. No, I \nwatched every single episode. I watched all of   it every day. They seem really close right now, \nbut let's see what happens later when I put their   relationship to the test. Are you Salish? Yeah. Can I \ntalk to you for a second? Yeah, let's go. You're kaido,   right? Yes. I've seen you like all over my TikTok. \nWould you want to hang out sometime and like go on   a date? kaido, this next challenge is protector. \nI want to know that you can keep my daughter safe.   So, I want to find out how hard you can punch the \nbag. Now, if you can beat me, I will pay for the   go-karts. Deal. All right, let's do it. Strong \nhandshake. Here we go. Wait, wait, wait. Okay,   okay. Straighten out your back. Oh, yay. I can't \nstraighten out my back because unlike you, I'm   tall. I got to get low because this thing is low. \nOh, it's made for guys, you know, under 6 foot.   It's fine. I am six- You and Salish are basically \nthe same height and then it's your hair. All   right. Ready? Here we go. That was pretty good. \n[Applause] kaido, you have to beat 763 to prove   to me you can protect Salish and for me to pay for \nthe go-karts. Got it. Come on, kaido. You got it. Oh, I feel good about my chances. I feel good \nabout my chick. Yay. Woo! Good job. So, you won.   I'm actually happy you won. And you passed both \nchallenges. Moving on. Thank you. Wow, that was   strong. Actually, what they don't know is I set up \na stranger to come over and flirt with Salish. And   see how kaido handles it cuz I definitely don't \nwant a guy dating my daughter who's jealous. I   hate 800, but I was just taking it easy. I could \nhave hit more. For sure. For sure. Like, that's   not that hard. Like, easily. Hey, excuse me. Are you \nSalish? Yeah. Can I Can I talk to you for a   second? Yeah, let's go. Oh, this is so cool. I'm \nI'm a big fan. Nice to meet you. Are you seeing   this? kaido looks a little annoyed right off the \nbat. Say I thought you were cute. Thank you. You   have a boyfriend? No, I don't have a boyfriend. I \ntold Salish about this challenge, so she's playing   along just to see if kaido's jealous or not. Keep \nputting in my phone. I'm giving you my snap. Oh,   he just jumped right in there. What's good, \nbro? What's your name? What's up, Keaton?    nice to meet you, bro. Nice to meet you. Pleasure. \nHere, I can put it in for you. Okay, I added her   secret one, too. Oh, you did? Yeah. Appreciate \nit. I got I got a picture with you, too. My My   sister's a big fan. I got you. Let's do it. All \nright. You have a good one, bro. Thank you. You,   too. Nice to meet you. Nice to meet you. Safe. \nNice to meet you. Let's go. He did not get her   snapped. I think kaido handled that really well. \nHe was nice to the boy, but he also made sure   everybody knew Salish was protected. So, what just \nhappened? Some boy tried to get her snap. Oh,   and did he get it? No, I gave him my snap, and \nhe thought it was hers. I like it. Let's move   on. Next date. Okay. Nothing weird about this. \nSalish. Okay, we're actually a good. separate. Okay. What's happening? Nothing. No, you said \nwhat's up. You like those plants, bro. I like   them. My favorite flowers are white roses. Look, \nI thought you liked um tulips. Kaido, look at me. I   really like that flower. Okay. A Thank you. Like, \nthis is my favorite flower. What's my favorite   flower? White roses. Good job. salish is telling \nkaido all kinds of things about herself. What he   doesn't know is that he's going to be quizzed on \nall of it later. What is this? What is this? We're   setting up a shot and I look over and there's just \nWe were talking about a car. That's not the part   I'm talking about, kaido. I'm talking about the \narm thing. I need a kid. I want kids right now.   I want kids so bad. How many kids do you want? \nYou want two or three? Two. I want five. Five.   Five or six? No. Six. Seven. All right. For the \nnext eight is Top Golf. I'm going to be measuring   your honesty. Whoever hits it further that round \ngets to ask the other person a question. kaido,   why don't you go first? I'm using golf to test \ntwo things for kaido. Number one, does he have a   sense of humor about himself because I know he's \nnot any good at golf, but now he's going to show   millions of people he has a terrible golf swing. \nIs that going to embarrass him or is he going to   laugh about it? Are you embarrassed to do this or \nyou good? A little, but I think it's fine. This   is testing their truthfulness with each other. Is \nkaido willing to ask her hard questions? salish   willing to answer them and visa versa. All right, \nKaido, you can go first. How do you do this? Collin,   I don't know how to do this. Go like this. \nYou just go like that and then you go like   that. I throw myself out into the golf club. \nNo, you got it. Come on. Lock in. [Music] Tada. That's cheating. I lost that one. Okay. \nHuh? No. Oh, salish. If you don't hit it that far,   he has gets to ask you a question. I \ndidn't think I would hit it that good. Okay, ask me your question. Okay. Did you ever \nlike Nidal? Yeah, I I liked him like probably   when I was like 10, I think. Like the first time \nI met him, I liked him and then like I don't know.   Now it's my turn again. Come on. You got it, \nkaido. Boom. Oh, 26 yds. Say, I got that. Easy. Zero yards. You did that 100 times. That was just \npractice. I made it to the red one. Did you have   fun on our first date? Obviously, I had fun and \nI wouldn't be here. kaido. Okay, fair enough. My   turn. Well, that was actually kind of a vulnerable \nquestion. What if she said no? No. What the heck?   Why did you turn good? Okay, your turn. You have \nto hit it all the way to the green. Okay. Well,   start thinking about another question, Kaido. \nOkay. All right. What's the question? If we were   to go on another date, where would you want to go? \nWell, I don't know if I want to go on another date   with you. Okay, I'll tell you at the end of the \nday. Okay, deal. Based on what happened today,   would you like to go out again? [Music] Nope. \nThat sucked. Do it again. Yes, I might win. No,   we do it again. Back up. You got to say, oh, and \nright in the center of the bullseye. That means   she gets to ask you two questions. Two. Wait, \nwhat? How many girls have you kissed? Honestly,   two. That's it. You make it That's it. No, \nno, no. Yeah, I can lie and say more. Okay,   next question, please. So, you have to say who \nthe better kisser was, but you can only say the   first girl or the second girl. Oh, second girl. \nWait, wait, wait, wait, wait, hold on. You said   you've dated one girl and you've kissed two \ngirls and you went on a date with Salish. So,   I'm going to ask you this one truthful \nquestion. Did you guys kiss on your date? You don't care. Okay. Next. Next. \nWe're going to the next thing. We're about to do the next challenge. \nBut first, while I'm talking to them,   I'm going to send Moo and Boomer in to see \nif kaido likes her dogs. Cuz of course,   if you're going to date kaido, you \ngot to also like her dogs. [Music]   Good job. Who's a good boy? Hi, baby. Hi. Hi. \nOkay. Okay, we're going to move on. You passed   that challenge without even realizing it. I sent \nboth dogs in to see how you liked her dogs. Cuz   if you're going to date salish, you got to actually \nlove her dogs. Moo and Boomer both loved kaido,   which is a really good sign cuz dogs are a great \njudging character. You two are about to go on a   dinner date, but before you do, you have to get \nready. This next challenge is to test your trust   of Salish. What does that mean? Salish will have \nthe opportunity to dress you however she wants   for this date. Is that what this is for? That's \nwhat this stuff is here. You could choose to make   kaido look super good with a nice outfit that's \nthere or silly. I don't trust with this one. Also,   if Salish chooses, she can do your skin care with her \nbrand new sincerely yours skin light exclusively   at Sephora. Now that I trust it with your skin \nwill only look good if you use it. Like look   at this skin. Look at that. Come on. show. Don't \nuse an example of your skin. They won't buy it. All   right, I'm going to let you two do this. Have \nfun. We all know that salish is a prankster,   so I'm super excited to see exactly what she \ndoes to him. What kind of makeup? What outfit?   This is going to be funny. Wait, what is \nthat? Moisturizer. Next is a spray. Ew,   why do you eat it? Why are you putting \nsunscreen on my face? We're not even going   outside. It's like actually good for your skin. \nAnd sincerely yours is the best skin care. Well,   I can't argue with that. By the way, guys, you can \nget all of my Sincerely Yours skincare exclusively   at Sephora and it's in store right now. So, go \nget it right now. Like, leave it and go get it   right now. Actually, maybe finish the video and \nthen you can go. I'll give you the most natural   blush. I don't think guys are supposed to wear \nblush. Okay, but this is a natural just to let   you know there are guys watching this video and um \nmy friends too. Okay, so say this, do you do this   every single morning? Like almost every single \nmorning. Is that why you look so good when we   call? Thank you. It's the lip liner twins. Okay. \nWait, what do I have to do? Just keep my lips on.   Just don't move them. Oh, this one's dark. You're \njust going to get c chapstick now. It tastes good. Why do you put your lips like that \nwhen I put chapstick on? You're   like like just put them normal. \nLast step. Oh, that tastes sweet. [Music] Okay. Okay. Yeah, I think that's enough. I like \nkaido. I really do. He's a nice kid. But liking   kaido and being team Kalish are two totally \ndifferent things. I'm not on team Kalish. Two   of my friends thought your name was Kalish. Oh \nmy god. They always text me and they're like,   \"How's Kalish?\" And I'm like, \"That's not his \nname.\" Why are you talking about meeting your   friends? I'm not. But they see you on TikTok. \nMhm. They do. These challenges are going to get   way more embarrassing for kaido and a lot more \ndifficult. Green eyes got me falling tonight.   That was the scariest thing that ever happened to \nme. You guys have been so incredibly supportive   of Sincerely Yours since we launched two weeks \nago that it is already sold out at sephora.com,   which is insanity. So, if you want to shop \nonline, scan this QR code to shop directly   at sincerely-yous.com or you could just buy it at \nyour local Sephora. Thank you so much. Next thing,   kaido, we're going to pick you out an outfit. \nDo we think kaido's are going to make kaido look   ridiculous to go to the restaurant? Or do you \nthink she's going to make him look good? That's   the big question. But he's trusting her either \nway. You can wear this outfit, actually. Yeah.   All right. I got you these pants. They're black \npants. I got this tank top from H&M. I got this   jacket from H&M. And he is a size medium. Three, \ntwo, one. Wo. Okay, that looks pretty good. I   styled you well and I gave you good makeup. Good \njob. So, you're welcome. I guess I trust you,   so you can pick my outfit. Here you go. No, I'm \njust kidding. I'm wearing that. I like this one.   I'll wear that one. No, wear this one. I know that \nJordan's really worried, but I trust Salish. And   really, kaido is such a nice guy. Like, I think \nhe's a really good one. Salish. kaido, you ready   for date number three? Come on down. I cannot wait \nto see what she put him in. This is going to be   funny. [Music] Wait, what? You made him look good. \nMhm. Yeah. It was a lot of work. He looks great.   Wow. Wow. I thought this was gonna be different. \nYou guys look too good. Thank you. You trusted her   and she did this anyway. Yeah. I look good. This \nis just The next date is the tin roof bistro.   They're going to dinner. The only thing is there's \na series of things I would expect a young man to   do if he's dating my daughter at dinner. Number \none, does he open the door for her? Thank you. I   guess so. But there's a bunch more. The first test \nwas to open the door for Salish, which he did. And   the second test was to let her sit first, which he \ndid. What are you going to get? I'll get whatever   you get. Whatever I get. You're not going to like \nwhat I get. I'm watching to see if kaido can pass   all of these tests of good manners on his dinner \ndate with Salish. If he gets three strikes, then   he fails this test and the date is over. Don't put \nyour elbows on the table. kaido, so you like just   keeping your elbows on the table. You just got an \nX. If you get three X's in this, we're not going   on to the next date. I was a server for 15 years \nand the worst thing is when a young man is dating   a woman and he tries to show off by being rude to \nthe server. I want to make sure kaido is not that   kind of guy. May I please have the local greens? \nLooks like he's letting her order first. Another   green check mark. I'll have the fearless Caesar, \nplease, with extra um dressing. Yes, ma'am. Thank   you. He's being super nice to the server, so that \nis definitely a green check mark. Thank you so   much. Having good manners, impeccable hygiene. No. \nkaido, you're on your phone at dinner? I'm looking   up the manners. Shouldn't you already know them? \nTwo X's. Two X's. My No, wait. Jordan. Jordan.   It's cold, right? Your hands are Are you cold? No. \nWell, I mean, yeah, I am cold. You want my jacket,   Kay? Yeah. Who told you to wear a tank top to \ndinner? Tank top from H&M. He's been taught. Well,   I got to give it to his parents or whoever taught \nhim cuz he's a gentleman. Check. You want to   figure that out? Yeah. Okay, let's share a drink. \nWait, let's make sure he's watching. They're   drinking out of the same glass. They're sharing a \ndrink. Yeah, you have your own drink, buddy. That   was our straw. Thanks. Throughout these dates, \nSalish has been casually saying random things,   and at the end of the day, I'm going to test kaido \nto see if he remembers all of them and prove that   he's a good listener. The freak is that? Wait, \nis he about to kiss her? Oh, you can sit over   here. You don't need to sit that close. Okay, \nyou don't need to sit that close. All right,   good. They both got their salads. Neither of \nthem have taken a bite. But if kaido takes a bite   before Salish, that's very bad manners. He gets \nhis third X. And I am not paying for dream date. Are you going to eat? I was just waiting for \nyou to eat. Okay. He knew to let her eat first.   Another check. One more left here. I really hope \nkaido eats with his mouth closed. You cannot   be om nom. So I was talking. No, you just talk \nwith your mouth open with your food in it. No,   I didn't. Oh my god. That's the third X. kaido \njust got three strikes, which means the date   should be over, but it looks like salish \nis having a lot of fun. Okay, they just   dropped the check. I'm going to give him one more \nchance. He has three X's. If he pays the bill,   I'm going to call it a wash. We go to the next \ndate. [Music] No, never let a lady pay for the   dinner. I like this. Remember, if Kaido passes \nall of my challenges, I will give him my credit   card and they can go on a dream date wherever \nthey want. If Salish agrees to go on that date,   I said if you got three strikes that we  \nwere not going to continue on with this,   no more dates. And you got three strikes. But \nthen you offered to pay for dinner. And I can   see that Salish is happy. So I'm giving you a pass \nthis one time. But I promise you if you fail the   next challenge, this is over. No dream date for \nyou. I'll give you the hug salish never gave you. For the next day, we're at the Gardina Cinema \nand the challenge is going to be, do you have   a sense of humor about yourselves? But first, \nyou might want to get some popcorn or candy,   whatever you want. Can I please have milk \nduds? I always get them. Thank you. Here you   go. Can I have my phone? No. That's Oh, and \nhe paid. He paid. Oh, he's not paying for. Is that little kaido? Uh-uh. No. Goodbye, kaido. \nCome on. I don't want to watch a movie by myself.   Good. We'll watch it. kaido is about to watch \na bunch of cringy clips of himself. [Music]   Holy moly. I never thought I was this cringe. \n[Music] And then you always lick your lips.   You were like I didn't. Oh, I did actually. Oh, \nyou're like, I wish I could have gone. Bravo. Oh my gosh. You're just picking the worst \nclip. Which way should I go? Oh my god. This   was actually fun to film, but oh my gosh, this is \nnot happening. Somebody slap me. So, we're finding   out kaido has a sense of humor about himself. No, \nyou can't put this on there. [Music] Oh. Uh-oh. [Music]\n[Music] [Music] Ew. Oh. All right. So, kaido's able to \nlaugh at himself, but does he want to be done,   or will he take more to save Salish? You \nhave a choice to make. You can either   continue to watch more cringe stuff \nof salish that will embarrass her,   or we won't play any more awkward salish \nmoments, and instead we'll watch more of   your cringe moments. Well, you can pick me, \nbut like that's going to be embarrassing,   but we'll just do more videos of me. Are you sure? \nYeah. I've already embarrassed myself enough. It   can't get worse than that. That was the test. You \ndon't have to watch any more cringe of yourself.   We didn't have to watch that. You have to watch \nthat, but you don't have to watch another round   of it. Last decision. Do you want to watch more \nkaido cringe or a movie? Movie. I'm just kidding.   I'm just kidding. A movie. A movie. They're \ngonna watch a movie. And when that's done,   we're going to next and final date. And if you \npass those challenges, get to go on a dream date   by yourselves. It's a super scary movie. \nAnd I want to make sure kaido is good with   scary movies cuz kaido loves them. Oh, I know. \nMissy. Hello. I love this part. What? Don't just   send a scary movie. Oh. Oh, you good? Nope. \nOkay, come here. He's making sure she's good.  Turn on the patio lights. \nDon't watch. Actually, watch. They handled it. We're going \nto go on to the final date.   The final date is a beach date. But to get to \nthe location of your date, you've got to use   this tandem bike to show that you can do teamwork. \nWe can do that. Yeah, we got that. I want to make   sure kaido keeps kaido safe. So, there's two \nhelmets there. And he better suggest they wear   them. Oh, wait. She just wear Yeah, did you hear \nme say that thing about a helmet? No, bro. If my   mom found out I didn't wear a helmet. Okay, I will \nmeet you guys at the pier. If you make it there,   that means you did it with teamwork. Okay, \nyou ready? I can't see what's in front of us,   though. Kaido it's okay. Just keep \npedaling. You want to go super fast? Sure. vroom vroom. You're about to drive on to the gas. \nHow can we go back to being friends when we just So,   are you having fun so far on the date? So \nmuch fun. Yeah. Keep up. Are you having   fun? Yeah. Having fun because you're \nhere. A left, right, left, right. Good. Well, you passed the teamwork test. The next \ntest is, are you a good listener? Whoa. What do   you mean? Oh, wait. Salish has been planting some \nseeds for you, and we're about to find out how   good a listener you are. I get it. Oh my gosh. \nIt clicked. It all clicked. Let's go down the   beach. What kaido doesn't know is that this girl \nis actually his next challenge, and she's waiting   for my signal. All right, kaido. So, throughout \nthe dates that you've been on, salish has been   saying some stuff to you that you probably didn't \nknow. And I'm about to ask and see if you listened   enough to remember them cuz they were just \nthrowaway things. Okay. And if you didn't   remember everything, we're done. No. How is that \neven close to fair? She was your date all day.   You got to be a good listener. You want to date my \nlittle girl. Okay. Ready? What does Salish always   get for a movie? Milk Duds. I always get them. \nOkay. What is salish's favorite childhood TV show?   kaido, we were talking about it with Jake. \nRemember when we were sitting on the steps at   F1? I watched every single episode. I watched all \nof it and we were talking about his middle name.   Why are you giving him so many? Oh, Bertrram. Oh. \nOh. Oh. Oh. Oh. Jesse, does that count? I'm going   to maybe send you off. Okay. Okay. Ready? How \nmany kids does Salish want? Oh, six or seven. Hey,   why did you remember that one? Six. Seven. \nI want five. No, probably actually six. Six,   seven. What are the four products of salish's \nskin care? sincerely yours. Serum, sunscreen,   she used a moisturizer, she used um like this \ncleaning the cleaning thing. cleanser. Okay. Okay. Go get yourself some sincerely \nyours at Sephora. What is Salish's go-to meal? You   asked her when she was looking at the menu. Salad. \nMay I please have the local green? Wait, wait,   wait. No, no, no, no, no, no, no, no. I texted \nyou a picture of it like a Oh, white rice. Oh,   white rice. This Okay. No. All right. I've got \none more question for you, Salish go! Let's go. Just   leave. Just leave. One last question that you have \nto get to go on to the next challenge. It's about   how well you remember your first date with salish. \nWhy did they make me leave? What are they talking   about? It was the first date you've been asking \nto go out with her for a long time. What was salish wearing on your first date? She was wearing jeans. \nOkay. And this is big. It was a blue tank top with   two white stripes on the side and the number 14. \nYou took a photo of her. Yeah. Let's pull it up   and see if you were right. Okay. Oh, you got it \nexactly right. The number. You got the number.   You got the color. You got the style of shirt. \nOkay. That is super impressive. Actually, there's   one final challenge. This is not going to be easy. \nI'm going to go get Salish. You just chill. Yeah,   you can stay here because we're going to come back \nand do it here. I'm sorry I did this, but I had   kaido wait on the beach and I just set him up with \na girl that was going to go flirt with him. Okay,   I don't care. Hey, excuse me. You're kaido, right? \nYes. I've seen you like all over my TikTok. Um,   it's nice to meet you, I guess. I'm Casey. \nIt's nice to meet you. What's your name?   Casey. kaido. Nice to meet you. Um, I know this \nsounds weird and uh like I'm just now seeing you,   but like would you want to hang out sometime? Like \ngo on a date. Oh. Uh, no. I'm sorry. I'm I'm super   sorry. I don't want to sound rude. I'm sorry. It's \nokay. I I totally get it. No. It's a pleasure to   meet you, though. It's nice to meet you. Nice to \nmeet you. Hope you have a great day. I'm sorry.   Byebye. Thank you. Hi. What happened? He was \nreally polite. Like he was like super polite,   but he declined and Okay, good to know. Thank you. \nThank you so much. Thank you for trying. kaido,   you can come up. I thought you guys left. That \nwas a setup. Oh, what did you say? I was like,   \"Sorry, no. I hope you have a great \nday.\" And then she left. Awwww So now   we just found out that he's loyal. He can \ndo teamwork. He's a pretty good listener,   but you were helping him with it. What was the \nlast question? What were you wearing o n your   first date together? What was I wearing? jeans and \na blue tank top with a number 14 and two stripes   on the side. I didn't even remember that. If \nyou are willing to do this last challenge,   then I will make my final decision at \nthe end. You released a song recently. And you didn't say who you were thinking of \nin that song. So, I would like you to tell us   right now who was the song about honestly. Yeah. \nTruthfully, yes. Not lying. No. [Music] Salish.   So, you recorded a song for Salish, but you've \nnever sung it to her, have you? Mm- Would you   like that opportunity right now? I don't I don't \nplay guitar. I thought you might say that. So,   don't worry. We already have one. I want to \nintroduce everybody to somebody. This is my   uncle Buzz. Uncle Buzz is not just a professional \nguitarist. He is one of the greatest guitarists   that's ever lived. He's amazing. If you have \nconfidence in yourself, you'll do it publicly,   not just in a studio. Okay. Okay. Yeah. You might \nwant to stick around for this last moment cuz wow,   this is going to be something. We got this, buzz. \nThis is so awkward. This is awkward. I can't do   this. This is awkward, but it's proving a lot of \nthat. There's so many people watching. There's   people watching that. Listen, this is saying \na lot about kaido. He's got a lot of courage   to do this. He's got a lot of confidence. \nI'm very impressed he's doing this. I'll   be over here. I'll be over here, too. Okay. \nYou ready? I can't lie. Those green eyes got   me falling tonight. That white smile got me \nlosing my mind. He's got some guts. I can't   wait to be with you. I just want to hold \nyour sweet thing. Just walk my way. And I'm   hoping that you'll stay cuz if not, I might be \nshattered. You know how much you matter to me.   You're we play in the back of my mind all day. \nI don't want to lose you. I just want to prove   to you that I'm the one for you, baby. Cuz \nI'm the one for you. You good? All right. Even though kaido was really nervous to \nsing his song, he was more concerned about   how Salish was feeling. You good? \nGood job. That was really good.   That was awesome. Okay, now there's a lot of \npeople watching us. kaido, I think you passed   all of the challenges. It's been an incredible \nday, actually. You've done every challenge. It's   been really great to get to know you better. And \nso now I have something important to say. Uh Buzz,   cue some emotional music. Thank you. This is \nthe first time I will have ever done this. I am   excited for you to take my daughter Salish out on \na second date. Actually, yes. I said I would give   you my credit card. You can take her wherever \nyou want with this. But first, you have to get   her to say yes. So, it's her decision at the end \nif you guys go out on another date. So, why don't   you go for a walk and see what she says. Did you \nactually enjoy that or was that embarrassing? Be   honest. No, it was like you were good at it. It \nwas embarrassing because people were looking at me and there was a lot of people. \nYour hair does smell good. Does   it actually? Yeah. I don't know what's in it. I have a feeling I know what her answer's going \nto be. So, your dad gave me his credit card,   which I still have, by the way. Just \nkeep it. So based on what happened today,   would you like to go out again? Yeah. Like for \naside from like YouTube and all that? Yeah. kaido said yes and they're going to go on \nanother date, but we are going to leave that   to them privately and we're not going to share it \non YouTube. But they had a great time. They were   beautiful together. And we'll see you next week.\n[Music]",
    "start_time": 0.16,
    "end_time": 1859.616
}