{
    "video_id": "prHLZOFP2Fw",
    "channel_url": "@jordanmatter",
    "transcript": "I've been keeping a big secret from \nyou guys and I'm so excited to finally   tell- Salish, Salish. You're running late. \nLet's go. Let's go. Let's go. Wait. I really   want to- I know. I know. But not now. Not \nnow. You're about to be able to tell them,   but just go inside right \nhere. Okay. Come here. Let me give you a quick zhush. Okay. Okay. Anyways, what \nI wanted to say was that- Salish! You are running   late. Where are you, little girl? Salish! Okay, \nyou're good to go. Okay. Thank you. Come on,   Salish. You guys can hear me, right? I don't \nknow. You're running late. Let's go. Right here.   Right here. Hurry. Grab some food. Okay. Thank \nyou so much. I don't think they can hear you,   by the way. Tell them again. Okay. You can't \ntell them the secret with your mouth full.   All right. Anyways, what I was wanting to \nsay- Is it my turn to say my lines yet? Oh,   no. Not yet. Sorry. Special \nDelivery for Salish. Hey,   Salish. I came to surprise you on your big \nday. Nidal What? Oh my gosh. Okay. Well,   thank you, I guess. Wait, so I actually came to \nsurprise you cuz I heard that you're dropping- No Nidal, you can't say it. I haven't told \neverybody yet. Hey Salish, congrats. Oh,   thank you, Kaido. That's so sweet. No no no. Get \nout of here. That's my best friend. Bro what are   you doing? I can give her flowers. You can't do \nthat. No. Hey. Hey. No.Let's ignore the boys.   Let's go. Okay, guys. I need to tell you this \nbecause I've been thinking about this so much.   Woah. Okay. Anyways, guys, I need to tell you \nthis right now. Ben? I built a secret room on set   and I filled it with- Wait, wait, wait. I \nhaven't told them yet. Alright. Anyways, guys,   now I need to tell you because this is taking \nforever so I'm gonna show you right now. I got   to get you right in- Rohan please, I need to \ntell them right now. No, you're running late.   Still running late to set. Let's go. Hi, \nmom. Salish, have you told them yet? No,   not yet. Thank you. Is it my turn to talk? \nNo, not yet. I'm so sorry. Thank you. Thank you guys so much. Okay guys. \nI've been working for months   on this and I'm excited to show you because- stop! Thank you. Okay. No more distractions. I'm going \nto tell you guys what this is all about. Aww, hi! Salish. Salish, hurry. Come on. Let's go. We \ngot to go. Wait. She hasn't told you about   it yet? Are you kidding? It is so cool. \nSalish, come on. Let's go. Hurry. Okay,   guys. I actually promise you that I'll tell you \nwhat the secret is. Let me just get this shot. Go,   go, go. Let's go. Let's go. Here Say. Wear \nthis. You look so pretty. Oh my gosh. Thank   you. I love this so much. Can I get my \ncamera, please? Thank you so much. Oh,   man. The lighting looks great. This is going to \nbe awesome. Salish, are you ready? Alright this   looks great. Can we bump up a stop on the lights, \nplease? Oh my- This is gorgeous- I love the fan!   The fan is killing. That is so good. Okay, Salish, \nnow grab sincerely yours and we will do one final   shot. This is going to be so cool. All right, \nSalish, are you ready? This is beautiful. Yes,   queen. Yes, we got the shot. That is so good, \nSalish. You can finally tell them. Finally.   Guess what? I'm releasing sincerely yours. It's \nmy brand new skincare line available exclusively   at Sephora on September 6th. It's made for teen \nskin. It's super fun to use and most importantly,   it's dermatologist approved. Seriously, you guys \nare going to love Sincerely Yours. It's so good",
    "start_time": 0.08,
    "end_time": 185.44
}