{
    "video_id": "9IdXa-BWssg",
    "channel_url": "@jordanmatter",
    "transcript": "Today, my daughter salish will begin fostering \nan adorable rescue dog. The only problem is we   had no idea that salish would fall in love \nwith him so quickly. He's perfect. The   family who said they were going to take \nthis dog is now not taking the dog. So,   the dog no longer has a home. And now I have to \nmake an impossible decision. I don't know what   I'm going to do if I can't keep moving. I don't \nknow what to do. To learn how this story ends,   we need to go back to when it started. Lauren is \non her way to the shelter to pick up the dog and   I've set up a blind baking challenge with Salish. \nShe thinks we are just baking cookies, but they're   actually treats for the new dog. She's going to \nwear noise cancelling headphones so she can't   hear anything. I'm going to wear a blindfold so I \ncan't see anything. And we have to complete this   recipe. Jordan's at the house distracting Salish \nwhile I go pick up the dog. And then I'm going   back to surprise her. What's the surprise? We're \ngoing to have to complete the mystery challenge   to find out. The first thing we'll have to do to \nmake these yummy dog treats is make the dough. Are   you ready? Yes. Find the oats and make oat flour. \nI'm going to crush the bananas. No, don't touch   anything. We're supposed to work together on this. \nIs this where the bowl was? Stop. Stop. Stop. Oh,   okay. That was my bad. I thought you put a bowl \nthere. What am I mashing? Salish. salish can't   hear me, can she? Nope. Oh, this is so fun. salish \nis going to be so surprised when we get this dog.   The thing about fostering dogs, which is super \ncool, is you take a dog that needs a home and   you let them live with you until they can find \na real home for the rest of their lives. And   that's what we're going to do today. What? \nNothing. I wasn't talking. Okay. This dog was   found as a stray after living on the street for \nmonths. His fur was really matted and he had a   bunch of wounds on his legs and shoulders and he's \nreally, really underweight. They shaved him down,   took off his mats, cleaned up his wounds, and he \nhad two surgeries. So, I'm hoping he's feeling   better now. I really hope this dog is healthy \nand is able to have a great week with Salish.   For right now, I'm actually a little concerned \nwith my own health cooking with Salish. All right,   Dad. Try this. Open your mouth. Is it good? Is \nthat pumpkin? Yeah. I don't know. What's the point   of it? We're making a surprise mystery treat. \nThese look disgusting. They look disgusting,   but they're going to be really good. Ari, this \nis the most disgusting thing I've ever eaten.   Oh my god, it looks nasty. You want to try it? \nsalish Ari said he wants to try it. No, no,   no. I'm good. I'm good. Don't make me fire you. \nUse your hand and mix this in. Oh, did we have to   use hands for this? Salish. Salish. Say has been \nwanting a big dog forever. It's really hard for   the huskies to get adopted because they're large \ndogs and they have a lot of energy. But come on,   I just met him and he already wants to cuddle. \nHudson, come on. Let's go get a dog. Let's go   get a dog. After a week, they will have a family \nwho can adopt him. And that's the perfect amount   of time to see whether Salish is up for caring for \na big dog. Boomer is staying at my parents house,   so this will be the perfect opportunity to shower \nthis dog with her full attention. This is taking   way too long. If Lauren gets back and these \ntreats aren't baked, then that will ruin the   entire plan to surprise Salish. We need to switch \nso I can see again and we can get these treats in   the oven. Take my blindfold. Okay. Oh, wow. That's \nbright. You're welcome. Put your blindfold on. We   got to keep going. Did I make it? That was really \ngood. You didn't even leave any shell. We're here   at Sherman Oaks Veterinary Group. They've \nbeen such a nice hospital to work with. So,   let's go. Lauren is about to meet the dog \nwe're surprising Salish with for the next week. [Music] Hi. Oh my gosh, he's so sweet. Oh my gosh. Hi. Oh \nmy goodness. Oh, he's such a sweet boy. You'll be   so good in a cookie. Salish. Carrots. Oh, give \nme a carrot. No, no, no, no. did it go in the bowl?  Yeah, that that's good. Just that's fine. \nWe picked up the dog and I really hope that   Jordan hasn't spoiled the surprise. Salish and \nHudson and Jordan too are all going to fall in   love with him. I just checked my messages and \nLauren's on her way. We got to hurry up. Okay,   Salish. I think we're pretty much ready to bake \nthese. I'm going to put them in the oven here. Do   you need help? They're in. We just got up to \nthe house. I'll bring the dog in to surprise   Salish. Okay, so we made these yummy cookies. \nThey look disgusting. Why don't we each taste   it? I'm not trying this. I think that'll \nexplain what the surprise is. 3, two, one. [Music] Did these taste like something that \na human would like? I surely hope not. These   are actually dog treats. Why do we need dog \ntreats? This is homemade treats for a dog.   Can you show me what the surprise is? I think \nit's pretty obvious by now. Take this treat   and go outside because mom is waiting with a \nnew dog and she wants you to meet him. Wait,   really? She's excited to meet \nyou. He's a foster dog. Oh,   yeah. We're just going to keep him for a little \nwhile and then he's going to an actual home. Hi. I know I wasn't super clear with Salish, \nbut the plan was to foster the dog for 1 week   until his new family could finalize the paperwork. \nDid you like it? I think you liked it. But I just   got a very surprising call from the shelter. The \nfamily who said they were going to take this dog   is now not taking the dog. So, the dog no longer \nhas a home. I don't think we're ready for a second   dog, especially a big one.  She's \nhaving so much fun with this dog. Seems to love to   to be with people. If we were to get a second dog, \nSalish would have to be the one in charge of that   dog cuz we just don't have time to do it. And I \ndon't know if she's ready to take care of a 50 lb   dog. Can you go upstairs? This is a massive twist. \nWe thought we would only foster him for a week,   but now we have to decide if we're keeping him \nforever. This is actually so difficult because   on one hand, you can see how much this dog trusts \nSalish completely. Stay. It's different, isn't it,   with a big dog? But I'm just not sure she's \nready for such a big commitment. Sit. Good boy.   To test Salish and her commitment to this dog. \nLauren and Salish are going to the pet store,   and Salish will be responsible for picking out \neverything the dog needs while he stays with us   for a week. Lauren also can't help salish. Let's \nsee if Salish can find everything she needs to   take care of this dog. The thing salish needs to \nget is a crate, bed, leash, harness, dog tag toys,   a bowl, and a gate. Let's see if she can figure \nit out. Mom, this one's good, right? You want to   tell me? No. Okay, I think we should get the extra \nlarge. What do you want? He keeps leaning on us.   Mom, please can he be Moo? I just really want to \ncall him Moo. Okay, he's called Moo. Come here,   Moo. I just got a call from Lauren where Salish is \nfully in love with this dog. has named him Moo.   Moo is a name she's been waiting for years to give \nto her next dog. And I think she thinks this is   that dog. Ah, I'm actually at a crossroads here. \nI thought we were making a really adorable video   about fostering a dog for a week and suddenly we \nhave to make this decision about whether or not to   keep him. And I know what Salish is going to say, \nbut I don't know what I'm going to want to do. Say   good night. Do you like this one? And he's sitting \non it. Kind of needs some help. Where's the cart?   I feel like this is a good size, right, Mom? I \nfound this, which is so cute. And we're going   to engrave. M O O. Moo. What's this? Oh, he likes it. \nLook at how many cute things we got. Ready? So,   we have to order the harness online. But I got \neverything here we could get. Yeah. Okay. Let's   go check out. I learned how to wink. Ready? \nOkay. That was good. Thanks. Yeah. Come on,   Moo. I love dogs, but I think what a lot of people \ndon't realize is how much responsibility they are,   especially a big one. As the week went by, \nSalish and Moo got even closer. and she took him   everywhere. He's perfect, so we need to keep him. \nAnd she is having an amazing time with Moo right   now, but it's summer and when school starts, I'm \nnot sure she'll actually have time to take care   of Moo. I'd love for us to keep Moo, but he just \nmay be too much for us. He's got a lot of energy   and he's very big. Salish doesn't know yet that \nthe family that was going to adopt Moo dropped   out. So Moo could be ours forever. Moo, come here. \nSit. Sit. Look, look, look. She's training in how   to sit. And I want her to be happy, but I don't \nknow if we're ready to actually get a big dog.   It's a lot of work. Here's the problem. Tomorrow, \nwe have to bring Moo back to the shelter because   our fostering time is over, unless we decide \nto adopt him by the end of the day. And I'm   not ready to make that decision, but I have to at \nleast tell her it's an option because she's just   fallen in love with him at this point. Hey, little \ngirl. Hi. Okay. Say, I have something to tell you.   What? You know how we're fostering Moo and then \nhe's going to have a family that's going to adopt   him? Yeah. Well, actually, that family doesn't \nwant to adopt him anymore. Wait, really? So, he's   actually available for adoption. Wait, actually? \nYes. Like, wait, really? Yes. But wait, wait,   wait. But this is really hard for me. I know that \nyou in love with him. He's so sweet. But I don't   actually know if we're ready to adopt another dog \nand especially such a big dog. And I I think that   he's going to get a great home whether or not it's \nus. But I'm not sure if it should be us. Dad, why?   Tell me your concerns. Here's my issues. You don't \nhave enough time to take care of him, but we can't   take care of a second dog. So, it would be on you. \nDon't do that to me right now. Oh my god. Okay.   This isn't helping me at all. Big dogs are very \nexpensive and they're hard to groom. They make   tons of messes. I think that maybe another family \nwould just have more time and be able to do more.   Dad, we need him. But I don't. No. Dad. Dad. Dad. \nJust give me an hour. Okay. Just give me an hour.   I'll figure everything out. Come on. M. Give me an \nhour. What are you going to do in an hour? You'll   see. Guys, I'm not going to let him go. Look at \nhow cute he is. All I need to do is convince my   dad that I can take care of him. So, my plan is \nI'm going to do a series of challenges to prove   it. I'm going to address each of his concerns and \nhopefully that will be enough to convince him to   let us keep Moo because if I don't by the end of \nthe day, we might lose Moo forever. All right,   Dad. So, you don't think that I'm going to \nbe able to take care of Moo before school,   right? Right. I don't think so. Okay. Well, now \nI'm going to prove it to you and I'm going to get   ready for school and walk in 30 minutes. There's \nno way you can say. It took you an hour and Okay,   I can do it. It's fine. All right. Ready? 3 2 1 \nGo! Go! First thing I do is I wash my face. And   you guys can't see this, but I'll show you later. \nShe's already wasted 40 seconds. She's not going   to be able to do this in 30 minutes. I'm telling \nyou for a fact, it took her an hour every morning   to get ready for school last year. All right, \ncome on. Let's go. Let's go. I barely have any   time. How is she going to do half the time and \nadd a dog to it? The whole point I'm trying to   make is that salish is too busy to take care of a \nhuge dog every single day. Come on. I just don't   think she's ready. Say, there's no way you're able \nto do this in time. Oh my gosh. Yes, there is. Oh,   hi Moo. So, I guess what salish is going to do is \ncome up with some challenges to prove to me that   she can handle having Moo every day of her life. I \nthink that's awesome. I can see how committed she   is to keeping Moo. I'm still not convinced that \nthat's actually going to help me make a decision,   though. This is so foamy. I can't wait to show you \nit, but I can't reveal it yet. It's definitely my   new favorite cleanser. Say, hurry up. I'm trying. \nSay, what else do you have to do? So much. I have   to do my makeup. I got to do the rest of my skin \ncare. I have to do everything Collin. Say we   do not have time, dude. I'm aware. She's back. \nThis is exactly what I'm talking about. salish,   you're so distracting. Slowing you down, but it's \nalready been 4 and a half minutes and all you've   done is wash your face. Dude, I'm doing the \nrest of my skin care now. salish, we all know   that you're not going to be able to get yourself \nup earlier and that you're going to end up having   to do this all in 30 minutes, right? I know. And \nyet you're that slow with your skincare. Yeah. By   the way, it's nice moisturizer, isn't it? Yeah. \nSuper good. Wait, do you find out what it is? I   was trying to convince my dad. Look at Okay, this \nis like This is I like have no time. What am I   supposed to do with this? Watch this. Watch. Okay. \nNo. Everything's falling. You don't have to wear   makeup to school, by the way. Yes, I do to school. \nYou're wasting time. So, you'd rather do makeup   than have a dog? No. But that's the choice you're \nmaking right now. Where did the beauty blender go?   Dad, look how cute he is. That's just a dog. How's \nmy makeup look? Moo. I know. Terrible, right?   You haven't even walked or fed your dog yet. Say, \ndid I say your dog? Yeah. I mean Moo. I mean Moo.   You haven't either walked or fed Moo yet? No, \nyou mean my dog. Let me walk in. Should I start   over? Oh my god. She's not. You know what? It \nlooks terrible. But I think I'm fine. All right,   let's go downstairs. Wait. Wo wo. Your What \nabout your outfit? I I would wear this. You   wouldn't wear that to school. It's You just don't \nwant to spend the time. Oh, no. Come on. I'm only   going to give him a little bit of dry food. We've \nalready fed him. Salish is only pretending to   do her morning routine for the challenge. She's \nnot actually going to school right now. Wait,   have you made a lunch? Whatever. Now I got to find \nsome breakfast. You know what? I'm not going to   make breakfast today. No. No. Actually, Salish, \nI insist you do not win this challenge if you   don't eat breakfast. Okay. Okay. Okay. That's good \nparenting right there. Come on. I know you haven't   gone for a walk yet. I get it. I know you want \nto. But salish is kind of taking her time. I'm not   taking my time. Just mango. Yeah. And it's that \nyou call this breakfast. If you have a dog and   you're rushing, everything else gets compromised. \nYou're drinking out of a blender. Oh my gosh. You   got to walk Moo say. Moo. She has less than 10 \nminutes to get out the door for school or she   loses this first challenge. You got to go until he \npoops. Go, Moo. Go. Come on. Let's go. Let's go.   We got to convince my dad. salish isn't even back \nfrom the walk yet. And there's only 30 seconds   left. Oh my gosh, guys. Big dogs are a lot faster. \nBut come on, Moo. Come on. Look. Do you like this   grass? Come on. I got to get out the door. We have \na couple minutes. So, we got to start going home.   Come on. All right, Moo. Come on. Come on. Go \nto the bathroom. Let's just go. Come on. Look, I   don't want to seem like I'm being super difficult. \nIt's just that we travel a lot. We're able to   bring Boomer cuz he's so small on the plane with \nus. If we travel with Moo, we can't bring him on   the plane, which means we either have to drive \neverywhere or we have to find a dog sitter to live   here and take care of him. So, there's just a lot \nof considerations about having a super big dog.   Salish is very, very busy and so her schedule's \ngoing to be really hard and yet he's really sweet   and she loves him. So, I'm absolutely torn. But, I \ndo have to make a decision by the end of the day.   Our foster term ends tonight. Tomorrow, we're \nexpected to bring him back unless we want to   keep him. So, this decision is like a now thing. \nAll right. Moo just used the bathroom. I'm really   hoping that this will convince my dad. And if not, \nI have a couple more challenges. So, let's go.   Hey, little girl. Okay. Okay. He did his business. \nOkay. I got to get my back. Huh? He's just waiting   for her. It's right here. It's right here. Let's \ngo. Let's go. Not even close. All right. Bye, Moo.   I love you. Can I go? Okay. Go ahead. Bye-bye. All \nright. See you. Bye. That was awesome. Parents,   come on. Are you with me here? Like it's important \nto teach your kid responsibility and to make them   really understand how much work it is to have a \ndog if they're taking care of them. Oh, you're   back. Mhm. Okay. So, how do you think you did? \nReally good. Except that you were 10 minutes over.   Okay. Well, let's just do the next challenge. It's \neven more important, and I will for sure convince   you that. Okay. Let's see. I am really impressed \nby how hard Salish was trying in that challenge,   but she went way over time. So, I'm obviously \nstill not convinced. All right. So, you know   how you're concerned because how dogs are super \nexpensive and they have to be groomed. Yeah. So,   I found this dog groomer place. And basically, if \nI ever need money to pay for Moo, I can just work   here and I'll learn how to groom him. Okay, let's \nsee. It looks like he's ready to start. Yeah, I   think so. Come on, Moo. Dad, can you please carry \nMoo into there? Oh, you need me to carry him? So,   when you have a big dog, it's hard to carry \nthem then. Yeah. So, if you ever to carry him   by any Okay, I'm going to give you this one. He's \nactually not that heavy now because he didn't eat   for months on the street. Yeah, but we're going \nto get him heavier when we have them. Well,   we haven't decided. yeah we have. We haven't \nactually. Good boy. And you put a leash on   him so he doesn't get out of the truck. Salish is \ngoing to be a great mom one day. She's got a lot   of maternal instincts. She's being very protective \nof him right now. Are you excited to meet Boomer?   You're going to meet Boommy, your brother. See, \nDad, he loves this. He's going to be the best   dog for us. Get nice and sudsy. See, Dad, this is \nawesome because then we can watch them together   and both have fun. Oh, like a bonding time. \nYeah, exactly. Yeah, but if we don't have mood,   then I guess what? No more bonding. I hate you. \nOkay, that was pretty harsh. No bonding. They give   you unconditional love. I know. I know. He's just \na huge dog. She has a lot of busy responsibilities Oh my gosh. I cannot live without him. He's \nso cute. Honestly, she's doing a great job at   this. Look at how comfortable Moo is with her. \nit. Obviously, they're connected. Obviously,   they're bonding. Obviously, he loves her. But \nI don't necessarily know if she has the time   to take care of him. That's my issue. Salish \nis going to have to take full responsibility   for me if she wants to keep him. If I say \nno, it's going to break my heart. Dad, look,   he's happy. Doesn't he look good? Wow. \nHe No. No. Not my hair. Cut. Actually,   cut cut. My mom is taking you to the vet to get \na couple of shots. And while she's doing that,   I'm going to try and convince my dad. The \nnext challenge is you want to make sure I   can keep the house clean, right? Yeah. Because \nyou go to school first thing in the morning,   then you go to gymnastics after only 20 minutes \nbreak. There's no way you can clean a mess if Moo makes one. What if you go downstairs and make the \nbiggest mess that you can make and then I have 20   minutes to clean it up? I'll do this challenge, \nbut I'm going to hire the world's strictest mom   to come in after you're done cleaning and make \nsure you did it right. Okay. I'm going to hate   doing this cuz I hate messes. A dog could get into \nthe laundry and then dump it all over the place.   What was that? This might be a little harder than \nI thought. So, the scenario, she comes home from   school. Moo's been left alone. He's wrecked \nthe house completely, and Salish has to clean   it before she gets to gymnastics, so she can't \nbe late. Drink glass. Collin, I might be cooked.   Tips this over. You know, dogs do this. Dog treats \neverywhere, right? Poop bags. I hate to do this,   Chloe, cuz I love your popcorn, but I'm going \nto make a mess bust. You pied me in the face.   Nice to meet you. This is like revenge. \nIt's really good though. I hate messes,   but if this is going to convince \nmy dad, it's worth it to get me. All right, let's go get Salish. You have 20 \nminutes to clean it and then the strictest   parent comes in. 3 2 1 go. Oh my gosh. Let's go. \nLet's go. She's lost 30 seconds just reacting to   it. I don't know what to do with this stuff. Collin, \nyou have 19 minutes. You're stepping all over the   glass. Come on, Collin. No, no, no, no, no. You \nsay I'm trying to make sure that you can clean   big messes cuz I guarantee you at some point Moo's \ngoing to make one. Stop distracting me, Dad. Moo   wouldn't even do this. This is so unrealistic. I \ndon't see it happening. Do you know how to use a   a broom? Oh, you use it like this, don't you? If she \nset up all these challenges to convince me that   she can handle Moo. I love the initiative on that, \nbut she's not actually convincing me. All right,   I got to fix these flowers. Oh my. No. Get it. \nLike that. Let's go. Get the broom. Get the broom.   I love that she's doing all this and making an \neffort, but she's running out of time. Oh my   gosh. Dirty footprints. It never rains in LA, Dad. \nRain sometimes. How would Boo even get pizza out.   You got to clean the mess up. Perfect. How are \nthere so many clothes here? Hey, it's good. Say,   what if the strictest mom sees all that? She \nwon't see it. 5 minutes. Wow. This room actually   looks pretty good. The world's strictest mom could \nbe here any minute and I need to get this done.   Wait, Ari, she might do it. Wait, she's cleaning. \nThis is crazy. How? It took forever to clean up,   but I think I got it all. Oh my god. I have to \nmake a decision soon. I don't even know what to   do. It's such a huge commitment. It's got to be \nright. 2 minutes. Say, I have one more thing that   could maybe convince him if this doesn't work, but \nI really hope that this works. 9 8 7 [Music] Time.   Pretty impressive for 20 minutes. I don't know if \nyou cleaned it as well as you need to have cleaned   it. We're going to get the strictest parent in \nhere and then we're going to see what they say.   Introducing world's strictest mom. Hi. Hello. Your \njob is to look through the entire house and let us   know if there's anything out of any dirt anywhere. \nThis woman is really particular. This has not been   fluffed. This chair should be turned in. Look at \nthis carpet here. There's a piece of filth. She's   strict. Give me a break. I need to get this dog. \nYou have to be really nice. Okay. I'm here to do   a job, not to be nice. You mentioned a dog. I seem \nto have found evidence of a bird. This appears to   be a feather. I see moisture on the countertop. \nProbably contains bacteria. No bacteria. Look.   Doesn't taste like anything. Look what I found. \nIt's one popcorn kernel. Here, can I have it?   Tastes totally normal. That's how clean the floor \nis. If this strict mom gives her a failing grade,   then she's failed another challenge. What do I do? \nYou got to make her like you. Okay. Okay. Yeah. Do   something. Would you like a glass of water? \nPerhaps. I don't trust the water here. What   is this? Ow. I hurt myself on this glass. It's a \nsmall piece of glass. There's this amazing dog,   and I love him so much. I'll do anything for you. \nPlease just be nice. What is she saying? She's   whispering. I can't have a dog in a dangerous \nenvironment with glass on the ground. Look   at this photo of him. He's such an amazing \ndog. Underwatered? It's not underwater. Oh,   it is a little underwater. You can' t take care of \na plant and you want to take care of an animal. I can take care of animals. This is like my baby. \nYou've probably had a dog before and you probably   love him or her. And that kind of connection is \nso special and I really think I have that with Moo. What's since? Oh, no, no, no. We don't \nhave to talk about that. I'll show you   guys this in two weeks. Oh, we don't go \nlook in there. This is actually fake door. [Music] I've made my full inspection. [Music] The house \nis clean. Congratulations. Yes. Woo! Yes. I'm   not that strict. That dog is super cute and I \nhope she gets to keep him. Oh my gosh. I told   you I could clean the house in 20 minutes and that \nwas a bigger mess than Moo would ever make. Okay,   congratulations. All right, Dad. What is the \nfinal decision? You have tonight to decide.   Please tell me. Say I'm sorry. Oh, yeah. Don't \ndecide. I I have one more thing. Let's go. Come   on. Let's go. Okay. What are we doing? Actually, \nI think I need like 5 minutes to prepare. Can   you go upstairs? Okay. Actually, all the way \nupstairs. Upstairs. Okay. Ari. Seriously,   what's going on? What's she doing? \nI have no idea. You know. Anyway,   I'm going to send a text real quick. Collin. \nOkay, Collin. Collin, this is actually bad. what,   bro? California Doodle Rescue just posted \na picture of Moo on their Instagram,   and all the comments are like, \"Oh my gosh, I \nwant to adopt him. Oh my gosh, he's so cute.\"   If I don't convince my dad to adopt Moo right \nnow, then we're going to lose Moo. This is so   bad. How good's your presentation? I think it's \npretty good. All right, we got to go now. Dad,   I'm ready. Okay, say what's Oh, I see. I love \nthat photo of you guys. I see what you're doing.   next time. Oh, I see. Okay. Okay. I have some \nquestions for you. Be honest. Do you ever feel   like the house is too quiet? Yeah. Do you ever \nfeel lonely? No. Would it be nice for someone   to always be happy to see you? I can answer this \nfor you. Yes. Because no one in this family is Do   you ever feel like this family is too small? No. \nI think When's the last time you actually made a   friend? I make lots of friends like all the time. \nLike what's the last one's name? Annis. 5 years   ago. Did you answer yes to every question? \nI didn't. Of course you did, Dad. Anyways,   I prepared something. I'll be in charge of every \npart of caring for him. I will do everything I   can. When I get home from school, I'll feed \nhim a small dinner and then mom will feed him   the rest of the dinner at night. Right. And I'll \nfeed him breakfast and walk him in the morning   and clean up after him. I'm so excited to grow \nup with him. I mean, I'm 15, but I'll have him   until I'm 18. What? Hold on. Wait. You're leaving \nhim with this? Oh, okay. Actually, I was about to   take him to college, too. All the challenges in my \nlife, he'll be there next. Imagine I go to college   and I get a job. He'll always be there with me \nand I'll always have it. And he'll get to be the   best friend with Boomer. If we don't adopt him, \nthen like what other dog are we going to have?   He's perfect. And you promised that we will get \na dog in September. I did. You did? Okay. Now,   I want you to think about Moo. He's been wandering \non the streets alone for months, scared. He has no   family, no home, no food. He's been hungry. He's \nbeen tired. Imagine what that would feel like   to live like that. And now he has a great home \nwith an amazing sister. Like incredible sister.   Like she's like the top best sister. The dad is \nlike fine. But the sister, oh my gosh, he loves   a good sister. Good sister. And then you just \nget ripped away from them. How would you feel,   Dad? I've spent the whole week with Moo and I know \nhe's the perfect dog. I love him. so much. I know.   So, Dad, what do you say? Look at that face with \nhis toy. A look how cute he is. Come on, Dad. And   you've got to kind of hurry up because they've \nalready put him on Instagram if you don't know   that. I do. Okay. So, [Music] Okay. I'm going to \njust tell you this one thing. Say, I've seen all   your challenges. I see all the effort the whole \nweek you've put in. I'm just saying you convinced   me about 30 minutes ago. I'm going to send a \ntext real quick. Hold on. I just got a text from   Jordan 30 minutes ago. So, we adopted him. He's \nours. I'm so excited to see Salish's face. She's   going to be thrilled. He's your dog. What? Yes. \nYes. Really? Yes. And guess what? He's outside   waiting for you to come in. Really? Yes. Go get \nhim. Ready? Go get your sister. Hello. [Music] Come on, baby. Hi. [Music] I made a final decision about 30 \nminutes ago, but let's be honest,   I've known the whole week because \nthey're perfect for each other. I mean,   just look. Hi, baby. Yeah, you're officially \nours, Moo. I can't wait to grow up with him. Oh, wait, guys. Before you go, we wanted \nto tell you something. Come join us at   the American Dream Mall on September 6th for a \nspecial event. And Boomer has a new best friend.",
    "start_time": 0.16,
    "end_time": 1633.76
}