{
    "video_id": "-LooUJlcdjU",
    "channel_url": "@jordanmatter",
    "transcript": "Today, my daughter Salish and I secretly live \ninside the Stokes twins $10 million mansion.   We'll have to find our own secret rooms to hide in \nand survive extreme dares that will make it harder   and harder to stay hidden. Something's going on. \nShould we just take it for a spin? low key? Ready?   First person to complete all of their dares wins. \nNo. Come on. Like you're just say it for this one   time. You're holding it. No. The Matter Cup. \nWoohoo! First challenge is to get inside this   house somehow. Are you ready? Yeah. One, two, \nthree, go. No, I don't want Okay, I'm done. All   right, come on. All right, good luck, Say. I think \nI have a plan. Let's go over here. That would have   been too easy if that was just open. Kat gave us \npermission to be here, and the Stokes twins have   no idea that we're going to be living in their \nhouse. Hide this. My poor little matter cup. It   seems like Salish already has a plan and I have no \nidea what it is. But I know that in this massive   mansion, there's at least one door window open. \nSo, I'm going to check every single one of them as   quickly as possible because Kat told us to be here \nat noon because the Stoke Springs left and they'll   be back in 30 minutes. So, I got to get in this \nhouse before then or I'm already busted. Earlier   today, I texted Kat and I asked her to let me into \nthe house. Salish and I each have three challenges   we have to complete. Get in the house. Once we get \ninside, I have to find a secret room and then we   have to decorate it. And then each of us is given \nthe other one five dares. And whoever completes   those first without getting caught by the Stokes \ntwins wins the matter cup. That's going to be me.   Boom. Come on. Let's go. Oh, Salish. Hi. Come on. \nOh my gosh. Thank you. All the secret rooms here   are for boys, but I'm going to make one for girls. \nBut the boys are going to be here in 30 minutes,   so you don't have a lot of time to find your room. \nOkay. I'll be up in my room. Okay. Thank you so   much. Bye. Okay. So far, we have done 18 Matter \nCup competitions. Salish has won 11. I've won   seven. Whoever has won more by the end of the year \ngets the most epic prize you've ever seen. So,   I desperately need to win today to get it 118. \nOne step closer to winning that prize. First,   I need to actually find a secret room. \nWait, I think I've seen this before. Wait,   how did you know this is a secret room? \nYou don't watch the soap twins videos? No,   I do. I just I didn't see this one. This is \nsick. There's a sl Oh, it's slide. Somebody   doesn't know the passcode. Yes. What? What was \nit? It was 0000. Stokes, you might need a better   password. Says no zapatos. What does that mean? \nNo shoes. I walked by a construction worker the   other day and he said, \"Hola.\" And I was like, \n\"Hi.\" And he's like, \"Como estas.\" I was like,   \"Estoy bien.\" And he laughed at me. Okay. Adios. \nOh my god, it's so sunny. If I'm going to be   stuck out here much longer, I'm going to use \nthe sincerely yours sunny-side up sunscreen.   This stuff is awesome. This is nice. I feel like \nthis is like lowkey good, but what if they come   in and watch a movie? Then I'm highkey cooked. \nI could hide right here. Can you see me? I This   isn't going to work. There's no hiding spot here, \nthough. I don't know if this place works. Okay.   Well, let's go find another one. Let's go. Where \nwould more secret rooms be? collin, my dad. Wait,   what? What is he doing? What are you doing? No \nway. What? How did you get in? I don't know. Let   me in. No. collin, you want to keep your job? \nTell me how she got in. I don't know how she   got in. I just followed her. I was looking at the \ncamera. All right. Well, you're wasting your time   cuz you haven't found a secret room yet. collin, \nwhat? I didn't lock that door. collin, collin. Come on. Come on. Hurry. Let's go. I didn't lock \nit, huh? Why didn't you lock it? Hi, Dad. Oh,   close it. Lock it. Lock it. Lock it. Lock it. \nWill you just let me in this? Just go. Can I at   least have your sunglasses? Why are you wearing \nthem inside? That's what I said. Is she chewing   gum? Oh my god, this kid is driving me crazy. Bye, \nJordan. All the doors are locked right?. Yeah. How  am I supposed to get in this house, man? I can't \nbelieve that I'm struggling this much just to get   inside the house. But believe it or not, this is \nthe easy part because Salish and I prepared some   brutal dares for each other. Freaking run. And I \ndon't know if things are going to end that well,   at least for me. All right. Okay. Okay. All right. \nYou know what? Can you take off your sunglasses,   dude? Oh my gosh, bro. Okay. Anyway, that YouTube \nsign looks a little sus. It's too small. Maybe the   kitchen will have something. collin, do you \nsee anything? But look, look. Like there's   a door there. There's something behind it. Oh. \n[Music] Yo, let's go. It's a pantry. Oh, well,   this could work though. We have like unlimited \nfood. What if they're hungry and they want food?   Oh, that's true. Plan D. Dude, I've got a crazy \nidea. Wait, what are you doing, Jordan? Listen,   I would pay the money to get a new window \njust to win the Matter Cup, dude. All right,   the Stokes twins are probably going to be here \nin like 10 minutes. We haven't checked this room,   have we? No, not yet. Okay, then let's check \nthis room. Do you think that's a bad idea?   Do I? I could break it right now, man. Don't do \nit. Shoot. You're right. collin, are you seeing   what I'm seeing? Look, it's hollow. What if this \nwas like an old secret room and they like built   a wall over it? Well, Kat went upstairs, but \nI could text her and like see if it is. So,   wait, let me take a picture of it. Oh, wait. \nShe said yes and yeah, you can break it down   and use a hammer in the garage. Let's go. Let's \ngo. Come on. The Stokes twins always go all in   building their secret rooms. That's why it doesn't \nsurprise me that Kat let salish destroy a wall in   their mansion. House is so big. Okay, come on. We \ngot to get the sledgehammer. It's in this garage,   I think. Is this a sledgehammer? Oh, this is \nheavy collin. That's a sledgehammer. All right,   let's go. Go, go, go, go. Close the garage. \nCome on Collin, We got to go. [Music] Oh, wait. Ari, I bought so many decorations for the secret room \nand we need to go get them. Are you kidding me?   I think they're about to be They're here. What? \nGo hide in here. This is the only secret room.   Go. Come on. Come on. Say! Shh. Come on. Come \non. collin. They're here. Come on. Is it shut?   I think so. Sh. That was bad. I think they're \nhere. Stokes are going to be here any minute.   I got to go for the secret room in the kitchen. \nI've been here a bunch of times. I know where the   pantry secret room is. So, let's go. What if the \nStokes come right now? Yeah, I know. We're going   to hide in here. Who's that? Are those the Stokes \nTwins? Okay, there it is. There it is. Okay,   secret room number one. Oh jeez. Oh, you got \nthis room. We thought you were the Stokes twins,   so you can have this room. Okay. All right. \nWell, I will then. Where are you going? You   want it? Sure. I haven't found my room yet. \nOkay. Well, then I'm winning cuz all I have   to do is decorate this and then I start doing the \npranks. Yeah. Or dares. Mhm. Okay. What happens   if they come and get a snack? Um, then I I think \nI'm screwed. All right, let's go. Bye-bye. Bye.   See you. See you. All right, have fun, guys. Why \nare you being so s What's the sledgehammer for?   I have no idea. We're going to follow salish \nto see what the sledgehammer is for. I got to   bash the wall before the stokes get home so \nthey don't hear it. Okay, this is a pretty   good option for a hiding place, but there could \nbe something better. Come here. Hurry. Hurry. Where'd she go? Kat gave me \npermission to break this wall,   but I'm really hoping that there's an actually \ngood secret room so that I can win. Ready,   Collin? Yeah. I guess I'm going to go \nupstairs. What was that? Oh my god. [Music] Yo, it's good. [Music] What \nare you doing? Oh, hey, Dad. No. S,   stop. Stop. What? What are you doing, dude? We \ncan't bash their house. Collin, how could you   let her do this? Kat said it was okay. She did? \nYeah. Kat said this was okay. Yeah. Here. Want to   take a swing? Take a swing. Wait, are we allowed \nto do this? This feels good. I never get to do   this kind of thing. This is what you're trying \nto do. Say, right? Oh, this is Okay. So, I'll   help you and then we'll share this room. Okay. No, \nactually, no. No. Okay, forget it. Wait. See you.   Wait. Let's go. Okay. She's building a secret \nroom now. We got to find something good. All   right. It's okay. We still got this. That looks \nkind of fun. I'm not going to lie. Do you want to   try Collin? Kind of. Come here. I'll film you. \nAll right. We have to find a secret room. Ari. Oh my god. No. They're here. But they're \nactually here. Come on. We got to get in   the pantry because that's our only option. \nThis is like a terrible secret room. They know   this exists as a functional pantry. Come on. \nCome on. Go. Go. Go. Go. Let's go. Let's go. Okay. Okay. Okay. Here. How do you close \nthis thing? This is a good hidden room,   but they know it's actually their pantry. If they \ngo to get something, I'm busted. I'd have to hide   there. The first phase of our plan is done. \nWe both found our secret rooms. But because I   saw the Stokes twins arriving, I'm going to wait \nhere before I start decorating it. But Salish has   no idea that the Stokes twins just got here. \nCome on, Collin. Hurry up. Let's go, Collin. So, this competition could be over earlier than I \nexpected. We got to go get the supplies. [Music] They're right there. Alan and Alex were just \nwalking. I see them. Dude, it's hot. Yeah. Oh   god. This is the worst worst hiding spot. They're \nright there. They're going to use the kitchen.   They're right there. Oh. Oh my god. All right. \nTime to eat some snacks. We just worked out. They   went to the kitchen. Let's go. Let's go. Come on. \nSh. Sh. Be quiet. Be quiet. Let's go. I'm actually   so happy we have our own product now. Something \ndelicious. something tasty. They're right there.   Oh my god. We're missing some stuff here. I don't \nknow dogs barking. Do you need anything out back   in the in the area here? Just go upstairs, dude. \nIt's fine. You sure? Yeah. Oh my god, that was so   close. Dude, did you hear? They were eating their \nfood right here. Step one, we got into the house.   That's good. Step two, we got the secret room. \nThat's good. Step three, we got to decorate. And   then after decorating, we have to do the dares. \nSo, what do you want to talk about today? There's   that giant list of everything that I need to go \nthrough. You're the one that needs to make the   schedule, not me, cuz you wake up like way after \nme. They noticed it was in the wrong place. Where   do they study it? I put them back. Okay, I got to \npick this as my secret room because at this point,   they're already back. So, I have to start \ndecorating. Decorating? I don't have my bag. I   left it in the car. Do you have to go back out?? \nI have to go back out. That's literally their   car. Okay, let's go. Go back. Go back. All the \nsupplies is in the car and the car is right there. Sh. You see that? Come on, go come go come \ngo come go come go come go come go come go   come go come go come go hurry hurry hurry. Okay, \nsay say. You dropped it. You dropped the rock.   Whatever. I'll get it after. Why do you have so \nmuch stuff though? Because I needed to make Kat   a really cool secret room so that she would \nhelp me. Let's go through the laundry room. Are you I'm hearing stuff. Am I hearing \nstuff or am I going crazy? My secret room   is definitely going to be better than my dad's. \nMy dad's is in the pantry. like they're going to   easily find him. Let's go. Come on. Okay. \nCome on. Come on. I didn't know what my   secret room would be. How are we going to \nfit this in the pantry? So hot. Luckily,   I'm wearing that sincerely yours sunscreen. \nHuh? You're going to need to help me with   this part. Say, go check and see if anybody's \nsir. Say sh. Are we good? Are we good? Okay.   Sh. You got this. What? Here. Okay. It \ndoesn't go here. Let me push it. collin. All right. Can you check? No. Wait, why are \nwe acting like this is a horror movie? What?   I don't know. I heard something. Is that \nTanner came over and broke into our fridge? Literally, they could be here any second. Okay, close the door. Close \nit. Woo! We made it. Okay. Woo! [Music]   I think this might be a little overkill. I don't \nthink it's overkill. Is that plant even going to   I had to make Kat a really nice room so she \nwould help me. Say! Sh. You're loud. I got   stuff. I thought I would have an actual \nsecret room. This is basically a pantry,   but I got to decorate it. That's challenge number \nthree. And then I start on the dares. What is   that? Sincerely yours. Sunscreen. Sincerely yours spray. \nSorry, Kat. I'm going to borrow some really quick. Thank you. Thank you.  moisturizer \ncleanser. I can't throw this. [Music] What are you doing here? I just This is my \nsecret room. You can't hide here. Why? The   boys come in here like at least 20 times a day. \nAre you kidding me? How did salish get in? I let   her in. What? Why? Well, she said she was building \nme a beauty room. And I'm team Salish. Oh my. Who   isn't team Salish? Oh, almost forgot my taffy. Wait, \ncan you leave? Can you please leave me? Sh. Say,   I think we really need a rug. Grab this, \nCollin. Grab this. This is Okay, say [Music]   salish left me my five dares in these envelopes \nsealed so that I can't open them until I've   already completed one. I have to come back into \nthe secret room every time I open a new dare. So   I have to keep coming back here even though it's \nthe stupidest secret room I can possibly figure. This is the wrong bag. I forgot my other bag \nat the house. Oh my god. No, that has all the   stuff for the room. How are we going to decorate \nit? No, dude. I don't want to show collin, but I   want to show you guys. So, here's 1 second of one \nof the dares my dad is going to have to do. Wait,   what? No. I You got to eat this. Yeah. Wasn't \nthat hard? What was it? I'm going to put all   the Sincerely Yours right here. Sincerely yours \nwas sold out at sephora.com. But great news,   it's back in stock. So, use this QR code to shop \nnow or go to your local Sephora. Does this count   as a decorated secret room? I mean, you just kind \nof put a rug in a bean bag in a pantry. So, no. To   finish decorating this room, I'm going to have to \ngo out and steal stuff from the Stokes and put it   in here. That's risky. I know. So, just stay here. \nSh. Yeah. There's no way he's going to be able to   win this challenge. I don't think he's going to \nbe able to decorate this room. Okay. And Kat's   sincerely yours. I'll put this right here. \nThat's cute. I know. Thank you. After searching   the whole house, I found some decorations that \nwill definitely help me complete this challenge. I need more stuff. I really want to win \nthe Matter Cup today because whoever wins   more Matter Cups by the end of the \nyear gets a really good surprise. Okay. All right. I have to check that out. You can \nstay here and just do nothing like you do all day. Hello [Music]   Hello. Alice, is that you? Baby. Alice, is that you? \nAlan, where's your dog? Oh my god. Oh my god.   Oh my god. Oh my god. Oh my god. Oh my god. \nI tripped. I broke their plant. And then they   heard the sound. They came out. They are both in \nthe office right now. 20 ft away from us. We have   to be quiet at all times. Hey. Oh my gosh. Hey, \nthis is the secret room. It looks so good. Look,   I found your carpet out there. I completely \nshattered their plant. Look, it's a fake plant.   I guess I'm buying them a new plant. I can only \nimagine how much it cost to bash that wall. And   salish is paying for that one. Oh, that's actually \nreally nice. It's like a jungle theme. Do you know   where Kat is? I don't know. Something's going \non. No. Also, this house is really big. So, is   there anything to like watch the security cameras \nwith? Actually, we have an iPad that connects to   all the cameras. Really? Yeah. I'm going to go \nget it. Wait, really? Thank you so much. Okay,   so I completed my three challenges. I got inside. \nI found the secret room and I decorated the secret   room. Now, it's time to open my first dare from \nSalish. Okay, I got access to all the cameras.   Thank you so much. Thank you. Thank you. Thank \nyou. All right, this is the iPad connected to the   security camera. So, anytime I need to do a dare, \nI can look at it and make sure the twins aren't   there. Each of us has to try to complete our five \ndares without getting caught by either Stokes. And   whoever completes them all first without getting \ncaught wins the Matter Cup. Come on. I want that   prize the end of the year so badly. Comment below \nwhat you think of this. I have to do a cannonball   into the pool. What? And not get caught? You're \ngoing to be soaking wet the rest of the day. Oh   my god, salish. That's a good one. I wish I had \nthought of that one. I gave her some good dares,   though. Wait till you see what I did. I'm \ngoing to be busted after one. These are   for two of my dares for salish. I'm going \nto go hide them in the kitchen real quick. [Music]   Let's go! Make popcorn. He left popcorn on \nthe counter and I have to pop it and then   eat some of it. Is that supposed to make it \nlook better? Like they're never going to come   into here. As long as the door's closed, I \ndon't think they're going to come into here,   so it's fine. The Stokes twins are in \nthe office right next to the kitchen,   so they're for sure going to hear \nit. Where's the popcorn? There [Music] freak man. There's a popcorn setting. What are you doing? I'm popping the popcorn. \nYeah. Okay. I'm doing the cannonball. The   window's right there. I was going to get busted. \nYeah. Yeah. Bye. We got to go the long way. Ow.   Ow. Ow. Ow. Watch out. collin. What if I hide \nin my dad's secret room? Okay. Ew. No. Aaawww!   Come. Come on. Go. Go that way first. shoot! \nThey're right there. Go. Go. Go. Go. Go. Go. It for sure burnt! You have to eat it. What? How many \npieces? Just a couple pieces. Oh, it smells so   burnt. Is that enough? Sure. You got to put So, \nyou got to hide the popcorn. I need air freshener.   Dude, it smells so bad. Did you leave the stove \non? Dude, we don't cook. Let's keep going. Keep   going. Keep going. Go check that out. That smell, \ndude. It smells like the house is catching on   fire. Can we just not get distracted? Oh, yeah. \nAnd then let the house burn down. Okay. Shh. Okay,   dude. I got to give you my mic, right? Yeah. \neverything that I don't want to get wet. Let's   go. God, I don't want to do this. Actually, I \ndon't want to watch this. Hey, Dad. It's burnt.   You're just chilling. I want to watch you. salish, \nI hate you for this. Wait, Dad. No. No. [Music] Are you I'm hearing stuff. Am I \nhearing stuff or am I going crazy? They have a alarm on their pool. You can stay \nhere and just do nothing like you do all day.   Let's go. Let's go. Let's go. Let's go. Let's go. \nAlex is literally walking out there right now. He's checking the pool. My god. Dude, did you close the sauna? Oh,   your clothes are in My clothes are in \nthere. Wait, why is he going in the sauna? You left your belt in the sauna. That's not my \nbelt. I don't wear a belt. Yes, it is your belt.   It's too small to be mine. That's your belt. Look, \nI'm too wet. If I don't somehow get dry, I'm going   to be trekking wet footprints all over the house \nand they'll know somebody's there. Is this a hamper. Oh,   okay. All right. Turn around. While the twins \nare trying to figure out who the belt belongs to,   Salish revealed her next dare. It says a \ndo a Coke and Mentos experiment. What? I   have to keep it inside and I have to keep \nmy hands on the bottle. Let's just go,   I guess. Okay, I got to go back in \nhere and read my next dare. All right,   Say. We got to be like really careful now. They're \ngoing to be looking for us. Wait. Quiet. Quiet.   Quiet. Where am I going to do this? No. \nNo. Let's do it. Let's do it right here. Hey cutie. Close that door. collin, \nclose that door. Thank you. Let's   see what this dare is. Feed the dogs. \nYep. Okay. Could you get out of my space,   please? No. No. No. Actually, \nno. No. Do not do that. Okay. Did you hear that? Is that Kat? Kat. Oh my god. Where am I going to do it? Just go \nright here. But not right now. Let's   go watch this Mentos thing. Stokes twins \nare literally right behind Salish. Let's   hide right here. Get down. What are you \ndoing? I'm watching you cuz you're going   to get busted and I'm not. How many mentos? Okay. They are sitting ducks right now,   but your hands have to be on it. I know. I'm \ngoing to close it. No, you can't close it. Okay. Ah, [Applause] [Music] I got to get the dog food. [Music] Salish \nis literally right there. Okay, I got to feed   this to the dog. Okay. Okay, now we \nhave to do the third challenge. Before I look at   dare number three, I have to set up an order \nfor one of my dad's dares. And don't worry,   guys, you'll understand soon. Okay. \nAll right. Here you go. Oh god,   this is bad. I just let the dog out, \ntoo. I have to get the dog. This is bad. They're right there. Look at this. Yeah. Let's go upstairs. Let's go upstairs. Come on. Come on. Oh my god, that was so close. Come on, \nlet's do the next prank. Bring the pink bean   bag to the second floor. Oh, what? Wait. Okay, I \nthink I got that. Do you know how heavy that thing   is? It's not like coke and mentos. Like, I don't have to \nclean it up after. Come on, let's go. It's going   to be so loud. Walk in with me, collin. I have a \npositive attitude. I'm positive we're not going to   be able to do it. What Salish doesn't know is that \nthe twins aren't actually in their office anymore. This is really heavy. I told you. 3 2 1 push up. \n3 2 1 No. No. Up. Up. 3 2 1. Okay. Oh, I didn't   mean to slam it. Are you 100% sure that's what \nyou want to do? 100% sure. For the next video. Oh my gosh. Surprisingly, we didn't get caught \nby them. And they didn't even notice that the   bean bag wasn't there. But we got to go. Let's \ngo. Sh. Okay. Take a secret selfie with one of   the twins in the background. What? I don't know \nhow I'm going to do that. It's just going to be   impossible. That's the hardest one. Yeah, for \nsure. I ordered a pizza. It's being delivered.   Bring it to me. She ordered a pizza. We got to \ngo outside and we got to go back to the driveway   and we got to wait for the pizza delivery and \nget it there so they never knock on the door.   I ordered pizza 30 minutes ago and the \ndriver just arrived. No. No. She's already   there. But if the driver rings the doorbell, \nthat's going to ruin his entire dare because   then the Stoke twins will probably come \nto the door. Who is that? Frick. Frick. Hi there. Did you Um, someone probably did. \nThey're talking to her. Thank you. Cool. Perfect. Oh, she's coming. Come. Oh my god. Okay, let's go. Let's go. Did you get \ngo again? Closer. Get closer. Go. Go. Is he visible in it? Yeah, I guess that counts. It's like the \nback of his head a mile away. I already   got the pizza. How do I get that pizza and \ngive it to Salish? Weird, right? Yes. There's   no meat on this pizza. Sh. What was that? \nThat was the wind, right? Or Hurry. Hurry. Get down. Actually, get down. Actually, get \ndown. Oh, this is where the noise came from.   Oh my god. I just slammed that door so hard. \nGo, go, go, go, go, go, go, go, go, go. All   right, I got the selfie for dinner number \nfour, not dinner number five. Let's go.   Let's go. Come on. Come on. Come on. Rev \nup the Lambo 10 times. What? Do you even   know how to start a Lamborghini? No. All right, \ndude. Let's just Let's just go back and lock in,   dude. Just lock in. Come on. Lock in. All right, \nlet's go, dude. Come on. Come on. Come on. I need to get the car keys and I \nhave no idea where they are. So,   I'm going to call Kat right now. Okay. Hi, \nKat. I was just wondering where the Stokes   twins like Lamborghini car keys are. Ooh. Um, \nsometimes they're in the coffee table in the   living room. Okay. Thank you so much. Wait, why \ndo you need the keys? Okay, bye. Thank you. What   are you doing with the keys? Okay, we got to \ngo. Let's go. Let's go. Ari, be super quiet. That's your That's your [Music] Go, go, go, go, \ngo, go, go. That was so scary. Next dare. Dare   number four. Two left. Matter cup is mine. Oh \ngod, that's so good. FaceTime the twins for 1   minute without leaving this room. Where's the \ncoffee table? Oh, it's over here. There's one   on this side, too. Yes, there it is. There \nit is. Good job. Wait, is this working? Who is that? Oh my gosh. I want \nto be in here. No, I don't know. Yes. Wait. Is that right? Let's go. Let's go. \nLet's go. No. No. Guess what? I'm on my fifth   challenge. Bye. Let's go. Come on. No. She's \non her fifth challenge. I'm on my fourth. I'm   a challenge behind. No. Go, go, go, go. All this \nlooks sick. Okay, I think it's the blue one. I've   got to FaceTime. Does this look sus? All right, \nthat doesn't look sus. You can't tell what this   is. Wait, why is Jordan FaceTiming us? Can you \njust in here going? Hurry up. Hurry. Okay. Yeah,   I'm Hey, Alex. Hey, how you doing? How \nyou guys doing? How you guys doing? You ready? Um, I just wanted to talk to you \nguys about um- Three. You ever want to do a   video together? Maybe. 4 5 6. Wait. Hold on one \nsecond. Jordan, my Lambo's turning on. Alan,   run. She's getting busted. She's getting busted. \nWhat is that? Go circle. Circle. Hey. Excuse me.   Hey. Excuse me. Hi. What are you doing here? \nWait. Wait. What are you doing? Wait. Hey.   We've been in your house all day hiding. Kat gave \nus permission and it was a competition to see who   would last longer. Okay, come on. You've done this \nto houses before. You get it. No, we have you have   it. Imagine you wake up and you go over to kiss \nyour wife and it's me. Imagine that. That's how   I feel right now cuz she was in the car. The only \nquestion is how many revs did she get before you   caught her? I got 10. No, you didn't actually. \nYeah. No, collin. She got 10. Why did it take   you so long to get out here? It's cuz we were \non the phone with you. Yeah, but why you didn't   call? We wouldn't have been distracted. You guys \njust cost me in the matter cup. You know that.   But what is a matter cup? By the way, thanks for \nletting us in your home. I don't even know. Thank   you. Thank you. What is happening? Why Why is \nhe going back in our house? The exit's that way.   Yeah. What is going on? I don't know. I'm going \nto go grab something to eat. I'm hungry. Bye. [Music]",
    "start_time": 0.16,
    "end_time": 1787.3
}