{
    "video_id": "sic_A9CZxzw",
    "channel_url": "@jordanmatter",
    "transcript": "My daughter Salish and her best friend Nidal \nsay they are dating. And you won't believe the   wild secrets we're going to reveal today. Does Kaido\nknow about this? Yeah. Then you won't mind   if I ask him. I want you to be honest with \nme. What is their relationship status? Bro,   why would you bring that up? And this might be \nthe hardest video we ever filmed for me. Salish,   I've known you for seven years. What is happening \nright now? Let's put this on. This is where I   just leave the set. In all seriousness, this \nis Oh my god, they're kissing. What? What is   their relationship status? That's crazy that \nyou brought that up, bro. Because um they're they're dating. Somebody take the phone for me. This is \nreal. And to test if they're really dating,   I've invited six couples, but only one of them \nis real. The couples will compete in a series   of extreme relationship challenges. Oh my gosh. \nAnd at the end, a guest judge will try to select   the real couple. Who said I love you first? One, two, three flip. Oh my god. Yo. So, the question is,   is my daughter Salish actually dating Nidal \nor are they faking it? This is the guest judge   Kevin Langue from the Kevin Langue Show. The world's \nabsolute best guesser. Everybody always remember,   you also have to try and guess which \none of them is the real couple. Here,   everybody introduce yourself. Tell me your name \nand how you met. Starting with you. Number one.   We met at CFJ Camp and I saw him. I was like, I \nneed to make him my man. And that's exactly what   I did cuz I I don't miss. Okay. Okay. Everybody \npause. What are they giggling about? We can't hear   ourselves. You're giggling over there so much. \nNumber two. Well, hi. My name is Reif. I'm Sydney. Sorry. She has a lot of energy. She has \na lot of energy. I'm Sydney. What? We're   both dating several people when we first \nmet and so we had breakups at the same   time. I figured them out. He definitely \nlikes her. So, if they're not dating,   you might want to deal with the reality \nthat you have a crush on your friend. All right, number three. Step on up. This is You \ncan feel it. It just felt kind of magical right   away. We just had so much in common and had so \nmuch chemistry right off the bat. Whichever one   of the couples is picked at the end by Kevin to be \nthe real couple wins $1,000 whether or not they're   the real couple. But if Kevin picks the real \ncouple, he also wins $1,000. I'm getting money.   If you pick the right couple, \nyou're getting money. What is this button for? Oh,   this red button. You're going to find out later. \nCouple number four. There's a big quiz coming   up after lunch. I saw her just studying \nand like struggling. So, I went in there,   helped her out. So, what did that make you feel \nlike when he came up to you? I already thought he   was like cute and I thought it was like really \nsweet of him. All right. Thank you. Not sold,   but not unsold. I've done over a 100 guessing \nepisodes and I've never been wrong. And today is   not that day. Number five. This is so weird. This \nis so What's going on? They work for me. Oh,   this is going to be good. No, wait. Hold on. Oh, \nthis going to be good. Just wait. Just wait a   second. Either they're dating behind my back \nor I'm getting pranked in front of millions.   Either way, it's a bad deal. We started dating \n3 months ago. Play the clip of uh Del's Tik   Tok when he's over 6 foot and has blue eyes. Was \nthat Tik Tok Del about Rohan? For legal purposes, I don't remember that Tik Tok. You know what? I \ndon't even need to hear it. Could you just go back?   I can't believe you guys. Just go back. Go. If \nthey're the real couple, that's going to freak me   out. We have Nalish. Is that what they're saying? \nIntroduce yourselves. I'm Salish. He's Nidal. He's   like a pro flipper. Or he used to be. Now he's \nnot that good. Oh. Well, show them. Oh, yeah.   Wow. And so my dad worked with him when he was a \nphotographer and then I came in one of the videos. We always liked each other, but we couldn't \nlike really do anything about it cuz we were   long distance. I lived in Texas. She lived here. \nThe way she's looking at him. There was a problem   that she was doing videos with Kaido. Oh. Oh. Kaido\nhas made it very clear he has a crush on Salish.   And recently, Salish asked him to dinner. Do you \nwant to go to dinner? Not a problem. I always have   liked her. I just never like really talked \nto her. Whenever she started talking to Kaido,   I kind of wanted to shoot my shot and like get \nthere before he could, you know? So, you feel like you   should have done it sooner? Well, Salish, where is Kaido \nright now? He's in San Diego. What do you think?   Sitting in a car looking out the window? Oh, yeah. \nYou know who's not in San Diego? Okay. You have a   lot on your hands. That was way more believable \nthan I wanted it to be. Nidal, I have to ask   you about this Tik Tok you posted. Are you saying \nSalish is your soulmate? I don't know, man. Okay,   let me ask you this. What is happening right now? \nIt's the worst thing ever. Were you dating when   you asked Kaido out to dinner? No. We were \ntalking. You were talking before you asked Kaido   out. Cuz I want to see like all my options. As you \nshould. Hey, as you should. That's crazy. My daughter. Oh,   not his daughter. What? Okay, hold on. This is \nnot happening. It's hot in here, right? Yeah,   it's crazy. Kaido's fine with it because Nidal \nand Kaido are like best friends, right? Well,   not best friends, but you guys are like twins. You \nhear her ask him to dinner. What's your reaction?   I got to ask her first. I got to get there first before \nthey actually go cuz they haven't went yet and we   already went. And once you talked to her about how \nyou felt when she asked. Nah hey   Jordan, I'm figuring this out for you, bro. Don't \nworry about it. When she asked Kaido out to dinner,   tell her how that made you feel. Okay. I'm not \ngoing to lie. Little bit jealous. Okay. No,   just a little bit. No, but I asked him before \nwe were dating. Based on that, it looks like   they are dating. Dude, are you more nervous \nabout Kaido or Jordan? Low key, I'm scared of my dad. I would be too. If this is the reveal video, \nfirst I'm honored to be here. Um, second,   we're going to get to the end and this is going to \nblow everybody's mind. You've been like dating for   how long? I liked him when we like first met \nand then we started talking like August 1st.   As far as I know, you guys are dating, but \nthere's an outstanding dinner date with Kaido that's   upcoming. So, what happens with that? How would \nyou feel about that Nidal? Because I'm supposed   to go tomorrow, so we already went on two. Oh, no. \nIs this the emergency button? Can we be done   with this video? They still haven't gone on the \ndinner and we already went on our two dates. So,   it's like Kaido was kind of like shooting and I \nalready hit the three-pointer. You know? What.   Bro, Kaido's at home punching air. So, are you going \nwith him tomorrow? Um, I don't know. She's going on that dinner   tomorrow. You know what? Go back. Go back. This \nis You're good. Thank you very much. Thank you   guys. Thank God, goodbye. The only person to blame here \nis you. What? What did I do? You photographed   him years ago. You set this up. I think I would \nknow if they're actually dating though. Kevin   is now about to eliminate one couple. Right now? \nCould you just eliminate Salish and Nidal and call it a day? No,   because guessing is fun, but watching you go \nthrough this is way more fun. When Kevin calls   your number, you're going to step forward \nas a couple and you will be eliminated. And   then we'll find out after you do that if you \nwere right. Obviously, there's your daughter,   which I'm not going to send home just yet. Watch. \nJust do it. Now, watching you suffer is so   much fun. All right, Kevin, are you ready? Yes, \nsir. It is time to eliminate the first couple. one. Oh no. One. Before we \nfind out if he was right,   comment below. Do you think it was number \none? Yes or no? Are you a real couple? No.  You got it right. All right. I'm \nsorry you didn't win a 1,000 bucks,   but that was a good effort. Thank you so much. \nAll right, let's give it up for couple one. It   is down to five couples. On to round two. I don't \nthink Salish and Nidal are actually dating. I mean,   they seem like they are, but I can't imagine they \nare. So, I'm saying it's not couple number six.   Let me tell you what this red button is. From \nhere on out, every elimination runs through   this button. Press it on the real couple. Okay, \neverybody. And you'll pay them a $1,000. But press   it on a fake couple. They're looking at their work \nschedule together. And you'll cash in a 1,000 for   every correct elimination. Okay. And we back. \nCurrently, who do you think is most likely to   be the couple? I'm going to say this, too. Even \noff camera, they're getting very comfortable. So,   I'm going three, four, or six. And I want \nto apologize for my guest. You know what? I   think I'm going to have somebody come in and \ntake this chair. I can't handle this. One, two, three.   What's up? I should be in this. But you need a \ngirlfriend first. We're working on it. All right. So,   Hudson's got an idea. I'm just going to be over \nhere. For this next round. One of you guys has to   pick the other person up and hold them for as long \nas they can and hopefully give us a little bit   of insight how they deal with each other, etc., \netc. It's like a body language round. One, two,   three. That's crazy. That's the hand placement. \nI'm going to pee my pants. What'd she say? She's   going to pee her pants. Three is doing this \npotato sack thing. He's getting tired first   round. He's getting fired. He's also getting \nfired. These two look really uncomfortable.   Like he just he's sweating right now. \nI know Nidal is sweating over there. Nidal's   sweating cuz Jordan's here. Y'all stay up like \nthis. Tell me a fun fact about your girlfriend.   They all look like a couple. This is crazy. \nWe'll start with you, Nidal. Fun fact about   your girlfriend. Uh she made a music video about \nme. He made one about me. Was it a love song? Yes. No. Who made the love song? You or her? Him. Um couple \nnumber five. What is your fun fact? I work with   them seven days a week. This is so weird. Fun \nfact, there was a video a couple months ago and   it ended a little early and then we both got into \nseparate cars and then went around the block and   got into the same car. He just made that up on the \nspot. And what what were you guys doing in that   car? Was that the first? I'm moving on from you. \nCouple number four. She's amazing with dogs. Okay,   I like that. I like that. I like that. Number \nthree, she likes to be big spoon. Oh, okay.   No, that's beautiful. We support that. Well, \nHudson probably supports that. I can't speak for   myself. Fun fact number two. She has a cat named \nBoots and they have the same color eyes. True. All   right, you can put him down. You've been enjoying \nyour time in the air. It's time to switch. Ladies,   it's now your turn to carry your man. Oh, the \ngirls are picking up the boys. Three, two, one go. Oh,   three. Look at three. Number three is respectable. \nYeah. Okay. Okay. Wait. Hold on. Stop. I'll give   $100 to whichever girl can hold the guy the \nlongest. And everybody has to run in place.   Everybody come. Oh my god. Oh, she's got what? \nAll right, Del, you guys are done. You didn't   run between you two. Go, go, go, go. You got to \ngive it to number four. Oh, number four wins 100   bucks. Congratulations. Yeah. Okay, so that was \nvery exciting. We're going to move on to What? Oh,   wait. You're going to eliminate somebody? I'm \ngoing to eliminate somebody. If he eliminates the   actual couple, he has to give them another $1,000 \nand this video is over. I forgot about that part.   If he gets it right, he gets an additional \n$1,000 into your pot. Are you sure you want   to do this? I have to. Kevin, who do you want to \neliminate? [Music] I'm going to go number two. Oh,   yo, hold on. Here. Listen, hear me out. Moment of \ntruth. All right, here we go. Stand   next to me. Stand next to me. The video continues and \nyou got another 1,000 bucks in your pocket or you're   giving them a 1,000 bucks and this is over cuz \nthey're a real couple. So, couple number two, are   you real or fake? Well, you better pull out your \nwallet cuz you're still going to get $1,000 cuz   we are not a couple. We are not a couple. I knew \nit. Come on. Let's go. I got a job to do. We did   our best. Thank you guys. Next round, photo booth. \nEach couple is going to pick some props, take some   photos, and then show them to Kevin to see what \nhe thinks. You can watch everything happening in   the photo booth on that monitor. Okay, you got 30 \nseconds to pick some props. Go. All right, baby.   Do you care? Just this? Yes. Okay, we're good. \nOkay. I don't know, bro. Her arm, though. You know   what it is? Is that You know how we eliminated \nthe other one? I think she's more into him than he is in her.   He doesn't want to do that, bro. I think he has \na girlfriend at home. If they're not the couple,   she wants to be. I agree with you that they might \nnot be the couple, but then that leaves it. Like,   who else is there, bro? Wake up. What do you guys \nthink? They're doing too much. I think they're   trying too hard. Woo. Okay. Either they're a real \ncouple or they're going to be a real couple. You   have 30 seconds to pick your prop. They could be \nreal, too. Yes. Is that it? I'm not going to lie.   I never put no bunny ears on my head unless I'm \nwith my girl. That's crazy. See, he's initiating   unlike the other guy like you were saying. And \nshe's okay with it, too. The kissy thing. And you   see the hands and he looks happy. Oh. Oh. Right \nnow, my number one picks them. I'm tied between   her and Salish. Yes, bro. I don't know. Three, four, \nboth of them could be a real couple. What do you   guys think? Start commenting your favorite below. \nAct like I'm you. What do you think about Salish?   Like like that. You know. I don't know. \nLook at the way he's looking at her. Stressing   me. I can't even think about. Do like a kissy \nface. We don't actually have to kiss. This video   is going to end. I think everyone's in for \na big surprise. Next. Go ahead. Do coupley   things. You got 10 seconds. 5 4 3 2 1. Okay. Go \non in. Here's the thing with Rohan, he was at my birth. I've   known him my entire life. But again, you've known \nSalish your whole life. Okay. Oh, woah woah. Okay, now we have to, we have to do \nsomething. One more photo. I'm not buying it. Yeah, I'm not. We're not buying \nit either. There's no way that my employees could   date without me knowing. I'm voting you off the \nisland right now, but it's not my choice. See   you. Bye. Really cute. Byebye. Babe, babe, babe is \nawful. I want to thank you guys for my $1,000. All   right, here. This is the big one. Salish, Nidal, \nyou guys have 30 seconds to pick a prop. If you   don't want a prop, if you just want really pretty \ncouple photos, you do that. Wait, should I have   these on too or not? Put these on top. Where is \nyour ear? She's comfortable putting stuff on him,   though. That's true. But they're also best \nfriends. Yeah, it's really hard to tell. But   a lot of best friends end up dating. You know what \nI mean? Like the girl next door. And then all   it took was like Kaido to like unlock that. Ready? \nYeah. I don't know if I can watch this one,   but let's see how it goes. Oh, shoot. That's \nthe worst photo ever. Okay. Hands. Hands. Nidal Hands. I'm just leaving the set. I'm \ngoing over here. How is he so cool with this?   You have to realize your dad might be team Nalish. Oh, \nall right. All right. Chill with that. Chill   with that. My grandparents are going to be like, \n\"Bro, chill. Salish.\" They're look so comfortable. Like,   look at this. Look at this. She's touching his chin \nstuff. That's not That's not She got a whole   hand of his chest and then another hand of his \nface. Like, okay, in all seriousness, this is like   they're acting like Oh my god, they're kissing. \nWhat? Oh, you got me. Y'all got insurance, right?   Come on out. So, who do you think is the real \ncouple here? That's like asking mom and you. Like,   who's the real couple? You guys. Oh, wait. You're \ncomparing a married couple forever to you guys who   have been talking for two weeks, dating for 3 days, \nand known each other for seven years. Does that line up   with what they told you earlier? Yeah. All right, \neverybody, take five. Okay, I just said take five,   but actually we're just going to watch them and \nsee if their body language gives anything away.   We can pretty much confidently eliminate five from \nour minds right now. It's $3,000. They're looking   at their work schedule together. Yeah that's, to me, look look. I don't think they are filming a video in   their minds. She's on set with her boyfriend. \nFour. Look at four. Dude, the hand placement   and he's comfortable letting her see his phone. \nNumber six and number three, they could both be   best friends. I don't see any world in which \nnumber four is best friends. You see three.   She's leaning into him. I think I don't know if, \nhe saw me. They're definitely into each other. I   think she's into him a lot more. Salish and Nidal \nare looking really comfortable with each other,   but they always do. They're believable enough \nthat I think they might get chosen. I'm going to   eliminate somebody. Before you do that, I'm making \na switch. If you eliminate the actual couple,   you have to give them all $2,000. You have now. I'm \nconfident. Wow. Okay, everybody. We have another   elimination. It's time to eliminate another couple. You \nwant to see the photos? I don't need the photos.   Well, just look. I don't need to look. Actually, \ndon't look at Salish and Nidal. They look too happy. No, no,   no. You know what? No. No. Let's No, no. \nKevin, who are you going to eliminate? Five. Yes. Okay. Are you a couple or no? No, we're \nnot. We good. Maybe we good. We still get paid,   right? For today. you go back and do your real \njob. I quit. It is down to three. But before   we go next round, I've always wanted \nto ask Nidal this question. I haven't   had a chance to ask you this. When I said at \nKid's Choice that I was okay with her dating,   just not you. I'm okay with her dating. Maybe \njust not Nidal. How did that make you feel? Well,   I didn't like that video and I think I'm \ngetting my revenge right now. That's all   I'm going to say. You guys say who's the real \ncouple and let's call this a day. Can we be   done with this? I can't do this anymore. I mean, \nis it a prank. I don't know why you guys don't   believe us. Let's just go to the next challenge \nand see if we can figure this out. Next challenge.   Blindfold. Each of you put the blindfold on, \nplease. Oh, this gonna be good. But okay,   I'm nervous. I am too. I'm gonna jump scare them \nand then see how they behave. Okay, everybody.   Blindfolded. Blindfold. Salish. What? Hold on. \nIs that the Nidal's bracelet? Yeah. Woah. Hold on,   Kevin. She just started wearing the Nidal's \nbracelet again. Let me see it. She wasn't wearing   this before? Why did you start wearing that? \nBecause we're dating now. I thought the secret   admirer video was rough, but this is like 10 times \nharder. Stay blindfolded. Oh, your dad's a savage.   Oh, wait. Wait. Look at Salish. I don't know. Oh my \ngoodness. This is a new shirt. No. Please don't get   my shirt dirty. Please. It's a new spider hoodie. \nPlease. He didn't think to protect her. He like   held her and then at the end he flipped her. \nYeah. That's absurd. Don't get me dirty. Oh my. What's happening? I \nfeel like someone's next to us. Someone's right next to me. No, there's not. Oh,   wait. I hear someone. Hey, I \ncan't see anything. What the heck? [Music] They're all reacting the same. Okay, \neverybody, you can take off your blindfolds.   Welcome back to Fear Factor. That challenge \nallowed Kevin to watch you and see how you behaved   when you got scared. Couple number three, you shot \nat them with a water gun. He didn't even think to   protect her. I couldn't feel it. I couldn't feel \nit. Is it my time to speak or your time to speak? Number four, their reaction was almost identical. \nLike you you hit the horn and they're in sync   because they've been together for a while. Do you \nwant my number six breakdown? Yeah. Unfortunately,   yes. You were scaring them. Mhm. They were like \nall over each other. And when you got to them,   you know what's funny? They didn't seem scared. \nYou know why I don't think they were scared?   Because they had each other. Okay. Okay. Stop. \nOkay. If you weren't Salish's dad and   you weren't Salish's brother and y'all are \njust playing this game with me as judges,   what would be your answer? I'd say it would look like \nthey're dating. But but but they've looked   like they're dating since they were ten. That's \nwhy people have shipped them for five years. Look,   I've done this a million times. People who \nare actually not trying cuz they're just being   themselves are the ones you got to look out for. \nAnd you know who's acting real normal? Salish and Nidal. Next round is the newlywed game. Kevin is going to \nask each couple questions. They're going to write   their answers on the whiteboard and see if they \nmatch. Okay. I've gathered a list of questions   to get deeper into this. Who said I love you \nfirst? Okay. Okay. Did you say it back? I mean,   yeah. That would be crazy not to. Say \nit right now. I love you. I love you,   too. I kind of believed it right there. I have \na question for them. Have you ever said I love   you to anybody else? Yeah. So, you have been in \nlove before. I was in a  four year relationship. She   was in a five year relationship. through through the \nwhole video too. They've been so consistent with   their story. I want you to write down her coffee \norder at Starbucks and I want you to write down   your coffee order at Starbucks and see if it \nmatches. They are locked in. Like he's like,   \"No problem.\" And it's a long order, too. It's one \nof them Frappuccinos or something. If if they get   this, just end this video. They're a couple. How \nare they still writing? I'm confused. Sorry. It's   a long order. One, two, three. Oh my gosh. Ice \nchai latte, shot of espresso, salted caramel,   cold foam. Caramel cold foam. That's the same thing. \nWe get the same order cuz we share it every time.   Okay. Okay. I want you to write down her mother's \nnickname. Like nickname, like what we call her or what her name is? What we call her. He obviously \nknows her mother. That's interesting. Is this Salish   and Nidal in 10 years? Without the dating \npart. One, two, three. Cheryl, Cherri. Oh,   that's what I put. Oh my. With the parenthesis. The parenthesis. \nGive me these with the exact parentheses. The   same parenthesis. Who even uses parenthesis? Hallelujah. \nSalish is not dating Nidal cuz they're obviously   dating. I wasn't sure, but I'm going to be honest. \nThey're moving back up my list. Same. Wow. Same.   I'm going to poof you guys out of here. I'm going \nto bring in the next guys. Okay? Okay. I want you   to write down her best friend's name. And you're \ngoing to write down your best friend's name.   Obviously, this is something he should know. He \nhas to know. On three. Ready? One, two, three. Maren. Maren.   Okay. Okay. There's my boy right there. Okay. \nWhy is he What? Can I try something? On three, say   who would have been the other best friend. Okay. \nOne, two, three. Soren. Hello. Four, did you pause? Wait. Cuz I have three best friends. She has \nthree best friends in total. I don't know. That was interesting. I feel like   couple number three would have killed that right \noff the bat. Oh, for sure. You want to do favorite things? Can I say one?   Yeah. What did she wear on your first date? Ooh. \nSee, now you're cookin'. You had better remember what she wore. This is crazy. If you, There's no way they pull this off.  Alright one, two, three. Oh my god. Blue jeans, tube top. Oh, same thing is crazy. I want you to tell \nme what his wallpaper is. It's kind of weird, but it's my foot. Wait, what? Yo, what the heck. He's got a screen saver of her foot. i don't know if you wanna know this but when three was here, his phone was on the ground and   I saw his background. It was a picture of the \ngirl's face. Somebody go get three right now.   Let me see your wallpaper. Oh, what is happening? \nRemember, at least one, if not two of them are   absolutely friends. Smoke bomb in Salish and Nidal. \nThis is getting crazy. Bye guys. See you. Hey,   it's my favorite time of the game. Oh, I \nbet it is. First question. You're going   to write down Nidal's Starbucks order and \nyou're going to write down yours and we'll   see if she matches with you. You got You got \nit. Yeah. You got his? Not Kaido's? Oh. On three. One,   two, three. Vanilla bean frap with no whip. Is that true? Yeah, \nthat's my order. Who gets more jealous? One, two,   three, flip. Salish. Salish. Oh, cuz you just said \nearlier that you didn't want me to go with Kaido.   That's cuz we already went on two dates and now \nit would just be weird if you went on a date with him. Okay. Well, why am I more jealous? Who am I \nmore jealous of? I'm not more jealous. It's just- Why   would you go on a date if you already went on a date? \nOkay. The thing is I wasn't jealous. It's just   that imagine imagine you're on a date with a girl \nand you're with her and then you're like, \"Oh,   I'm going to go with this one.\" It's like, you \nknow? So you were jealous. Go anyway. Yeah. You   were jealous. No. Okay. You can say jealous. Okay. \nOkay. So, but why do you think she gets jealous?   Yeah. Whenever I'm on Snapchat, she's always \njust like, \"Oh, who's this? Who's this?\" Oh, ooh and they're usually just friends, but she thinks \notherwise. Is this true? All right, bruh. No, because whenever I'm on   Snapchat, he's literally like, he only has girls \nin his snap. Like, what are you doing with all   these girls in your snap if I'm right here? The \nsilence is loud. Can I just say something? Even   if they're faking it, that sounded so real. When I \ntell you he's not having no girls in his Snapchat   story for the next two weeks, that's real. \nYeah, you better not. Cuz you need to post on   your private Snap story right now that you're not \ntalking to any more girls. On my private one, I'll   do that on my private one. Okay. On your public \none. Wait. Okay. Wait, wait, wait. [Applause]  Here's the thing. My phone's dead. No, it's not. \nYou were just on it, bro. Let's just pull out   the phone, right? Oh my god. I think everybody \nwants to see the phone. Oh my god. First of all,   I can confirm the phone is not dead. Hold on. \nHold on. Hold on. Here it is. I'll make you guys   a deal. We'll go through his. But we also got to \ngo through yours. All right. And if Kaido's in there,   that's going to be really interesting. There's \nno pressure to do this. You guys could just poof   away. All right. Sure. Okay. Here we go. Let's go. \nLook, look, look. That's not that bad. That's not   All right. Best friends list right here. What's \nthat thing? What's a best friend on Snapchat?   Your best friends list is like the people \nyou talk and communicate with the most. Oh,   dad is Finn. Dad. A girl. Girl, guy, girl, girl, \ngirl, guy. Okay. One of the guys is your dad. It's   not a good look. I cannot believe you're getting \nthem to do this. All right. You ready? Kaido's going   to be number one. If Kaido's in there, this clip's \nabout to go crazy. All right. No cheating. All   right. Best friends. We've got number one. Kaido. No \nway. No way. Hey, we got to get out of here. No,   no. Exposed. Can I say though? Can I say \nnumber two is Nidal. Okay. What? Yeah,   but he's still number two. If you- if you \ncheck my texts, if there was like a best   friends list for text, she would probably be my \none number one. And FaceTime list. I mean,   that makes sense. If I start dating someone, I'm \nprobably communicating with them more often. And   more FaceTime. Oh god. More FaceTime then Snap \nafter that. Yeah. FaceTime and text. That's   all I need. I don't even know what to make of \nthis. What just happened? Can we just move on?   Can we get this over with? That was a lot. All \nright. Let's do one final round. Then you got to   make a decision. Okay. All right. Final round. \nThis is a promise ring. And I want each guy to   give it to his girl. But the girl is going to \nwear this. And this will allow us to measure   your heart rate. So, we'll see how you feel when \nhe's promising himself to you. Before you start,   I want you to take 10 seconds and just stare into \neach other's eyes and then go into your proposal.   Like she was spiked and then it calmed down. Oh, wait. \nWait. Oh, it's going back up. It's going back   up. Normal heart rate is around 60 or 70, but \nher heart is beating twice as fast right now.   Nova. Yes. I promise to be with you forever. \nThat's so cute. That was interesting. Wait,   you're five months into dating? Four and a half. \nFour and a half. But this is maybe a little red   flag. I think they might be too comfortable for \nthree and half months. I don't know. All right, next   couple. Come on in. Her heart rate right now is \n78. Couple three, her heart rate started at 130.   You're just chill. That is a great point. I would \nlove to give you this promise ring because you are   always so kind to me and always take care of me \nand I always promise to do the same for you. Aw, [Applause] that felt so genuine. That was \nbeautiful. I legitimately cannot tell. And   finally, it's time to test Salish and Nidal. \nAll right, you're going to turn and face each   other. And I want you guys to just look at \neach other. Look in each other's eyes for   now. It's going down. So chill, very comfortable. I can't \nlook at both of your eyes. Look at them. Salish,   I've known you for seven years. We've been on \ntwo dates already. I'm really starting to   like you. And I want to give you this ring. And \nhopefully we can go on a third date. Okay. Okay.   Okay. [Music] Okay. Wow. Are you ready to make a \nfinal decision? Almost. Almost. What? There's no   more rounds left. I need- I need one more \nthing. Salish, do you have your phone on   you? Yeah. Do you have Kaido's number? I do. I \nthink we should just FaceTime him. And tell   him you're dating Nidal. Which is fine, right? Cuz \nit's true. Yeah. Oh my god. I think it's fine,   but your heart rate says otherwise. Oh, it did go up. Oh, no no. Hey, what's up, dude? What's up,   bro? Huge fan. How are you doing? Yo, let me ask you this. You \nknow, you know Nidal? Bro, of course I know   Nidal. I want you to be honest with me. 100%. \nWhat is their relationship status right now? They're dating. Bro, why would you bring that up, bro? I didn't \nI didn't- I don't know. I don't know. Yo,   what? That was crazy. Dude i'm gonna start crying bro. Are you ready to make a decision? I think I'm ready. I can't even with   that. Here, take this back. Her heart rate was \nout of control. All right, we got to just collect   ourselves and then Kevin has to make a decision. \nWe're going to find out who is the real couple.   And please don't let it be them. Before Kevin \nmakes his final decision, I just want to remind   you guys, we're doing a popup event September 6th \nin New Jersey at the American Dream Mall. Huge   announcement. Please join us. Link in description. \nAlso, make sure to check out everything Kevin   does. He's amazing. Go check out his channel. We \nwill link something in the description as well.   And now, Kevin, are you ready? Salish Nidal, \nyou've always had the vibe that could be couple   and you've never been one. Nothing changed today. \nI think you're way too private a person, Salish,   to actually come public with a relationship like \nthis. I just don't think you would do it this   way. But Kevin has his own opinion. I would \nhave to guess between three or four. I mean,   look at this. My guess is it's three, but it's not \nmy vote, but my guess is three. Hudson, what do   you think? I'm going to go four. I have a lot of \nthoughts, but my immediate thing says four. Okay,   Kevin. I went into it not thinking it was Salish. \nThrough the video, they were really convincing and   they at some point were like my top pick. But I \nagree with you a little bit. I just think Salish,   you seem very sweet and kind and I just think \nif you were dating someone, it would be more,   I guess, private or you wouldn't make a spectacle out \nof it. I'm going to take y'all out. I think you   might just be doing it to mess with your dad, your \nbrother, and for some cash. Or they might be the   couple and we're about to find out. This is how it's \ngoing to go. You're going to pick the number and   that couple gets the money. Then we will ask which \none of you is actually the real couple. My vote is number four. Number four. You just \ngot $1,000 in cash. Number four. And now   we're going to find out which one is the real \ncouple. If it's number four, Kevin just got   $3,000. I'm hoping it's three. I've \nalways been voting for you. Okay,   here we go. When I count to three, please, \nthe real couple, step forward. One, two, three. It's what I do. All right, guys. I just want \nto explain the whole thing was a prank on my   dad. We were never dating or talking. We \njust wanted a 1,000 bucks. But Kaido and I   are still great and we're actually going \nout tomorrow. Wait, you are? All right,   guys. Obviously, I'm joking. But if you \ndo want to know how I feel about Kaido,   make sure to go check out my channel. Guys, \nSalish called me before the video telling me that   she and Nidal were going to prank Jordan \nfor a video. I thought it was pretty funny,   so I went along on the call. It's okay. I love \nyou guys. Stay safe and see you soon, Salish.",
    "start_time": 0.16,
    "end_time": 1944.96
}