{
    "video_id": "l7dzf4eFeAc",
    "channel_url": "@jordanmatter",
    "transcript": "Today I'm going to build a secret pool in \nmy house. But if my dad finds out, he's   going to freak out. No, no, no. So to keep him \ndistracted, I trapped him in the elevator. Say,   \"What am I doing in here?\" And the only way for \nhim to get out is by completing five really hard   challenges. Starting with cup stacking. Finally. \nOkay. Can I come out? No. You have to stack all   the cups to the ceiling. And if they fall, you \nhave to start all over again. So I'm never getting   out of here. Nope. Bye. To the ceiling. Salish. No. \nGood luck. That's going to take him a long time,   which is good cuz I have so much to do. Come on, \nCollin. Let's go. I've wanted a pool forever,   but my dad says it's a huge waste because \nhe doesn't think that we would use it. So,   I'm going to build my own secret pool under this \ntrampoline without telling him to prove that I   would use it every day. First step is to figure \nout how to take off the trampoline so I can put   the pool inside. And I got this entire idea from \nBen Azelart because he hid under the trampoline.   The whole team is here because my dad thinks that \nwe're doing a tiny elevator video and they're here   to help. But that's perfect because now they \ncan help out with this. Collin Ro, del! Wait,   you're Collin. Del. Rohan! Okay, now that we have \nthe crew here, we can really get started taking   off the trampoline to make room for the pool. \nCollin, what? That's not helping me. Meanwhile,   my dad seems to be making progress, but \nhe doesn't realize that there's no way   to reach the ceiling with that strategy. \nI did it. I stacked it. They didn't fall,   but it's not anywhere close to the ceiling. \nHow am I supposed to get to the ceiling? I am   really hoping he doesn't finish anytime soon \nor he's going to catch me for sure. Oh god,   what do I do now? I have no idea if this is going \nto work, but I have to try something. Oh my god,   this might work. The reason that I picked the cup \nsacking thing first is because it is literally   impossible, especially for him. He has no eye \nhand coordination or whatever. It's probably   going to take him literally like hours to do, \nso I have more time to finish the entire pool.   Okay, now I have this monitor so that I \ncan watch my dad. No, no, no, no, no, no,   no. All the cups just fell. So, that sucks for \nhim. I'm having second thoughts about this plan.   Ew. This looks pretty gross. I'm not going to \nswim in there. I got a pool to put in there.   It arrived when I wasn't home, so I had Hudson \nhide it somewhere for me. Okay, Hudson, I have   a question. Where did you put the pool? I hid it \nupstairs in the attic so mom and dad wouldn't find   it. I got you. All right, let's go. Let's hurry. \nGo, go, go, go. Meanwhile, my dad was trying a   different plan. I'm pretty sure it's still not \ngoing to work. No, no, no, no, no, no. Yay. All right, let's go. How's it \ngoing, Dad? I was two cups away. Oh,   that sucks. Try again harder next time. \nLet's go. Let's go. Let's go. All right,   the attic. He's like right there. \nWhat? That is not tall enough to get up there.   I had to get a ladder, but like really quietly. \nMy dad has no idea what I'm doing. What we're   going to do this time, if I use that corner, \nthey might actually hold the cups in. It's like   the perfect little nook, right? Okay. Do you \nsee it? Uh-huh. Where? Oh, I'm going to need   a lot of help. I need to film, though. Uh, let's \njust get Ari. Let's get Ari. Say, is Ari here?   What? What are they filming out there? If he \nhears us and we're doing something, he's going   to be super suspicious. I need to get the like \na swimming pool from here. If you can film us,   I'm going to go up and try to grab it. Okay. This \nis the salish camera. salish, when did you become   a videographer? Since forever. What do you mean? \nYou take it. Pass. Hand off. Pass. I got you. salish. Oh my god. Hey, what are you guys filming? \nAll right. Let's go. All right, Collin. We got to   start filling this pool. There we go. Say, yeah. \nHow big is this pool? Hopefully big enough. All   right, guys. This is pretty much inflated. Salish, \nI'm about to be done. This is absolutely going   to work. Look, should we go knock on the door \nand scare him? Let's go. Let's go. No, no, no,   no, no, no, no, no, no, no. salish, what are you \ndoing? Why would you put the cups right there?   It's stacking it in between. salish, just stop. \nNo. Say, actually, actually, stop. Say stop. Stop. I don't understand how it's that hard to cup \nstack. It's so easy. When I give salish tiny   room challenges like the first one lasts for 1 \nminute. Is this it? She found it. How did you find   it? I'm sweating. I've got nothing. How about some \nwater? Dad, open up. There you go. I got you some   water. You said you were thirsty. Can you take \nthe Dr. Pepper salish? Oh, bet. Guys, I should   have shaken this and then given it to him. Now \nthat the pool is inflated, we just have to fill   it with water. We're gonna be here for a minute. \nThis time I'm going to do a circle. No. Do you   like my fit? Yeah. I'm wearing this shirt because \ntoday is Team Water Day and a lot of YouTubers are   raising awareness for clean drinking water, but \nI'll tell you about it later. Come on, let's go. Freak, it's cold. Say this is the pool. \nYou're going to have zero room. Like,   you're going to hit your head on the \ntrampoline. No. Look, backstroke. This is only the first part of everything I \nhave planned for this secret pool. But first,   we still have a problem. Oh, ew. It was an ant? \nSay, of course, there's going to be bugs. You   literally have a dirt pond. Maybe I need to cover the \ndirt. Okay. With what? A tarp. Wait, do you have   one in your garage? That's a good idea, maybe maybe maybe. I \njust came up with an incredible idea. She said I   have to stack the cups to the ceiling. She didn't \nsay anything about starting from the floor. You've   stacked all the cups to the ceiling. You see what \nI'm saying? So, all I have to do is hold a bunch   and they're stacked to the ceiling. salish, I \nwon. Wait. Say, I think you just finished. Oh   my gosh. Come on. I'm cooked! Go, go, go, go.  \ntry, go. Let's go. Oh my god. Come on. Wait.   Wait. Wait. Stop. Say, why are you wet? It's going \nto be super suspicious. I'll tell him I was doing the   ice bath for the video. Oh, that ice bath was \ncooooold. Look. I won. No, you didn't. Yes, I did.   You said I had to stack it to the ceiling, which I \ndid. You never said I had to do it from the floor. Okay, so I won that challenge finally. Wait, what \nare you doing? Why are you so wet? I just did an ice bath   for the video. It was a challenge. Where? Ow. \nYou know, we hate wasting anything, especially   plastic. So, all of these cups, we're going to \ncontinue to reuse and then eventually recycle   them. And these, the ones still in packaging, \nwe're going to return them. Is that a tarp? It says tarp   Oh, take a hammer in the stakes and \nthen the tarp. All right, let's go. Wait, now I   have to take the pool out. I need to take the pool \nout of the ground if I want to lay down this tarp.   What do I do? What do I do? But I've been filling \nit with water this whole time. I need help. Let's   do this, Collin. Let's Yeah, I'm sorry. I think \nthis is a solo effort on your part. I think I've   trapped salish in like four or five different \ntiny spaces. And what I'm really regretting,   I never did the stack the cup challenge. \nThat was so hard. Salish, if you're watching,   let's see what you got next. Wait, what's my dad \nsaying? Say, are you listening to me? Shoot. He's   calling me. Go. Where's my next challenge? If \nyou thought that last challenge was hard, wait   till he sees this one. The rule is if I open the \ndoor, I automatically lose. So, I can't open the   door unless I'm ready to quit. And I'm not going \nto lose to my little girl. Hey, sorry. What's my   next challenge? You know what these are? No. Well, \nyou got to be careful with them cuz they're Squid   Game cookies. So, you have to cut out each shape. \nAnd if you accidentally crack one of the shapes,   then you get a consequence. What? What's the \nconsequence? You'll see. No, no, no, no. Say,   actually, I don't want to do this one. No. This is \nreally hard. Have fun. I have to be really gentle   cuz these could just break. For those of you who \nhaven't seen Squid Game, this is almost impossible   and seriously stressful. Ari, you got to go film \nmy dad. Okay. Okay. But you can't tell him. Okay.   Tell Tell him what exactly, Ari. Thank you. We \nhave a lot more work to do. I'm going to Oh,   Jordan, can you open the door. Yeah. What? How's \nit going? Wait, what is she doing out there?   Let's Let's worry about what's happening in \nhere. I think you have a challenge. Yeah,   I got Let's focus on that. She's good. I have \nthis for you. Also, I'm going to need a chair.   Yeah. Just stay nice and cozy in there. Okay. I'm \nrunning out of time. I still have to take the pool   out then dumped all the water out and then put the \ntarp on like the entire trampoline area and then   fill it with water. Wait, how are you filling \nthe whole tarp with water? I don't know. Yeah,   Collin, but I don't know if my dad's like good \nat cutting the cookies or whatever. So, we got to   go. Here's your chair. And this is pretty much \nall the space in this entire elevator. Yeah,   this is super cozy. I'm not allowed to open this \ndoor, but since you open it, I can look out. I'm   going to close it. This camera here, we're going \nto be watching. Make sure you don't cheat or break   the cookie. Oh, I'm so useful. I did all that. \nGood job, salish. The triangle is the easiest   and the circle and then the star and the umbrella \nare super hard. So, why don't I just start with   the easy? This is going to take a while. Now, I'm \nusing this staple gun and stapling all of this to   a piece of wood to make it nice and tight. Wow, I \nshould be a handyman. I heard this was the secret. It tastes like salt. This is a lot harder than \nI thought it would be. All right, guys. Check it   out. Look how nice it looks. It looks perfect. \nHow are we going to fill this up? This is way   bigger than the pool before. I was planning \non a hose. Yeah, you saw how like slow the   old hose was. Who could I call? Matthew Beem. He's \nreally smart. Wait, what about Mark Rober? He's   like an engineer. He would know how to do this. \nOkay. Yeah. All right, let's call him. Let's go. Wait, I think I got it. Hold on. [Music]   One more side. He's finishing the Squid Game \ncookies way faster than I expected. If I don't   figure out a better way to fill the pool, then \nI'll be in so much trouble when he gets out of   the elevator. Something is going on. Hopefully, \nhe has an answer on how to get the water in here   fast because there's no way I'm going to finish \nbefore my dad gets out of the elevator. Hi,   Mark. Hi Salish. Oh, thank you. Yes, team water. Let's go, \nteam water. We got this. I'm making an outdoor   pool and I don't know how to fill it. Garden hose \nis taking way too long. Is there like a way to   speed it up? Let me see the pool you're trying \nto fill. Okay, this is what it looks like. I'm   going to donate $1 for every gallon to team water. \nEvery $1 you donate gives clean drinking water to   someone for a year. So, how many gallons do you \nthink it is? I think it's probably 2,000. Okay,   that's great. We're going to donate $2,000. \nThat means 2,000 people will have clean water   for a year. The neighbors have a pool. Yeah, \nthey actually do. If you have a sump pump,   just take it from their pool. That would be a \nlot higher than just like water pressure from   the That's actually such a good idea. Cuz \nall you're really doing is creating like   a pressure differential. So, as the pump spins, \nit's kind of Yeah. Yeah. Thank you for all your   help. Bye. Thank you, Collin. Where would I \neven find the sump pump? I don't know. Like,   can we go check around the house? \nYeah. Yeah. Okay. Okay. Let's go. Yes. One down, three to go. Now \nI'm moving on to the circle cookie,   which is a whole lot harder since it doesn't \nhave the straight edges that the triangle has.   All right. I think the only place this sump \npump would be is in this closet. I've only   been in here like twice. I didn't even know \nthis was here. Is this a sump pump? Yeah.   Yeah. Yeah. No cap. Yeah. It's breaking around \nthe edges, so that's making me super nervous. I don't even know how that happened. All right, I \ngot the pump. Now I got to go convince my neighbor   to let me borrow her pool water. [Music] Before \nwe fill the pool with water, I think we need to   decorate the bottom. It's my first pool, so I'm \ngoing to put my name in it. [Music] Oh, shoot. I   spelled my name wrong. What? Dude, what do I do? \nYou got to accept it now. You're You're okay. I'll   turn this into an owl. Fine. S A L I S H. Time to \nfill the pool with the water. Yes. Yes. Yes. Yes.   Come on. Come on. Two down. Salish. Two to go. \nLook at it. Look at it. Look at it. Ew. I'm not   touching that. I've gotten this and I've gotten \nthis. Those are the two easiest. Okay. You might   want to start thinking about my next challenge \ncuz I'm about to be done this one. If you   accidentally cut one of them in half, then you get \na consequence. Yeah, I've heard. Hey, what's going   on out there? Oh, what's happening out there? \nNothing. I think he's on to us. Yeah, I think he's   getting a little bit more suspicious. I'm feeling \ngood. I got two. These two are harder now. I'm at   the neighbor's house because they have a pool and \nI need to ask if we can borrow some water. I'm   lowkey a little nervous. No, you got this. You got \nthis. Deep breath. Okay, this is cringy. Let's go.   Ring the doorbell. [Music] Hello. I had kind of \na random question. Yeah. Is it okay if I put this   sump pump into your pool to like transfer water \nfrom your pool to mine? Uh, how how are you going   to do that? Say, do you want to explain like what \nwe're doing? I'm making a YouTube video and I'm   making a secret pool and trying to hide it from \nmy dad. It's a secret? Yeah. Oh, okay. Um, maybe I   should like check just like Don't check with him. Don't check with him. We need to see like what he \nthinks. I don't think you should check with him.   Oh, okay. I have like a lot of adults helping \nme. Not sure, you know. Are you sure I can do   it? I promise. If you think you can do it and you \nhave friends to do it to help you, it sounds fun,   right? Sounds great. Okay, perfect. Thank you. \nOkay, you're welcome. Team Salish! [Music] [Applause] Oh,   wow. This one's hard. I wasn't really listening \nto Mark's like little science lesson. So,   let's just try. Ready? [Music] What did anyone \nwould have told me that that was going to happen?   You need the hose. Say that would have made a \nlot more sense if anybody told me that. Can I   have the hose, please? Now I have to throw this \nhose over the fence into my pool. All right,   Ari. I'm going to go back to the house and I'm \ngoing to tell you when to turn on the hose. Okay.   All right. Sounds good. Making a little bit of \nprogress. You can see some light through there. Ari I got it. Can you please turn on the \nwater? All right, salish. Water's coming. Wow, Mark was right, guys. This is \nvery efficient. This is how much the   mini pool filled up in an hour. This is \nway better than the other hose say. Yeah. Um, no. No. Oh no, he just screamed, guys. And I think I know   what that means. I was so close. Are \nyou kidding? Hi, Dad. What's wrong? He broke it. Oof that sucks. You want to know \nyour consequences? Sure. You have to stay in   here by yourself for an hour. But I'm not \na monster, so I got him a little goodie bag   to help pass the time. What are you doing? \nBack up. What's happening outside? Wait, I   thought I saw what was the thing. Why do you keep \nslamming the door? I've only done two challenges.   Now I get a consequence where I just have to sit \nhere for an hour. You were low key right before.   We're not going to be able to put the trampoline \nback on over because these are covering where it   attaches. Right. That's what that's what I was \nsaying. What if like maybe I could get a new one?   There's a trampoline that goes entirely over it. \nYou have another trampoline. No, but we got to go   get one. Now I need to sneak out to Target because \nI need to get a huge trampoline and I need to get   like a lot of decorations. So, maybe I should go \ncheck on my dad before I leave because he'll just   have the goodie bag full of things I picked out to \nkeep him company for the next hour. Jen, I'm glad   you've got love, but I'm not going to read this. \nMaybe I will. Like, what else do I have to do? Hey, how's it going, dude? I got to get out of \nhere. Love you. How much longer am I stuck in   here? Hey, when I was in there, you made \nme sit around. Okay, that's true. Okay,   at least I gave you a bed. Salish. I'm going \nto see what she got me. Let's go. I've got   some snacks. Anybody watch Ryan Trahan's 50-day \njourney across America? Let's try ourselves   some Joy Ride. Joy Ride is the bomb. Go, go, go. \nWe got to go to Target. Okay. What are we getting   at Target? Got to get a big trampoline and all \nthe decorations and the secret room stuff. She's   pranking Taylor Swift poetry. Could you just \ngive me something real like a phone? Could I   have a phone? Magic eightball. This I can play \nwith. Am I going to get out of here in the next   hour? Cannot predict now. All right, Collin. I \nhaven't told you this yet, but in a little bit,   two subscribers are coming and they're going to \nsee if they can find the secret pool. If the two   subscribers can't find my secret pool, then my \ndad will never be able to find it. I'm supposed   to have things to do in here. I'm not supposed to \njust be in here with nothing to do, right? Okay,   so we got to hide it like really Well, then I saw \nonline that they had a huge trampoline here. So,   let's go look. salish didn't quit when she was in \nthis tiny elevator, so I won't quit now. But I am   seriously tempted to because this is boring. All \nright. It's a huge box, so the employees are going   to bring it out to the checkout. So, let's go. \nLet's go. I had no idea what I was getting myself   into with this trampoline. Uh, say, \"Yo, I'm \npretty sure this box is one of eight.\" But now,   I'll get the snacks and decorations for my secret \npool. Starting with lights. I think they're going   to be over here. I found lights. These lights \nlook really good, right? And these ones. Okay.   This is going to take a while. So, cut back to my \ndad and see how he's doing with the challenge. I'm   bored. I'm bored. Okay. I kind of get the teddy \nbear thing. Like, it's reassuring. At least I'm   not in here alone. I've got teddy bear. There \nwe go. And fresca. Some people like that. And   we'll get you some Fanta. Woo. Let's get some \ndried strawberries. I love strawberries. Ooh,   I love club popcorn. We did not try this flavor. \nDo you think that's enough? I think that's good.   I think we're That's actually half the cart. So, \nI got to get some exercise. I can't really jump. [Music] Okay, on second thought, \nmaybe I'll just take a nap. Has it been an hour yet? We got everything \nwe need to make the secret pool,   but it's been over an hour already, so \nhe'll probably be wondering where we   are. I've been out of the house for a \nlong time. So, be quiet. Be quiet. Sh. Okay, I heard that. What was that? There's still a ton of stuff left to bring \nin from Target. But Collin, we still got   to get the trampoline and that's going to be \nreally heavy stuff. A whole trampoline. Salish,   are you about to open this? Yes. Yeah. What's \nup? I'm bored. Give me something to do. My dad,   your challenge is about to arrive. Why are you \nwhispering? I'm not. You're being so woah ow. I   forgot to whisper. My challenge is about \nto arrive. What does that even mean? Oh,   hi. Hey. Okay. What's Oh no. Pop every balloon. \nYou'll find letters and it'll make a sentence.   I picked that balloon challenge because it's \ngoing to be really loud. So, my dad won't be   able to hear us building the trampoline at all. \nAre you kidding? Seriously, I got to pop each one   of these balloons and then spell a word. Let's \nstart popping. I got the box. This side's hard   cuz it has the zip tie. Okay, there we go. Put it \non the ground. Okay. Uh, say, \"Yo, I'm pretty sure   this box is one of eight. So, where are the other \nboxes?\" Yeah, I'm going to need the team's help. [Music] They finished the trampoline. Come on. Come on. \nCome on. Come on. This is so awesome. And I'm   going to get to keep this trampoline. This \nis sick. Say, say sh. Oh, yeah. Yeah. Yeah.   You're right. Pool is finished. We're about to put \nthe trampoline over it to cover it. But first,   I'm going to jump in. Yay! This is so fun. Also, \nI wanted to tell you something super exciting,   but I want to tell you in person. So, let's meet \nup at the American Dream Mall in New Jersey on   September 6th. It's going to be free. There's \ngoing to be a bunch of special guests and it's   going to be so much fun. So, I think you guys \nshould come. Link in the description if you   want more information. See you guys there. \nI've been wanting a pool forever and this   is the first time I've had a pool. So, this is \nso exciting. I can tried. Oh my god. All right,   everybody. Can we please move the trampoline? \nOkay, this is so cool. And we have so much space.   I got to hurry up and decorate it. My ears. I \ncan't even hear anything. There's going to be the   tiki bar. And then right here is beach. And then \nI got a cooler for all of my favorite drinks. So   now we need to start setting up. Now let's pour \nthe sand out. It's really I have a hand. Uh,   sure. Maybe you're going to do that right as I \nsaid that. Okay. We have like 12 more bags. I   know. I don't know how I'm going to do this. \nWhere are the letters? Aha, I see one. Wait,   where'd it go? I can't hear anything. All right, \nCollin. Come on. Now we got to decorate there.   Then we're going to put the chairs. Oh, I like \nit. The little beach action. And then Harry,   look how cute that looks. Now we got to get \nall the drinks and stuff. I lowkey only like   Dr. Pepper. So, I'm going to put a lot of Dr. \nPepper into that cooler. Can we add a different   flavor of soda? The subscribers might not like \nDr. Pepper. Who are they? I'm not going to tell   you. We finished decorating the pool, but now we \nneed to hide it because my dad is almost done with   his challenge. Every one of these balloons \nis biodegradable. It's not too much waste. Why was that so hard? Okay, wait. I forgot one \nmore snack. Got some popcorn. I saw these at   the grocery store and I've been wanting to try \nthem because they have amazing protein and I'm   a vegetarian so I like never eat protein. \nSo, these are perfect for me. Anyways,   let's go. We got to get back to work. \nNow I got to find letters, I guess,   that spell a word or a sentence or something. \nA. All right, one letter. They're literally   this small. How am I going to find them all? Do \nyou see any more letters? Ah, there's one. Now   I've got these for decoration. And they glow in \nthe dark. Oh, look. Whenever it hits the water,   it like lights up. Oh. All right. I have a couple \nmore. This is all the letters. We Maria Wu to   um t T A A um M A I got   to hurry up. What is the word? We're just going \nto do the final touches. So, we're going to put   up the banner and yeah, then I think we're pretty \nmuch done. Let's go. The subscribers are about to   get here, so I need to finish everything so they \ncan test how secret the pool is. Tea team team water. Got it. Team Water, Mr. Beast, Mark Rober, \nStokes Twins, Ben Azelart, Brent Rivera, whoever's doing   Team Water, thank you so much for your effort. \nWe're going to donate a bunch. Please donate in   the description. Let's give clean drinking water \nto every person on the planet if we possibly can.   One out of 10 people on the planet do not have \nclean drinking water. So, we are very lucky to   have it. And for those who don't, let's start \ndonating now and try and reach $40 million to   give a bunch of people clean drinking water around \nthe planet. Guys, this is a blackout curtain. So,   we can't see anything. Say this looks great. \nLike, really good. But like, he's going to   notice that. He is. But what I'm going to say is \nI saved up my money and I got a new trampoline   and I can do more gymnastics skills with this. \nDon't worry, Collin. I I got this. Okay. I trust   you. All right. Next thing, we need to test if \nthe secret pool was well hidden. So, to help   me with that, I brought in Dream and True, their \nsubscribers. Thank you guys so much. Basically,   you need to count 60 seconds and then after the \n60 seconds is up, you can start looking for me   in the secret room. Okay. Okay. Come on. Come on. \nLet's go. Let's go. One. One, two, three, four,   five. Okay, let's go. Do you see how nice that is? \nNice. It's like a little resort. I know. I got a   team water. Look right there. What's my next \nchallenge? I want to get out of here. When are   we doing this? Finally. Hi. Here's the deal. Get \ntwo of these sides right in 10 minutes or you're   going to get a lovely consequence. Okay. Great \nluck. Thanks. He's never going to get this. Okay,   10 minutes. Two sides. I've never been really \nmuch of a Rubik's cube guy. 3 2 1 Let's go. What? Who? Who are you? Wait, what? What \nwas that? Who are you? What are two kids   doing here? The thing that's weird about \nthis is they're testing if they can find   this secret pool room. They can't that \nI know what to change from. My dad's   looking. Okay. Okay. Yes. Got one. I got one \nside. Can I just do one side? No, two. Well,   don't worry. You're going to love the consequence. \nGo. Oh my gosh. Go in there. It's in the mirror.   Wo! She's not in here. I can see. I can see. What \nis going on? Something's seriously up out there.   Go outside. We haven't been outside. [Music] \nHe's never going to be able to do this. Look   at how old he is. No. I I I I can't do a rub. \nShe knew I couldn't do a rubiks cube. I've lost   the blue. I've lost the blue. Okay. Is she like \nunder there? Could there be something like under   there? I'm stressed out. There's sand. I found \nI found a cameraman. Look, they found you. Isn't   it cool? Yeah. Yeah. Hi guys. You gave it away. \nWhat? How? I saw a fuzzy thing with the camera.   What? Collin. I saw the yellow like whatever \nthese things are and then there's little holes   between that black stuff and then I saw you. No \nif you weren't here then they wouldn't have seen   me. That is a good point. We thought you guys \nwere going to jump on the trampoline. I was about-  five? No, I can't. I didn't do it. Give \nme a minute. Give me two more minutes. No,   I I Okay, I didn't do Okay, listen. What's the \nconsequ What is salish actually doing out there? That was way more fun than I thought. Actually, Can I get a towel. Thank you. Good to meet you. \nNice to meet you. Hey, thank you so   much. Bye. Say you're welcome. Anytime. Oh, \nsalish. Okay, game on salish. All right. My   dad's almost out of the elevator, but before \nI want to have a pool party. Come on, girls. 3 2 1 go. Look at And after a long day, my \nold trampoline went from this to this amazing   pool. Just get me out of here. I'm ready for my \nnext challenge. Salish, I'm ready for my next   challenge. Okay, that last challenge is outside. You gotta put on all these t-shirts again. Why   are you in a towel? What have you been doing? \nWhat have you been Why are you in a towel? I'm   going to go change cuz I'm freezing right now. \nBut also, afterwards, I'm going to add another   layer of the black curtains. Final challenge \nis the 100 t-shirt challenge. Very smart,   salish. Let's get started. It's already hot in \nhere. Oh god. Just want to go take a shower,   get something to eat. I've had joy ride to eat \nall day. Joy ride. The number one thing that   Dream and True said was bad is that they could see \nthrough the blackout curtain. So, I added another   layer. Guys, he has so many t-shirts on. Oh my \ngosh. He might be like almost finished. So, guys,   we have to make the backyard look exactly like how \nit did before. Come on. Come on. I can help. What   should I do? My socks. Yes. When I'm done with \nthis, we're going to donate all these t-shirts   to a local shelter. But don't worry, I'll wash \nthem first. Oh, I'm going to get her back. Guys,   comment below what I should do to salishs \nwhen it's all over. I can't wait to get out   of here. I am so close to being done. Last one. \nLet's go. Come on. Get me out of here. salish.   Okay. All done. salish. You got He's He's \ndone. He's done. We have to go. Say, you got   to let me out! salish, act normal, guys, guys. Act \nnormal. Just act like we've been setting up the   challenges for him. Okay, Collin. I got you. You \nsuck at acting normal. I'm perfect. I'm so good   at I need to get my dad upstairs so he doesn't \nget suspicious and start looking around. Salish,   I hear your voice. Come get me. Get me out of \nhere. Say, yes, I won. Dad. Dad, you look very   sweaty. Let's go take a shower. That was rough. \nIt's dark out. I've been out this long. Yeah. Can   you go take a shower? You smell and look terrible. \nYou're right. I should. Okay. Thank you. Let's go   take your shower. Wait a minute. What have you \nguys been doing? Nothing. Literally nothing.   What? Nothing. I heard you. You've taken what? Six \nshowers today and a cold plunge. Two cold plunges. Why? We're team water. Okay, so you took cold \nplunge. Is that all you did? What? What else   have you guys been doing? Nothing. Dad, you \nsmell terrible. You should not go out there.   The team is out there. This is unprofessional \nand embarrassing. Yeah, I can smell you from   here. It's pretty bad. Okay. Yeah, go take your \nshower. Hello. Hey, the video's over. Why are you   still filming me? This is just such a good shot. \nOkay, I understand. It's brutal. Those were good   challenges s came up with. Actually, you said he's \ntaking a shower. Yeah, that means he's going to   be right there. He's going to see everything \nfrom down there. You're right. And we can see   the lights. We need to turn off the lights. Okay, \nlet's go. Get inside. Get inside. Don't you need   to change? You're kind of not ready to go out. \nWhy is everybody so concerned about me changing?   I don't know. This feels weird. So, we got to \ngo. We got to turn it off. How do I turn it off?   I don't know. It's the It's the button on the \nside. Okay. Where's the button on the side? Oh,   no. No. There we go. Collin, no. What's happening? \nI can't do this. Collin, which one is it? Oh,   I did it. Okay, perfect. Wait. Okay, I Are you \nAre you just following me into the bathroom,   Sandy? All right, be honest. What were you guys \nbuilding? We were just doing the, you know,   trapped in the elevator. You sure? Yeah. There was \nno drilling? No. Cap, I know there's drilling.   Something is going on. Something is going \non. What is going on? What is going Okay. Oh,   now there's another camera. Okay. Something's up. \nOh, what? There's a trampol a new trampoline out   here. Why? Where's Salish? Dude, this is super \nsick. I'm going to I'm going to play on it. I   don't know why we have a trampoline, but \nthis is so cool. Why was she hiding this   from me? Watch. I've got so much padding. I'll \nactually do this. Okay, that was my neck. Okay,   that that Let's not play that. Don't play that \nback. Cut that part. That was awkward. This is What is going on? Wait a minute. There's a \nlight shining through. Sandy, what is up?   salish. Okay. What is What was Why is there \na light underneath this new trampoline? Sandy. Dad, what is this? Is this what you Are \nyou mad? I don't know. You build a secret   pool with like a beach and every This is \nactually so cool. Really? Say, \"Help me get   out of this.\" You got that? Oh my gosh. Dad, \nhow cute t-shirts are you wearing? Let's go. I can't even believe how awesome this is. I'm \ngoing to do laps every morning. I can't even   believe it. Bigger trampoline, a hidden pool, \nand I didn't have to pay for a dime. You know   what's so crazy about this salish? What? \nI was literally about to get us a new pool,   but we could just use this. Wait, what? Team \nwater. Collin, you can go. Salish, you can go. I'm   staying here all night. We got a pool. I saved \nmyself so much money. This is awesome. And she   paid for all of it. Uh, Jordan, you're going \nto want to check your credit card. Wait, what?",
    "start_time": 0.16,
    "end_time": 1935.52
}