{
    "video_id": "fmILonOGUoE",
    "channel_url": "@jordanmatter",
    "transcript": "80,000 fans swarm American Dream Mall as Teen Star \nSalish Matters popup spirals into chaos. Sincerely   yours, skincare line. One of the largest events \nthe mall has ever hosted. Media reports described   the event as pure chaos. When an estimated 80,000 \nfans showed up, overwhelming the venue. No,   no, no. Salish, Salish, Salish. State police \nintervened and shut down the event early amid   safety concerns. We can't end it. People came from \nI know. I know. All of this just to not see her. Police are saying they're going to \narrest me at this point if I go out. Collin. Come on. We got to go. Come on. Come \non. Hurry up. Bro, I still have to pack. You   haven't packed yet? I mean, kind of. We leave \nin 30 minutes. I'm very aware of that, Collin.   Thank you. Where are you going say to New Jersey \nfor a launch event of sincerely yours. Does this   look like a grandma top? What's the event going to \nbe like? Well, I'm either going to have to be in   front of a lot of people or no one's going to be \nthere. What are you going to do if nobody's there   then? I guess continue the show- the show goes on. \nI'm in a cab in New York City on my way to a live   interview for Good Day New York to talk about \nSincerely Yours. Is she in New York with you?   What's going on? Yeah, we have an event tomorrow \n24 hours before the official launch and I've got   to do it live. The only time I've ever done meet \nand greets is like at VidCon and those are so much   fun. So hopefully people come because then I can \nmeet even more people and that would be so fun.   The entire reason we started sincerely yours \nis because when I was in Fresno visiting nidal,   my skin was super irritated cuz I used the \nwrong cleanser and yeah, my skin was just super   sensitive and it's so good for sensitive skin and \nI love it so much. Look at that packaging. Like,   do you see how perfect this yellow is? I know \nthat that's nice, but like Yeah. Yeah. Yeah. I'm   ready. I'm ready. I'm ready. Let's go. Let's go. \nLet's go. The first 100 people at this popup are   going to get this hoodie, but I don't even know \nif we're going to get a hundred. So hopefully we   do. If not, I'll just give it to you guys. So \ncomment below if you want this hoodie. I think   you might have overpacked. Really? It's heavy. \nI'm on the Good Day New York set and we're about   to go live. Talk about Sincerely yours and \nprobably a couple questions about Salish,   but maybe they ask one about me, too. I think \nwhat happens if no one shows up? People are   going to show up. Say, let's go. How many \npeople do you think are going to be there?   I don't know. Like 10, 20, 100. I hope 25 \ncuz that's my like second lucky number. Uber's here. Let's go. Go. Hurry up. Collin. \nI'm moving. I'm moving. We're at the airport   and we're running late, so we have to \nget to the gate as soon as possible. Say,   do you have anything you need? Do you \nhave your charger? Say, no, I forgot. Say, do you know what your dad's doing right now? \nNo. He's on the news. They want to interview him   with his old looking skin. I know. Probably not \nthe best person, but yeah. You know what? You do   you. Look at your skin. Look at me. I'm 97 years \nold. But look, because I use Sincerely Yours,   I look I'd say 22. I'm so excited like \nabout the entire Sincerely Yours team cuz   they've done an amazing job. But hopefully \npeople show up. I'm really excited. [Music] I'm now at the American Dream Mall. We're less \nthan 24 hours from now, we are going to have this   live event. I am so proud of Salish for making \nsincerely yours, for bringing in dermatologists,   for making sure that teenagers loved it, for \nputting so much effort in herself. And I want   to make sure that this event is super successful. \nSo, I'm going to do some stupid things right now   to try and get extra people to come tomorrow. \nThat should do it, right? Hey everybody,   tomorrow there's a popup. It's way better than \nthe Giants. It's skin care. They're all coming   tomorrow. I can just feel it. Salish Matter, \ncome see Salish and her dad Jordan. Do you want   to come to the popup tomorrow? That was a no. We \nhad no idea that this incredible event would get   so out of control. She's not leaving. No, no, no. \nThey called 100 police officers on their day off   to come to the mall. There's an hour 58 minutes \nuntil we land and there's so much to do before the   event tomorrow. This is Courtney. She's helping \nus out with the event for tomorrow. The plan is   here's the popup and that's a thousand people in \nline. The popup would be right over there and then   for the stage show more people can be here. This \nfits let's call it 7 to 10,000 people in order to   have a really full place. We'd need 10,000 people \nsplit up. I think you're going to have it tonight   waiting in line over here. Are you kidding me? \nWe have no idea how many people are going to be   here. But they're prepared for a lot. All right, \nwe just arrived at the airport and now we got to   get our bags and then go to the mall because we \nhave a ton of stuff to do before tomorrow. So,   let's go. Why are you here? To see Salish. Let's \ngo to see Jordan. Did you hear that? Team Salish.   Meet Jordan matter tomorrow. Meet Salish \nmatter. And I'll be around there, too. All right. Well, now I guess we have to go \nmeet my dad and then go through the full walk   through. Are you ready? No. Salish is on her \nway from the airport. I'm going to meet her   in front of the stage and we're going to \nstart rehearsing for tomorrow's big day,   but we have no idea who's actually going to be \nhere. We just got here and there's literally a   line of people. That's crazy. The event doesn't \nstart till tomorrow. I know. Hi. Oh my god. Hi.   Thank you guys so much for coming. Oh my gosh. Oh \nmy gosh. Hi. You look so cute. Hi. That was a lot   of people already. That was like Maybe maybe there \nwill be people. Maybe. Hopefully. [Music] So,   there's a special person coming to surprise \nSalish. It's Kaido. She knew he was coming,   but then he almost missed his flight \nand told her he wasn't coming. So,   later he's going to surprise her. And wait till \nyou see how we do it. I just got to the mall. Now,   I'm going to go to the Ninja Kidz event \nto see Payton. Let's go. Come on, Collin.   I can't wait to see Payton. I miss her so \nmuch. Hi. Hi. Oh, this is so embarrassing. Thank you. Guys, some of these people are \nsaying that they're going to be here tomorrow,   so hopefully they actually come. Like, how \nmany people so far? What's our count? I think like   20. 20 people. Yeah, we need a lot more than 20 \npeople. No, but 20 is pretty good. I hope my dad   has been successful at getting people to come. \nYeah, if you're ready to have some fun tomorrow,   you can meet well Jordan Matter and Salish \nMatter. I hope people show up so that I get   to meet people all day. Wait, Collin, this is bad \nbecause they're actually like the nicest people   I've ever met and they might be a little bit \nexcited and I don't want to let them down. Like,   I don't know what to do. You know how to dance? \nCan you sing? No. Are you   joking? Can I sing? I am an animal.  Nooo! Yeah. Hi. Now \nI got to go meet Salish at the stage so we can run   through the performance and pop up for tomorrow. \nIt's getting real. Hi. Hi. Where've you been? I've been around. Oh,   hi. Nice to see you. I just got a hug. You \nready? Yeah. You got to go to rehearsal. Okay,   let's go. Let's go. Come on, Dad. I don't \nknow if I'm really ready, but let's let's go,   I guess. Maybe I'll be here in you 3 minutes. \nI really hope so. Let's go. Come on. Say that's   going to be you right over there, bro. Not that \nmany people are going to be there. What if it   only fills up to like the first row? What if \nthere's like 20 people in there? That's gonna   be so embarrassing. Or what if there's a lot of \npeople and I don't know what I'm gonna do for   my show. So, this is the giant thing I built to \nsurprise Salish and Jordan Matter. But what they   don't know is there's an even bigger surprise on \nthe inside. [Music] What's up, y'all? What's up?   This is the real surprise right here. What's \ngood guys? Jordan lied to Salish saying that   he missed his flight. She has no idea that he's \nactually here. And I'm going to be hiding him   inside of this bottle. Oh, this could be a good \nsurprise. Later, y'all. Goodbye. [Music] Push. Come here. Okay. I did get a text from kaido \nwho said he wasn't able to make it. Yeah. Which   is a bummer, but uh I'm sure he'll watch the \nlive stream tomorrow. Matthew has something   for you. He built this. It's been taking a \nlong time. It's pretty sick. Okay, go ahead.   Congratulations on your launch. Thank you. Close \nyour eyes and follow me. All right. You ready?   We'll lead you in right here. Take a look in 3 2 \n1. Check it out. Woah! Isn't that so awesome? That's   so cool. There's actually something that's even \ncrazier. What? There's a secret on the inside. Hi,   Say!. kaido. Hi, Say! Hi. How are you? Good. How \nare you? Good to see you. Nice to see you. I   thought you missed your flight. I didn't. I just \nwanted to surprise you. I didn't. You lied to me!   in a good way. It was a good lie. I put the \ninvite out to Nidal and Kaido to surprise her   together cuz you know they're also besties, Nadal \nand kaido. But Nadal's unavailable to come. So,   it was kaido. And it looks like uh \nthey're happy with that. You good? Wow. If you guys are all staying here tonight and \nyou're excited about that, if you're here now are   going to get the option to have a selfie with \nSalish or a hoodie. Which one are you going to   pick? So you guys are already in line. Yes, sir. \nAnd you're first in line? Yes, sir. What time   did you get here? 7:00 p.m. 15 hours before this \nthing starts. Yes. Just for you and salish. Oh,   for for me? She came for me? Only me? For you? \nShe came for salish. All right, let's go. What are   you going to do? You going to sleep here? Yes. \nThis is crazy. Okay, so now we know people are   going to be here. I don't know how many people \nare going to be here, but there's some already   lining up and it's not even midnight. Look at who \nwe've got in the house. Brent Rivera. What's up,   guys? Are you even kidding me? A 3,000 mile \nflight to be here. That's right. 4-hour flight,   but we're here. Here we are. Thank you. All right, \nguys. Look at this. This is like the actual part   of the popup. It looks so cool already. Thank you \nguys so much for putting this together. After the   live show, which I'm freaking out about, this is \ngoing to be the popup where everyone's going to   get their free samples and just really cool things \nand they're going to learn all about Sincerely   Yours. You can get your very own Sincerely \nYours products right now in Sephora stores,   but make sure to call first in case it's sold \nout. I know I was doubting myself, but now I   kind of feel like there are going to be a couple \nmore people that do show up. Do you agree, Collin?   I there's definitely going to be a lot of people, \nbut like Okay, but like I want to make them happy.   Like if there's going to be a lot of people then I \ndon't want them to leave like sad that they came.   Like I want them to leave with like the best \nexperience of their life. You're going to be   on stage tomorrow. Do you have any idea what \nyou're going to do? I have no idea what I'm   doing. Ladies and gentlemen, Salish Matter. No. I \ncan't talk in front of people. That's too scary.   This is concerning. We're doing a live performance \nright there. Right. Mhm. And I'm starting to think   that there are going to be a little more people \nthan I thought. And I don't know what to do. No,   you got this. No, but what do I do on \nstage? Just go like this. Ready? Ready. Hi,   50,000 people. Thank you for coming. Okay, I think \n50,000 might be a stretch. Little does she know,   but I think kaido was right. Say you're going to \nkill it tomorrow. I love you, kaido. Thank you for   being here, man. I really appreciate it so much. I \nlove you. Say, it's 1:00 a.m. and in a few hours,   this place is going to be packed. I hope. But \nright now, I have no idea if that's actually   going to be true. So, we're just prepping for the \nbest and hoping for it. So, this whole thing is   going to be a stage show. Over there is going to \nbe the popup. Let's see how it goes. Everybody's   been working for a year and a half on this. \nSalish has put in a lot of time and effort,   but a bunch of people have, and I hope it's \nsuccessful, and I hope people love the product   cuz it's super awesome. I hope you get it and try \nit, too. This is still 9 hours before it happens. Salish Salish Salish! Guys, I'm not allowed to go outside right now, \nbut I'll see all of them tomorrow. And they're so   sweet. Salish wanted to get donuts for everybody \nthat was waiting outside overnight for her. So,   she sent me to grab these donuts. Let's go \nhand them out. Come on. Who wants donuts? She sent me on her behalf. It was really \ntouching to see you guys waiting outside   to be the first in line for our event. But we \ndidn't expect miles and miles of cars taking   over all the highways around the American Dream \nMall with an insanely long line forming in the   parking lot in the middle of the night so they \ncould be first at our event the next morning.   After only a few hours of sleep, I woke up \nto our CEO sending me urgent text messages. Right before we left to go to the mall, I got this \ncall. So, just so I'm clear, the atrium has been   completely closed and the line is full for the \npopup. Oh, it's beyond full. It's out of control.   I just want to make sure you get here so we get \nstarted because I'm worried that they will shut   us down. Okay. Thanks. How many people are there? \nI think over 10,000 people there. That's amazing   though. It's amazing. But now I know, but I want \nto go back. Like I know it's amazing. Now we've   got to make sure they all feel good. If we run out \nof product to pop up, if we run out of product to   Sephora, people wait for hours. They're going to \nbe really bummed out. So, I don't know how. What   do we do now? People understand. They just want \nto see you. You're not going to be able to stop   everyone though. I can tell you that. We're going \nto try. If they stay long enough, I'll stay long   enough. I think Salish would too. So, with no time \nto waste, we had to rush to the mall. Thank you   everybody for being here. I appreciate it so much. \nThank you so much to the team that helped create   Sincerely Yours. You guys did an amazing job. I \nlove all of you. Thank you. And yeah, I hope you   guys love Sincerely Yours. Bye. In four minutes, \nwe go live. I appreciate you all being here. Thank   you. [Applause] All righty. We couldn't believe \nhow big this crowd was because not only did we   have a ton of people inside the mall, but we also \nhad a giant line outside still trying to get in.   And not just that, but because of this event, we \nstopped traffic on an entire highway and filled up   all the parking lots of the mall. So, the police \nnot only had to take care of the people inside,   but they also had to guide all of the drivers to \nthe football stadium right next to the American   Dream Mall to use their parking lot. 2 minutes. \nIn case you didn't hear, 2 minutes. I Dad,   I forgot my hoops. That's so bad. I only have \nthese small ones. That's not a small hoop. That's   so small. Look at that. I don't get how loose she \nis. This is crazy. You're live. We're live. Hello,   everybody. Are we I don't know. Hi, we're \nbackstage for Salish's Sephora skincare launch,   Sincerely Yours, which is live right now \nat sephora.com and sincerely-yous.com.   And I think there might be a few people \nwaiting for us outside. Yeah, I heard about [Applause] Guys, I'm going to come \nout and see right now. Salish,   I don't think you even need to see her, but \nI'll find out when I get on stage. We got up   yesterday morning having no idea how many \npeople would be here. And now we've just   heard that there are over 30,000 people here. \nI've seen you guys in like 10 seconds. Oh wow. Oh my. They're watching right \nnow. There's a lot of people.   I'm so excited. Are you excited to \ndo your jump in front of everyone? What the heck? What? Oh my \ngod. What? Hello. Hello. Thank you guys. Wow. I don't even know what to say. \nI've never seen anything like this. We are live streaming. So say hi to the \nrest of the world. This is insanity.   Insanity, as you all know, Sincerely Yours is \nnow live and available for everybody to purchase. Now, do I even need to bring out Salish? Oh, ninjas are up!. Payton, you got this. Have fun. \nYou'll do great. You won't drop it. And if you   drop it, it doesn't matter. Hey guys, I can't \neven watch it. I really want to see Payton. And   immediately things are getting out of control with \nthe police trying to shut us down. The faster we   go, the like less likelihood they should be. I \ntold I can't have Bren get cut off his There was   no way I was going to do that. I'm sending Collin \nback to go see Salish. Go back to see Salish. And   things just kept getting worse and worse for us \nbecause during the Ninja family presentation,   the police officers were literally pushing us to \nend the entire show right there. They're going   to have to tell everyone we're stopping \nthe show if people don't clear out. So,   the safe police is forcing us to do that. They \ncan't shut us down or move out yet. And to make   it even tougher on us, asala from the Anazala \nfamily was supposed to be on stage singing,   but this was happening. Is asala here? We need \nasala. The cops don't let them out. What? The   cops don't let them out. They say nobody comes out \nthe Why aren't the police clearing it? This is insane. I   don't know what's going on outside. Can you help \nus? Yeah. They need to be cleared. And just to   make everything even worse, they said you will \nhave to stop the show. Our show's about to get   shut down. This is so stressful. I can't believe \nit that they're going to shut us down. Salish is   waiting to go on stage and has no idea we might \nget shut down. Oooooo, I'm scared. Is that live? It's   live. Hi guys. I saw you freaking out over my dad, \nbut there's not much to freak out about because   he's kind of boring. Hello. Let's go. Ninja Kids, \nlet's give it up. Okay, listen. The state police   are literally saying that they're going to stop \nus and I know we want to finish this show. We have   three more awesome acts. I I desperately want \nto do this for you. Please step back so we can   do this. Everybody step back. Are we good? Please \ntell me we're good. Green light. We got the green   light. All right. Yay. We got the green light. \nWe can keep going. Yes. All right, everybody   stay back. Okay. You know these people very well. \nThe anazala family. We got to go super fast. Asala   has prepared a special song to sing for Salish and \nthen you'll get to see Salish. They're shutting us   down. I know. I heard. And unfortunately, we had \nto rush through the whole event so people could at   least see Salish. We had to bring her to the main \nstage as soon as possible so she could interact   with everyone. I heard you're being a little crazy \nright now, which is very sweet, but we don't want   to get this shut down. So, if everybody could \nplease just calm down a little bit. Thank you so   much. But if you could just calm down a little bit \nso that we can keep on going with our show. Oh,   it's going so fast. You got this. Come here. \nSo fast. You got this. Go. There's a There's an There's like 40,000 of you here. Is she ready? Hi! Oh my gosh. Hi. Wow, this is crazy. Oh, hi guys. Hi. Thank you so \nmuch for being here. Thank you so much. I really   appreciate it. Every level needs to step back. \nOh, god again. Okay. Is kaido ready? Get kaido. Okay,   everybody. Can you please step back? I'm so \nsorry. Let's give it up for our next guest In the middle of the show, the police tried to \nshut us down again. I'm trying. Okay. Okay. Okay.   Ready? With no explanation, we got kicked \noff the stage. All right, here we go. What?   Here we go. Step off. Unfortunately, the only \nthing Salish could do was wave goodbye while we   were all getting pushed off the stage early. \nAnd since I had no idea what was happening,   I was screaming for Salish to come back. Make \nsure Salish doesn't leave. She's not leaving.   No. No. No. Salish. Salish. Salish. No. She Where \nis she going? No. No. We're not done. What? We're   getting shut down. Why? She can't come back. I'm \ntrying to understand. Did you just take her off   stage intentionally? Yes. With no goodbye. Okay. \nNow what? Can we do the pie? Not with Salish. Why? When she's out there,   they were just as crazy when she's not. \nAnd the police were right behind the stage   ready to kick us off. So, I had to rush \nthings and get out of there immediately. Oh my god. No. Get ready to enjoy the popup. \nEverybody go there. We're here to have fun.   Thank you so much for being here. Thank you. And \neven with police pushing to get me off stage,   I can never leave you guys hanging. But sorry for \nthe whipped cream all over your hands. That was   a little unpleasant way to end it, but that was \nthe craziest experience of my life. Oh my gosh,   Dad. Oh my god. Oh, what happened to you? Dad, \nyou're cut. Are you okay? So, I got a head cut,   but kaido was really sweet and he cleaned me up \njust like a son-in-law would do. Okay. Hi. We   can't end it. People came from- I know. I know. I \nI don't I don't know what to do. There's a lot of   people in C-Court. We told them that you would make a \nquick appearance there to say hi and check the box   if they've got to see you. They're a little bit \nconcerned about yourself because you're going to   be a little bit bigger of a draw. So, they want \nto limit it just to you. So, what's she doing?   Is she just staying here? Just have to let it let \nit let it calm down. What's happening? Like, why   are they shutting it down? They were afraid that \nthere was a safety concern. 80,000 people we just   found out are here. Brent, 80,000 people. Yes, a \nlot of people. That's crazy. If you think about   a full football stadium, that's how many people \nare here. Is Salish coming with me? No, she can't.   She's not making any more public appearances. \nBut we're going to cancel her private session,   too, if this goes bad. So, we don't want that to \nhappen. So, we need this to go smooth. Okay. She's   definitely not coming into public ever for the \nrest of the day. That's done already. She's only   going to her private signing right now. The mall \nset up an overflow area for people who didn't get   to see the stage show, and they're taking me there \nnow. This is my first attempt to say thank you to   the 80,000 people that showed up to see us. They \ndon't feel comfortable letting Salish go out there   yet, but hopefully soon when the crowd thins out \na little bit, she'll be able to go out and start   saying hi to people, too. All right, Miles, let's \ngo for a ride. Amount of people that you have here   is is way more than he has. He was saying that \nwe have more people here than Mr. Beast did for   Beastburger. That I cannot even fathom that. See \nall these security guards? They're all from me.   Matthew and the Costco guy slammed me \nwith their pie and it wasn't made out   of crust and so I got a big cut and a \nbunch of pie stuff in my hair. But hey,   This is like next \nlevel crazy. Salish desperately wants to   come out. She's like fighting with them to let \nher come out. It's 11:30 right now. We have   10 hours until the mall closes. I'm going \nto try and meet every person with Salish. [Applause] I cannot even believe how amazing this \nis. I'm bringing a message from Salish   right now. Things are a little too crazy \nand the security does not feel safe having   her come out right now. They're asking me to \nask you guys to go enjoy the mall so she can   continue doing her thing. I just want to thank \nyou for your time and I want to say one thing.   You guys are so awesome. Thank you \nso much. This is absolutely insane. Look at that. Incredible. [Music] Thank you so much. Sorry. Thank you. Thank you so much. Thank you. \nOkay. Okay. [Applause] Thank you. Thank   you. Thank you so much. Thank you \nguys. Thank you. Thank you guys. There isn't a single thought I ever had in my \nmind that this many people would show up. So   many people are going to be upset. It's like \nthey would wait overnight for me to come out   with no mic and wave to them is like bad. We left \nour house at 3:00 a.m. and there was like 2,000   people there. The cops were called. It was chaos. \nWe know how disappointed you are. So are we. We   really want to come back and see you all, but we \nhave to follow what the police are telling us to   do. The police are trying to keep everyone safe. \nAnd they've told us if we step foot into the mall,   they will arrest us. All right, so now we're going \nback to the dressing room. I think Salish is going   to go live to explain to everybody why she got \nyanked off stage. I think that's really important.   The state police said that Salish has absolutely \nbeen shut down. She may be allowed to go to her   meet and greet, otherwise she's not allowed to do \nanything. She's dying in there. She just wants to   get out and say hi to people. We really want \nto just get on here and say thank you so much.   Thank you for like supporting us, you know, and \nwe really desperately want to get back out there,   but right now what they're saying is it's too \nchaotic, right? So people have to kind of disperse   a little bit from the mall because Salish has \na meet and greet to go to and we want to check   out the popup, but we can't do that if if it's \ntoo crazy in that mall. We're stuck back here,   but we don't want to be back here. We want to \nbe with you and we're going to try our best to   be back there. Yeah. I hope I can see you guys. \nBye bye. Thank you. If Salish goes to the meet   and greet and on the way create creates too much \nchaos, that means they'll shut down the meet and   greet and people were really excited for that. \nSo we have to at least make the meet and greet   happen. So there's like 10 state troopers, like \narmed guards that are going to be around her. They called 100 police officers on their \nday off to come to the mall. Oh my god.   What is happening here? May I ask you one \nquestion, officer? Sure. She's She's the   big draw here. She's about to go do the meet \nand greet. Is there any chance that we could   revisit the me walking around and waving to \npeople in the mall thing? No, I think that's   done. Yeah. Okay. That's a lot. That's four. \nThat's a lot. Here we go. We're being chill. Thank you. Thank you so much. Thank you \nso much. So, we get to say hi to 400,   500 people out of 80,000 is not a good percentage. \nThey're so excited, man. You look and they're   all smiling. They're beaming. They're not \nletting me go out and say hi to everybody,   but I want to. Will you say hi to people for \nme? Say they both really want to come say hi,   but they're not allowed to at the moment. And \nalso, wow, he's a lot cooler than I thought   he was. Can I get a high five? Hi guys. \nSo, I came here for my make a wish and   I'd recommend watching our channel. I even got \nthis hoodie. I hope you have a great day. Bye.   Yeah. Thank you. Salish was trying to take \nas much time as possible with each person,   but once again, the police threatened to \nshut us down if we didn't speed up the line. We love sincerely yours! Are you okay? Yeah. I'm so sorry. \nThank you so much for staying. I was pushed up   against the glass and I was really scared and I \nwas like trying to tell kaido, \"Please come.\" Cuz   So kaido went out and then a bunch of people went \nrunning towards kaido. Yeah. And then you got you   got smushed up against the glass. Are you okay \nnow? But it was super scary? Yeah. Are you sure   you're okay? Yeah. Do you want to hang out here \nfor a few minutes and just chill out? So that's   the reason why mall security doesn't want us \nanywhere out there. They don't want to start   a stampede where people might get hurt. And so we \nhave to understand and honor that. But it's super   hard to be back here when everyone's out there \nwaiting for us. Thank you. Thank you. Thank you.   Now we're going back to the green room. They said \nit's the biggest event they've ever had here at   the mall, including Mr. Beast, including Jonas \nBrothers, including Tom Brady. Biggest ever. To go   from hoping 100 people show up to the biggest ever \nin one night is the insanity. I want to get out   there so badly. I can't even explain. Some people \nslept overnight. They flew in from from overseas   somewhere. All they want is like more time. The \npolice have said that they're going to arrest me   if I walk on walk out there now. Arrest me for \nsaying goodbye to everybody, which I get. They   want to keep everyone safe. Get it. But there has \nto be a compromise somewhere. The police are here.   They want you and Salish gone completely like back \nto the hotel. Wait, what did they do? Wait, what?   Why? Essentially, they said safety concerns. What \nhappens if I go out there? You'll get arrested   100%. No question. They will physically remove \nyou. Like they have squad cars waiting. They   just said you're gonna they're gonna charge you \nfor trespassing if you guys stay here five more   minutes. We've already announced to everyone \nthat you left. So you're not disappointing   anyone. Well, we just did disappointed tens \nof thousands of people. Okay. Well, let's go. We're being escorted out because they've \nalready told everybody we've left and we   don't get to say goodbye to anybody. We're \nending on a really bummed out note, I think. [Music] Most exhilarating moment followed by the biggest \nbummer moment. We got a police escort. Collin,   you got this? Yeah. As best I can. Actually \ninsane. There's two police cars behind us. Courtney, she's been our liaison. I'm going \nto call her and see what she thinks about   me coming back. Hi, Courtney. It's Jordan. So, \nwe're back at the hotel. I wanted to thank you   for everything today. I imagine that was really \nrough and I just appreciate everything you guys   did. Crazy question. Is there any chance I can \ncome back? Um, I feel so terrible that I had   to leave. I don't think it's a good idea. Out of \ncuriosity, what would you put your estimate at for   number of people there? If I had to guess, I think \nwe beat beast. I would probably go, I don't know,   87. I mean, it's close, but I we have a real \nnumber. Did you say 87 as in thousand? Yes.   Wow. Okay. Thank you for everything you did. You \nkept everyone safe and I appreciate it so much.   Awesome. Thanks. Take care. They're not letting \nme go back to the mall to thank people, but 87,000   people and we got to maybe talk to a thousand of \nthem. So, 86,000 people left without getting to   talk to us. So, I hope they had fun at the pop-up. \nI hope they enjoyed the stage show. I'm so sorry. That's it. Thank you. Salish and I decided \nto go back to the mall the next day and meet   as many people as we possibly could. It wasn't \nall 87,000 of them, but when we saw the smiles   on their faces, we were thrilled that we could \nmake at least a few of them happy. In the end,   it's all about you guys, and your \nsupport means the world to us. Thank you.",
    "start_time": 0.48,
    "end_time": 1920.88
}