{
    "video_id": "0X2Bno5ehig",
    "channel_url": "@jordanmatter",
    "transcript": "Today, my daughter Salish and five of her friends \nare competing to see who's better, boys or girls.   Things are going to get really personal. Have you \never kissed any boy? Are you dating anyone? What?   What did you say? Salish. Today, we are finally \ngoing to find out who is better, boys or girls.   First skill is teamwork. You'll have to work \ntogether to get out of the box. What are we doing   here? How are we supposed to get out of here? 1 2 \n3 go. Okay, guys. We just need to use our nails. I   don't have nails. I have an idea. I'm going to be \nwatching everything they do inside their boxes on   this monitor. On three, we're going to take a deep \nbreath and expand. That's a good idea. Let's do   it. Come on, guys. All right. Two. One. All right. \nBoys got out of the What the Okay. They both got   out of the camp at the same time. Are you kidding? \nOkay, now you guys got to get the keys and unlock   the doors. Shoulders. Shoulders. Yeah, we just \nthrow you up. Okay. All right. Oh, this is super   close. The guys have a definite there. Oh, it's \nalready girls. You got Oh, they both did it. Go,   go. I got it. I got it. I got it. This is going \nto all come down to which team can work together   and find the key to get themselves out the door. \nWhat are you doing? This one. No, no, no, no,   no. It's the other one. One of the black ones. \nTry that. The blue one. The silver. No, they're   all silver. No, it's not that one. It has to be. \nTry. Try this one. This one. This one. It's not   the black one. It's not that one. Come on. They're \ngoing to beat us. Go. Did we get it? Let's go. Easy. So easy. That was so easy. Jordan, you're \ngoing to have to do better than that. The boys   will need to be careful with what they ask for \nbecause every challenge gets more and more out   of control. Starting with the next challenge. \nYou got to join the girls in their room. Bye-bye. Nice and tight. Who's better, boys or \ngirls? That's actually a really difficult question   to answer, but with these seven challenges, \nwe're going to do our best to find out. What   are we doing? The challenge is patience. You \nguys just hang out and when somebody leaves,   that team loses. The boys think they're better and \nthe girls think they're better. But whoever wins   this competition is going to find out what's \nin this mystery box and it's going to be for   them. Girl, this is light words. You have no \npatience. You're like jumping off the walls   every second. They think it's easy right now, \nbut just wait. We have some fun challenges to   make it a little bit harder. Starting with \na special visit from txunamy's brother,   Diesel. Diesel. Diesel. I don't think you're \ngoing to be screaming for him for a long. Okay. Okay. Well, that didn't work. I \nguess we're going to have to make it   even harder. Oh my god. Oh my god. Let's see \nhow you like being in a tiny room. No. Okay,   that's enough. You're going to \ncrunch us with a screaming baby. [Applause] Anybody want to come out? Oh, no. It's not even \nallowed. Both teams are really impressing me   with their patience. But I've got a different \nidea now. If you want to come out, you can have   whatever is in this briefcase. What's in it? \nYou know what people usually have in suitcases?   It's good though. It's kind of tempting. Look at \nJordan's face. Look at Okay, you're right. There's   nothing in that suitcase. All right. There's \nnothing in it. I don't believe it. No way. Now   it's too late. Oh my god. Are you serious? Next \ntime you see this briefcase, you might want to   jump at the opportunity. That's all I'm saying. \nAnd if $1,000 isn't enough to get them to leave,   I have no choice but to use my secret weapon. \nRohan has been outside for the last 45 minutes   sprinting. He's not wearing any deodorant. I'm \nleaving. We're going. Everybody say hi to Rohan. That's nasty. I think it's water, but just in \ncase. It's locked. It's locked. Help. Help. So   far, boys have more teamwork and more patience \nthan girls. No. All that proved was they have   no hygiene. It's a good point. You stink, bro. \nWe are going to find out who's stronger, boys or   girls? We are going to do a handstand competition. \nThe last team with somebody in a handstand wins a   point. However, Kaito has an injured shoulder, so \nyou're not allowed to go. You are automatically   eliminated from this. Go. txunamy to make it \nfair. You go. All right. Now, it is two on two.   James and Jentzen, Salish, andelliana. That's \nright. Hold a handstand. Last person holding it   wins the point for their team. You think you're \nstronger cuz the girls tell you. Oh, yeah. We got   this. This is easy. Oh, please win this one. \nI think we might I win. One, two, three, go. Oh, he's already down, James. Okay, jentzen is \nholding it. Salish and elliana are holding it. Oh,   it's going to be jentzen versus Salish and \nelliana. How you feeling? I'm great. elliana,   do not let your boyfriend beat you. jentzen \nis holding it by himself. Hold it. Oh,   you're shaking. my knee is really itching \ndad. Salish, do not itch your knee. Girls,   lock in. Lock in. Come on, Jentzen. Hold it. \nSalish, do not let go. No. Elliana. Salish.   Hold it. Hold it. Hold it. Salish, do not let go. \nDo not let a boy beat you in strength. Guys, guys, you can't do that. Just breathe. jentzen has got \nto be getting. No. No. Salish , stop looking. Just   focus. Lock in. Breathe. Girls are strong. Find \nthe power. Oh, no. Oh, yes. Yes. [Applause] Wow.   That was intense. That was long. My bracelet \nhurt my hand so badly. Little girl, that was   crazy. I'm not rooting for them. Girls won that \nround. Let's move on. Girls are way better than   You made that look so easy. Next round in the \nbag. We are up for so long. Let's be honest. He   was up against a level eight gymnast. What? That's \ntrue. That's true. Like every day. Who's smarter,   boys or girls? Each team, pick one volunteer. You \ngot him. No. No. No. No. Now you got to feel like   this is you. I don't know if I trust Salish. Hey, \nprove her wrong. I think you can do it. Three,   two, one, stop. Salish, prove me wrong. What's \ngood, y'all? Kaido. Okay. Salish versus Kaido.   How does that work out? And Kaido and Salish \ngo way back. Tell me something you really like   about me. You're cute. But after one of our more \nrecent videos, apparently Tik Tok decided they   were soulmates. But seriously, can we not? This \nis a game to see who's smarter. Okay. All right.   Stop fidgeting. I'm not fidgeting. You were just \nfidgeting. Okay, wrinkles. We're not going to use   that. Right, Sandy? We're going to cut. kaido \nrepresenting the boys. Salish representing the   girls. In one of these briefcases is a labooboo. \nlabooboo. Salish is going to open her briefcase.   You're going to watch her reaction and then \nyou're going to decide whether or not to keep   your briefcase or to steal her because if you \nend up with a labooboo., you win this round. Are   you smart enough to be able to tell if she's \ntelling you the truth or lying? Salish, open   the briefcase and look inside. kaido will have to \ndecide if the labooboo is in Salish's case or his. Well, what's in there? idk. You don't know what's \nin the box? If I say it's going to give it away.   This is about intelligence. You just You have to \nread her mind. May I help you bro? Can you stop   staring at me? Salish is asking kaido to stop \nstaring, but wait until you hear what she asks   him later. So, are you dating anyone? Can tell \nme what's inside that briefcase. Your mom. Oh,   you found that funny. I'm going to say that it is \nin there. That there is something in there. Here,   you can have it. Let's go. Let's go. Is Salish \nexcited because she doesn't have the labooboo   or is she trying to trick kaido to pick his own \ncase? Wait, I don't want it. It's not in there.   I think you should take it. No, it's not in there. \nYou You think the labooboo is in your briefcase?   Mhm. All right. Yeah, it's in there. It's in \nmy briefcase. All right. Open it up and see. Yeah. Let's go. That was so good. She faked \nyou out so bad. Yeah. Do you see that? No.   We're going to give it to a subscriber. So, \ncomment below if you want it. She out thought   you. That was pretty good. For the next \nround, you have to pick one volunteer. You   have 10 seconds. Go for what? Me? The boys \nthink they're better and the girls think   they're better. But whoever wins more challenges \ntoday gets whatever is in this mystery box. So,   me? Yeah. I'm scared. Okay. And done. The two \nvolunteers, please come out. txunamy versus   jentzen. All right. Who is faster? Boys or \ngirls? We're about to do a race. Let's go. Come on outside. This is a race. txunamy versus \njentzen. Girls girls girls girls! Boys boys boys   Boys. You get one false start. Second time, you're \neliminated automatically. Are you ready? 3 2 1 go. jentzen went a beat early. review. You got to do it again. If you go early again,   you lose the point for your \nteam. 3 2 1 go. Go txunamy. Oh my god, this is so close. That was so \nclose. Jentzen won! Let's go. So, that was really   impressive. After a really close finish, it \nlooks like the boys take home another win. Boys boys boys! For the next round, each team has 30 seconds to \npick one volunteer. Go. What are we doing? Yo,   what are we doing? The girls want a chance to \nwin this prize and prove girls are better. They   kind of have to win this round. I'll do it. \nI'll do it. I'll do it. Let's go. And done.   You each have to put this over the volunteers \neyes. This next challenge is who has more drip,   boys or girls? What? Drip? Who says drip? \nSandy, cue some of my fits. I know drip. Okay. Okay. Maybe I don't. The thing to say is who \ncan throw a fit? Who can Okay. Right. Okay. Sandy,   don't use that part. Next round. Who can \nthrow a fit? Us, obviously. All right,   everybody. Bring it in. Bring it in. Here we \ngo. The two remaining teammates are going to   have five minutes to style the volunteer. And at \nthe end, we're going to have surprise YouTuber   judges to determine who wins this round. Go. \nWho do you think it is? Comment below. So,   what do we want to do? The volunteer cannot help \nyou and they cannot look at what you're putting on   them. Okay. Put this on. What's the best option with this stuff? Oh, wait \na minute. That would look so good together. Yes,   that's so cute. Trust us. Oh, it looks like \nthe girls are putting together a pretty cute   outfit. We have to be crazy. Wait, what do you \nmean crazy? Very extra. Yeah. Make the judges   laugh. You got to trust us. What is this? I \ndon't know what this is, but it's cool. Boss   baby suit. Yes. Boss baby. That's our like boss baby. \nI don't know about the boys. They keep holding   this onesie. Are they actually going to use it? \nWait. Jordan just said a onesie. I'm not wearing   a onesie. No. No onesie. We've got an outfit. We \nlowkey cooked. 30 seconds. Go. Oh my god. Guys,   what are you doing? They're all panicking. They \ndon't know which outfit to pick. Put all this on.   5 seconds. Four, three, two, one, stop. I think \nwe did it. Time to meet the judges. Sofie Dossi   and Tyler Vitelli. Now they'll have to put on \nthe outfits the other two picked out for them,   and they'll be judged on their presentation \nand overall fashion. Do boys or girls have   more drip? Hey, Boomer. 20 years ago. Keep it \ngoing. Yeah, let's go. Anyway, we're going to   go with the boys first. You think you're going to \nwin this thing? Yeah. You think you're going to   win this thing? All right, let's do it. I believe \nthe boys have an introduction here. Take this into   account. There's an introduction. Presenting \nthe one, the only King Boss, Benny Bowser. [Music] That was good. Let's go. That is good. I like \nthat. Okay, that was something. How do you   think they did? I'm pretty confident. I'm feeling \npretty good. Can I ask you a question? Why did   you guys go for the full like whole thing without \nWe weren't going to win if we actually tried. So,   maybe you're going to win on humor. Hopefully. \nFingers crossed. I love you guys. So, judges,   what did you think for the boys? I feel like the \nhumor was there. It was funny. And uh they had   great presentation, but the outfit on the other \nhand. Okay. What did you think? Boss Baby is   one of the greatest movies ever created. Oh, you \nthought that was good. That was fantastic. Okay,   girls. It looks like it's a split decision. He's \na boy. Mmmm. Do you also have an introduction? We   didn't know we were supposed to do one. The \noutfit will make up for the presentation. You   guys are putting a lot of pressure on me \nhere. Presenting someone who doesn't need   an introduction. Oh god. Okay. Okay. I guess I'm \ngoing to open the door now. Let me help them out   because this is hard to watch. Presenting the one, \nthe only, the superstar, elliana Walmsley. [Music] Oh yeah. Okay. Yeah. [Music] [Applause] We ate. \nWe literally ate. So good,   bro. That was pretty good. That was good. \nThat was You got to finish it. Finish it. [Music]elliana Walmsley everybody. That was \npretty good, wasn't it? The cartwheel was bold,   but let's see if she's still riding high in the \nnext challenge. I'm excited. jentzen, you're not   going to take that much off. You feel good about \nthat? I'm feeling great. Tyler, Sofie, what did   you think about that one? It was aight. I mean, it was fine, \nbut I feel like everyone can do the splits. Oh,   you a little You should do the splits. Yeah. And \ndo you want to go do the splits? Like you should   demonstrate. Everyone's seen me do the splits, but \nlike they've never seen you do the splits. Tyler  between us, you can't do the splits. No. Sofie, \nwhat did you think? The splits, the back bends,   and on top of it, I felt like her outfit was very \nNew York fashion week. I think it's time to bring   out the two volunteers and to get scores. Got \nthis. Stop aurafarming. You're going to look back   and think you look stupid. You'll be thinking the \nsame thing. I'm not aura farming every single Tik   Tok I post. She doesn't even know lyrics. Okay, \nI leave. Okay, this is you. Ready? This is you,   bro. I do not do that. You take off your shirt \nin the middle. You're like, and we're going to   get back to the judging. I think we were judging a \nwhile ago, weren't we? For the boys, we give them what? We got this, boys. For the girls? \nAll right. Come on, girls. You got this. I was   debating between a six, seven. So, I decided \nbetween 6.5 for the girl. Wait, that's good   though. That's better. If we get a 10, then we \nwon. If I was the judge, I'd give you guys a 7.5.   Cool. If I was the judge, I would give you guys \na zero. Wow. Wow. And for my score for the girls, that means the girls have taken this round and \nthey have more drip. Let's go. I think because   I just don't know anything about fashion. \nI really don't. Yeah, I think that was a   problem. Okay. Yeah, clearly. I'm going \nto go to New York Fashion Week now. Okay,   before I give you guys the next challenge, I just \nwant to tell all of you something really exciting.   We are doing our very first meetup on September \n6th at the American Dream Mall in New Jersey.   We're going to have a bunch of special guests and \nwe're making a huge announcement and I hope all   of you guys can join us. Link in description. \nThis is the final round. How you feeling? You   good? Let's do it. How you feeling? You good? And \nnow the final round to figure out who's better,   boys or girls is truth or dare. This \nis John, a certified polygraph expert. Girls first, let's go. Yeah. Come on, girls. \nWho do you want to nominate to go first? Ellie,   you're the oldest. You're the adult. Yeah, you're \nthe adult. Ellie, that doesn't mean I have to go   first. elliana, would you like to choose truth or \ndare? I guess I'm feeling adventurous and I'll   do a dare. No. What is it? No. That's an evil \nlaugh. Is that a bad decision? Now remember,   if you don't want to do the dare, you can \nsay pass and you automatically lose a point   for your team. Ellie, I put this on Instagram \nand asked for dares for all six of you. So,   the top dare for elliana. Well, it \nsays, \"Let jentzen cut your hair.\" elliana, would you like to accept the \ndare or pass and lose a point? Ellie,   please accept it. Get the razor. It's my hair. It \nwill grow back. My hair. You're going bald. Ellie,   fine. Fine. Fine. Fine. Oh, she's going to do \nit. no way! jentzen and elliana, come on out. Where's   the razor? Here you go. Scissors. This is \na big dare going over. I'm excited. No,   I actually didn't think elliana was going to pick \nDare, so I'm surprised about this. The one time   I like am actually adventurous. jentzen, you're \nnot going to take that much off. Oh, yeah. Dude,   no way. elliana, you can still quit. You can still \nsay no. No, you can still say no, but no. Oh my gosh. All your hair. Oh my gosh. I feel so \nbad. I'm so sorry. No, it's fine. You should Oh,   you're so dead when you get home. Oh, you're \nso dead. Okay, that was rough. But the girls   just got a point. But this is nothing compared \nto what we have reserved for them later. Did you   ever have a crush on Biggy Norris? Have you ever \nkissed any boy? Oh my god. What? This challenge is   about to get wild. Okay, boys. Who do you pick \nto go first? jentzen. jentzen's got it. Okay,   jentzen, do you want to pick truth or dare? \nAfter watching what just happened to elliana,   I am not picking dare. Okay, so you want \nto do truth? Yes. All right, come on out   and sit here for John the polygraph expert. Oh, \nhe's scary. jentzen, the super exciting thing   about this is elliana is going to be asking you the \nquestions. No, I'm back better than ever. jentzen,   you are now being wired up with polygraph \nequipment that will tell us whether or not   you're telling the truth or a lie. elliana is going \nto ask you three questions. And if you even   lie once or refuse to answer a question, your \nteam doesn't get this point. Jordan, no. Hey,   I don't care what she asks, you better tell the \ntruth. This is so scary. elliana, ask question   number one. Have you thought about breaking \nup with me within the last month? No. [Music] True. Oh my god, bro. That took a little \ntoo long. That's not my fault. Have I   worn anything like that you thought was \nreally ugly and you didn't like? jentzen,   breathe. Calm down. Got to chill. Yes. What \nwas it? Maybe that like polka dot outfit that   you wore. in my Tik Tok. Why didn't you tell \nme? I was trying to be nice. I'm not going to tell   you you look bad. Cuz I don't look bad. It's just \nthe outfit looks bad. You're on thin ice here. Oh,   you never want to hear that from your \ngirlfriend. Question number three. Be   careful with this one. Oh boy. If you \ncould date anyone else, who would it   be? Oh my god. Oh boy. Oh boy. Only you. You \n100% positive. Yes. John. Oh my god. True. The boys win a point. Let's move on. I was so \nscared. Why were you scared? Because I'm hooked   up to a lie detector. Hey man, we got it Hey, don't \nmess this up though. Yeah, we got Don't mess this   up. Bro was looking at me when he said that. I \nknow Jordan's coming for you. Okay, which girl   is going next? txunamy. txunamy. txunamy. Okay. Okay. Okay. txunamy. Yeah. Truth   or dare? Truth. Truth. Oh, this might be really \nbad. Okay, come on out. txunamy. You're going to   be asked three questions, and the person asking \nyou is going to be your brother, Diesel. Oh,   no. Oh, no. No, Jordan, no. Jordan, no. But I \nwant you to remember while you're answering them,   not only are we going to know if you're telling \nthe truth, but also your father is here. It's not too late. You can just say no and \nyour team does not get a point. I'm going   to take one for the team and I'm going to answer \nthe question. Okay. Wow, that red one is really   spiking. txunamy. Dude, you have to chill. \nThe spike is out of hand right now. Okay,   just breathe. Take a breath. When you're \nready, say you're ready. I'm ready. Okay,   Diesel, go ahead. Have you ever had a crush on \nsomebody but told that dad you didn't? Yeah. True. That's that's rough. Okay. Diesel. What's \nthe second question? Do you currently have   a crush? Diesel. We're going to go back here. \nNo. Txu. That was the most not true answer I've   ever Okay. Sure. Yeah. Yeah. I have. I do. \nThank you. Oh my god.. Oh my. Oh, he's so mad. he broke the \nchair. I'm so close. You're actually good. Well,   final question, Sue. Did you ever \nhave a crush on Biggy Norris? Um no Lie Yes. Okay. So, the girls did not get a point for \nthat round as txunamy lied on the last answer. Why   would you do that? Cuz my dad's here. Your \nbrother is the goat. Everybody get back into the   room. Get back in the room. Who's better, boys or \ngirls, for the mystery present? You guys think you   know what it is? Comment below. Boys, who's next? \nJames. James. Okay. Okay, Kaido you're next. James.   Truth or dare? I got to pick dare, honestly. \nOkay. The number one dare for James on Instagram   says this, \"James, to match the tattoo you got of \nSalish on your arm, now get an earring piercing.\"   No. No. Actually, you have no choice. You have \nto do it. That's like Aura, though. James,   come on out. Sit right there. I have a 10-year-old \nsister. She didn't even make it tear. You're fine.   Oh, and guess what? I kind of wanted to save some \nmoney cuz I didn't know if you were going to pick   it. So, we didn't get a professional. We said, \n\"I'm just going to do it.\" Have you ever done a   piercing before? No. How hard could it be? I look, \nI have instructions. Hold on. I'm supposed to uh   Okay, hold on. Clean out in there. Ew oh Okay, do that. \nWhat do you mean ew? I think you're going to have No,   that looks You're going to have like a gold stud. \nThat's going to look tough. It's   going to look really tough. You got this. \nThink about the ladies. It hurts really bad,   dude. Ready? That's the wrong way. That's \nthe wrong way. Other way. Other way. Oh,   thank you. Oh, thank you. Oh my god. He was \ndoing it the wrong way. Before I do this,   I'm warning you. I've never done it before. I \ndon't know how to do it. Why are you telling me   this? Because I want to give you an opportunity to \nsay no and then you won't get a point. You don't   have to do this. Oh jeez. Okay, that might be a \nlittle dirty, but it doesn't matter. Who's your   hair? This way. Oh my god. Three, two, one. \nI got--STOPPPP!! What? What? What are you doing? I   was just going to get a ear piercing. It's for \nthe challenge. I have to do it. No, James Mom,   please. Please. I told you that. I don't care. \nNo. No. No. You need a point. No. Mom. Yay. Okay. I guess you didn't get a point. That's \nnot fair. Listen, if you want to do it so bad,   here's the thing right here. Who wants a \npiercing? Who wants a piercing? Collin Collin?  you. It is absolutely tied. And there's one final \nround of truth or dare to determine who's better,   boys or girls. And then we will find out what's in \nthe mystery box. Boys, boys, boys, girls, girls,   girls. That was weak!  appreciate your enthusiasm. We \nall know who's going for the final round for the   girls. It's my little girl, Salish. Yay! Let's \ngo. Let's go say Salish. Truth or dare? I think   I'm going to pick dare. Come on out to hear your \ndare. Okay. I'm scared. Have a seat there. Woah wait why am i sitting right here? I'll sit right here. I said \ndare, not truth. I know. And your dare is to tell   the truth to one question. That's crazy. This is \nin reference to the video we just posted when you   went on a fake date with James and pranked me. \nThe question is, in that video, you said that you   couldn't say on camera who you've kissed. I can't \nsay that on camera. So, the dare, which is also   a truth, and remember, you don't have to answer \nthis. Okay. Have you ever kissed anyone other than   nidal in that video? Oh my god. Oh, she's so \nguilty. Salish, have you ever kissed any boy? Just   remember, there's no judgment. It's totally okay. \nYou're almost 16. Kissing would be totally fine.   Um, actually, I'm not answering this. What? Yes. \nLet me take this thing off. No, you just lost a   point. I'm not doing this anymore. Salish, it is \njust a kiss. Okay. You can't tell your dad that.   Why not? it's your dad. What's he going to do? My \ngrandparents watch these videos. You are 15 now.   So, it's normal. My parents don't realize that. \nI realize it. I said it was okay. I just want to   say for the record, I'm glad you didn't answer \nit. It's your own personal business. Instagram   wanted to know. I'm kind of happy I didn't have to \nhear that. Now, get back into your box. Please get   back into your box. Salish didn't get the point, \nwhich means if kaido gets a point for his team,   they win the mystery box. And boys are better than \ngirls. So Kaido. Truth or dare? Truth. Are   you sure about that? Yeah, I'm sure. Come on out. \nYou got this, bro. You got this. My palms My palms   are sweaty. Oh, he looks nervous. You don't have \nto do this, but if you tell the truth with every   question, your team wins. And boys are better. And \nyou get the mystery box. Are you ready? Okay. Do   you want to quit? No. Who would be the worst \nperson you could imagine to ask you questions   right now? The person I'm looking at right now. \nLucky for you, it's going to be me. No. John,   you can wire him up. kaido, I've been through this \nwith the doll a few times. I know. I know what I'm   doing. Why are you shaking so bad? I'm pretty sure \nwe know the answers to all of your questions. Oh,   you don't know the questions yet. Why are \nyou so red? You're getting red. Calm down.   There's millions of boys watching. They want to \nprove that boys are better than girls. They're   counting on you. All right, I got you. I got you. I got \nyou. Now, I want to remind you, we will know if   you're lying. And also, uh, your mother is here \nwatching. Ooh, that's awkward. Oh my god. Yes.   The other two that did truth had three questions, \nbut yeah. Um, for this one, because it's final,   I'm gonna do five. You know what? Fine. Go ahead. \nI don't care. I didn't ask Instagram because I've   got some questions for you. Okay. I don't like \nthis. You and Salish knew each other for a while   and then you didn't see each other and then you \ncame back together with the secret admirer video,   right? Correct. And she asked you two questions in \nthe dinner scene, right? Number one, what's your   type? Girls that are kind, sweet, personality. \nYes, it's not me. Have green eyes. Oh. Oh. And are   super nice. True. Okay. Okay. You told the truth. \nThat was sweet. It's not what you said last time.   Last time you said starts with an S, ends in a \nH. And she matters. And she matters. That was   a good line, by the way. Smooth. Saw it on TikTok \na lot, too. Okay. Now, this is a little awkward.   Yep. Number two. Have you ever lied about having \na crush? No. True. Number three. I'm gonna play a   Tik Tok for you. Oh no. And I would like to know \nwho you are referring to in this Tik Tok if you   don't mind. You just posted it today. Oh no. So, \nlet me just Oh, I know what he's talking about. I   know what he's talking about. [Music] Oh. When you \nfind yourself thinking about her all the time. Oh,   kaido, calm down. Put your hands straight. \nDo you need a minute? Do you need some water,   please? I think we're just going to move on. \nPlease. You can have water after. You don't   have to answer the question. But then my my boys \nwon't get a point. Then you you won't get the   point and then we'll go through sudden death. So, \njust so you know, in all seriousness, this is fun,   but you don't have to answer this question if it's \ntoo personal. Yeah. You don't you can just You can   absolutely You can absolutely quit. You have to \nanswer. Tell the truth. Come on. Salish. What?   What did you say? Salish. What? You were thinking \nabout Salish in that in that Tik Tok. Yes. Okay,   John. Oh, okay. I got to hide. Yeah, me too. to her \ndad is crazy. You should have lied. You could have   told him. Why did you tell the truth? Oh, Jordan, \nhow do you feel about that? This That was a rough   moment. What's the girl's last name? There's only \none Salish. Is there another Salish? Just made sure it   was me. Okay, we might need to take a breather \nbefore the final. Bro, it's really hot in here.   Yeah. Here's some water. Here's some water. Jordan, \nI'm being so dead serious. This mystery box better   be good. The graph is crazy. He's going crazy, \ndude. Are you going to Do we need to stop before   you like have it? Like, are you good? Okay. All \nright. Okay. Breathe. Breathe. Let's get it back.   Let's get it back. Two more questions. If you \nanswer these two questions right, the boys win the   entire challenge. Gotcha. And those questions will \nnot be asked by me. They will be asked by Salish. No way. Okay, you got this, bro. I've been \nthinking about this question for a while,   actually. So, are you dating anyone? Oh my god, \nwhy? If I was dating you and you posted that   TikTok about a girl, I would be kind of mad. \nSo, are you dating someone? No. True. Well,   I'm kind of going to expose you for this \none. Do you remember when you asked me to   go to the movies? Yeah. And I kind of avoided the \nquestion. Yeah. Um, do you want to go to dinner? This is You have to answer this \nquestion truthfully. Yes. John True.  go. So, the boys won. That was crazy. That was Are \nwe good? Oh, so that's the end of the video. Wait,   I didn't win. No, he told the truth. Why \ndidn't we win? Because he just told the   truth. You guys are going to dinner. Did \nyou think he was going to lie about that?   I forgot about that. That was a wild ending \ntoa a video. Boys won. Congratulations.   And here's what's in the mystery box. Oh my \ngod. This is $1,000. Let's go. Hey, Salish.   This is 300 bucks. Now I get to take you out to a \nfancy dinner. Okay, hold on. What? Cut the show.",
    "start_time": 0.16,
    "end_time": 1958.5600000000002
}