{
    "video_id": "GprYyc7m4gg",
    "channel_url": "@benazelart",
    "transcript": "Today, I'm building an extreme private jet for my girlfriend. And you're probably wondering why. I've put my girlfriend Hannah through a lot over the years. From turning our entire house into a theme park to destroying our bedroom. So, to make it up to her, I'll be giving this $5 million private jet the craziest transformation ever. And at the end of the day, we'll be surprising her with it and flying it to her dream vacation. But if I somehow mess this up, she might break up with me. But first, this is the private jet we're going to be customizing. Oh, wait. This is huge. Let's go check out the inside. Wo! Oh, this is insane. Wow, a couch. No way. There's a couch. This is nice. Look at these seats. Oh, yeah. This is very comfy. But there's more. Come back here. Check this out. There's more. Dude, is this a dining table? We could literally have dinner in the air right here, bro. It keeps on going. There's an entire kitchen back here. This plane is perfect. This is so cool. But I have a surprise. Follow me outside. A surprise? What is it? We were clearly excited about the jet. But back at the house, Hannah was pretty confused. >> So, Ben gave me a ticket for a plane that leaves at the end of the day, but the only problem is it doesn't say the destination on here. It doesn't say the destination because you can take a private jet wherever you want. So, at the end of the video, Hannah will be the one deciding where her dream vacation is. >> So, because I have no idea where I'm going, I'm going to have to pack for all types of weather, but I don't really have enough clothes. So, let's go shopping. >> So, obviously, we're going to be customizing this plane and doing some crazy things to it. But, we're not going to be doing it right here. We're going to be doing it in this giant hanger. Wo! Cool. Let's open it up. Open up. It's moving. Wow. To start customizing, we had to bring the jet inside the hanger. This jet is taking off at the end of the day. So, let's get inside and start customizing. Meanwhile, back at the house. >> My flight leaves at the end of the day, so it's time to go on the world's fastest shopping spree. And while Hannah was on her way to the mall, back at the plane. So, we've put my girlfriend through a lot over the years. So, we're going to be customizing this plane for her. Cam, do you have any ideas? Yes. What if we put video games in here, all of our favorite snacks, and what if I cut a hole out of the window and put a slide so we can skydive out of the airplane? Woah, woah, woah, woah, woah, woah, woah. We're not putting a hole in the window. >> Why not? >> This private jet's like $5 million. >> I can fix it after. I don't trust you with a hammer in here, but I do think we actually have a huge problem on our hands. >> What's the problem? >> We've never customized something for a girl. We've only ever customized things for ourselves. >> So, why don't we just customize it for oursel? >> That's not the point. >> Okay, but I do think I have an idea that can save us. >> What's your idea? >> One second. My plan was to call the top three biggest girl YouTubers in the world and ask them for advice on how to build this private jet. And after a little bit of waiting. >> Hey guys. >> Rebecca. All right. Sorry. We don't mean to be scared. Welcome to the private jet. >> What? >> I'm so glad you're here. We need your advice because we're customizing this plane for my girlfriend Hannah and we have no idea what to do. >> Hold on. Ben surprising her with a jet. >> Are you proposing? >> You're proposing? Oh, there's a kitchen in the back. I have an idea. >> Okay. Okay. Okay. I'm following you. All right. Let's go. >> Okay. So, here's what I'm thinking. This could be a snack bar. And she likes healthy food, right? >> She does like healthy food. >> Okay. So, you could do like a salad bar here. And then you could do smoothies. And then you could do some fruit. It would be perfect. >> Oh, like soda and candy, too. >> No, I'm pretty sure she doesn't like junk food. >> All right, I'm going to write that down. >> I have another idea. Okay, Ben, where are you taking her? >> To her dream vacation. >> Okay, that's probably far. And she is going to want to sleep. So, >> Rebecca's idea was to turn the table into a bed with pink pillows and pink blankets. >> We're going to make this into a bed. >> Perfect. >> Thanks to Rebecca, we had some ideas now, but we still need more. So, we are now at Lexi Rivera's house to get some ideas. >> Lexi, Lexi, hurry. >> Why are you so frantic? Thank you for answering the door. Anyways, we are building a private jet for my girlfriend Hannah and uh we need your help because we don't know what we're doing. No clue. >> Um okay. Okay. I'm sorry. Well, obviously it needs to be pink, you know. Um because you Hannah's obviously a girl. >> Uh lots of stuff. Pink. >> Yes. >> That's all we need. Thank you, Lexi. >> You want to go to the jet with us? >> Um >> Cam, you don't want to hang out? >> I I would love to. >> Thank you, Lexi. [Music] >> Why don't I get a jet? The next girl YouTuber we're asking for advice is Salish Matter. You're a girl. Can you give us like some advice? >> All right. Well, h Does she like like books? Like maybe a lot of entertainment. Like add a lot of books. Okay. >> Like books though? >> Yeah, cuz it's like a long flight. So you need books. Okay. >> What about like video games? >> No, like books. >> Books. >> And then the second thing, you know, I hate that when you go on a plane, you can't have animals. So like a lot of animals, you know. >> Really? >> Oh, like an alligator. Maybe like a snake. No, not like a dog. >> Oh, >> okay. So, make the plane allow animals. >> Yes, exactly. >> Okay. Well, thank you, Sish. >> Oh, of course. Also, you should give her my new moisturizer. She'll love it. >> Thank you. Bye. >> Bye. >> Bye. >> Thanks to the girls, we know exactly how to customize this jet now. So, we rushed to the store. We're here at the store to get everything that the girls told us to get. Why do we even have a list? I know exactly what to get. Dude, this is important. Who cares? We're going to use this list. Let's go shopping. Whatever. The first thing on the list is books. This is going to be Hannah's entertainment. Or we could have video games for entertainment. Are you kidding me? Trust me, bro. She's going to like it. All right, perfect. Okay, I'm doing books. Next thing on the list is a lot of pink stuff. Starting with pink fuzzy rugs. Uh, pink's a cool color, but I think blue's better. Okay, come on, Ben. We don't have much time. Guess we're not doing pink. While we were shopping for the jets, Hannah was shopping for the trip. I'm at the mall. Let's make this quick. [Music] I just bought so much stuff. Let's go home and start packing >> so Hannah can sleep comfortably. We're going to put a bed on the private jet and it has to be pink. So, we're going to grab some pink pillows. Or it could be Minecraft themed. I'm pretty sure Hannah told me that she really likes Minecraft. She's never said that. Uh, she said it before. >> Perfect. Cam, our private jet needs lots of LED lights. That's a lot of lights. We need more. >> More? >> Yeah, more. >> All right, perfect. I think we we might need some more. >> No, there's so much pink stuff in this aisle. >> Dude, kidding me. Blue's better. Looks like we're getting blue pillows. We're going to be building a snack pot on the private jet, and obviously it has to be healthy. So, we're getting some salad. I think this stuff is better. Chips, donuts, and soda. Don't you like this stuff? >> Yes. >> Perfect. Right. This is for Hannah. Now that we're done shopping, it's time to go back to the jet. >> We're back from the store. And now that I'm thinking about it, I think we got a little carried away. >> What? What do you mean, >> dude? We didn't get anything on the list. >> Hannah could still like this stuff. >> All right, we don't have enough time. Let's start customizing. Oh, yeah. Starting with the fuzzy rug. All right, let's add the rugs everywhere. The entire inside of the plane is now covered with a fuzzy rug. The blue looks so good. Let's just keep customizing. Meanwhile, Hannah just arrived at the house. >> Okay, I'm back at the house. I've done a lot of shopping. Let's start packing. >> Next up, we're putting LED lights from the front to the back of the plane. These are also supposed to be pink. There's pink right there. See? Right there. Okay, whatever. Let's put these up. Wo! Wo! We're putting a light behind the couch right here and right here. Our private jet now has LED lights. >> I sure hope we're going somewhere relaxing because the past couple months living with Ben has not been the most relaxing. One day there's a water park in the backyard. The next there's a secret swimming pool under the floor. So hopefully it's a relaxing trip. >> Hey. Hey. Hey. Calm down. Calm down. We don't have enough time to be messing around. Just put the pillows in nicely. Clearly, we don't know how to relax. Let's just hope that doesn't ruin Hannah's dream vacation. >> This plane can be going anywhere. So, I have all these suitcases to pack for any type of trip. So, let's start packing. >> Look what I found. Uh, where did you find that? In the bathroom. I don't think that's yours. Well, I mean, look, look how good I look now. Dude, that's for the pilots. Well, I'm the new pilot now. You definitely don't know how to fly a plane. Have you seen the cockpit? I'm sure I could fly it. Oh, no, Cam. No, no, no, no, no. >> Bro, don't worry. I looked up a couple videos how to fly this thing. We'll be just fine. >> Dude, we don't have time to be messing around. Put this back on and take the pilot's costume off. >> What? Okay, fine. Fine. No fun. >> While Cam was taking off his outfits, Hannah was trying on her outfits. >> I packed for somewhere cold, like Antarctica. So, let's quickly try it on. I am 100% ready to travel somewhere cold. I like this outfit. But the next place I'm packing for is the beach. Let's try it on. I'm ready to go to the beach. I sure hope we're flying somewhere tropical because that would just be so relaxing. But the last place I'm packing for is a romantic vacation, but I still have no idea where we're going. >> Little does Hannah know, she'll be the one deciding the destination of her dream vacation. >> Next up, we're going to make this couch purple in 3 2 1 and done. This looks good. A pillow right here. And a pillow right here. And a pillow right here. All right. This looks so good. But will Hannah actually like this? Duh. Look at all the colors. Okay. Well, we still have some more to customize. So, let's keep going. >> My favorite thing to do on a long flight is read. So, I'm going to pack my favorite book. >> We're putting a giant TV right here. We're going to play video games on this TV. Perfect. Now, we can play video games. Video games are the exact opposite of reading books. We are so screwed. >> So, remember when Sailor told us to bring a pet on the plane? >> A lot of animals, you know, like a dog. >> Well, I listened to her and I brought my pet snake. >> Woah, woah, woah, woah, woah, woah, woah, woah, woah. No, no, no, no, no, no, no. Cam, cam, cam. >> You're so cute. >> Why would you bring a pet snake on the plane? Hannah hates snakes. She's not going to be happy about this. >> I swear Hannah told me she likes snakes. >> She's never said that. >> Well, doesn't matter. He's not going to bother anybody. He'll just be right here. You want to say hi to him? He's really friendly. >> Jeff, >> say hi, >> Jeff. >> His name's Jeff. >> Hi, Jeff. Put that thing far away when Hannah gets here. Enough with the snake. We got to keep customizing. You're right. >> I am super excited to go on this trip. But the one thing I don't like about planes is not being able to sleep. So, I'm going to bring the sleeping mask. >> Next up, we're going to turn this dining table into a bed. Good thing I brought Minecraft blankets. Normally sleeping on a plane is super uncomfortable, but now we're going to have a bed. Yeah. Look at this. Woo! You could literally sleep right here. Scoot over. I want to lay down. >> Scoot over. >> Okay. Okay. Minecraft blanket going on. And last but not least, a Minecraft creeper. Wow. Hannah's going to love this. All right. Well, the bed is done. It's very comfortable. But no, we have to build the snack bar. >> Oh, that's next, huh? Let's do it. >> Yeah. >> I don't want to be hungry on this plane, so I'm going to pack some snacks. >> I got all the snacks. They were supposed to be healthy. >> Yeah, they're healthy enough, dude. Come on. >> Oh, these are Ben's snacks. My snacks. They're over here. >> We're putting drinks on this side and snacks on this side. >> I'll take one of these and one of these. Perfect. >> I love all of these snacks. This was supposed to be Hannah's snack bar. >> Which one should I eat first? Okay, fine. I'll eat the donuts. Bingo is the sprite. Hannah's definitely going to love these donuts. >> The snack bar is now done. The private jet wasn't looking like it was for Hannah, but Cam had an idea to save the day. >> I'm going to call one more YouTuber and ask him for advice. >> Who? >> Mr. Beast. >> He's not going to answer. >> Yo, Cam. >> Hey, Mr. Mr. Beast, how's it going? We're building a private jet right now. How does it look? Pretty cool, right? >> Looks pretty good. >> I need a couple more things to add to it. What do you think? >> Definitely some games. >> Uh-huh. >> You obviously need some feastables. >> Okay. >> No, no, no. I'm sorry, Ben. >> No, we got to go. >> Ben, bye. >> You just hung up on Mr. Beast. >> I don't care. We don't need that stuff on our private jet, bro. We already have video games, unhealthy snacks, a snake. >> Oh, where's the snake? Where's the snake? >> What? Where do you This snake is gone. He wasn't there. >> Cam, why would you bring a snake on the plane? >> He's probably just playing hide-and-seek with us. Jeff, where are you? >> Everything is falling apart right now. But luckily, I had a plan. >> All right, I have an idea. I'm going to go to our house to get our dog, Roger, a bunch of Hannah's favorite snacks, and everything else we need to make this plane hers. And Cam, you go to the warehouse and just grab anything that's pink. >> I can do that. Let's do it. Okay. So, I immediately rush to the house. All right. I am at the house to grab our dog, Roger, and all of Hannah's favorite stuff. I'm going to sneak around the back. Here we go. I'm in the backyard. I do not want Hannah to see me. Yo, Roger. Roger. Step one complete. I got our dog Roger. >> You're coming with me, buddy. >> But then this happened. >> Ben, what are you doing? >> I was playing with Roger. >> Stop the cat. >> What do you mean? Aren't you supposed to be packing? >> He's going to help me pack. He's going to fold the clothes while I put them in the suitcase. >> We're leaving in a couple hours. Give me, Roger. >> Okay. Okay. Um, >> I'll take him and you go finish packing. And where are we even going? >> See you at the airport. >> Oh, okay. >> This is not good. Hannah caught me and now I'm going back to the plane with literally nothing. Oh my god, this is bad. Meanwhile, Cam arrived at the warehouse. I'm at the warehouse. Let's find some stuff. Wait, what was I supposed to get? Uh, look at this arcade machine. Wait, I just remembered. >> Definitely some games. Mr. said I should get some games and snacks. Well, looks like I just found one game for the private jet. Wo! Look at this. It's a tiny pool table. This would be perfect for the private jet. We're going to have to get this. You obviously need some feastables. Look at all these chocolate bars. >> Yeah. >> We got some snacks. We got some games. What was the other thing Ben needed me to get? Something pink. Oh, I have the perfect idea. Okay, perfect. I got some pink sticker paper that spells out Hannah's name. This is going to be perfect for the private jet. And it's pink. All right, I got everything I need. Back to the private jet. Let's be quick. I'm back. And I didn't get anything. Pam, I'm right here. Look what I got. I got a pool table and an arcade machine. Just like what Mr. B said. You were supposed to grab stuff that was pink. Well, good thing I did. All right, hold this. Lift it up. Look what else I got. What is this? These are stickers that spell Hannah's name, and they're pink. Where are we putting those? >> On the airplane. This is the first good thing that's happened in this entire video. All right, let's do it quickly. Let's put it on the plane. Yo, Hannah is for sure going to like this, but we're taking off soon, so we added the games and the chocolate. >> I am so worried about what Hannah's going to think. >> Now that all my bags are packed, it's time to set them up, put them in the car, and then quickly head to the airport before we leave. >> To the airport. Meanwhile, minutes before taking off, Cam did this. What's that noise? What is that? Oh my god, look what I found. Is that the tires of the plane? Maybe. Put that back on. We're leaving in like 5 minutes. Fine. Oh no. Oh no. This thing is taking off from 5 minutes to go pick up Hannah. Oh no. Okay, it's fine. We're taking her to her dream vacation. I'm just so worried about what she's going to think. Back at the house, Hannah had a problem. >> This is not going to fit in my car, but I don't want to miss my flight, so I have to pick one of them. I'm taking this one to the airport. Hannah was on her way to the nearest airport. So, the private jet is now out of the hanger. It's time to go pick up Hannah to surprise her with the private jet and take her on her dream vacation. >> Come on, P. The engine's starting. Come on. >> All right, let's go. [Music] We're on our way to go pick up Hannah. The plane is about to take off. I'm so excited. We have so much food, so many games. Woohoo! Oh my gosh, we're going so fast. Wo! We're in the air, dude. Look at that. Wo! We're literally flying above the air right now. I can't believe our private jet is now flying. Look at the city. While we were on our way, Hannah arrived at the airport. Okay, I'm at the address that Ben sent me, but he's nowhere to be found. All I see is a bunch of planes behind me. Ben, >> it's going to be a quick flight to go pick up Hannah. So, I think it's the perfect time to give you guys a tour. Thanks to Mr. Beast, we have an arcade machine. I love it. >> Our flight leaves in 5 minutes, and I have no idea where Ven is. I'm going to get my plate. >> Oh, I got one. We're playing pool in a private jet. This is so cool. No, [Music] >> he's not picking up. >> We have a giant couch and we can either watch TV or look out the window. >> Wow. >> Can I have one? No. [Music] We have a bed with our TV with our video games. All right, let's get the first Fortnite win at 40,000 ft in the air. >> That's probably like a world record. >> So, let's do it. >> Oh, yeah. All right, here we go. We're playing Fortnite in the air because this plane is Wi-Fi. This is so awesome. You better get a win. I'm focused. I'm focused. Oh, there's one right there. Right there. Get him. Get him. Come on. He's on. Come on. He's low. Away. I got the first Fortnite win at 40,000 ft in the air. We're literally flying in the air. And I got a Fortnite win. What's up? Oh, give me some candy. Oh, mine. >> We were having so much fun in the air. But back on the ground, Hannah was not happy. >> Well, looks like I've officially missed my flight. And Ben is still nowhere to be found. Looks like I packed all day for nothing. >> We're landing soon to pick up Hannah. But there's one more thing I wanted to do. I want to close all the windows and see what it's like in dark mode. Turning on dark mode in 3 2 1. Yo, this looks good. Dude, this is awesome. We are literally over the ocean right now. We are so close to picking up Hannah. I don't know what she's going to think. All right, we're landing. Woohoo! Just so fun. About to land. About to land. The plane has landed. It's time to go get Hannah. Wish me luck. >> Hannah. >> Ben. >> Hannah, >> where have you been? >> Okay, I'm sorry I'm late. We missed our flight. >> No, we didn't. I have a surprise for you. Put this blindfold on. >> Wait, a surprise? >> Yes. >> Wait, why? Why? >> Okay. Okay. Okay. I got your suitcase. Follow me this way. >> Where are we going? >> Don't worry about it. >> Okay. >> It's the moment of truth. Even though we might have made some mistakes customizing this plane, it's time to show Hannah. I'm nervous. >> Hannah. >> Hannah. >> How's it going? >> Where are we? >> All right. So, I'm going to need you to take a seat real quick. >> Where? I can't see anything. >> Yeah, right here. Okay. >> Oh, this is comfortable. A real life airplane. >> Uh, maybe. >> Can I take this blindfold off? >> Not yet. All right, let's get in our seats. Buckle our seat belts because we're taking off. >> Okay. All right, we're taking off. Oh, we're in the air. >> Oh my god. Oh my gosh. Yo, look at that. >> Can I take my blindfold off, please? >> All right, you know what? Since the plane is now in the air, you can take your blindfold off. Oh yeah. >> What? >> Welcome to your new place. My >> private jet. >> Not just any private jet. This is your private jet. >> You guys made this for me? >> Yes. >> All right. All right. Let me give you a quick tour. We obviously have some games because I know you love games. So, we put them right here. >> I've never played these games in my life. >> That That's okay. That's okay. Come to the back. >> Okay. >> So, uh we have a nice couch with a TV with some nice pillows. Okay. >> You like it? >> It's not bad. >> But wait, the back is the coolest part. So, right here we have the coolest area in the plane. We have a bed and video games. >> Oh, yeah. >> I don't play video games. >> What? >> Well, do you like the bed? >> Yeah, >> it's Minecraft. >> That's fine. Um, we have a snack bar. >> A snack bar? >> Yeah. Come check out the snack bar. >> Okay. >> So, welcome to the snack bar. We have Fastables, some soda. I like healthy snacks. So, I don't think any of this is healthy. >> You got donuts. >> You like donuts, right? >> No. >> Okay, it's fine. Um, come this way. Come this way. >> Okay, >> take a seat. You know, we can just relax in the couch. Watch a movie. >> All right, let's watch a movie then. >> What is this? >> Um, nothing. Nothing. Nothing. Oh, that's my snake's home. Your snake? >> Yeah, my pet snake. I brought it for my home. You guys brought a snake on this plane. >> Pen, why would you say that? What do you mean? >> Where is the snake? >> Well, he's playing hide-and-seek with us right now. >> He's in this plane. >> Yes, he's really good at playing hide and seek. >> Where is he? Okay. No, I need to get out of here. >> You're leaving? >> Yes. >> Well, this is the only way out. So, uh, if you're leaving now, here you go. >> What is that? >> This is a parachute. >> No, no, no. We need to land this plane right now. I am not jumping out of the plane. We need to land it. Guys, help me out. >> Anna was not happy, and I don't blame her. We were supposed to be customizing this jet for her, but all we did was customize it for ourselves. Instead of books, we had video games. Instead of healthy snacks, we had junk food. And worst of all, we brought a snake onto the plane and lost it. But there was one last thing that could turn this around. >> What? >> This private jet is going to your dream vacation. >> My dream vacation? >> Yes. You can literally decide. Just yell, tell the pilots, and they're turning the plane to wherever you want to go. >> Anywhere. >> Anywhere. >> Say it. Come on. >> Hawaii. Take me to Hawaii. >> Louder. >> Hawaii. >> I take this plane to Hawaii. >> Even though this private jet wasn't exactly what Hannah would have wanted, all that matters is that we're going to spend some quality time together at her dream vacation. We're about to land in Hawaii. Woo! We're in Hawaii. We finally made it to Hannah's dream vacation. We're in Hawaii. Woo! Is that Cam? >> Well, at least we're in Hawaii together. >> We're going to Mexico. Bye, Ben. Bye, Hannah. Woo! [Music]",
    "start_time": 0.16,
    "end_time": 1469.059
}