{
    "video_id": "cmyemvNmdzI",
    "channel_url": "@zhcyt",
    "transcript": "Today, I'm turning my wife into a master artist. \nI'll be teaching her from scratch through six   extreme art lessons, pushing her creativity \nand skills to the limit. And at the end,   she must create her very own masterpiece with \nno help. And if she survives this art boot camp,   I've got a secret gift for her. Watch until the \nend to see how much my wife Michelle improves.   This is my wife, Michelle, and she does not \ndo art. I'm Michelle. I'm married to the best   artist in the world. I don't do art, but I'm \nready to learn. Today we can pass all these   tests and make a masterpiece at the end. I have a \nsurprise for you. I'm so excited. So, we're going   to start with some baseline tests. This is a \nsketchbook and I want you to draw something   very simple. Why don't you draw a dog? Just let \nyour imagination flow. This is just a baseline   test. Why is your hand shaking like I don't \nknow. I'm not good at drawing. I love my wife,   but art is not her strong suit. She's known as \na human calculator. I'm known as an artist. Art   is nothing like math. So, our dog is kind of \nfluffy. Okay. Interesting. She has two ears,   big boba eyes. Oh, wow. Oh, wow. Oh, wow. Oh, \nwow. Let me color that in. She smiles really big. I'm not done yet. She has a very like big fluffy \nbody. And then she has a big fluffy tail. She has   three toes. I think this is kind of like bacon. I \nmean, I can tell it's a dog. Well, now it kind of   looks like a cat. Oh, no. You have a very unique \nstyle. Michelle, you're going to have a lot to   learn today. Okay. For your next baseline \ntest, you're going to paint a portrait. Oh,   no. I got you your paint. This is called a paint \npalette. Why is there a hole in it? Here's your   paintbrush. Over here, I have a canvas. Ooh, it's \nglossy canvas. For your baseline painting test,   you're going to attempt to paint me using only \nthe colors over here. There's no skin tone color.   Well, you're going to have to mix it. Oh, I don't \nreally know how to mix colors. I just like to grab   the color right from the tube. I don't think \nZach is as tan as this. No, it doesn't matter.   I'm going to mix the brown with some white. Hey, \nthat's very close. I'm trying to I'm trying to I'm   trying to color match. Okay, I think it's right. \nDon't move. Michelle, can I stop you right there?   What? I'm cooking. Michelle, do you want to unwrap \nyour canvas? That might be a good idea. Yeah,   you should probably unwrap that first. I feel \nlike that's something I don't need to teach you. I   thought you I thought you gave me a glossy canvas. \nNo, it's just a new canvas. They come wrapped.   Maybe point down a little so it's a little easier \nfor me to draw. Okay, there's your cheekbone, your   jaw. I'm very curious to see how this turns out. \nNow you have nice eyelashes. I'm going to draw   your lips. Oh, she's going straight in with the \nred. I'm not done. Your hair kind of swoops up a   little bit like that. Why are you laughing? No. No \nreason. Oh my goodness. Michelle, actually trying.   Whoever's watching this, don't laugh. I mean, \nokay. And I'm done. I think I captured him and his   essence and his personality. Very nice, Michelle. \nThis will be your baseline for painting. Next,   we're going to test your baseline for sculpting. \nOh, good. And over here, I have some sculpting   tools. What is this for? Why is it pointy? Why is \nit bending? I'm going to have you sculpt your own   character. We all know mixing colors is a very \ncreative thing. I'm going to mix some white and   blue to make light blue. Going to use some teal. \nGoing to give her some big juicy lips. Lastly,   we got to finish off. Lastly, wait, you're almost \ndone. She's looking fabulous. She's a fashionista   that likes to go on her little red booties. \nShe has a nice fluffy tail. Oh, she's carving   duck into the clay. Ta. Fashionista. I present to \nyou Div.a Duck. Very cute. Actually has a really   creative name. Thank you. Blue head, red boots, \nteal tail, teal beak. This is going to be your   baseline for sculpting. Honestly, I think I did \npretty good. Now, Michelle will have to go through   six intense art lessons to make sure she's ready \nto create her masterpiece. For your first lesson,   you are going to learn basic painting skills. \nOkay, we have a canvas. We have a palette. This   is going to be your paintbrush. The color, yellow, \nred, blue. They're primary colors. We have our   primary blue, red, yellow. What's special about \nthese colors is that you can combine these colors   to make any color you want, but there's no other \ncolors that can mix to become a yellow, a red,   or a primary blue. When you mix some red over here \nand some blue to make a nice purple like that. And   if you want it to be a warmer purple, just add a \nlittle bit more red. Like that. Wo. Next, we're   going to mix yellow and blue. A very pretty green. \nAnd finally, we're going to mix red and yellow to   get very nice orange. Wow. You have your primary \ncolors. And then you made purple, green, and   orange. That's so cool. Okay. Easy. Earlier when \nyou were painting me, you used brown and white to   create a skin tone, right? Yeah. I'm going to show \nyou right now how to make skin tone with only red,   blue, and yellow. When you mix complimentary \ncolors, you get brown. We're going to take some   red. We're going to take some green. And we're \ngoing to make brown. Do you see how it turned into   brown? Just like that. Wo. So, now we're going to \ntake some white. Do you see how it's getting more   like it? This is where you kind of have to eyeball \nit. You're going to add a little bit more yellow   and add a hint of blue. Wow. Looking peachy. Look \nat Zach's mixing all these colors. He's so good at   it. To make it lighter, add a little bit of white \nand you'll get a brighter version. Okay. And to   make it darker, you add black. Black will make \nit look very dull and mute. So, we're not going   to add black. What we're actually going to do is \nwe're going to add more red and green to this. So,   have this color. We're going to add some more \nreds. Add some blue, some yellow. Do you see how   we have a much darker version of what we started \nout with? Yeah. After watching Zach mix colors,   I think I'm starting to get it. Now, I'm going to \nhave you try it. Okay. Okay. I have five different   colors for you to color match. You're going to \nuse the primary colors only and try to match   these colors. How about you? That sounds fun. The \nfirst color is orange. I think Michelle was really   paying attention to the color mixing. If she knows \nthe basics of color mixing, she can basically   mix any color she wants out of those colors. For \norange, I remember it's yellow and red. And then   I need to make sure I mix it all the way through. \nAnd you want to kind of like flatten it out. Oh,   flatten it out. Flatten it out. Okay. You think \nyou got it? I think I got it. Let's see. Ooh,   that's honestly pretty darn close. Yes. Next, \nyou're going to mix an olive green. Olive   green sounds tough. You got your blue. Blue and \nyellow. Maybe add a little bit more yellow. Wait,   that's getting kind of close. Let's see if \nit's close. Ooh. Okay. A little bit off,   but but it's pretty good. Not bad. Are you ready \nto mix your favorite color pink? Yeah. Pink just   looks like red that like turned light. What you're \ndoing right now is called tinting. So, you add a   little bit of white to the red and you're going \nto get your pink. Wow, that's a pretty color. Oh   my god. Very good, Michelle. Look at that. Look at \nthat. Now you're going to make this purple. Last   time we did red and blue. Let's test this purple. \nI don't know. Wait, that's pretty good. That's   pretty good. Michelle. Michelle, you're actually \nlearning so fast. This is crazy. And finally,   I'm going to have you make this brown. Oh, no. \nSo, I think I'm going to mix green and red. So,   I'm going to start with some blue, some yellow \nto make the green. Ooh, it's getting there. It's   getting there. Ooh, it's getting brown. Oh, you're \ngetting closer. Okay, let's test it. Brown is a   tough one to make. All right, guys. The moment \nof truth. Ooh, good job. Thank you. Now you know   how to color match. She did a really good job. \nI was kind of surprised. This is a good sign   for the other lessons because she killed it on \nthe color matching. And each round you pass, you   get a pin. How cute. So, you will get to pin this \nto your apron. And once you collect all six pins,   you get your special prize at the end. Oh my god. \nAnd that was just our first art lesson. Later in   this video, I'm going to teach her speed drawing, \nsculpting, art trivia. But first, let's move on to   portrait drawing. I'm going to teach you the basic \nways to draw someone's face. I like to break down   the face into two different shapes. For the top \nof the skull, like to do kind of a circle first,   and I like to connect it down here a little \nbit for like the chin. When you're sketching,   you can do pretty like loose lines. I'm going to \ndraw a line down the middle just so I know where   the midline is. And in the middle of the ball, I \nlike to draw a line. Generally speaking, your eyes   are about in the middle of your head. There are a \nfew basic ways you can draw a head. First, you can   do it from a side angle like this. You can do your \nfront-facing profile. You see how you have the   neck over here. And if you want to get real fancy, \nyou can do a 2/3 angle. So, what you would do is   you create the ball. Going to have the center line \ngoing down over here. You have like your ey line,   you have your ear. That's how I was drawing you \nearlier. Do you want to try it out? Let's do a   front facing, side facing, and two/3. Learning \nproportions seems really difficult. There's so   many things I still have to learn. This is the \nfront facing. And then now I'm making a chin. And   I got got my cross in the middle of the circle \nand then a cross down the circle. Ooh, that is   not centered, Michelle. I feel like my eyes are a \nlittle lopsided because that looks centered to me.   Your center is right around there. Another circle. \nAnd then it's like a trapezoid looking just like   kind of like in the like this right here. Okay, \nthat's pretty solid. The hardest one. Try a 2/3.   Same thing. Circle like a little curved and then \nstraight down. Yes. And then the chin. It goes in,   touches the line. That's pretty solid. Yeah. Good \njob. The neck is like right here. You got it.   Nice. Now that you got that out of the way, I'm \ngoing to teach you how to measure out someone's   proportions. Your face, for example. I'm just \ngoing to block in the bottom part of your face   right over here. You can kind of use this as a \nruler. So, this is the bottom of your eye. Your   eyes lay around over here. And I'm going to kind \nof use little dashes to block it in. I recommend a   lot of dashes just to get where the thing should \nbe. You can do another dash for the mouth. Your   forehead is about the same length as this part to \nthe nose. Her initial sketch looked really rough.   So hopefully by getting these proportions right, \nit'll take her a long way and the sketches will   look a lot more realistic. We'll get your hair in \nthere. Your ears are around where the top of your   eyes are. So I'm going to leave a dash over there. \nAnd I'm gonna kind of block in where your ear   should be. And wisp the hair a little bit. Your \nneckline ends around there. Block out where your   nose should be. So, even though it's not a full-on \ndrawing of your face, this is to help you get your   proportions right. Definitely good at drawing. His \nportrait looks amazing. Here are some examples of   portraits you can do. We have a drawn portrait. \nAmazing. The reason this is so good is because   you got to map out the exact proportions. This is \nnot only for faces. This is for everything you do.   Someone from our team also made this. Look at this \npainting of you. That's amazing. So, let's try it   out. Looking at the example pictures, and they \nall look so good. And well, I'm not sure if I'm   going to be able to do it. So, circle the chin. \nSo, I'm mapping out your forehead to the middle   of your eyes. And now I'm mapping out the eyes \nto the bottom of your chin. Okay. I think I made   it a little too short. I need to make sure it's \nat the center. I need to map out your eyes. Your   eyes look about that big. The nose is literally \nlike right here. And then your edges of your nose   is also right here. Your mouth is like right here. \nEar. Ear. And then I'm drawing out your hair. Your   neck goes right here. And then your shoulders. \nProportion- wise. Not bad, Michelle. Nearly.   You created a very, very nice looking grid. And \nthis is what you're going to be using for the   base of all of your portraits. Oh, I learned so \nmuch. The portrait looks so much better. I think   Michelle got the proportions correct. She measured \neverything out perfectly. I'm going to have to say   you passed. Yay! I got another pen. This is your \nproportions pin specifically for portraits. I feel   so accomplished. You have two out of six pins. I \npassed the second pass. Yes. I'm so proud of my   wife. She's beautiful. She's smart. And she's \na quick learner. Can't ask for more. Things   are only going to get tougher from here on out. \nAnd next up, Michelle will be learning drawing   skills. Our next lesson is going to be drawing \nskills. I'm excited. You have your sketchbook,   pencils, and you have an eraser. Do you see how \nthere's different numbers and letters over here?   This determines how hard or soft the pencil \nis. H is a light pencil. So the higher the H,   the lighter it is. And the exact opposite, the \nhigher the B, the darker it is. Interesting. So   there are some things I want to teach you to get \nyou better at drawing. Everything around you can   be broken down into shapes. For example, let's \nstart with this water bottle. I like to break   it down into shapes. This is a cylinder, right? \nYeah. So to draw at the right angle, I will start   out with a cylinder. draw a circle at the top and \nrounded at the bottom that matches the cylinder   over here. We're not going to get it perfect, \nbut what I see from this bottle is the top is   a little bit skinnier than the bottom. So, I kind \nof imagine it as two cylinders stacked on top of   each other. Now, you can do another basic cylinder \nup here. It curves up similar to this cylinder and   goes back down. Now, you have a water bottle and \nit's all broken down from those two cylinders.   Yeah. I'm ready to try something a little bit \nmore complicated. This is the foundation of all   my drawing skills. I really hope she gets this \nbecause this is going to set up a stuff I have   planned in the other lessons. The next thing we're \ngoing to try is a camera. But what shapes do you   see? A cylinder. And then I see like a rectangular \nprism. Very good. So that's what we're going to   start out with. The cylinder laying down over \nhere. So you're going to draw your rectangular   prism directly behind it. It doesn't need to \nbe perfect. And it's starting to resemble a   camera a little bit. You can start detailing \nit more and more until it looks perfectly like   a camera. And this is how I can draw everything \nfrom memory. Zach's a really great teacher. He's   really breaking it down in a way that's making it \neasier for me to understand. Would you like to try   some on your own? I'll try my best. You kind of \nset the standard kind of high. You got it. This   next challenge doesn't seem any easier. Zach's \nteaching me how to draw objects from shapes. I   know my shapes, but that doesn't mean I know how \nto draw them. I want you to draw this globe. I   see a sphere. Very good. I see like a cylinder \ngoing down. Oh, and a smaller cylinder. And then   a bigger cylinder. And then I see a half sphere. \nYou're doing really, really well, Michelle. That's   my Good job. That's really good. I'm so proud of \nMichelle. She's catching on so quickly. She broke   down those shapes perfectly. And even though \nthe next lessons are going to be even harder,   I think she has a good foundation going into it. \nSo, I'm feeling pretty optimistic. Over here,   I have a much more complicated figure. That's more \nthan just a sphere and a rectangle. I'll show you   how I would break all this down. Okay, I'm going \nto start with the body. I kind of see that as a   little oval. The top of the head I kind of see as \na big ball. The snout there's like a little wedge   shape. So I'll kind of do it as like a mini like \ncylinder half dome. A little cone for the ear.   For the flower, I kind of see it as like a giant \nball. The legs, little ovals. The arm, it's also   a cylinder. So cute. And then the tail is just \na long bendy cylinder. So once you get those in,   you can start to detail it. As you can see, it's \nstarting to come to life really, really fast.   You can do your own character using a lot of \nshapes. I'm also going to have you try drawing   a camera. Now, I'm going to take this camera \naway. I want you to draw the camera front facing,   but you're looking at it at a slightly upwards \nangle, so the camera is below you. Rectangle.   Very good. And then it's a cylinder. Very good. \nVery good. Okay, look at that. You got it,   Michelle. You did such a good job with the camera. \nI think you passed. Good job. Yes. You get another   pin. Good job. That's your third pin. Oh my gosh. \nI feel so accomplished. I'm halfway done with the   lessons. I'm really hoping I get the surprise \nat the end. Are you ready for your next lesson,   Michelle? Mhm. And now we're going to do a \nsculpting lesson. For your fourth lesson,   you'll be sculpting. 3D art is very outside of \nMichelle's comfort zone. Anything with sculpting,   anything with carving. If Michelle's going to \nstruggle on any lesson, it's probably this one.   Even though your diva duck was very creative, it \nlooked very rough. So, let's look up a reference.   Why don't you sculpt an octopus? That sounds \nfun. I want to make it pink. Instead of just   going straight in, knead it together so that \nit's nice and warm. That way, it's going to be   easier to sculpt with. It's very good with your \nhands. You can roll it into a ball like this,   and you can start pressing and kneading however \nyou want. You also have sculpting tools. So,   you can use these to smooth it out, add texture. \nIf the clay is not sticking when you're putting it   together, you can actually make little scores over \nhere. And you can score this, too. So, then it'll   be easier to put it together. Really dash right \nhere. That's cool. Score it a little bit. Add the   eye. And then you can use this for some of the \ngrooves. Roll it in your hand like this. And you   got some tentacles. How do you make your octopus \nlaugh with tentacles? Oh my goodness, Michelle,   look. You're doing so well. I'm going to use the \npurples for the little spots on the octopus. So,   what I recommend, I think you should press it \nand flatten it. Press and flatten. Tap tap tap.   Very good. You can also use your sculpting tool \nto add little uh texture to it. Nice. Slowly,   slowly. Nice and gentle. I had no idea about the \nscoring technique. That's so cool. Diva Octopus,   you passed your sculpting test. You get \nyour sculpting pin. Yay. You have four   pins. Good job. Oh, I guess you're almost \ndone collecting at all. All right. Are you   ready for your next lesson? Yes. Next up, we \nhave art trivia. Michelle, for your fifth test,   we have art trivia. I like trivia, but I don't \nknow if I'm good at art trivia. I love any sort   of test with multiplechoice answers. However, I \nknow nothing about art. I'm going to ask you five   questions. You need to get at least three of them \ncorrect in order to pass. Oh no. All right. Which   artist is known for making the famous prints of \nthe Campbell soup can and Marilyn Monroe? Is it   A. Andy Warhol, B. Freda Ko, C. Michelangelo, or \nD. Monae? I know Michelangelo and Monet are old,   so they probably don't know what Campbell soup \nis cuz between Andy and Freda. And honestly,   Andy is giving soup. I'm going to give it to A. \nAndy and Michelle, you're correct. Yay. What is   the name of this tool? Is it A, a paint knife, B, \nleveler, C, pallet knife, or D, angled scraper? All the answers look like they could be this. \nI'm going to eliminate pallet knife because   it looks more like a paint knife than a \npallet knife. That's not a pallet knife.   We don't claim it anymore. It does look like you \ncould level something, but I think this doesn't   feel like a leveler to me because it doesn't look \nlike much. Okay. It could be a paint knife or   angled scraper because it literally is angled \nand it looks like it can scrape. What's your   final answer? The angled scraper. Michelle, \nyou are wrong. It's literally angled. Okay,   but it's literally called a pallet knife. That's \nnot a pallet knife. A pallet knife should be sharp   so I can cut through a palette. No, no, you're \nnot cut through paint. No, you're not trying to   cut. That is not a pallet knife. This is to \nmix paint on a palette and it looks kind of   like a knife scraper. Wrong paint knife. It's \nan angled scraper. That is not a pallet knife.   You're crazy. Knives cut things. Which pencil \nis the lightest? Is it a H? Is it B6B? Is it C   H C? Or is it D2H? There's no such thing as HC, so \nI'm going to eliminate that. I know B means soft,   which means dark. So, it's not B. And it's either \nH or two H. And I know the higher the number,   the lighter it is. So, two H. B 2 H. Very good. \nYou got it. Nice. You're two for three. What   movement did Pablo Picasso help create? \nIs it A cubism, B surrealism, C dada, or   D pop art? Oh my god. Okay, so I've seen some of \nPicasso's work. It doesn't look like a cube. So,   I'm going to eliminate a pop art just sounds \nmore modern. I'm gonna eliminate pop art. Now,   it's either surrealism or dada. And I have \nnever heard of data. And I think Picasso is   a little bit more influential than that. I'm \ngoing to I'm going to say be realism. Sorry,   that's incorrect. What is it? It's cubism. \nWhat? It looks rapping like a cube. The questions are a lot more difficult than I \nthought it was going to be. I thought you could   use some context clues, but clearly I'm wrong. \nAll right, Michelle, you are two for four. Okay,   so you have one more chance to get this correct. \nI have five art pieces and five artists names. You   need to match all of them correct to get a point. \nOh my god, that's my hubby. I know my husband's   art anywhere. It's this one. Unfortunately, \nVincent and Vinci just sounds very similar. So,   I mess them up all the time. For all I know, it \ncould be pronounced Vincent. Okay. But I know for   a fact I've seen these two paintings. I obviously \nknow Mona Lisa. Okay. And you obviously know that   one. Michelle, you're messing with me. Star night. \nYes. Wait, but which one goes to which? Or No,   I really do mix them up. Okay, I'm going \nto put this on the side. No, Michelle,   that's the easy one. Puchelli sounds very potelli. \nIt sounds very like fancy and this is getting   fancy. So I'm going to put these two together \nand by process of elimination this one must   be Gustaf. And I'm like 70% sure that Van Go is \nStar Night and Vinci is Mona Lisa. Well Michelle,   you are correct. You got it. Good job. You do get \nyour art trivia pin. There you go, Michelle. And   you just have one more test left before you've \ncompleted everything. I only have one more test   to go. I have learned so much already and I \ncan't wait to learn in this final lesson. And   for the final lesson before Michelle attempts \nto create her own masterpiece, we are going to   test her speed drawing with a game of Pictionary. \nMichelle, for your sixth lesson, you're going to   be learning all about speed. In order to test \nyour speed for drawing, we're going to play a   game of Pictionary. Ooh. With our friends. Oh my \ngod. Hi. So, everyone come in. Hi Jake, you're   going to be with Michelle. And then over here we \nhave team white. In order to pass this lesson,   you and Jake need to be David and my sister Faith. \nAnd you guys don't let them win. I'm going to give   each artist a word. You guys will draw it out. \nFirst team to guess what the person is drawing.   You get a point. First team to three points wins. \nOkay. Okay. Michelle, if you fail, our lesson ends   here. You don't get the final test. You don't get \na surprise. Ready, set, go. Okay. Fish. This is   a a dolphin. A whale. A shark. A evil shark. A \nshark jumping out of the water. Shark splashing.   A whale eating. A beating whale. An angry whale. \nUm narwhal. A salmon. Fish. A whale knife. A a   narwhal. A shark attacking a person. Shark attack. \nA killer whale. Oh my god. Oh, you got it. It's   a killer whale. Yes. David, you guys get a point. \nThis challenge is tough. Faith. Michelle, this is   your word. Okay. You guys can turn around. Come \non, Michelle. You got to lock in. Okay, I lock   in. Do not lose. Locked in. Ready, set, go. Go. \nFaith. House building. Woman portrait. Mona Lisa.   Period. Hey. Hey. Hey. We're so good. You guys got \nsome self-reflecting to do right now cuz that is   not working. You guys ready for the word? Yeah. \nOh my god. Ready, set, go. Okay. Cat, fox, dog,   sheep, platypus, unicorn, horse, horseback riding. \nOkay. What's going on? Keep going. Drop faster. I   I don't know what's happening. Uh, cowboy rodeo. \nShrek and donkey. Shrek. Shrek and donkey. Shrek   and donkey. Says donkey. Ready. Ready, set, go. \nSoccer. Messy. Ronaldo. Oh, you got it, Jake. Now we're tied and I'm feeling a comeback. \nI think we're going to get it. Are you guys   ready for the word? Ready. Okay. Okay. Ready, \nset, go. Skyscraper concert. Concert. What   is that? Ew. Faith. Tennis game. Basketball \ngame. Harry Potter. Reflection. Symmetry. So   excited. Angry. How is it not that? What \nis that? Half and half. Crayon. Drawing   with crayons. Drawing on paper. Coloring book. \nColoring book. Picture. Uh, Pictionary. Yeah. Good job, Michelle. You won the speed drawing \nround. We won. Finally get my final badge.   Your last and final pin before your test. Yay. As \nyou can see, this is a Pictionary pin. How cute.   Michelle, are you ready to make your masterpiece? \nOh, I'm nervous, but yes, I am. And now, let's see   if Michelle can put everything she learned into \nher own masterpiece. And if the art piece is up   to standards, she will be receiving a secret \ngift from me. It's time for your final test.   You have 30 minutes to paint your very own iPhone. \nOkay, that's a big deal. You can paint a portrait   of you. You can do an animal, a cityscape. Just \nremember everything I taught you and put it into   this film painting. I'm so nervous. An iPhone is \na big deal. We're going to get this prepped and   painted. All right, it's ready for you to paint. \nNow I have to remember all the things I learned.   I only have 30 minutes, so I have to go fast. \nShe's learned so much throughout this video,   and I really want her to put everything together. \nShe's going to be mixing colors from scratch.   She's going to be measuring out proportions. \nCome on, Michelle. You have 30 minutes. Okay,   you got your paint palettes. You got your \nbrushes. Over here, you also have access to   acrylic paint markers. Last time Michelle painted \nan iPhone, this is what it looked like. Zachary,   please don't show that to the I'm going to go \nfor a cute painting. Sketch in your shapes,   draw it out, and then you can paint on top of it. \nOkay, I'm thinking of going for Kirby. Something   very cute. Kirby is a round character, so I'm \ngoing to draw a circle. He has kind of like   an oval arm, some oval feet, and like a circular \narm. Michelle's already improving so much. She has   all the base shapes down and it's looking really \ngood. Kirby's pink, so I'm going to mix some red   and white. I'm going to make sure it's completely \nblended before I put it onto the canvas. I feel   like such a proud teacher. I'm going to create a \nbase layer first. So slow and gentle is what my   teacher always says. Now I'm adding color to the \narms. I'm going to do a cute little background.   I'm going to mix some blue and some white to make \na light blue. I will also mix blue and red to make   a nice blue and purple background. I want to do \nsome waves. So, I'm going to get do the overall   shape and make like a cylinder across Kirby's \nbody. The wave is going to go behind Kirby,   though. I think I need to go for a lighter blue, \nso I need to add more white. I definitely got a   lot better at mixing the colors now. I have more \nvariety with my colors instead of just using   what is presented to me. Michelle is painting this \nright now and it looks so good. It's so cute and I   feel like such a proud husband. I'm going to just \ndo some waves. It's looking amazing so far. I'm   not even going to say anything. I'm just going \nto watch Michelle paint cuz Michelle is doing   so well right now. Oh, Michelle. And I forgot \nto teach you a very important lesson for when   you make a mistake. Oh, what is it? If you ever \nmake an art piece and it turns out really bad,   you know all you got to do to fix it? What? Say \nit with me. Say, \"That's my style.\" That's my   style. Yeah. Nobody can say anything about \nthat. See, Michelle, that's an art hack. Oh,   I like the art hack. I'm making sure I apply \nenough pressure. I'm mapping out where the   ends of the stars should be. I'm having the stars \ngo on top of the waves. Oh my goodness. Honestly,   Michelle, the waves you did look so good. I think \nKirby looks super super cute. I can see myself   improving from these lessons. I'm gonna use a \npaintbrush to make the stars look a little bit   more realistic. I'm leaving the paint a little bit \nwet so it's easier for me to blend. The stars are   a nice touch. I've learned so many things today. \nI can't wait to make some really cute art. Hey guys, just compare this to the phone Michelle \npainted not too long ago. Look, Kirby looks   so clean. Really, really nicely blended. You guys \nshould comment what you think of Michelle's phone   painting. Before I show Michelle her surprise, \nsubscribe if you think Michelle improved.   Michelle, if nobody subscribes, nobody thinks \nyou're improved. Hey, subscribe. I improved,   guys. Michelle definitely improved. Your \nfinal test was customizing a phone. So,   the rest of us also did our own little phone \ncustomization for you. Really? You have a brand   new phone. Tada. It's so pretty. And it's the \nsame Kirby. Yeah. So, so you tried to do a Kirby   version. So, our team did a little Kirby and \nthere's a little portrait of you. I love it.   You like your new phone? I do. You developed \nso much skill and I'm so proud of you. Yeah,   no problem. Well, this just shows that \npractice makes kind of better. Thanks   for watching. Comment who you want to see me teach \nnext and also like the video, please. Yes, please.",
    "start_time": 0.16,
    "end_time": 1750.0
}