{
    "video_id": "Q_yM2dJQS6I",
    "channel_url": "@zhcyt",
    "transcript": "Today, I'm surprising five K-pop \ngroups with secret gifts in one color,   like custom art pieces, a me, handmade \ncrochet dolls, so cute, and so much more. So,   make sure you keep watching till the end \nto see their reaction to these gifts. Amazing. Starting with one color gift for \nMeow Meow. And if you don't know who Meow is,   they are a huge five member K-pop girl \ngroup. Hello. Hi. I'm Zach. I'm Michelle.   Hi. Nice to meet you. Nice to meet you \nguys. Here's the game plan. Step one,   meet the K-pop group to ask them what their \nfavorite color is. Step two, travel back to our   art studio to make the secret one color gifts. \nStep three, travel back to the K-pop group to   surprise them. And hopefully they go crazy and \nabsolutely love it. We actually wanted to make   a piece of art for you guys. Okay. Okay. I have \nan idea of making our pieces in one color. So,   do you guys all have like a favorite color or \nlike a specific color you might want? Blue,   black, purple, pink, white. Okay. Give us a little \nbit and then we're going to these items in that   color. Okay. We'll be back soon. We'll be back. \nOkay. Okay. Don't go anywhere. I'm excited. As   we made our way back to the studio, I immediately \ntexted my sister to pick up some cameras. Okay,   we've got the Polaroid and we've got the film. \nWe've got this rainbow color and hopefully they   really like it. Once back at our art studio, we \nwere ready to paint the cameras in one color. We   have all the cameras taped up. So, now we're \ngoing to spray paint them. Luckily for us,   the cameras didn't take too long to dry since \nit was extremely hot outside. They're all spray   painted in their favorite colors. And now we're \ngoing to use the same color to go in and do some   extra designs. Painting all the gifts in one color \nis not going to be easy. We've done all sorts of   surprises for K-pop groups in the past, so this \nwill really push us outside our comfort zone. I   should try a different color. I think I need \nto clean this color first. And for the camera   designs, I decided to go with some satisfying \ndrips in their favorite color to match the base   of the camera. We were all hard at work. Well, \nexcept for one person. Michelle, what did you do?   You didn't do anything, Michelle. Yeah, I don't \nwant to. I don't want to mess it up. Michelle,   get it together. Maybe I'll draw something I'm \na little bit more comfortable with. Much better. Michelle, if you need help, I'll \ndo the pink one for you. Yes,   please. After taking over Michelle's pink \ncamera, it looked like we were making some   great progress. We're done with the cameras \nfor me. And Michelle, I finally have a task   for you. Do you want to untape these? Yes, I can \ndo that. Okay, that's going to be your job. Okay,   great. Michelle is the untaper. Untaper. \nOkay. [Music] Ah, it looks so good. Yay. I'm really happy with the way these \ncameras turned out. I think the one color   designs are super clean and I can't wait \nto see if Meow likes them, too. Okay,   let's close your eyes. We're back and \nand we have some special items for you   guys in the colors you requested. \nThree, two, one. Tada. Oh my god. Oh my god. [Music] Look at this. This is so cute. It's like swim. Wait, look at this. Look at this color. And \nit has these. I have the same pattern on it. Oh,   this is so cute. I like it. We should take one \ntogether. Oh. Oh my goodness. What an honor.   No. It's our It's ours. I listen to their \nsong Meow in the Gym. And that was just the   first K-pop group we're surprising in One Color. \nThings only get crazier from here. And next up,   we're surprising Kai, a solo K-pop artist who \nis also part of the K-pop group EXO. Hi, Kai.   Hello. Hello. I'm Zach. I'm Z. Hi. Nice to meet \nyou. Yeah, I'm an artist and I was wondering if   I could make an art piece for you. Really? Do you \nhave like a favorite color or something? Red. Red.   Yeah. Can I make a red art piece for you? Yeah, \nI can. Yeah. Now, knowing his favorite color,   we were able to get started on Kai's piece. For \nKai's gift, the plan is to cut out a piece of wood   in a cool shape for the canvas. Paint the canvas \nwith a red portrait of him and his favorite things   in red and then use a 3D painting method we've \nnever tried before to decorate it. We cut out this   beautiful wooden piece for Kai and we're going \nto paint it all red because his favorite color   is red. And my favorite ice member is Kai. He \nsaid he really likes Lego. We're going to do two   portraits of him in the middle. One of him's going \nto be just him and the other one's going to be the   Lego mini fig version of him. Let's get this red. \nWe're going to start out by sketching the borders.   We're going to put X's to mark it all off so we \nknow that this is all going to be covered. The   Lego minifigure version of him is going to go over \nhere. Chunky Lego body. A microphone right here.   I'll do a general sketch of where the portrait's \ngoing to be. And then we have the World Cup trophy   over here. Giant football right there. I just \nfinished Lego Kai and he's all red. I found   this one picture of him with his shirt open and \nhis abs and pecs out, so I kind of copied that   one. Do you guys like it? Oh my god, that looks so \ngood. Kai's jacked. We're going to start a hyper   realistic version of Kai and then we can decorate \nthe corners. While watching David and I paint,   Michelle was starting to feel a bit left out. Zach \nand David have been working really hard. I feel   like I need to do something. Is there anything I \ncan crochet? Why don't you crochet this version   of Kai? Oh, I can do that. I'm going to attempt to \nmake his hair like all nice and flowy and include   like a red blazer. To start off, I'm going to use \nthis light color red and do his head. But then a   storm hit and things took a turn for the worse. \nAll the power is out right now because apparently   there was a giant storm brewing and it just hit. \nThese are the only lights we have at the moment,   which means we literally can't see anything. David \nis really struggling painting his portraits cuz   as you can see, it's really hard to tell like \nwhat's what. It just looks red. I'm not going   to lie. I can't even tell if those are red. I \ndon't even know what colors these are. Oh, we   don't have Wi-Fi either. No Wi-Fi. I was going to \nlook up Kai XO shirtless. If you guys didn't know,   painting in red light is virtually impossible \nsince it makes every color look the same. So,   right now, everything just looks red color. Do \nyou want to shine the light? Take a look. What the   What is that? Oh my god. There's blue up there, \ntoo. This was just what I was afraid of. Why is   there so much of blue on there? I don't know. \nWait, how do you even have blue on there? Looks   red. David, you have blue on there. Well, it was \nfor the shadows. I don't know. You can't tell him   that. David K is literally blue. Well, maybe he \nlikes blue, too. The title of this video is one   color. Blue makes that two colors. That's going \nin the trash. Oh my god, Jake. Get rid of that.   Thanks. Well, that's a little much, Jake. So, \nboth the porches are done. We're going to move on   to the next thing for Kai. So, I have a football \nright over there. And over here, we're going to   start painting the World Cup because Kai really \nlikes football. Well, I guess I'm going to try to   turn the breaker back on because we can't just be \npainting in red light the entire time. Three, two,   one. Oh, no. All right, let me try a different \none. Jake, flip it harder. Three, two, one. Light. Well, I give up. Yeah, the lights aren't going \nto come back on today. While continuing to work   in the red light, we lost all hope of the power \ncoming back on for this project. But after about   another 10 minutes, this happened. Wo! Woo! Oh my \ngoodness, David. There's so much of blue still.   I know. I need to fix all the blue. This is what \nwe have so far. We have a hyperrealistic red Kai,   a Lego mini pig red Kai, and then football \nand the World Cup over here. And now we're   going to experiment with something that could \nruin the entire piece because I've never done   this before. This is heavybody acrylic. Once \nyou paint it on, it gives it like a really big   3D texture. So if we left it like this, it would \njust stay like this and it kind of like pops out.   Oh my goodness. Look at that. This is one of the \nonly times where we're making art and I literally   don't even know what we're doing. I don't know \nhow to do this. I'm just going to do it. Oh,   that's giving. Should I just keep going? Yeah. \nIt's like cake. That's pretty. We have a nice   coat of the heavybody acrylic on Kai's piece, \nbut I feel like a baby could do this. I'm going   to start experimenting with a pallet knife to \nsee if we can get some cool strokes going on.   And we also have a piping bag to see if we can \nmake it look a little bit more purposeful. Let   me just kind of make it kind of uneven. We did \nsome like spirals in here. I feel like there's   a lot of texture coming up, so I think it made \nfor a pretty cool frame. The most important part,   Kai needs to like it. and I'm sure he will. \nHopefully it dries in time. Oh, we're about   to see him. Okay, start blowing on it. After \nletting the art piece dry, we resin poured it,   waited for that to dry, and we went straight \nback to Kai to surprise him with his gift in   one color. And before we surprise Kai, I wanted to \ntry an aura farming trend I saw. No, wait, wait. [Music] We have two gifts for you actually. Yeah. All \nright. This one's for you. Wow. So cute. Oh my   god. Yes. Oh my god. Kion's outfit. Wow. \nWonderful. My god. Did you like it? Yeah,   I like it. My team and I made a custom art piece. Amazing. Hey, that's for me. Oh my god. Wow. Me \nLego Kai. Kai Kai. Kai and Lego Kai. Lavai. Thank   you. You want to do a transition? You can just \nlike grab the camera. Now we're headed off to meet   Rice, a six member K-pop boy group. Hi everyone. \nWe are Rise. And I have something very special   planned for them. What's up? How's it going? And \nwe want to surprise you guys with something. So,   my team and I are artists and we do a lot of like \npaintings and stuff. I've seen a lot of Oh. Oh,   you have? Oh. And just like Meow and Kai, I needed \nto find out what their favorite colors were. Red,   black, sky, blue. Oh, okay. Now that we know \ntheir favorite colors, we headed back to the   studio to paint their one color gifts. So, \nhere's my idea. I want to do a painting   all in one color with a giant portrait of them. \nThere's going to be a giant animal behind them.   We're going to do some like cool gradients in \nthe background for Shoaro. We have his portrait   in one color and I'm going to do a water dragon \nto match with the blue. I'm about to start the   portrait of Anton. I went ahead and found a \nreally clear reference photo and got it taped   onto my canvas. I put graphite on the back and \nI'm going to trace over the photo since we don't   have a lot of time and it'll give me a perfect \nsketch and then I'll start painting him. Then   Zach will draw a really cute animal around him. \nWe started on the portrait and animal for Rise   and we soon realized that it was going to be a \nlot more painting than we thought. And since we   could only use one color for everything, it made \npainting the animals extremely difficult. I mean,   just look at this blue tiger and this red panther \nand this blue dragon. Trust me, it was not easy.   David, what do you think? Don't they both look \nso cute? The dragon's so precious. Michelle, who   am I painting for next? My London. His favorite \ncolor is black, so I guess I'll do a gray and   black dragon. Okay. He looks really good. Yeah, I \nknow. Good job, David. Oh, thank you. All right,   time to add the dragon on. The next painting for \nRise is almost finished. I painted the portrait of   the member painted on a gradient background. \nI'm currently working on one bin's piece. As   you can see, his is all black because he asked \nfor black. I used gray to create a cute little   dragon going through the back. For Anton, it's \na very simple all blue painting. There's even an   all blue unicorn. It's all shades of blue. So, \nhis canvas is also complete. As you can see,   we have his portrait in all red. And then \nwe have a Puma in the background where it   looks like it's black, but if you look really \nclosely, it's actually all using shades of red,   which is really cool. I'm not going to lie, that \nactually took a lot longer than we thought. We   We thought these paintings were going to be pretty \nsmall and pretty easy to paint, but these actually   aren't that small. That was hard. Now that all six \npaintings are finished, we met back up with Rise,   and it's time for the big reveal. Okay, they're \nready. All right, Michelle, you got it. 3 2 1 Wo wo wo. Oh my god. So good. We only used the \ncolor that you requested. Wo wo. And then each   one of you guys has like a an animal next \nto you. Why did you guys choose the animals?   Just whatever we felt like artistic. Is this \nme? Yes. We painted all of you. There. Yeah,   panther. Panther. I love it. Yeah, that's \nanother dragon. Zach likes painting dragons. Thank you. We can just leave with these. Thank you. \nThank you. No problem. Thank you. Yes. Next,   we are surprising and mix. As you guys might \nknow, we actually did a surprise for them before.   So this time we're challenging ourselves to \nsurprise them with gifts in only one color again. Do you guys have like a preferred color? White, \npurple, blue. I love yellow. I like pink. Okay,   we'll be back in a bit. So don't go anywhere. \nOkay. Okay, Jake. So Edmix said this time they   want water bottles. So I'm going to have \nyou go out and buy some water bottles. All   right. Easy enough. We were able to find \nall of these Stanley cups at Dicks. So,   now we are going to head back to Zachary and \nget started. We're going to tape them all up,   spray paint them, and then paint a design on \nthem. After spray painting them a solid color,   all six water bottles were prepped and ready \nto be painted. For white, we're going to use   a light gray. And for all the other colors, we're \ngoing to use the exact same color because, as you   guys know, we can only use one color. I think I'm \ngoing to start with my favorite color, blue. Well,   I want to stay with pink. Let's paint it. So, the \nconcept is actually quite simple. I'm going in and   I'm doing a lot of abstract spirals over here. \nIt's a little hard to see, but it's all in one   color. It's quite subtle and it looks pretty cool. \nWhat we didn't realize when painting was that each   layer of marker was a bit see-through, so we ended \nup having to do three to four layers on every   single water bottle. Jake, you ready for more line \nwork? Ready for a second layer face? Where's the   energy? Get out of it. Even though it took a lot \nof time, I think it's going to be worth it. And   hopefully Enmix loves it. We just finished all \nsix of the cups for end mix. And now all we got   to do is spray these to seal them in so when it \ngets in water, it doesn't rub off. And then these   will be all done. And we're going to go surprise \nend mix. They're going to be so well hydrated. As you can see, it's all sprayed and \nready to go. And if you scratch it,   it also won't come off. \nHopefully, it's waterproof. Okay, I think it's good. Hopefully, no paint \ngot on the actual water bottle. Let's see. Oh,   we taped it off so well. Wa! Check it out. \nWe have all the water bottles done. They all   have some abstract spirals on it. Starting out, \nwe have the purple one for Lily. And for Cin,   we have a white one. For Juu, all blue. The blue \nis honestly very subtle on this, but I feel like   you can still see the design in the light. For \nSol Yun, there are so many shades of pink. Oh,   she's going to love it. Over here, we have \nBaze. The yellow turned out so cool. We have   a bold yellow. We have a pastel yellow. We \nhave like a greenish neon yellow. Finally,   Hwan also likes white. Actually, pretty much the \nsame as Hugans. With all water bottles in hand,   Michelle and I were ready to surprise Enmix \nwith their custom painted water bottles. Oh, yeah. Yeah, we have a little gift. Thank you. Thank you. Thank you. It's beautiful. Thank you. These are gorgeous. Thank you. We \ngot a one color um water bottle and then we Thank you. I love it. [Applause] Thank you. \nThank you. How you guys like it? Oh, yeah. I   love it. Now you guys will be very hydrated. Yes. \nThank you. Now that we're done surprising Edmix,   we went to meet up with Yuki, a huge K-pop \nstar who's also part of the group Idol. Hi.   Hello. I'm a big fan of the guys actually. Love \nyour video. You guys are really you're a genius,   right? And since Yugi knows that Michelle's \na human calculator, later in this video,   we're also going to have her test Michelle's human \ncalculator math skills. We are here with the one   and only Yuki. Hi, nice to meet you. Well, we're \nactually really big fans. Really? Yeah. So, one of   your favorite idol songs? I like Queen Cart. Queen \nCart for And I like your song Radio. Oh, really?   That's so sweet because I didn't I want to make \nsomething that you could maybe like hang up on   the wall like like something. Okay. Do you have a \ncolor in mind? Color in mind? Red, actually. Red.   We can do something. Now that we know her favorite \ncolor, we made our way back to the studio and got   straight to work. And what we're about to do is \nsomething we've never done before, and I can't   wait for you guys to see it. This one color gift \nis going to be insane. Yuki chose the color red,   so we are only going to use red to make a really \ncool art piece for her. Jake, don't ask why,   but I need a lot of wood. All right. You want \nto crochet something red for Yuki? Yeah. Okay,   go for it. This is my idea for the art piece for \nYuki. This is all going to be made out of wood   and we're actually going to stack different pieces \nof wood on top of each other so it's a 3D piece.   We're going to paint it all red and then we're \ngoing to paint Yuki on it. And we're also going to   paint some really cool cartoons in one color. Here \nat Home Depot to get the wood. Let's go inside to   see what they got. I think we're honestly just \nlooking for some sort of plywood. Easy to work   with and ideally easy to paint. Did somebody \nask for wood? Let me take this down. Yeah,   grab that. We use this as the bottom of the base. \nAnd then we're going to cut out different pieces   using this piece of wood. And we're going to \nkeep layering it on top. And then we're going   to paint it all red. While Jake and I prepped \nthe art piece, Michelle started to work on a   tiny crochet doll for Yuki. I found a cute pattern \nmade by Cuckoo Crafts. It kind of looks like Yuki   a little bit. I decided to go with a small yarn \nso she can put it on her purse. It'll be like a   little boo boo. We cut out the base plate and now \nwe're moving on to sanding. We're laying another   piece of wood on top of our base. And I'm going \nto try to draw out this shape so we can cut it   and glue it on. Let's see if the extra piece \nfits on. I think that looks pretty good. So,   we're going to round this out a little bit. Make \nsure there are no hard edges. And we're going to   keep stacking. I got her head started. The doll's \ngoing to end up looking so tiny and so cute. We   have all the pieces glued on. Now, we're going in \nwith white primer. So, once we go in with acrylic   paint, everything will stick on. That's dry. All \nright, let's get this over to the art studio.   We're just going to do an entire layer of red all \nover this. After getting down our base layer, I'm   finally able to start sketching out the giant art \npiece. And I think I have a pretty good idea of   what I want on there. We now have the entire piece \ncovered in red. I'm going to kind of lay out where   everything is going to go. Obviously, with a red \nmarker cuz we can only use red. I blocked in her   general face over here. Next step, we're going to \nstart Get this freaking mosquito out of here. Oh   my goodness. He's going for the videographer. I'm \ngoing to start painting these in different colors.   And David, I want you to do Yuki's portrait right \nin the middle. Michelle, you're still working on   your crochet piece? Yes. It's looking really cute. \nMy head is getting to the point where I need to   start putting in safety eyes. And now I'm going to \nfill her up with some fluff. So, she looks like a   stuffed animal, but also still very squishy. So, \nI'm kind of testing each layer a bit. So, the red   gets lighter and lighter and lighter as we move \nup. Oh, I think they're going to love my crochet   doll. I think they will, but not as much as the \nart piece. No. No. Trust me, they're going to love   my crochet dolls even more. Watch. Watch this. \nSubscribe if you think they're going to love my   crochet doll. No, no. Like this video if you think \nthe art piece is going to be better. No. Subscribe   because they're going to love my crochet dolls \neven more. Like the video. Well, well, you know   what? We're just going to see if they subscribe \nmore or like the video more to see which one   they think is going to be better. I'm going to use \nthis to transfer her face onto the wooden panel.   I covered the back of the paper in graphite. So \nnow as I trace over her face, it'll leave like a   graphite drawing onto the panel. Almost done with \nher hair. It looks a little bit crazy right now,   but you got to trust the process. Kind of looks \nlike a clown right now, but she'll get there. I   just finished transferring Yuki's face onto the \nwood panel. I have my really cute limited palette   here with all of my red to do her monochromatic \nportrait. I think it's going to look really good.   We have a lot of layers of red right now. We're \ngoing to finish up the portrait. We're going to   get some cool designs around here. This is going \nto look so good when you res and pour it on. Wait,   Yuki did say red, right? I hope so, cuz this is \nvery red. I just finished Yuki's body and now I'm   working on her arms. I'm going to just throw it \non. How cute. Once I add on the dress, add on her   hair. She's going to look so good. I just finished \nup the portrait of UP and I think it's looking   really, really good. Now that the portrait's done, \nDash is going to pick up this painting where I   left off. We only have a few hours left to work on \nthis one color art piece for Yuki. So, I got right   to work on the red dragon for her. I tried to do a \nserpent-like design that was spiraling all around   her, so it looks really dynamic. David absolutely \nkilled it. And Yuki's even got some armor over   here to make her look like a dragon queen or \ndragon slayer or something like that. This is   kind of how I want the dragon around Yuki to look. \nDragon will swoop in. The tail's going to wrap   around over here. And I'm going to use a marker \nright now to kind of trace everything in. That's   the dragon head right over there. It's really \nsimply blocked right now, but I'm going to go   in and detail it right now. I'm almost done with \nthe crochet. I used the haird dryer to flatten   her hair a bit. And now I'm going to add a little \nponytail at the top. I've completed most of the   dragon. And now I'm going in with the background. \nI'm trying to get some smoke. You just got to   dab it a little bit. After working tirelessly on \nYuki's giant art piece, my team and I were getting   very hangry. And since this is a one color video, \nI had a fun idea for today's dinner. We're going   to spin to see what color we get. And we will only \nbe eating that color of food. I want red. I want   red. Red. You get a green dinner. I hope you like \nyour veggies. Look like I'm going to get blue. Red. Jake, you get red. I guess I'm taking \nthe black dish. Let's get Michelle's yellow   food. I have all black food. I have \nOreos and my favorite, a diet coke. That is not a diet coke. That is coffee. I \nhate coffee. I have jello, some strawberries,   and what's this? Take a sip. It smells \nlike hot sauce or something. Oh my god,   it's tomato juice. Oh my god, I got medication. Faith, you get your green \ncolored meal. Yay. Oh my god. Oh,   we got a giant gummy bear. I don't know how \nI feel about What flavor is it? Oh my god,   it's hard. Bite it. I'm \ngoing to break a tooth. Jump. Oh my god. What would you give this meal out of \n10? Two. Four. Maybe a one. After dinner was over,   Yuki's piece was just about ready for the \nfinal step. And we're done. Let's see if   my friends like it. Oh my god. So good. This \nis honestly top three, if not my favorite art   piece that we've ever made. I'm not kidding. \nIt looks so cool. There's just one more step.   Resin pouring. This is the scary stuff. You \ncould ruin everything. If we do it correctly,   it's going to look so good. If we do \nit wrong, the whole thing is ruined.   We have our resin mixed. And now time for the \nmost satisfying part. We're going to pour it. And now we're going to use our gloves and spread \nall the resin out. I like how this feels. It's so   smooth. And now Charles is torching the resin cuz \nas you can see, there's tiny air bubbles trapped   in here. And once we torch it, the air bubbles \ncompletely go away. Now we just got to wait for   it to dry. I just finished. I added the little Y. \nTied her hair up into a bun. I put some blush on   her. I think she's going to really like it. All \nthe resin has cured, so we can touch it. There's   like a really, really nice shine to it. And now \nall we got to do is go show my friends to see if   they also like it. This art piece looks so cool \nin red. Honestly, it kind of looks like the art   piece we did for Kai, but this one ended up being \na lot larger. Open your eyes in three, two, one,   open. Oh, that looks so good. She looks expensive. \nHonestly, I think this might be my favorite art   piece we've ever made. Let's go back. Oh, I also \nmade something for Yuki. Oh, yeah. Michelle,   you were going to crochet over it. Yes. I want \nto show it. Okay, let's see it. Let's see it.   Oh my keychain. Yes. It looks like a little lab \nthat you can like hang around your waist. All we   got to do is pack it up and fly over to meet \nher and surprise her. If she doesn't love it,   take it back. We'll hang it up in the studio. \nNow for the moment you've all been waiting for.   We packed the art pieces and met back up with \nYuki to show her the secret one color gift we   made for her. I think she's going to absolutely \nlove it. Now that we're back, Michelle is going   to show Yuki her human calculator math \nskills in person. I'm going to show her   my human calculator skills today. That's crazy. \n1999 times 23. Okay. It might take me a while,   but 45977. That's tricks. [Music] Oh my god. \nOh my god. Okay. 2 * 3 6. Correct. Time 304.   Uh 204. Correct. Times 101. Uh 20604. Correct. \nTime five. Uh 103020. Correct. Time 72114. Wo wo. Incredible. Amazing guys. She is the one. \nI'm telling you. Thank you. Thank you. Thank you.   Amazing. We want to surprise you with something. \nI love surprise. We actually have two surprises.   Oh my god. Not only one, you have two. Okay. \nI'm really nervous, but this is my first gift   to you. Oh god, they're so cute. Oh my god, it's \nreally all red. Yes. I even added like a little   keychain. Oh my god. I love it. Thank you. Thank \nyou. Thank you. Okay. All right. Where's yours?   All right. It's your turn. Okay. Okay. This \nis a big one. Oh, a big one. Two. Three. Ta.   What? Hold up. What is that? What is that? What is \nthat? Wait. Do you like the art? It's an abstract   art piece. Yeah. I Wow. I'm trying to, you know, \nconnect with him. Seriously. I think it's art. Oh,   it's all art, right? Yeah. God. What? Oh my. \nWow. Crazy. A It's me. Thank you so much,   guys. Oh, where's my Where's my Where's \nmy door? [Applause] There's going to be Thank you so much. Happy now. I own \nthe energy to do my stage today,   I think. Yeah. That's crazy. \nYeah. I'm trying to take it. Yeah. Yeah. Wow. Craving.",
    "start_time": 0.24,
    "end_time": 1738.0
}