{
    "video_id": "aM0ymcZPjXY",
    "channel_url": "@zhcyt",
    "transcript": "I've been waiting a long, long time for this. \nOnce I met Zach, I knew he was my person. And   a lot of my friends and family have also \nbeen waiting for this moment. I feel so   nervous today because so many people \nare coming out to see us get married. Oh my god. When they have like any personal \ntroubles, I know they can always have each   other to talk to. They just Oh, I just \nlove them so much. My impression is that   we're going to do a first look with I want \neverything to go really well today. I'm   not sure if we're going to get everything on \ntime. I'm already running a little bit late.   Is there a hanger in there? Like a hang. \nZach is just one of the most like quirky,   hilarious people I've ever met. Like I'm \nused to looking into the camera. Am I not   supposed to look at it? No, you're not. And \nI'm also really nervous because I'm kind of   scared I'm going to get very emotional. I know \nhow much this means to her family and I just I   just want to make sure the day is perfect for \nthem. Okay. Should I stand right here? Turn. Like nothing felt real until like I turned \naround and then saw her in the dress. You look   so Michelle in the venue with her hair and her \nveil and everything. She looks stunning. That's   happening. I wasn't expecting myself to feel so \nemotional and she really looked like a bride. And   it's so crazy cbecause she's finally going to \nbe like part of our family now. So beautiful. Oh, is my dad already crying or do you \nthink I'm going to cry? Sniffling. I   don't think I can do this. I don't think I \ncan do this. Oh, yes. I would like a Q-tip. You're so pretty. My dad just cares. I can tell my dad cares for \nus a lot. Seeing his face and seeing how proud   he is. I just felt like I think a part of it is \nalso very emotional cuz he's just like worried.   I was waiting for this moment for a long \nlong time. It's happen. It's happening today. He ultimately wants me to be \nhappy. He wants us to be happy. I wish you are, happy when I saw her wearing dress, it \nwas so pretty. I just cannot I   just cannot hold my emotion. I did \nnot pretty cry. Oh my god. So I'm   so happy for her today. Dad is very \nproud of you and loves you forever. I make you sick twice. I only cry when I see my dad. I'm grateful to   welcome Zach as my son-in-law. His \nlove and support mean a lot to us. Zach, I am so happy for you and Michelle. \nAnd we come from Taiwan. Congratulations. Do you look pretty? The moment I \nsaw her in my head, I was like,   \"This is the most beautiful woman I've ever \nseen in my life.\" You're nervous? Are you   nervous? Why are you nervous? I'm nervous cuz \nI want to I want to The first look was so much   funnier than I expected. It was very silly \nand very goofy. And that's exactly how our   relationship is. What else do you do at a first \nlook? I've never done a first look before. Well,   it's surreal. I went from a subscriber to like \nworking for him and it's been like a really cool   experience and I couldn't be more happier for \nthem. Congratulations. We're so excited for   you. You've known Michelle for so long. This is \nthe right decision and just have fun. Be loose. This is my first son. Just watching \nhim grow into a fine young man. When   you're watching your kids grow, you really \ndon't think about time passes by so fast. When you marry, you do not cling on to your \nparents. and you become one with your spouse.   He's going to start his own family. I'm not \nlike nervous marrying Zach. I'm nervous cuz   I want everything to go well. He will really \nbe a man from that point on. And I bless him.   But a part of me feels so sentimental. Oh my \ngod, I'm nervous. Zachary, my baby. Oh my god.   I love you. I will always love you. I know \nthat we don't say this often enough. I'm   proud of you. Nothing would change my \nlove for you. I wish you all the best. Take care of my my daughter. \nLove her. Support her. We've come together today to celebrate the \nunion of Zach and Michelle. Zach and Michelle,   take a look around. These are the people \nwho care about you the most. They've been   there for your b biggest successes and today \nthey are here to witness your commitment and   to support you as you begin this next \npart of your lives. Zach and Michelle,   you have prepared vows to share. Zach, \nwhenever you Okay. All right. Michelle,   you're the purpose I didn't know I was waiting \nfor. I'm not going to get through this. You're the matching piece I never knew I existed   for me. And I'll never understand how \nI got lucky enough to call you my wife. You make the world brighter and \nlouder and messier and better. I've said it before and I'll say it again. \nMirroring you is the biggest decision I've   made in my life and also the easiest. You've \nshown me again and again that who I am is   already enough. You've never tried to change \nme, but somehow just by being you, you've   changed everything. You pull me out of my head and \ninto the present. You make room for spontaneity,   for emotion, for all the things I used to push \naside in the name of work or comfort or control.   You've already given me more than I ever thought \nI deserved. So, here's my vow, plain and simple. I'll spend the rest of my life trying to return \nthe favor. I love you, Michelle, and thank you   for loving me. right there. When we met, we were \njust two strangers who happened to swipe right   on a silly little app. We were kids back then, \nunaware that the person we had just met would   become the love of our lives. You, Zachary Hsieh, \nare unlike anyone else. You're incredibly driven,   the hardest worker I know, and you care with \nthe deepest heart. Your passion and dedication   inspire me every day. Being with you has taught \nme what true partnership really means. Not just   loving each other when it's easy, but choosing \neach other again and again, even when it's hard.   You helped me grow in ways I never expected. \nYou've encouraged me to dream bigger, to believe   in myself more, and to keep pushing forward. So \ntoday, I make these promises. I promise to love   you fully, to support you always, and to walk \nbeside you through every high and every low.   I promise to grow with you, to build a life with \nyou, and to never stop choosing us. I love you,   Zachary, and I'm yours forever. Zach and Michelle, \nby the love you share, vows you've spoken, and the   commitment that you've made and the authority \nvested in me by the Universal Life Church and   the state of Texas, I now pronounce you husband \nand wife. Zach, you may now kiss them. Right. Oh, it was so hard not to cry. It was so \nhard cuz they just came out. They were just   they already had the tears coming down and then \nyou're just walking in the water. It was really   like something you just could only dream about. \nI thought I was only going to cry a little bit,   but I think also because we have the view of \nZach's face, watching him cry was like too much   for me. I was like, \"Now that all the crying is \nover with, now we can party.\" Oh my goodness. I   was so nervous to talk. Did you see Steve? He \nwas like, \"But I was crying like so much.\" I   think that's why I started. I'm a married man. He \nhad me tearing up. That was amazing. Way to go,   Zach. It was like so beautiful. It was so \nbeautiful. The water, the boat, it was amazing.   They really put Crazy Rich Asians to life. \nOkay, guys. I just finished this oil painting   of y'all of your first kiss as husband and \nwife. And I hope you love it. Really? I   literally just finished. It's still wet, so \nbe careful. It's still really wet. Wo. That   is That is insane. Oh my god, David. This \nis beautiful. Oh my god. Yeah. Munchie's   been ready to get married for so long. She's \nbeen picturing the day and dreaming about it.   Oh god. Oh no. I'm just so excited to see \nthem both do this. I feel like I've seen   Michelle like over the years so fun. For the very \nfirst time as a wed couple, Mr. and Mrs. Hsieh. After getting to know Michelle, she she definitely \nchanged me in a way where I I used to not want to   show any vulnerability. I feel like Michelle \nmade me feel safe and comfortable. Watching   Michelle and Zach grow together has been such \na joy. They support each other not just in the   big obvious ways uh but in the small quiet \nmoments too. The kind that really defines a   strong relationship. I've been waiting to be \na wife for the last 6 years. I'm so excited. You did so well and that planned like he designed \nthe whole wedding. So everything with him   We are grateful to welcome Zach as our \nson-in-law. Next year is the year of horse,   which is a very good year \nto have Zach or Michelle Jr. It's just a really cool full circle moment and \nit's like it just shows like we're all becoming   adults and we're doing it together. She asked \nme last night if she should stop taking birth   control. Don't tell Michelle I said that. \nOh my god, this freaking bag is making   us all cry. What the heck? And Michelle's \ndad, I'm like, \"Bro, shut up. I'm crying.",
    "start_time": 1.52,
    "end_time": 814.16
}