{
    "video_id": "RMf-QQOXyzE",
    "channel_url": "@zhcyt",
    "transcript": "Today I'm building two basketball courts in my \nhouse. Like this basketball court with a giant   Steph Curry mural that I'm going to attempt to \nshow Steph Curry. You see, I've always dreamed   of having a basketball court at my house. But when \nI asked my wife if we could build one, Joe, can we   please build a court? No, Zachary. So, I sent my \nwife Michelle on a 7-day vacation to Indonesia so   my friends and I can build the craziest outdoor \nand indoor basketball court before she comes back   at the end of the week. We have one week to make \nour outdoor and indoor basketball courts. Are you   guys ready? Not really, actually. Not too bad. \nShould we start out looking at the front yard?   Maybe we can build a front yard. Let us in. Thank \nyou. Okay. Am I crazy for thinking maybe we could   just put up a hoop at the front of the house? \nWell, you can't play basketball here. There's   rocks and stuff. So, I guess the first would be \nthe office. I don't think Zach would like if we   took over his office space. And the reason why we \nhave two different teams is because David and I   think an outdoor court is cooler and my sister \nand Jake think an indoor court is cooler. So,   to settle this, after we build our indoor and \noutdoor courts, a mystery judge will come and   decide which one of us built the better courts. \nWhat if we turned that tree into a basketball   hoop? I feel like this is on a hill, so if you \nmiss, the ball's just going to like Why do you   hate all of my ideas? I know. I like that one. I \nlike a tree court. That sounds pretty. But there   could be something else. The living room. This \nspace is going to be hard to do because there's   that whole concrete. Do you think you can see them \nfrom here? What are they doing? There's no way   they're building the court in the bathroom. No. \nThat's That's such a stupid idea. Yeah. What the   heck, Jake? Could you imagine like in the corner? \nOh, you would break everything. There's no way   we're doing it in here. Okay. Fill the entire pool \nwith concrete. Michelle would kill you. Finally,   after scouting out my entire property, but the \nred and the blue team found the perfect spot   to build their basketball courts. Oh, wait. This \nis nice. I mean, there's a lot of stuff in here.   They can sit and like this spot. Oh, okay. \nThank you. They're doing an outdoor court,   which one already sucks because indoor courts \nare way better. What do they have outside? Grass,   bugs, sun, rain. Y'all's indoor court is going \nto suck. What's the definition of basketball? I   really don't know. When Jake and Faith cleared \ntheir room, David and I got to work planning   the construction of our basketball court. I'm \nbuilding an outdoor Steph Curry themed basketball   court with a giant mural of him in the middle. \nSteph Curry is the best shooter in NBA history   and my favorite basketball player ever. And it's \nmy dream to meet Curry. So once we are finished,   hopefully I can get him to see it. Can you start \ntoday? Really? Okay. Can they start today? Yeah,   they're going to start. Oh, that's \nso good. And so without any delay,   the construction began. Meanwhile, Michelle \nflew overseas and finally arrived in Bali   with her friend for her dream vacation. I've \nmade it to Bali and it is absolutely gorgeous   over here. I just saw a monkey. The NBA plays \nindoors because indoors is better. I don't   think there's any argument you could possibly say \nto rebuttal against that. Let's hear it. Wait,   I didn't hear anything he said. While Michelle \ncontinued to explore Bali, David and I designed   our Steph Curry outdoor court. My favorite \nbasketball player ever is Steph Curry. We're   going to have Steph in the middle over here ready \nto shoot. That's going to look so good. Zach,   what I think we need to do next is take a look at \nsome real basketball courts. First things first,   we need a basketball hoop. I think that's like the \nmost important thing we need. Yeah, I think that's   concrete. Yeah, I think so. All right, we need a \nconcrete base. Faith and I are out at an actual   indoor basketball court. First thing, uh a floor. \nWell, how are we going to get these kind of wooden   floors up? I think we can come up with a creative \nway to make it look like this. All right, it looks   like they have basketball lines over here, too. \nHopefully, we can pay someone to do it for us,   cuz that looks really hard to do. We're at a \nbasketball court. We definitely need a basketball   hoop. Oh, we definitely need basketballs. \nDuh. Yeah, they have a basketball rack. Yeah,   they actually have fences over here so when the \nbasketball bounces away, it doesn't go into like   trees or something. We definitely need that cuz \nI'll probably miss every shot. I think we should   be good to go. Let's test out the court. How about \nthat? One-on-one. Put the clipboards down. Yes.   Oh my god. Do Oh my god. [Music] Oh my god, I'm \nso good. I'm so good. Yes. Yes. Scores 1 to 37.   I think we got a pretty good idea of what we want \nour indoor court to be. So, face tough time. And   finally, after planning our Steph Curry mural \nand making sure we had everything we needed,   our basketball court was ready to be painted. \nThat looks so good. Oh my goodness. We have the   basketball hoop right here in the middle. We have \na net over here to catch the basketballs. This is   so much bigger than I thought. How are we gonna \npaint it? It's This is going to be a lot of work.   Oh, they did so good. It's so perfect. Here's \nthe plan. We have our entire court built out   right now. And all that's left to do is to paint \nthe mural. And then after we're done painting,   we'll get the lines over it. But we don't want the \nlines to interfere with our mural. So, we're going   to do some measurements first. Meanwhile, Faith \nand Jake plant their own indoor basketball courts.   Now that the room is empty, I can definitely see \neverything coming together. All the clouds on this   wall leading onto this wall. Ceilings high enough \nto make a jump shot. Yes. I think we can go out   and get supplies shopping. Okay, so here's the \nplan. We're going to do a ton of giant squiggles   around this court. And afterwards, we're going to \nput the drone up in the air so we can see all the   squiggles. And then we're going to put it on the \niPad so we can overlay Curry's line work onto the   squiggles. And then we can match up the lines \nwith the squiggles. Okay. Oh my god. Zachary,   what are you drawing? What I'm drawing? Yeah. \nWell, you know what that is, Zachary? Well,   now I don't know what it is anymore. Oh, it's a \npuppy. Yeah, it looked like a It looked like a   What did you think it was? I was painting a puppy. \nDavid. It looked like it. As David and I continued   painting, Jake and Faith bought some supplies. And \nfrom the look of it, we're taking very different   approaches for our basketball courts. Yeah, \nwe're not. I think this is perfect, honestly,   cuz that's one not flimsy, but it's I think maybe \nwe should try getting a couple of these. For foam,   I think we're going to go with this type of foam. \nWe finally got everything and we're ready to head   back. Check this out. Look, didn't fit in the car. \nIt took a while to build the court, but now that   we're finally doing the art, I think it's really \ncoming together. Check this out. Look at that.   We have the shoulders all over here. The arms \ngoing out to the basketball. We have the Golden   State Warriors logo right here. We have the \njersey shoulders are all in. And then look,   we even have all the shorts over here done with \nchalk. Now all we have to do is sketch out the   face and we can start painting. I'm also getting \nreally burnt up here. I I should probably put on   sunscreen. But I wasn't the only one that needed \nsunscreen because in Bali, Michelle was also   enjoying a nice day on the beach. Obviously with \nsome sunscreen. You ready, Michelle? All right,   let's go. We're at the beach. Actually, it's \nso beautiful out here. It's so hot. Molly is   so crazy. We're just walking on the beach casually \nand then we see camels. Back at the house, David   and I worked on a way to transfer Steph Curry's \nface onto the basketball court. Okay, a little   bit larger. Larger. While also making sure the \nproportions were accurate and lifelike. That's 53.   We got it. So, now that we have the face at the \nright size, I'm going to trace those lines onto   that paper with a pencil. And then we'll take the \nchalk, rub it on the back of the paper, and trace   it onto the cord. Okay, I'm going to cut out stuff \nthat this will name Rosie Stefan. Rosie Stephanie. Time to chalk the back and \ntransfer it onto the court. [Music]   Meanwhile, Faith and Jake arrived only to notice \nsomebody left scraps in their workplace. What do   we have here? What is this, Faith? Do you \nknow what that is? No. Well, it's paper. This does not serve us whatsoever. I think that they're trying to sabotage us. \nThat's not going to fly with me. All right,   David, are you ready to see if it worked? Yeah. \nI just need a little outline. It doesn't have   to look good. It has to be like a little 3. \nOh. Oh, nice. That worked. An outline. Well,   well, well. Look who it is. If it isn't the little \nsabotage outdoor court people. Hi. Hello. Someone   has sabotaged our work area. That's literally \nnot a big deal. That's not. How do you guys   like it so far? Are the courts? Wait, you guys \nnever saw the built out court. Do you guys want   to see it? We never saw the built out court. \nWe only saw the paper on our wall. Oh my god,   you're so negative. Come enjoy the moment. \nFaith, come here, queen. I'm not going to lie,   the uh giant staff does look good. The proportions \nare pretty solid. And it would honestly be such   a shame if Faith tripped into a giant bucket of \npaint that would happened to be right by Steph's   face. I would be ashamed if Hey, what are you \nguys talking about over there? Nothing. Keep   painting. Can you guys hurry up and finish Steph \nCurry's face? Yeah, hold on. Perfect. All right,   ready for the first big stroke? Oh, look at \nthat. We're just going to need to cover this   whole place up. And after hours and hours \nof painting, we still had a ton left to do. So, we got some rest and started bright and early \nthe next day. We made it to our next destination   in an Uber hotel. We also have a private \npool inside our hotel. Put a bamboo fence,   a waterfall. So, apparently for breakfast \nwe have fruits and we have tea. Oh,   that looks so so yummy. It's our second day and \nit's our first meal of the day. First thing that   we have to do today is to trace our clouds on our \npieces of foam board. Oh my god. Today it's all   about painting. We're going to be under the sun \na lot. We're going to be working a lot and we're   probably going to get burnt. So, the first stroke \nI'm going to do it right above his eye. Yes. Oh,   this is going to take a lot of paint. Zach. Oh my \ngod. Steph is going to look so good. Wait, Zach,   he's on the Lakers, right? What? We have one of \neight cut out. We're going to take this cloud,   put it on top of a flat piece of wood, \ntrace the cloud shape on the piece of wood,   then cut it out using the jigsaw. Paste the \ntwo together. Paint the top of the wood. And   then what's the last step? Resin resin pour. \nIt's going to look super clean and hopefully   it'll turn out really cool. While Faith and Jake \nbegan the construction of their clouds, David and   I were almost done painting Steph Curry's face. \nAnd I'm not going to lie, this looks insane. Zack, do you think Stefan is cute? \nWhat? You think Stefan is cute? Um,   no. Can I add a sparkle then? No. Was that real? Is that my hair? Zachary, how's \nmy hand? Oh my god, you're so mean. We finished   cutting out all of our clouds. Now, Faith and I \nare going to go around the sides and sand them   a little bit because they're definitely a bit \njagged. And then after that, we can go in and   trace them on the thin pieces of wood. Meanwhile, \nMichelle was busy having the time of her life   in the monkey forest. I hope she comes back in a \ngood mood because I started building these quarts   without her asking, and if you don't remember, she \nclearly said no. Yeah, I'd rather not sleep on the   couch when she gets back. Hopefully, she likes \nit. I am so excited to see monkeys. [Music] No, Zach is going to kill me, but it's okay. Where did they go? Around here. Yeah. Yeah, \nI saw it drop. Yeah, it dropped. Oh my gosh.   I can see like monkeys playing over here. \nRemember Jake had to do some work outside   and things got a little bit crazy when Jake \noverheard we used the wrong blue paint. Oh,   hey guys. That looks stupid. Do the basketball \ntoday. Not too fun, does it? Shut up, Jake. Jake,   leave us alone. Jake, we're having a \nhard time here. You guys got the wrong   blue paint. Huh? An outdoor court problem. \nJake, don't you Jake, don't close that. Jake,   don't lock it. Can we lock it? Jake, where's the \nblue paint? We don't have any. Faith, promise me,   brother to sister that you do not have blue \npaint. I don't know. I don't know what we   have in here. Charles, do you want to unlock the \ndoor for us, please? No. Charles, open the door,   please. Charles, burning. Charles, wait. We want \nto come inside. What is this? This the pain. Don't   take that. God. So, I don't think that they're \ngoing to come in with various living organisms   attached to their body from being outside in the \nelements all day. I hope they're getting attacked   by them. And if they're not getting attacked \nby the squirrels, then we have to be on edge. run. Jake, it's okay. Jake, don't do it. Jake, \nare you serious? Jake, stop tying it. Here,   go ahead. Jake's taking out the trash. Jake, how \ndo you sleep at night? I sleep on a couch like   this or a bed indoors. They wouldn't dare. Jake, \nJake, do not do it. Don't do it. Don't do it,   Jake. Freeze. Drop the pain. This was the only \nway. Faith, make sure he drops the saw. You don't   want to get cut again. No. You mean squeeze the \ntube? No, I mean drop the tube. If I see any pain   come out, I'm doing it. Faith, get the saw out \nof his hand and I'll put this tube away. Injured. Zach, give her the saw. Oops. He cut into Oh my god. Oh my god. Don't do anymore. Right now you don't have to stop right now. Stop \nworse. Jake to stop right now. Jake, no. What are   you doing? So much worse. Jack, you're going to \nhave to repaint everything three times. Dude,   I should have cut more of theirs. Zach, we have to \ngo to a Home Depot and get more yellow paint now,   too. Are we out of yellow paint? I mean, I don't \nknow what's left in that bucket. I think we're out   of Yeah, we're out of yellow paint. Yeah, I used \nblack paint. Jake, we have no more yellow paint.   Seems like another outdoor court problem. That's \nlike the most evil thing he's ever done. Dude, I   just finished it. Let me be honest here. Zach was \nthe one that took the jigsaw to our piece first.   I had no choice but to defend it. Dude, we need to \nroll it. David, it's starting to stick. Oh my god,   that looks so bad. Yeah, Zach, that's like it. \nIt's cooked. Well, it looks like he knocked out   one of our clouds. But lucky for us, I can just \nretrace it over here. We still have room. But   this was the last wooden board that we had. So, \nyeah, we are lucky. I think we need to redo the   whole cord. Don't say that. That's horrible. \nYou definitely should have jigsawed it more,   but hopefully we can get that fixed up \npretty soon and then we can get back on   track and start making progress. Yeah, he's \nlosing it. I think it's been hours. Oh god,   I wanted to start painting Steph and I'm still \npainting this yoho. And so while both of our   teams worked tirelessly to recover, Michelle \ntraveled to an absolutely beautiful temple.   My wife Michelle told me she absolutely loves \ntemples and thinks they're so gorgeous. So,   I'm glad she got to see it, especially if that \nputs her in a good mood for when she sees the   basketball court. I'm so hungry. Back at the \nhouse, Jake and Faith came up with a super cool   idea to elevate their court to the next level. \nAnd now we're 3D printing even more to display   on the wall. And we really think that it will \ngo great with our cloud and sky theme. [Music] [Applause] So good. Ow. So, it's \nreally hot today and everyone's   been complaining about how hot \nit is. So, I thought of a funny   little idea to cool them down and prank \nthem at the same time. What the [Music] No, no, no. Oh my god. Okay. Shake, shake, shake, shake. Okay, we got \nto get back to work now. I definitely feel cooled   off, though. Last cloud. Now, Faith and I can \nfinally focus on adhering the wood and the foam   together so that we can paint them. And finally, \nresin board. We're making good time. At this   point, both of the courts were looking insane. \nI can't wait to see how they turn out at the   end and to see if it's good enough to get Steph \nCurry's attention. Steph's my hero and honestly,   and it would be so cool for him to notice it. Look \nat how good this space looks. It looks incredible,   dude. This looks insane. I feel \nlike I need to jump for joy. Oh,   it's finally time for us to start \nresin pouring our clouds. And honestly,   Faith and I have never resin poured \nbefore, so this should be interesting. After a few more hours, we were finally done with   this insane giant mural of Steph \nCurry. But we're not done yet. [Music]   Sample coffee from the plantation. So many \ndifferent flavors. I don't drink coffee. Cheers.   Oh my gosh, that's so yummy. I think the coconut's \nreally good. As Michelle finished up her trip,   both of our teams started to add our final \ntouches to the indoor and outdoor basketball   courts. Currently, as it stand, this bar area \nand sink does not fit our cloud themed indoor   basketball court. So, Faith is actually gonna \nstart lining the top of it with LED lights and   polyfil. We're going to make the top of this \nlook like a giant white cloud. We're even going   to line part of the cabinets with LED lights \nas well going down. David and I promised that   we would go insane and finish Curry today. We set \na goal and we achieved it. Yes. Can't believe we   did it. Good job. We are done with all of the \nclouds, including the backboard. Now, we have   to wait for the backboard to dry, and then we can \nstart putting them all up on the wall. All right,   guys. I got some bad news today. It is raining \na ton. In fact, I'm a little worried that the   court's going to get ruined because it is raining \nso hard right now. This was not part of the plan.   Oh no. How are we going to paint today? It's so \nwet. All right. Well, it looks like we're about   to lose a whole day of painting because there's \nno way we can paint with all these puddles. Also,   my dog is just standing out there in the \nrain for no reason. We have our ball rack   turned into a cloud. And our large white cloud \nbackboard now has a hoop attached to it. Okay,   the cloud backboard was pretty hard to put \nup, honestly, but these smaller ones should   be a lot easier. roll out the floor. After \nwe do that, we can velcro it to the floor. That was a lot of work, but honestly, I think it \nlooks pretty good. I think it looks like a cloudy   room. So good cuz I set up myself. And because \nI really want to get Curry to see all of this, I   also got a lot of Curry related stuff to decorate \nthe house. Like this Curry jersey rug that Simji   gave us. A signed Curry jersey from Jesser. Signed \nCurry shoes from Legit Tim. A basketball signed   by Curry. This giant colorful Curry portrait rug \ngiven to us by Simji. She actually gave this to us   during our wedding. I hope they like it. Wo! What \nthe Oh my god, Simji, you're insane. And finally,   after a bit of cleaning up and polishing, both of \nthe courts were finally done and ready to be put   to the test and judged by our special guest, \nJesser. Thank you. Thank you, artist. I have   arrived. Jesser is the biggest basketball content \ncreator on YouTube, so we thought it would be   fitting for him to judge. You know, I've watched \nthe videos. I've been a part of them. Y'all have   the best art on YouTube in the world, honestly. \nSo, I'm very, very excited for these courts. Well,   today we have two very unique courts to show \nyou. Hopefully one of them blows you away. Oh, this is actually insane. The cloud backboard. \nI would put that in my house as an art piece. That   is a giant piece of wood which I cut out, sanded. \nYes. We also have these basketball holders which   we have the 3D printed basketballs. Okay, this \nis insane. Like aesthetic. Having the 3D white   basketballs in here is this is next level. \nAnd I've I've used some fake ones and they   break. So if this were to break on dribble, \nno, y'all are losing some dribble. Wait,   it dribbles just like a real ball. Oh my god, \nit's not even breaking. We also have some   clouds over here. There was a bar area that \nwas a little bit in the way. So in order to,   you know, have this still fit the theme, we \nused polymer fill and these LED lights. It's   beautiful. To make this really cool glowing like \ncloud effect over here, the fridge is empty. Um,   so if you just want a beverage, just Oh, what? \nSo cold. Super super cold. So just enjoy that. [Applause] This is not Chester found the budget \nones. I got to take a jump shot. Oh no. No. That is You guys are losing points. All \nright. You Let's test the functionality with   some 1v ones. I'm on Jake. All right. Let's \nsee the playability. Don't you love that you   just didn't have to go put on shoes just \nnow? But look at that clap. [Applause] David, I want to see you get a jump \nshot in. Hey, how do I do that? Wait, Jess, who's your favorite basketball \nplayer? Boom. LeBron James to Curry back   to Iguodala up for the layup. Oh, blocked \nby James. The Cavaliers are NBA champions. Welcome to our outdoor court. Have a giant \nmural of the greatest athlete of all time,   Steph Curry. This is honestly incredible. It's \nhonestly so good that I would almost feel like   bad playing on it cuz like I wouldn't want \nto like affect it at all cuz it's just such   a great piece. In the background, we even have \nthe Golden Gate Bridge over here. And I like   how subtle it is. Like the darker yellow on \nthe yellow quarter. Hell yeah. And I love   these. So like you don't have to go and chase \nthe ball. I love that. Yeah, that hoop looks   like insanely nice. This is a regulation hoop. \nNotice the no restriction on how high of an arc   you shoot it. I do notice that the ceiling. And \nthen over here we have a basketball rack if you   want to test out the court's functionality. The \nball's not hot. Don't touch this. Oh, it is. Oh,   there's a bug on the Damn, that is hot. It's not \nthat hot. These mini walls I feel like are just   such a different vibe than the rest of the court. \nIt matches the hoop. It's like black, white,   and gray. It's modern, minimal. Let's test out the \nfunctionality. They did say since Curry's on this   court, you are blessed with Curry's three-point \nshooting. So, if you take a three-point shot,   I I guarantee you, you will not miss. Curry. \nDamn. David, demonstrate. Yeah. Let me see.   Let me see if this curry blessing is \ntrue. Oh my god. Curry blessing. Oh. Oh. Hey. Oh. Hit a slippery court. What happened? \nIt was It was your skills. My skills. Thank you.   You got the space. You got the three-point line. \nThere's nothing blocking you. It's good vibes.   Like I I really I really do like this place. \nLet's talk about the court. So the outdoor court,   I mean, best art piece in the video by far. \nLeagues ahead of the other room in terms of   artwork. But the thing is the other room just had \na better vibe. Okay, I don't know if it's the heat   messing with me, but I like that it was like all \nthe walls had artwork. Obviously, you can't really   have artwork out here, but I feel like cloud theme \nis a little overplayed. Okay, I feel like it's   like if I were to do an art challenge, I would \ndo clouds cuz they're easy. But those airless   fake basketballs pissed me off. They literally \nbroke on dribble. So, that definitely lost them   some points. One has better art than the other, \nbut one is more of an overall piece. I'm like   50/50 right I might have to even flip them away. \nI have the decision in my mind. Let's start with,   you know, functionality to the basketballs. Yours \ncracked in half, but yours were on fire. Okay,   so there were cons to both of y'all's basketballs. \nI mean, you told me you built this from the ground   up. Nothing there. To have this vision to build \nthis and with the netting around it is insane.   Like ground up that is round of applause. Now, the \nmini fridge was the biggest airball ever. Like,   how was that not stocked with beverages for the \ncourt? Like that was a miss. I think creativity   y'all win. Artwork you guys win. But the third \nthing was playability. And playability I have   to give it to your team. And that means you guys \ngot two of the categories. You guys got one. So   you guys win the basketball court. Oh god. Oh \nmy god. Yeah. I mean the art was insane. Huge.   Thank you to Jesser. Subscribe to Jesser right \nnow. So Michelle should be back from Indonesia   now. We're going to give her a call to see \nif she landed. Did you just land? Uh-huh.   I'm pulling in really soon. Wait, I'm going \nto need to show Michelle the court. Okay. Hi,   Michelle. Hello. Why am I filming right now? \nI have a surprise for you. I love surprises.   I I know you love surprises. Oh my gosh. Let's go \noutside. Zachary, what is that? Let's go outside.   Let's go outside. Isn't it nice outside? Well, \nZachary, I think I I see a basketball court.   Oh, that does stand for the basketball court. Do \nyou know who this is? Yes, it's Steph Curry. Yes,   it is pretty cool. That's why I sent you \nto Indonesia. How much did you spend? Is that okay? I think it's best we keep \nthis. The wife likes it. All right. And   I'm not going to lie, I DM'd Curry before \nto try to get him to see this. So, Curry,   if you're watching this right now, I hope you like \nit and please respond. I really want to collab.   Please. You're my favorite B. Thanks for watching. \nSubscribe. We'll see you in the next one. Bye.",
    "start_time": 0.16,
    "end_time": 1641.28
}