{
    "video_id": "PT2Q_mHzLG0",
    "channel_url": "@zhcyt",
    "transcript": "We are about to take a 7-day road trip in this \nCyber Truck. Why? Because my little sister is   getting her driver's license, and I want to be \nthe first person she ever drives with, but she   lives across the country. So, I'm driving this \nCyber Truck that I'll be painting along the way   to surprise her for her first ride. Keep watching \ntill the end because we risk getting stranded in   the middle of nowhere on this road trip. First \nthing we got to do is rent a Cyber Truck cuz   my wife said there's no way we're spending a h \n100red grand on it. Oh, here it is. Uh, we should   probably rent it, right? We are not spending that \nmuch money on that. It looks a little bit like a   box. Go inside to test it out. Oh my god. You're \ngood to go. Good night. It's really dark. So,   I rented a Cyber Truck for the week and got \nit wrapped so we can paint it on the road.   The Cybertruck is now completely wrapped white. \nWait, what do you guys think? So clean. My wife   and I packed our bags, got in the Cyber Truck. \nMichelle, you said you always wanted a white   modern house. Oh, this is it. Yeah. Thank you. and \nhit the road to start our 7-day road trip. Road   trip. I'm so confused by these controls. Wait, \nlook at the steering wheel. It's like a video   game controller. But first, we needed to stop by \nthe store for some supplies. Get sheets. I'm on   a very thin pillow. I usually need two pillows. \nMichelle, we can get a desk. Portable AC. What   about this? Feels good to be home. Feels good \nto be home. We need a lava lamp and a desk lamp.   We're going to create a home cyber truck gym. All \nright, we're going to get a ball. Yay, Michelle.   They look like a happy couple. They look so happy. \n22 in high. Oh, wait. 12 in. I'm surprised you're   still happy with 10 in. All right, we have \neverything we need. We're going to go to   our camping grounds and set up our room there. \nWho's going to be doing most of the driving? I   think you should. I'm a bad driver. If you see \na bad Cybert truck driver, sorry, that's me. Okay, I'll do most of the driving. Look, \nStephie, there's a fellow cybers. Oh,   yeah. Hello. Hello. Hi. They look just as silly as \nus. After a couple hours of driving, we made it to   our first supercharger. All right, our first \nstop, the supercharger. Good trip. Good trip.   We just reached our first stop. It's been around \nlike 2 and 1/2 hours. Honestly, not too bad. Yeah,   except for when we hit a bunny rabbit. It was \ndead. It was dead already. There's so many bugs   at the front. E. Now it's time to get back on the \nroad. And this time, Michelle's driving. I feel   really tall. I'm scared. You look so nervous. I \nam nervous. I'm a very anxious driver. On day one,   we really wanted to cover a lot of ground. So, \nwe drove a lot. And after a few more hours,   we made it to our second supercharger. How's \nMichelle's driving? Scary. Get Michelle. And   then the third. All right, let's charge her up. \nNot going to lie, charging the car takes so long.   I'd rather just go to the gas station and fill \nup some gas on a road trip. Zach, you're creating   a graveyard. Oh my goodness, dude. There's like \n1,000 bucks on there. And as the day came to an   end, we found a nice spot to stop. We're going \nto camp out here and rest for the night. We're   just in a random parking lot. Michelle looks so \ntired. I think we might just lean our seats as   far back as we can. Oh my god. Set the moon. Wo. \nThis is our setup now that we have our LED light.   Tomorrow we're going to build our entire room. \nTonight it kind of just looks like a mess. Good   night. We should cut that camera. Good morning. \nWe are on day two of our road trip. We're up   bright and early. I think we slept okay. My my \nneck hurts a little bit, but other than that,   not too bad. My hips are a little tight, but it's \nokay. We're ready to hit the road. We're going to   drive a little bit and we should be at our next \ndestination soon. After reaching our next stop,   we began to put together our little mobile house. \nAll right. So, last night Michelle and I slept up   there and it wasn't the most comfortable. So, \nwe're going to start out by building out our   mattress. We have a custommade cover over here. \nCybertruck had this Cybertruck tent that they were   advertising for $3,000 and it looked really cool. \nWe looked at the pictures and replicated the exact   one we saw in the concept. We also got a portable \nAC. Ooh, we have a lava lamp. Michelle, do you   want to check out your dream room? This is the \nmost beautiful dream room ever. So, to make things   a little more interesting, Jake actually mentioned \nthat on road trips, couples fight a lot. Oh, Jake   proposed the idea that if we ever get annoyed at \neach other, we have to stop exactly where we are   for 24 hours. Yeah, because, you know, you guys \nare going to need time to like work things out,   figure out how to move forward before you guys can \nstart driving again. I'm going to try my best not   to get annoyed right now. Just to make sure we're \nnot arguing or getting really annoyed at all,   we should have a safety word. Oh, like um \npineapple. Okay. Yeah, we can use pineapple. How   about you two just like list off a couple things \nthat would, you know, make you upset with each   other that you shouldn't do? I get a sweet treat \nat every stop and you can't say anything about   it. You cannot talk about Karina for the rest \nof the trip and I get two entre for every meal   I have. Happy full wife, happy life. I feel like \nthere's about to be a VO and an overlay shot thing   and it's not going to go as planned. And well, \nthat's exactly the case. Pineapple. Pineapple.   Pineapple. Pineapple. Oh, pineapple. We'll seal it \nwith a kiss. No idea. Can I also make a rule? No   PDA. This trip is going to be a ton of driving, \nso along the way, my friends and I are going to   stop at some insane places as we make our way to \nmy sister. Starting with a natural spring. 3 2 1 You go. How's the water? Pineapple. Pineapple. Here, Michelle. Get to the finish line. Get to the \nfinish line. I did it. After a nice refreshing   time at the pool, we were off on the road again. \nIt's charging. Oh my goodness. There's so many   people in this car now. Time for dinner. All \nright. Who's hungry? Me. I'm starving. All right,   let's go eat. I'm allowed to get 200. Yeah. \nPopcorn. Pop pineapple. Pineapple. We established   this earlier. It was established that get two \nentre is insane. Hello. Do you recommend the   peach milkshake? Sure. Can I get that, please? All \nright. Uh, that's it. Promise me two Audrey. You   did promise me. I promise I Yes. I love you. \nI won't leave you. Yes. and and have babies. You guys have a good one. Thank Thanks for making \nus chicken. After a quick family meal, we got   right back on the road. And this time, Jake and \nDavid joined us in the back of the Cyber Truck.   Did you guys see the little tornadoes? Wait, \nare those like dust devils? Dust. That's what   I thought. Dust devils. Yeah, dude. There were so \nmany of them. Found a good area to go camp out for   the night. Yeah, right next to us. Scouting a good \nlocation. Drooling cow. Hi there. Wait, there's   a Wait, it's Mr. Steak. Oh my gosh, it's a cow. \nWhy does it look so skinny, though? Wait. Yeah,   it looks very skinny. It looks like it's kind of \nlike wondering what spaceship it's looking at at   the All right, guys. Let's pull in over here. This \nis where we're sleeping. It's so pretty. Look,   you can see the sunset from here. This is actually \nquite spacious. Wait, these mats actually aren't   bad. Wait, it really is so beautiful though. Wait, \nguys. You know the only thing missing? Light. The   LEDs. One LED over here. Bougie. We'll put one \nLED back here. Oh my goodness. Wait, this actually   looks so cool. Our room's done. Wait, right after \nthis, I need to kick you guys out so I can give   a room tour. No. This is our Cybert truck room. \nThis is our bed. We have some pillows over there,   blankets, bubbles, and honey in case we get \nlonely. Over here we have a lamp. We got an   AC. And all over here we have it lined up with \nLED lights. The side of this is all mesh so you   can see the sunset and everything around it. And \nI can pull this down as like a little door. Wait,   this is actually so comfortable. Let's get \nready for bed. You're going to sleep so much   better tonight. Oh, this is so nice. You like \nyour room? I do. All right. All right. Well,   I guess we're going to rest up a bit and we're \ngoing to get ready to hit the road tomorrow.   I'm honestly so happy with how the entire camper \nturned out. Michelle, would you rather have our   house or 20 Cyber Trucks? Maybe our house. I guess \nthat's smart and responsible. [Music] All right,   so we're on day three of the trip. Time \nfor our first supercharge of the day.   But the main reason we're driving all the way to \nCalifornia is to surprise my little sister with   her first drive ever. I want to check to make \nsure she's on track to getting her permit. Is   she going to ghost you? No, she wouldn't do that. \nYour call has been forwarded to voicemail. We were   just supposed to get to our supercharger stop \nin Phoenix like 15 minutes ago, but Zach keeps   making wrong turns because he's listening to Ives. \nDude, it's so confusing. It gives me an exit. So,   I go into the exit lane and then next thing \nyou know, I'm stuck exiting on some exact. Yes,   get over into the middle. You're going \nto make it left. Left. You know what I   am? Dang. I am. All right. We're going to \nlet this trash for a bit and I want to do   something fun for my friends. Yeah. I'm going to \nLulu Lemon. Go. Really? Run. Run, Jake. Go. Go. 5 minutes. Easy. $130. Easy. Easy. All right. \nSo, we just charged up our Cyber Truck and   we're ready to go. Oh, I'm sorry. Did you just \nreverse? Yes. Just a car. Once back on the road,   we drove a few more hours before \nfinding a place to rest for the night. Okay, so we're already on day four of our trip. \nWe went to the gym this morning. We got some   breakfast and now we're getting ready to go to the \nGrand Canyon. Give me a kiss. PDI. Too much PDI.   Too much PDI. On the way up to the Grand Canyon, \nthe scene was absolutely beautiful. So far,   we've mainly only driven in hot, dry areas. So, \nthis was a great change of pace. Wait, look at the   hill over there. That looks so cool. All right, \nwe found a nice place to stop. We finally have   some time to customize the Cybert truck. As if \nit didn't stand out enough already. Jake, what   do you think we should do? I think that we should \ndo a dragon going like through the cybert truck on   each side and then the head popping out the front. \nThat's cool, but I think we should do a bunch of   pretty fairies and bubbles and sparkles all over \nit. I think we should make the whole car pink and   then paint tunes on it. I kind of like the idea of \na creature going in and out of it. We could have a   ton of cracks in the car. We should do different \nsceneries in the crack. And I think we end up   having the creature come all the way around here. \nThere is one problem. We've been driving a lot and   I feel like our bug problem only got worse. \nAll right, Michelle, you got this. Michelle, is it coming off? Oh, yeah, it is. At least \nwe can see the progress we've been making.   This isn't an art piece where you get a \nsketch first. Zach is going straight in   with the black paint. A lot of scales. All \nright, cool. Let's get started. So, we just   started painting and I think we're making really \ngood progress. Jake is working on the scales.   David's working on the cracks and Zach is also \nworking on the dragon scales as well. Zach is hard   at work. David is hard at work. I was just hard \nat work, but we are missing somebody. Michelle is   just sitting in the Cybert truck passenger seat \nwhile we're trying to paint. So, personally,   I'd like to say pineapple. Pineapple. Pineapple. \nI was enjoying the paint. But there's such a nice   breeze. Yeah. We spent about an hour painting over \nthere and even though we didn't finish all of it,   I think we made some really good progress and \nwe're going to continue painting it soon. In   the meantime, we're off to the Grand Canyon. None \nof my friends have ever been to the Grand Canyon,   so I was super excited for them to \nsee how beautiful it was. All right,   we're here now. Yay! Let's go check it out. \nHoly crap. I know. It's just right over that.   Oh my god. Oh my god. Oh. Oh my god. Holy crap. \nNo way. This is real. This is insane. Holy crap.   That doesn't even look real. It looks like \na cool thing. Jake, this is what you see on   desktop screen savers. Yeah, there's more. Wo, \nit's so bright and orange. This thing is so big. [Music] All right, so for this next stop, we're \ngoing to be seeing a lot of animals. It's like   a little forest safari. Wait, this place is so \ncool. This is so cool. Now we're going to see   reindeer. Reindeer. I lost the van. Wa! That was \ninsane. Wait, it's not letting you pass. Next up,   we have bears. Oh, wait. Look at it. Little \npaws. Oh my gosh. The bear is bathing. Wait,   that would be you. Michelle, that bear was \nkind of annoyed at the other bear. That was   like us earlier. Well, maybe one's annoyed cuz the \nother bear won't stop looking at other girl bears.   Holy crap. Wait, look how chunky they look. \nWait, this one's ginormous. I look like I'm a   National Geographic. That bear's scratching up \non the tree. Look at that. Oh, that's so cute.   That looks amazing. After seeing some beautiful \nanimals, we stopped to paint the cyber truck,   but realized we had a bit of a problem. Also, \nI just realized since we're driving through   dirt roads, we have to wipe down the car a \nton. Oh my god, there's so much dirt. It was   like sanding off the paint. All right, we can't \nwipe it since it's taking off the paint with it.   We went through the back. Oh, okay. Oh, never \nmind. Water is not going to work. Uh oh. Wait,   I literally messaged you today and you \ndidn't respond. Oh, pineapple. What's up? Uh,   nothing much. Are you studying for your permit? \nMy test is tomorrow. Are you going to pass the   test? I hope so. Are you excited to see me? Oh, \nyeah. Oh, yeah. Nice. Nice. Yeah. We saw Oh, yeah. What happened? I blew my lashes away. Where did \nit go? I don't know. Your lashes are gone here.   Michelle, how could you lose your lashes? I \ndon't know. There was a huge gust of wind. I   don't know if you guys felt it, but I think \nit just blew it away. It is day six. We are   pulled over right now because the check engine \nlight came on in the van. So, that's great. Bro,   the check engine light to the van just came on. \nWhat? The check engine light to the van came on.   What? It's really windy. The check engine light to \nthe van. You want Chick-fil-A? Just come here. Oh,   yep. It's on. Oh, yep. Totally fine \nwith that. The check engine light just   came on and we're like hours and hours \naway from our destination still. Wait,   I have an idea. That definitely worked. Wait, \nreally? No, it's still on. Michelle is currently   redoing her lashes cuz her other lashes are \ngone with the wind. It's forever gone with   mother nature. We're about to hit the road for \nanother around 2 hours or so. We're at our next   location of this road trip, the desert. Oh my \ngod, Michelle. What? Look at your eyelash. Oh, there's one. Where's the other? You guys said \nyou've never been to a desert before. Let's go   then. Zachary. Hi, Zach. We're here right now in \nthe Mojave Desert in California. And right now,   we're walking to the dunes. Come quick. Come \nquick. Right here we have a munchie. She looks   innocent, but careful. If you get too close, \nshe might pounce. Wait, dude. Do you want to   point it out again? Your other lashes on my \nshoe. There's no way. Michelle, we found it. We   found your other lash. What the hell? Michelle \nhas officially been reunited with her lashes.   I'm so happy. I'm glad we came here, but I'm \nreally hot and I'm ready to go back to the car.   I'm curious to see how much sand is in our shoe. \nMichelle. Jake. Jake. What were you doing, Jake? All right. So, we drove out of the desert \nand right now there is a giant train just   stuck in the middle of the road and it's not \nmoving. What if the Cybert truck dies? This   is very bad. We need to figure out something \nfast because we're running so low on battery   and if we can't make it to a charger in time, \nthis entire trip is doomed. We're going to be   stranded. We're going to need to call a tow truck \nand we actually don't even have cell service.   What is happening? Well, we got a train stuck on \nthe tracks here and the check engine light. The   check engine light is still on and I'm just hoping \nwe can make it through. Oh my god. The train goes   for as far as the eye can see. We may be stuck. \nWe're going to miss Joy. This is really bad. Oh,   Jake's coming back hopefully with some good news. \nWhat's it looking like? He said a bunch of people   ended up turning around to go take Route 40. Are \nyou serious? So, I'm going to go back over there   with my phone. And he said I can use like I he \nprobably has like a Wi-Fi. All right, Jake going   in for the rescue. Michelle, are you just playing \nsolitire? Yeah, we're stuck. After Jake discussed   with a man who had been stopped for an hour \nalready, we decided to turn around and things were   not looking good. Um guys, we're not going to make \nit. It says we're going to end with -3. Really?   Yeah, guys. I'm not even joking. It's got to be a \nclose charger. That's the closest charger I saw.   We're going to go on the 40. It's an extra 70 m. \nCan someone call real quick? With no other choice,   we found a charger that was just a bit closer, \nbut in the opposite direction of where we had to   go. This other place we found will make it with \njust enough charge to get there. We just got to   make sure we make no wrong turns. Otherwise, we \nmight actually be stuck out here. We made it. We   did it. Oh my god. We barely made it. It is at 6% \nright now. We have to turn down the AC in order to   make it. Why is nobody honking? [Music] It's like \njust Hi. After charging, we're going to have to   make up some lost time and drive even longer \nthan we expected. Oh, they honked. Michelle,   so many people are honking. Oh my god. Everyone's \nlike Michelle wasn't intimidated by the honks at   all. She was actually quite flattered. Dude, there \nhave been like seven honks. Seven cars honk at us   in the past 10 minutes. I can't tell if they are \nhonking because we're in a cyber truck and there's   art on the side or because Michelle's not driving \ngood or because they like Michelle. Like she said,   she's so popular. Oh, they hugged. Oh, \nMichelle, you're so popular. Oh, hi. Michelle,   how does it feel to get so many honks? It \nfeels so good. And they were all friendly   hawks. We made it to the next supercharger. Wait, \nlet's walk around the side. Oh, your shoes are Oh my god, the license plate's \nbroken. I don't get it. Michelle, it took you so long to notice it. We \nliterally wrote this at the start of the day. Oh,   wow. I need to start paying attention more often. \nNo wonder you guys have been acting so weird all   day. We're not acting weird. As you guys can see, \nwe have some pretty intense blue lights in the   back seat. Really getting the mood up in here. Am \nI right? Yes. Told you. Holy crap. I thought that   was for us. After finding a spot to rest for the \nnight, we got up bright and early on day seven   to start our drive to meet my little sister, Joy. \nGood morning, everyone. Uh we are up really early   getting ready to hit the road and I noticed \nsomething. Jake, what? While Michelle and I   were sleeping in here overnight, uh someone left a \nlittle note and I actually didn't even notice it.   Hi, you are blocking my parking spot to the right \narea. If you back block it again, I will have   your car towed. Thanks. Whoever did this is not \nhappy. Jake, I'll bet you they didn't honk. Guys,   can you believe it? This is going to be our last \ncharge of the entire trip. I know. It's kind of   crazy that we're already here. We're around 2 \nhours away from my sister. We're going to finish   charging and then we're going to finish up the \npainting and surprise her. I'm not going to lie.   If this was the first car I ever drove, I' i'd be \npretty terrified. Did she pass her test? I think   so. She gets pretty good grades and she's not like \nme. Once finally making it to my hometown after   another 6 hours of driving, we made one last stop \nto finish our painting on the side of the truck.   Tada! We made it to the parking lot of the place I \nused to swim. Right now, I'm adding the finishing   details on the dragons. David and Jake are doing \nthe space cracks, and Michelle is just cleaning   the entire car. We're very tight on time, but \nI feel like already changing all the cracks to   space cracks has made it look so much better. So \nfar, the space cracks are going really well. We   don't have that much time, so I'm painting really, \nreally fast. We can surprise Joy in 30 minutes.   I just finished cleaning the car. It got really \ndisgusting on the trip. So, in order to make the   car look presentable, I cleaned this. Now that \nthe painting's finished, we're about ready to   surprise Joy. But first, we had some 3D printed \ncustom parts to add. This is a normal Cyber Truck   and this is the aftermarket body kit that we're \n3D printing. So, you can see right here we have   a custom bumper and we have these really wide \nwheel wells. And then we have like these custom   vents on the side behind the windows. And right \nnow, we're in the process of printing the bumper.   I'm good to to just snap this off. Go for it. This \nis it. Okay, this goes into the bumper box. Mike   is going to basically glue these all together and \nthen they're going to be put onto the Cybert truck   using double-sided tape. It basically looks like \nthe hardest jigsaw puzzle I've ever seen. I'll   leave this to Mike. The Cybertruck has all the \npaint on it, but the last thing we have to do is   put on the 3D printed parts. Jake, I feel like you \nshould know what's going on here, right? Hey guys,   to be fair, when I was there, they weren't put \ntogether quite yet. They look a lot different now.   Do you remember making them, right? Yep. Okay. \nI think Yeah. Wait, this looks like the right   measurement. Okay. I want to say this goes all the \nway at the front. So, this is half of it. Wait,   this didn't come with the instructions. Uh oh. \nLike that? I think it doesn't look right. No, it's   right. Dude, I am so confused. Uh oh. Uh oh. Jake. \nJake. No. I Guys, I think we pack it up. We can   put it together at the studio. Say no more. After \nunfortunately scrapping the 3D printed parts,   we were off to meet Joy. Hey everyone, guess what? \nWhat? What? We're 3 minutes away. We were going to   have my little sister try to drive this car, but \nshe took the permit test this morning and failed   it. So, where's my brother? I'm escorting you guys \ninto the siren truck. Wow. Hello. Welcome to your   ride. Hi. What do you want me to do? This is the \nbattle of the introverse round two. It's weird cuz   you're not getting out of the car. Do you want to \nget in the car? Okay. Originally, I was going to   teach you how to drive, but since you don't have \nyour permit right now, I will just be your limo/   Uber driver. Do you want to get boba? Yeah. Hello. \nI love your guys' channel. Oh, thank you. Yeah. Do you want to go shopping? I'll buy \nsomething for you. Let's go. Okay,   let's go shopping. Where do you want \nto go? You want to go for over 21? No,   I know that. Although my goal of having my sister \ndrive her first car ever together wasn't met. I'm   still so grateful to have made the 7-day road trip \nwith with my wife and my friends and make memories   that will last a lifetime. Oh, Joy, I need to go. \nLove you so much. Thank you. Okay. Bye. All right.",
    "start_time": 0.16,
    "end_time": 1485.6
}