{
    "video_id": "d6MycDPbqxQ",
    "channel_url": "@littleangel",
    "transcript": "Little angel [Music] made by me. Watch me make pink glitter slime. [Music] >> Oops. >> Huh? >> Sometimes you got to make a splash. >> Make a splash. Getting messy is where it's at. Mix a little stir a little. Shake a little. [Music] Put on your goggles. It'll be a show. Science ready. It might explode. [Music] >> Huh? >> Whoops. Hm. Mhm. >> I got the skills to make the best at making a mess. >> Oh yeah. >> Dropping things and making things pop. >> But it's science. We can never stop. A bit of this, a pinch of that. Science is fun. Mix it. Stir it. Shake it. fun. [Music] That is how he's done. [Music] Let's get [Music] We need to follow the recipe. >> Just cuz I'm a princess, I don't have to stay clean. I'm trying to get messier than chaos is a middleman. I've done it again. My hair more chaos. Let's eat some more. [Music] Huh? And that was our slime show. [Music] [Applause] >> Huh? [Music] This turn really is the best. Someday I'll be just like her. Brother, you are my best friend. I can take a ball and be like you. Brother, I want to play along. Sister, I am brave and strong. [Music] I love learning something new. Playing sports together is fun to do. Sings are the best do. They are my best friends. Playing together is so much fun. [Music] >> Hey baby John, you want to find some bugs with me? >> Yes. Yes. Yes. I want to explore. Brother, what are you looking for? Searching, searching here and there. We can find adventures everywhere. Brother, we can look around. Brother, tell me what you found. I wear my hat and look at tiny things to a big brother is the best. He is my best friend. Finding an exciting so much fun. Baby John, time for a tea party. >> Yes. Yes. Yes, >> brother. Would you like some tea? Brother, come and sit with me. Our friends love the party, too. Party time is extra sweet when I'm with you. Sister, it's fun to play pretend. Laughing and eating treats with friends. Uh-huh. Sharing and seeing everyone are a special time for fun fund do sister is the best do she is my best friend parties with you >> let's all do some arts and crafts >> yes Yeah, we can see blue and green [Music] all the things we want. Painting it together is so much fun. Making a story we can share. Pictures, pictures everywhere together. We love to create. My sister and my brother are siblings are the best. They are my best friends. My sister and my brother. >> Well, kids, we're almost there. Be good with Nana and Grandpa. >> Look, there it is. Nana's farm. There they are. >> Come here and give your grandpa a hug. >> Grandpa mama. Hello. >> Hi, baby John. How are you, honey? >> Bye. >> Bye. Bye. >> Bye, Mom. Bye, Dad. Bye. Who's that hiding in the straw? In the straw. Who's that hiding in the straw? Let's go look and see. Jill, you found a little lamb. Little lamb. Little lamb. Jill, you found a little lamb. A friend for you and me. >> A look. He's so cute. >> He's not ours. I've never seen him before. He might be lost. >> Oh, he's just a baby. He might miss his mommy. We should look for her. >> You go to the left and we'll go to the right. We went searching on the left, on the left, on the left. We went searching on the left to find the mama lamb. >> We went searching on the right, on the right, on the right. We went searching on the right to find the mama lamb. >> We didn't find his mom or his home. >> Oh, I have an idea. Let's make posters and stick them everywhere. >> That's a great idea, Jack. >> Yes, he can stay with us for now. You can name him if you want. >> Woolly. His name is Woolly. >> Can you still lamb? Little lamb. Little lamb. Can you still lamb? I want to take a picture. I will draw the little lamb. Little lamb. Little lamb. Patiently I draw the lamb. It's such a pretty picture. >> The posters are ready. >> Great. It's time to go. >> Come on, let's go. >> Ride the tractor into town. Into town, into town. Ride the tractor into town to help our little lamb. We hung posters up and down, up and down, up and down, everywhere and all around to help our little lamb. >> Oh, woolly looks a bit dirty. It's a bath. It's easy. I will show you. Just pull this lever down and water comes out. You want to have a bath too, baby John? Give the little baby back. Baby jump in the spade. You shake shake shake. [Music] A let's go and play outside. Play outside the animals will stop and say hello. Little lamb you must behave. Just behave. Must behave. Little lamb you must behave. Everywhere we go. [Music] Look, it's a mommy. >> Hello. I saw your poster. I knew it was him because of this great boy. You are right, Mr. Shepherd. [Music] [Music] >> Are you excited for school? >> Absolutely. [Music] I've got a big smile and a bigger heart. Ready for a new day to start. Put on my shoes. I've got to move. So much to do. It's going to be a pink day. Smiling all the way. It's going to be a pink day. [Music] It's mag. It's going to be a pink day. Bye, Mommy. [Music] Helping my friends is what I do. I want them to have a great day, too. If once in a while I can make them smile, I'm going to make them feel brand new. It's going to be a pink day. Smiling all the way. It's going to be a pink day. My heart's full. It's mag. It's going to be a pink day. [Music] I want to be there for my friends. They're always there for me. >> Pink day. Good vibes never end. Spread positivity. It's going to be a pink day. Smiling all the way. It's going to be a big day. In my heart's mag. It could be a great day if your day isn't flowing like mine. We can make it. We can make it shine. Stick with me. We'll have a good time. We can make it pink. We can make it shine. It's going to be a fun day. smiling. It's going to be a day in my heart. It's going to be a pink day. Wo wo smiling all the way. It's going to be a pink day. Wo wo. My heart is full. It's going to be a big day. [Music] I want to be a ballerina show. What to do? I want to be a ballerina show. [Music] 1 2 Let's go. Dance with me. Ballet is so fun, you see. We are family. Ballet is so fun, you see. Let's go. Dance with me. Ballet is so fun. You see, we are a family. Ballet is so fun. You Ouch. Sorry. It's okay. I'll show you. Follow me. >> You got it. >> I want to be a ballerina show. Me. What to do? I want to see a ballerina show. Me. What to do? So I can [Music] ballet. makes us strong. We love dancing all day long. Sometimes it goes wrong, but we love dancing all day long. Ballet makes us strong. We love dancing all day long. Sometimes it goes wrong, but we love dancing all day long. Rise up and down. Rise up and down. Level up and down. Up and down. I want to be a ballerina show. Yay. What to do? I want to be a ballerina show. What to do? So I can. We are bestest friends. When we fall, we try again. We all help our friends. When we fall, we try again. We are best friends. When we fall, we try again. We are helpful friends. When we fall, we try again. And jump. Do you think you can do that? >> Wo! Wo! Oh, I want to be a show. What to do? I want to be a show. What do you do? So, I got one. If you are doing great, don't give up. It's what we say. We all love ballet. Don't give up. It's what we say. You are doing great. Don't give up. It's what we say. We all love ballet. Don't give up is what we can do. You [Music] Great job, girls. And a special welcome to Bill. >> Yeah, [Music] >> it looks amazing. I can't wait to wear it. No, I can't wait to wear it. Everybody look at me. Look at my new dress. I'm so pretty in pink just like a princess. [Music] Can't you see? I dress impressed. When I put this on, I just feel the best. It's my favorite color. It matches my hair. I can't wait to wear it everywhere. Step to side. It's our moment to shine. I bet you love a dress as pretty as mine. Fashion, passion, style. Voila. So chic. All the eyes on me. Look at my cool moves. Trust in my own style cuz that's what I do. [Music] Look at me. I'm dressed impressed. When I put this on, I just feel the best. It's my favorite color. Nothing compares. I can't wait to wear it everywhere. That's the sky. It's our moment to shine. I bet you'll love a dress as pretty as mine. I'm the queen of the catwalk. [Music] Fashion is my passion. Watch me strike a pose. I can do anything in these clothes. Makes me feel so brave. Makes me feel unique. I feel like my best self when I look chic. Fashion. >> Yeah. >> Strike a pose. Passion. Style. Steal the show. Voila. So chic. Watch me glow. It's my favorite color. Nothing compares. I can't wait to wear it everywhere. Step aside. It's our moment to shine. I bet you love it. Just as pretty as mine. Passion. Strike a pose. Passion. Invisible. Style it. Feel the show. Voila. So chic. Stripe. [Music]",
    "start_time": 0.32,
    "end_time": 1237.66
}