{
    "video_id": "RSyWMr9GlvE",
    "channel_url": "@littleangel",
    "transcript": "Hello angel. [Music] It's Halloween spooky spooky. It's Halloween hot Halloween costumes. Just you and me. Spooky spooky family. It's just fun. It's our hall is done. [Applause] [Music] It's Halloween. Hop hop. Halloween. It's Halloween. Get dressed up and every spooky spooky family. It's just makeup. Do you see? It's not scary. It's just fun. It's how is ah [Music] It's Halloween. Spooky spooky. It's Halloween. Get dressed up and rewind. All our friends are on the street. Do you want a trick or treat? It's not scary. It's just fun. It's how Halloween [Applause] It's Halloween. Halloween. It's Halloween. Halloween. Leave candy. Super sweet. So much fun to trick or treat. It's not scary. It's just fun. It's Halloween. It's Halloween. Spooky spooky. It's Halloween. [Music] Happy Halloween. >> Yay. [Music] We're not scared. We are not scared. It's me and we are we are to share lots to share. [Music] We are Christmas. Today we're making today's We're the day. You too like this. I'm scared. Not scared. [Music] We are We are to share. We are to share. Me today we're making and we're face painting. Oh yes. Today the day today we're making and we're face painting. Oh yes. Today the day so pretty. [Music] This is fun. We're not scared. We're not scared. If we are we are we are to share. Lots to share. Me today we're tasting and celebrating. Are you Sia? Today is the day. Today we're tasting and celebrating. Are you today the day? [Music] [Applause] We're not scared. We're not scared. We are not to share to share. I could be today together and today is better when we're together. Oh yes. [Music] It's music class. Woohoo. [Music] >> It's a lovely Halloween. Walking down the street. And then we go from door to door. Knock the open. Treat or treat. Give us something good to eat. Or treat. Halloween is sweet. >> Things are spooky. It is dark. It might give you the chills. I like it. It's not spooky at all. It is just for fun. Treat something to eat. Treat. [Music] You can meet up with your friends. They will try to you can trick or treat them. It's going to be so cool. Trick or treat. Give us something good to eat. Trick or treat. Halloween is sweet on our street. [Music] People might give you candy and sometimes people won't always there to share it all with you. Drink or treat. Give us something good to eat. Drink or treat. Halloween is sweet on our street. [Music] If they don't give you candy, they have healthy snacks and fruit. Why don't you give it a try? It's delicious. Drink or treat. Give us something good to eat. Trick or treat. Halloween is sweet on our street. [Music] When we finish trick or treat, it's time to eat our sweets. Woo! Share them out with everyone and we'll get so much more. Trick or treat. Give us something good to eat. Treat or treat. Halloween is sweet on our street. A bit of candy for each day of the week. Halloween is really great with so many things to do. A party with our family is really fun, too. Give us something good to eat. tree for treats. Hall is sweet on our street [Music] on your street. It's Halloween. Wow. Happy Halloween. It's Halloween. I'm going to be the scariest thing I ever seen. It's Halloween. What do I need? Point twice treats. Yay. It's Halloween. Creepy. Scary. That's what I want to be. I want to look the best on Halloween. [Music] I'm a ghost. I want to see the most. I want to look the best they've ever seen. It's Halloween. It's Halloween. Let's get ready. I'm going to be the scariest thing ever. It's Halloween. What do I need for tricks and treats? It's Halloween. How cool and scare with everything I wear. I'm going to look the best on Halloween. Cuz I'm a ghost. I want to scare the ghost. I'm going to look the best day I've ever seen. It's Halloween. It's Halloween. Let's get ready. I want to be the scariest day for Halloween. What do we need for treat as treat? There's a ghost around me off the ground. I'm going to look clos [Music] and look the best they've ever seen. It's Halloween. It's Halloween. Let's get ready. I'm going to be the scariest ever. [Music] What do I need for tricks? Tricks. [Music] [Music] This is the way we put on our teeth. Put on our teeth. Put on our teeth. Let's put on our vampire teeth on this Halloween night. [Music] This is the way we put on our hat. Put on our hat. Put on our hat. Let's put on a witch's hat on this Halloween night. Wa wa. [Music] This is the way we stir the pot. Stir the pot. Stir the pot. Let's stir the brew inside the pot on this Halloween night. [Music] This is the way we decorate. Decorate. Decorate some pumpkins and some skeletons. On this Halloween night, this is the way we all out. All out. This is the way we all out. On this night, [Music] Trick or treat. This is the way we trick or treat. Trick or treat. Trick or treat. This is the way we trickor treat on the Halloween night. [Music] Yeah. Woohoo. [Music] Special day. We together. The flowers and lights. Shine all day and night. With our love on this special day. [Music] Make it wonderful. Make it so colorful. Amazing everywhere. It's big and wonderful. Make it so colorful. We do our best to show we can a special we together [Music] with our loved ones on this special day. Flowers and lots of it's for my family and find way here and there. Flowers and lots of it's for my family. We do our best to show we care. It wasn't just a special we [Music] loved ones on a special day and candles to together. [Music] pictures [Music] to show you [Music] special. [Music] Tell me all my love special. [Music] Wow. H happy Halloween. H happy Halloween. We just scary. What will I guess just happy Halloween? Happy Halloween. Scary costumes. Halloween. Which one am I going to be? Prince or dragon? Scary fairy. Now one more. Fairy costumes. Hall. No, no, no. Not good for me. Oh, mommy. H happy Halloween. Ha. Happy Halloween. We dress up to look scary. What will I dress up to? H happy Halloween. H happy Halloween [Music] costumes. Hall. Which one am I going to be? Alens go. Which costume is right for you? scary costumes. No, no, no. Not good for me. Oh, no. [Music] Happy Halloween. Happy Halloween. We dress up to look scary. I will dress up to be h happy Halloween happy costume. [Music] Which one am I going to be? Which for which cat? He Which one is it going to be? H happy Halloween [Music] scary one [Music] happy. [Music] I have some Halloween soy. [Music] So spooky [Music] funny things. funny things. We love to laugh and sing. and sing. Yeah. Tell me anything. [Music] [Music] [Applause] [Music] It's Halloween. Oh my god. And they go flash. I got teeth. And they go zap zap zap zap zap zap [Music] any [Music] [Music] Oh, we bring our we [Music] pirate sail across the sea. Se seance [Music] with me. Dance with me. [Music] I have no me and have some fun and It's Halloween. [Music] [Applause] They go swish swish swish swish swish swish. I'm so green cuz I'm a witch. Wish witch witch witch witch. [Music] What's that? >> Mommy. [Music] >> There was one in the bed and the little one said, >> \"I'm scared. I'm scared. So, one got in and now there's two. [Music] >> Huh? >> There were two in the bed and the little one said, >> \"I'm scared. I'm scared.\" So, one in there's three. Huh? [Music] Mommy. There were three in the bed and the little one said, \"I'm scared. I'm scared.\" So one got in and now there's four. >> Huh? [Music] Mommy. [Music] >> There were four in the bed and the little one said, \"I'm scared.\" H I'm scared. So, two got in and now they're six. [Music] I'm scared. I'm scared. So, one got in and now there's seven. Huh? [Music] Huh? There were seven in the bed and the little one said, \"I'm scared. I'm scared.\" So, one got in and now there's eight. [Music] There were eight in the bed and the little one said, \"I'm scared. I'm scared.\" So, two got in and now there's 10. Uh huh. [Music] [Music] >> The itsybitsy spider crawled up the water spout. Down came the rain and washed the spider out. Out came the sun and dried up all the rain. And the itsybitsy spider went up the spout again. [Music] Doo doo doo. Itsybitsy spider never ever stops. Even when the rain comes and drips and drips and drops. [Music] >> Oh, look. [Music] >> The itsybitsy spider crawled up the water spout. Down came the rain and washed the spider out. Out came the sun and dried up all the rain. And the itsybitsy spider went up the spout again. [Music] >> I can be like it. I can do it too. I can be like it. Doo doo doo doo doo. Itsybitsy spider never ever stops. Even when the rain comes, it drips and drips and drops. [Music] >> Wait for me. >> The itsybitsy spider dried up the water spout. Down came the rain and washed the spider out. Out came the sun and dried up all the rain. And the itsybitsy spider went up the spout again. [Music] >> I can be like it. I can do it, too. I can be like it. Doo doo doo doo doo. Itsybitsy spider never ever stops. >> Even when the rain comes and drips and drips and drops. Aha. Yeah. [Music] >> The itsybitsy spider crawled up the water spout. Down came the rain and washed the spider out. Out came the sun and dried up all the rain. And the itsybitsy spider went up the spout again. >> I can be like it. I can do it too. I can be like it doo doo doo doo doo. Itsybitsy spider never ever stops. Even when the rain comes and drips and drips and drops.",
    "start_time": 2.72,
    "end_time": 1848.039
}