{
    "video_id": "FGS-hVJWGdw",
    "channel_url": "@littleangel",
    "transcript": "Hello angel. Wow. H happy Halloween. H happy. We just scary. What will I guess what you happy Halloween? Happy Halloween. Scary costumes. Halloween. Which one am I going to be? Prince or dragon? Scary. Airy. Now one more. scary costumes. Hall. No, no, no. Not good for me. Oh, mommy. H happy Halloween. Ha. Happy Halloween. We dress up to look scary. What will I dress up to be? H happy Halloween. Haha. Happy Halloween. [Music] Scary costumes. Hall. Which one am I going to be? Alens go. Which costume is right for you? Santa. No, no, no. Not good for me. Oh, no. H happy Halloween. Happy Halloween. We dress up to look scary. What will I dress up to be? Happy happy Halloween. Happy Halloween costume. Halloween. Which one am I going to be? Wigs for which cat? He Which one is it going to be? H happy Halloween. [Music] Happy Halloween. We dress up scary. Why dress up happy? [Music] Happy Halloween. [Music] It's Halloween. Halloween spooky spooky. It's Halloween hot Halloween. Get dressed up everywhere. Costumes. costumes. You and me. Spooky spooky family. It's just fun. It's our hall is done. [Applause] [Music] It's Halloween. Hop hop Halloween. It's Halloween. Get dressed up and spooky spooky family. It's just wake up. Do you see? It's not scary. It's just fun. It's how is done. [Music] It's Halloween. Spooky spooky. It's Halloween. Get dressed up and rewind. All your friends are on the street. Do you want a trick or treat? It's not scary. It's just fun. It's Halloween. [Music] [Applause] [Music] It's Halloween. It's so candy can sweet. So much fun to trick or treat. It's not scary. It's just fun. It's Halloween. It's Halloweeny spooky. It's Halloween. [Music] We are so [Music] [Music] funny things. Funny things. We love to laugh and sing. Laugh and sing. Yeah. Tell me anything. [Music] [Music] [Applause] [Music] It's Halloween so [Music] it's Halloween. So I got lights and they go flash. I got teeth. And they go zap zap zap slap zap zap [Music] any [Music] [Music] Oh, we are we [Music] pirate sail across the sea. Se seance [Music] with me. Dance with me. Happy [Music] new and have some fun. And then it's Halloween. So [Music] [Applause] they go swish swish swish swish swish swish. I'm so green cuz I'm a witch. Wish witch witch witch. Heat. Heat.",
    "start_time": 2.72,
    "end_time": 571.32
}