{
    "video_id": "-brAoK_RYxI",
    "channel_url": "@topperguild",
    "transcript": "Today, I am surviving 99 Nights in a\nforest with my friend Fulton. We will be hunted every night, and the only way to escape is\nby finding the missing animals. If we get tagged before then, we lose... so we need to figure out how to survive. Time starts now.\nCome on! Go, go, go!\nMy friend Steven set up this challenge... so we have no idea what\nthis forest beholds. Wait, wait, Fulton, hear me out. What if I camouflage myself as a tree? There's so many around here,\nthey would never see me. Bro.\nWhat if your friend Steven brings an axe? Because people in Roblox chop down trees, and you don't want to be more\nchopped than you already are. Wait, what makes you think this\nis a Roblox challenge? Bro, we're in a forest for 99 nights. That's literally the Roblox game. Okay, well,\nI'm not sure what challenges Steven has, but we need to be prepared for anything. Let's keep moving. Alright, Fulton, since you say this is going\nto be a Roblox challenge, I have the perfect camouflage. Alright, bro, show me what you got. It's gonna take me, like, 30 seconds. Or can you just turn around and\njust give me a little privacy? What?\nDude, just trust. What? Just trust me! Alright, fine, bro, you got 30 seconds.\nHurry up. Okay, just don't look. Bro, hurry up.\nWe're running out of time! Alright, Fulton, check it out... I'm Tung Tung Tung Sore! What?!\nFirst of all, that's the wrong game. And second of all,\nthat's not Tung Tung Sore. That's Trololo Trolola! And third of all,\neven if Steven doesn't play Roblox, you're a shark in the\nmiddle of the forest. Fine.\nAt least just help me get this off. Alright, I got you. Look, there they are right there! I have cameras planted all over the place\nin the forest. And this is the last one... Now, I have eyes on them, and I'll be able to see\nexactly where they're hiding. I have to get back to the control room. I thought you were the king of camouflage? I am, alright?\nI'm just getting warmed up. Yeah, sure, buddy. Alright, let's go look over here.\nCome on. Trust. Wait, dude,\nlook at this golden treasure chest! What if we just take off the lid,\nboth go in there and hide? There's no chance\nanyone's going to open it. Bro, it's a treasure chest. That's\nhow people get loot in the game. If someone finds a treasure chest, they're going to open it and then\nyou're going to take the biggest L. Okay, fine.\nThen what do you suggest we do? Wait, what's that over there? What? Bro, the fire's out. Dude,\nwhy does it matter that the fire's out? It's daytime.\nWe don't need a fire. Bro,\nno fire means no protection at nighttime, and it could get dark any second. Okay, well, wait. Look at this tent right here. Maybe there's stuff inside\nthat can help us camouflage. Let's check it out.\nMeanwhile, Steven is in the van\noutside of the forest, where he can control the game from. Welcome to my control room here. I can see everything, everywhere,\nall at once. Let's see what Topper\nand Fulton are up to. Okay... No, not there.\nNot there. Found you guys! Bro, what is all this stuff? I don't know.\nBut wait. Dude, look at this.\nThere's spray paint here. I feel like this will\nprobably come in handy later. They just went into the tent... This is the perfect time to search! Time to turn off the lights... Three...\ntwo... one...! Wait, what just happened? Bro, it's nighttime. Steven must be controlling\neverything in the arena. Wait, so,\nguys, that means the search is about to start. Alright, let's go find them. And not only will Steven\nbe searching for us, but he can bring whoever\nhe wants to help him look. Wish us luck! Alright, guys, the tent is right there. Let's end this quickly...\nReady?.. Three, two, one. Bro, they're destroying the tent. Yeah, I know. How did they know we\nwere in there so quickly? I thought you said they were in there. Wait,\nI saw them go in on my security cameras! They must have just left. Wait, what?..\nSteven set up cameras? That's cheating. We have to destroy them. Yeah, you're right.\nBut first, we need to hide. There's way too many of them. We don't even have our camouflage yet,\nthough. It's okay.\nJust don't get tagged. Okay, let's make a run for it.\nReady? Three...\ntwo... one..! Wait a second.\nI see them right over there! Come on. Go, go, go.\nCome on, Fulton. We need to speed up! Alright, let's go. I'm coming. Fulton!\nWhat do we do? Bro, there's a tree right there.\nLet's go climb it. There they are. Come on, let's go. I'll be right there. He's literally right under us.\nLook at this! You are worthless. I can't believe you! We gotta make a run for it.\nReady? Three...\ntwo... one..!\nLet's go, hurry! There they are! Run! Topper Guild.\nI got you. Go.\nGo! Topper!\nI'm gonna get you. Wait, dude, look at that. What is it? There's an underground bunker right here.\nYo, come on. We need to hide.\nThey're coming! Come on.\nLuckily, guys, Steven only has 15 minutes\nto find us each night, so he should run out of time soon. Come on, Steven. What's taking you so long? Just give me a sec to catch my breath. No, we don't have a second. Look, I know they're over here. I need you to look around. Okay... Guys, if we get tagged or caught,\nthe game's over and we lose the challenge. Wait, look up there!\nHigh ground. Let's go up there. Topper Guild, I know you're here.\nGive up now! This is solid concrete.\nThere's no way they can get through this. Wait. I ran out of time. I have to go back to the control\nroom and turn it back to daytime... Let's go. Did you hear that? Steven said that he's going\nback to the control room. Does that mean that we passed night one? Yes, sir. Alright, let's go!\nWell, it seems we have made\nit through night one, but we were way too\nclose to getting tagged. So we need to prepare a\nlot better for night two. Bad news is I ran out of time. Good news is I can still\nsee exactly where they are. So... next time I go out\nfinding them will be easy! No problem.\nLet's turn to daytime. Yo, Fulton.\nWe're good. Let's get out of here. Alright, guys,\nwe survived night one, and now it's day two. Dude, what's the move? We cannot let that happen again. Okay, first things first. We need to\nget rid of Steven's cameras, Alright? Yeah,\nbut how are we supposed to do that?.. Wait,\ndo you remember what was in the tent? Feastables and Prime? Yes, but no, not that. There was also spray paint. We can use it to blind the cameras! Yeah! Let's go.\nAlright, guys, hopefully they did not\ndestroy the spray paint. Take care of my cameras. Why would they go back in the tent?\nIt's daytime. And they were just in there. We got it.\nWe're good. Let's go look for the cameras and make\nsure that Steven cannot see us anymore. Let's go. Spray paint? Why would I put spray\npaint inside the tent, you idiot?\nWhat is wrong with me? That's okay. Even if they take out one of my cameras,\nI still have so many cameras. So I can see them everywhere. Yo, Topper.\nCome here. I found one! Great! Hey, Steven,\nI hope you like the taste of spray paint. No, no!\nBro!! Well, now I can't see from that angle. Alright, sick!\nLet's keep moving. Oh, no.\nOkay, well. Well, I still have this one.\nAnd this one. Bro! Well, I have one last camera. I have no more cameras... And now that Steven\ncan't spy on us anymore, we need to hurry up and camouflage\nbefore it turns to night again... So, guys, Fulton and I have been\nwalking all over the forest, and this time, I've got it. There are bushes everywhere... So I'll just hide as a bush! Bro, in Roblox, and in real life,\nbushes literally give you food. You'd be hiding as a snack. And if Steven is the one searching,\nyou're gonna get eaten. Wait.\nUnless we take off all the berries off the suit,\nthen it might actually work. Oh, dude, I knew my idea was amazing.\nLet's go! What?\nThat was my idea. No, it wasn't.\nI literally came up with this. Bro,\nyour idea would have gotten you eaten. My idea is genius, bro. Hand it over. Okay, fine.\nChill. Alright, chill, bro.\nI'll give it to you. Stop!\nGuys, this forest is massive. It's gonna be so hard to find\nthe missing puppy and kitten. I need to lock in and find a good spot. Yeah, bro.\nI'm not gonna lie. You're taking way too long.\nYou need to hurry up. Alright, hear me out, bro... What if I literally just lay\nin the ground and become dirt? I'm not gonna lie.\nThat's actually a pretty good idea, because the 99 nights in\nthe forest. You can't dig, and you'll be super low to the ground,\nso it'll be hard to see you. Wait, are you serious?\nOkay. Will you help me build my camouflage suit? Yeah, bro.\nI got you. Alright, come on. Let me just grab some of this stuff\nand let's head back to the bunker. Come on. So the plan is to use the stuff that\nwe found in this bunker from earlier to turn this into a dirt suit.\nSo, Fulton, just go ahead and start putting\nthat glue all over the place, and we're gonna glue\nall the dirt on there. Alright, I got you, bro. But we need to hurry up. It's about to get dark soon. Wait, what are you doing? This glue is not gluing. What do you mean? You just told me we needed to hurry up,\nbro... Lock in!\nOkay, there we go! Guys, keep in mind, we still have to find the missing\npuppy and kitten to win this... So we need to make sure\nour camouflage is perfect before it turns to nighttime again. Well, now they took out all my cameras,\nbut... that's fine.\nI don't need cameras to find them. Fulton, it's nighttime.\nLet's go hide. Okay, Bet. Now we need to get into our\nspots before anyone sees us... Guys, this challenge really is a\nlot like the game on Roblox. If you want to see me play the\nreal 99 nights in the forest, be sure to check out my gaming\nchannel called Topper Plays. Alright, let's go find them. Topper Guild.\nYou might as well just give up! Your camouflage isn't\ngonna hide you forever! My gosh. What was that? Stupid stick... A stick ain't gonna stop Mike Ferguson. Hold a second. What was that in those bushes? I'll check it out. Guys...\nThat was so close... Alright, I need to get back to hiding. What is this?.. I know somebody's probably\ncamouflaged as a bush! Alright, if you're in this bush,\nyou better get out in three... two...\none..! Oh, my gosh.\nIt's thorns! Oh, my gosh.\nI gotta get some help. I know you're out here! Guys, the time is ticking,\nand I still haven't found anyone! Yo, what is this shovel doing here? That's really sus. Wait, look at all this dirt. Someone could have easily used\nthis shovel and camouflaged himself into this dirt... I've done it before! Alright,\nyou have three seconds to come out. Three...\ntwo... one..! Nothing? Three...\ntwo... one..! Nothing... Alright. Last chance. Three...\nTwo... One..! Steven, come look at this! Why did I leave out the shovel? That was so dumb. Okay, guys,\nnext time I get up, I gotta move it. Look at these footprints I found. Let's follow them.\nCome on. Steven. The footprints lead back to here. I've already cleared this entire area. I just came in this area,\nand there's nothing here. Mike. Hold on.\nThere's more footprints over there. Come on.\nWe need to keep moving forward. Guys, I don't like this. This is getting way too intense. I got to go check on Fulton. Fulton! Fulton, where you at, bro? It's me, Topper.\nFulton? Bro! Oh my god!\nBro, you scared me so bad... Yeah, now I can see it's you.\nAlright, dude, Just me! let's head back to the bunker\nand start setting up some traps, okay? Yeah, let's do that. Keep your voice down, bro.\nCome on. This way. And the footsteps end right here... Steven, can you see anything? No, nothing. Look, they're way better at camouflage\nthan I thought they were. I think I'm gonna have to call back up. I ran out of time again?!\nAlright, it's time to turn it back to daytime\nand head back to the control room. Let's go. Let's go, buddy. Okay, guys,\nin this bunker, we have some sticks for a trap. There's a bucket. Okay, this could work. Oh, and some rope.\nLet's go! Bro, I found a bear trap. A bear trap?\nDude, we can't use that. That's way too crazy. Alright, fine.\nWe'll go with your trap. Alright, sounds good. Well, I didn't find anything,\nso let's turn it back to daytime. Wait, look,\ndude, it just turned to daytime. Let's go! Alright,\nlet's hurry up and go set this up... Wait, do you hear that? Yeah, it sounds like a crying puppy. I think it's coming from this way. Yo, let's go check it out. Bro, where is that noise coming from? I think over there. Are you sure? I don't know, but let's go. Alright.\nbro, the sound of the puppy\nis getting way closer. Bro, it's right over there. Oh, dude, no way! What the heck is this? What is that?\nTung Tung? I think it is.\nBut yo, real quick, let me take a picture with the puppy so\nwe can prove to Steven that we found it. Yeah! Come here, good boy.\nHi, puppy. Ready? You are such a good boy... Guys, look at how cute this puppy is. Alright,\nso now we need to find the kitten. But first we need to\nfinish setting up our trap. Okay, sounds good.\nBye, puppy. Tung, Tung, take care of him...\nLet's go. And as we set up our decoys, subscribe to give us some\ngood luck for this next night. We are definitely going to need it. I have a feeling that Steven is going\nto take it way more seriously this time. Now I have no idea where they're\nat or what they're doing. Okay, well,\nwhatever they're doing, that's enough time.\nLet's go find them. And now that it's nighttime, I really need to lock in\nand find this kitten soon. It's only a matter of time before\nI get found in this camouflage. This is night three of searching. And I brought backup. The world's best police officer,\nDavey Youngblood. There's no way that Topper or\nFulton can hide from any of us. Let's all split up and go find them. Let's go. There's three of us now, Topper! You might as well just give up. I have a stick,\nand I'm not afraid to use it. Wait... What if Topper is hiding\nin one of these trees?.. I've seen him build a\nsecret treehouse before. There's only one way to find out. Man, it sure is dark out here... It's creepy. What was that?\nYou know what? Maybe the forest is playing\ntricks with my mind. I gotta keep looking.\nWait. I hear something.\nSteven. What are you doing up there? Oops, sorry.\nI was just searching for Topper. Mike said he climbed a tree last time. Can you help me down? I did not come in here on my day\noff to not arrest somebody... Well, this wouldn't be the first time\nSteven got stuck in a tree. Let's see what Mike is up to. Alright.\nHaving a little bit of a problem. Haven't found Topper Guild yet, but I did bring my military\ngrade night vision goggles. Let's see what I find with these. Hold on a second. What's that right there? Topper, I got you! What are you doing, Mike?\nI'm not Topper. Yes, you are. Take those glasses off. I'm a foot taller and way better\nlooking than Topper Guild. Look, I'm so sorry, man. It's these glasses. I'm just trying to find Topper. So am I.\nLet's go. Guys,\nI think I just heard a police officer. They are not messing around... I really gotta find that kitten soon. Well, these things were worthless. What do I got here? A treasure chest... Either Topper Guild's inside, or I'm gonna be rich. Doesn't matter either way. Three...\nTwo... One! What are all these Brain\nRots doing in here? Brain Rots don't belong in the forest.\nNot here! Not on my watch. Cause that's what Mike Ferguson does! At least my decoys are doing their job. Let's check back in with Steven. Topper has hidden in bushes\nbefore with extreme camouflage. And there's tons of trees and bushes here. Someone has to be hiding in them. Is that a lemon?\nWait. This bush looks way different... It has flowers on it.\nWhat? Wait.\nOh. I found you.\nWait. Dang it! Who is it..?\nFulton? Yes, bro.\nYou found me. Alright. Head to the top of the\nhill to exit the arena. I can't believe I found someone... Alright, now it's time for Topper. Oh no!\nGuys, it sounds like Steven found Fulton! Okay. Looks like I'm the only one left. One down, one to go. Honestly, I'm getting really good at this. Oh, my God!\nRaccoon! Raccoon! Yo, it sounds like my booby trap worked.\nLet's go! Wait.\nA booby trap?.. That means Topper has to be close by.\nHey, Topper! Your booby trap sucked! I didn't even get scared. While Steven is wasting time, I'm starting to hear someone\nelse getting closer to me. This forest is massive. But with the team we put together,\nthere's no way they can hide from us. Nothing... I'm so glad the police\nofficer didn't find me. And right about now, I think Steven should be running\ninto another one of my decoys. Why are there so many hills? I need to catch my breath. Okay,\nthey have to be around here somewhere. What..?\nWait... I'm stuck to the tree!\nOh, no. It's a booby trap! Help! Help! Guys, I'm so glad my booby\ntrap from earlier worked. He's actually stuck to the tree. Now's my chance to get up and\ngo try and save that kitten. Someone, please!\nMike...? Davey? Oh.\nHey, Steven! Topper?\nHey, I found Topper. Topper's right here. Hey, I see you fell for my booby trap. Hey, what are you doing? Stop, that's not funny!...\nMike? Is that Steven? Buddy, hold on. I'll be there to help you! Oh, my gosh! I can't believe that... I just got hit with a decoy... Topper Guild! I'm gonna destroy you...\nSteven! Coming, buddy. Guys, that booby trap should buy\nme a little bit more time. I gotta find that kitten. Come here, kitten.\nHello? Please help me. Oh, my gosh. Steven...\nWhat are you doing with your pants off? What?\nNo. It's not what it looks like.\nI promise. Who did this? Topper did.\nHe... went that way.\nCan you help me, please? Let's go.\nPull your pants up, weirdo. Come on. Come on. Guys, if they find me like this,\nI'm so finished. Come on.\nWhere's that kitten?.. Wait.\nDo you guys hear that? I think there's something coming\nfrom that tree over there. Alright, I gotta make this fast. Look.\nThere he is over there! Let's go get him. Topper Guild! Leave me alone. Surround the tree! Oh, no.\nOh, no. Oh, no.\nChill. Alright, Topper Guild.\nWe got you. We got you right now. Topper Guild... We have you surrounded.\nGive up. We got you! Alright, you got me. We got him. But I found the kitten.\nLet's go! It was on the tree. What?\nNo... We lost! Come on, buddy!\nGuys, click here to watch me play\n99 Nights in the Forest... while I'm actually\nsurviving in the forest!",
    "start_time": 0.0,
    "end_time": 1335.28
}