{
    "video_id": "sJxsrGu0N5Y",
    "channel_url": "@theellenshow",
    "transcript": "That's cute. I like your jacket. >> Thank you. >> It's a Lacass jacket. >> It is. It's a It's a big Oh, they say. Uh >> so, thanks for being here. >> Thank you for having me. >> I appreciate Last time I saw you. Uh I was on the court uh and uh I was reporting your match. >> You were terrible. >> Yeah, I was. >> I was really bad. I couldn't keep score. I was too impressed. You and Agassi were playing and it was it was very exciting. >> It was It was fun. It was It was a good day. It was for actually Arthur Ash Kids Day. Um, which kind of precedes the US Open every year. Ellen was nice enough to come out and referee a match for us. >> It was great. And, uh, and then I jumped into your arms and, uh, you actually supported me, which I, I, uh, you just grabbed me and held on. I didn't realize you were such a big fan of mine that you took my cardboard uh, Ellen to an event with you, right? >> Yeah. I'm I'm not proud, but it happened. Yeah. It's uh you know, you know, it's uh I I could I couldn't I couldn't actually make it out to the show ever. So, there's me my charity event last year. Um I'm walking around with a cardboard cutout of Ellen. She was my date. >> Uhhuh. [Applause] >> So, and I also I wish I would have been able to stick around. We were shooting our premiier shows in New York. That's why we're there. I wanted so badly to stick around and watch you play. And you played feder and you how did you feel? I mean you I thought you were playing great but >> yeah you know I I I played okay uh I I've been playing too well this year so uh to to get to the finals of the US Open and give myself a chance against Federer was uh it was a lot of fun. It was a great two weeks and I have uh nothing but fond memories. >> And now when you play because I look at how long some of these matches go and you recently played a match that was four hours and 48 minutes or something. >> Yeah. >> What happens during that's a long long time. What how do you concentrate? I I struggle with it. Yes. >> Do you really? >> Oh, yeah. I can tell you who's in like the fourth row eating potato chips and you know I'll have some like annoying song in my head, you know, going, you know, >> like what song? >> You know, Manudo, Bananaama, Wang, >> something. >> Don't share that ever again. >> Ever again. Hopefully, we can just uh No, but uh I'm the worst. You know, I can I always see what's going on. really. I was wondering if if people do try to keep people still, but if you see you can see someone getting up, does that distract you? >> Well, you know what it is? It's it's cuz you're you're tracking a little, you know, yellow ball and so when the person tosses it up and it gets lost in white shirt and so and then you're trying to you have about a second to react to it before the person serves. So, uh it's just you can't really see it as well. >> So, we just tell them sit down. >> Yeah. Well, that No, I think that would be really hard if somebody's talking or if anything like that. But that's a long time to do anything. Yeah, I' I' I'd love for it to be like football where everybody's going crazy all the time, but a lot of it is uh visual and and and you hear the the way the ball comes off of somebody else's racket as well. So, uh unfortunately, you know, you can only be loud in between the points >> really. So, you that even that kind of noise coming off the racket is something that you start paying attention to where it's >> you can you can hear like different spins and stuff actually coming off the racket. Um the really good players can hear it more than me, but um but on on good days they can hear it sometimes. >> Now and do guys uh grunt as much as girls do because I I just hear that constant like and then you just go Yeah. Does that bother you to hear that? >> It's kind of just a timing thing. >> But is it to psych the other person out? >> Um not that not that I know of. >> It's really just to make that noise as you hit. >> I think it's just about repetition, you know? It's just about doing something consistently and some people just just teach that. I don't >> Yeah, but that's like if a jogger just went >> might help him. Who knows? We might we might we might or when you dance next episode just come out and start >> grunting at each move. >> Oh, sure. >> I hope I never dance that hard. >> So, and now here's another thing about tennis players because you're always touring. You're always, you know, we watch the major tournaments, but you're always on the road 11 months a year, right? >> Something like that. Yeah. >> How do you date? How do you have a relationship if you're on the Unless you're dating a tennis player? >> Yeah. It's uh No, it's it's it's a struggle. I mean, uh you know, it's it's not exactly uh easy to tell someone, \"Okay, that's great. I'll see you in a couple months.\" That doesn't fly too well normally. >> It's uh for everything that's great about tennis, that is uh you know, that's that's a tough part of the job. >> All right. So, we have a tennis court in the back in the riff raff room. And uh you have a a look, they're back there waiting. We have a whole bunch of things set up for you to break and uh with your serve because you have a very fast serve. >> Hard. >> I've It's It's killed a small dog. >> Yeah. >> Yeah. >> Joking. I'm joking. >> The dog was huge. >> All right. All right. So, uh so we're gonna go back there and and we're gonna have you uh serve and see how many things you can hit. and we're going to uh we'll tell you what what happens if you hit them. Let's walk back there. >> All right, let's do it. >> All right. >> Okay. You want this one? >> Sure. >> I'll take this one. >> All right. I'll take this one cuz it's pink. >> There you go. >> All right. So, uh we have a bunch of things set up. We have a dishes and we have uh bottles and we have light bulbs and an egg and uh if you break two of those only even if you just break two, we're giving everybody in the audience and the riff refra room a gift. >> All right. >> So I get I get to break it. >> Yeah. Go ahead. >> How many how many chances do I get? >> Oh, just keep going. Come on, Andy. Do it. Oh, almost. Oh, yeah. >> Well, anybody everybody's winning. Anyway, you're all getting uh uh and everybody in the roof raff room a special edition Seagate Pink Pocket hard drive. You can back up everything on your computer, including music, photos, videos. It retails It retails for $109. 10% of every purchase goes to Susan G. Common Foundation.",
    "start_time": 0.88,
    "end_time": 403.4
}