{
    "video_id": "AhXjSv8cwzk",
    "channel_url": "@theellenshow",
    "transcript": "[Applause] That's it. That's 20. Oh, have a seat. That's plenty. Thank you. [Applause] Thanks a whole lot. Right straight back at you. >> And an extra. Everybody's happy today, right? Very happy. Good. >> I'm glad to hear it because I'll tell you something. There's a disorder going around uh and it happens this time of year. I don't know if you know about it, but it's a phenomenon that everyone's talking about and uh it's called SAD. S A D. Seasonal effective disorder is what it is. Have you heard about this? >> I just heard about it today. I had no idea that people were walking around with SAD. I am with sad. Um, and what happens is this time of year, you know, it's the fall and winter and the days get shorter and we have less sunlight and because of that people their mood gets down because you need the light and uh they depressed and they they people don't smile as much and the upside is you don't have to brush your teeth as often. I stop brushing around mid-occtober and then uh I pick it up again late March and really no one notices just people get sad and uh the problem is right there with the name of the disorder. If you have a disorder, don't name it sad. That's just going to make it worse. you know, call it something different and then you would, you know, because really it's all what you're talking about, what you're thinking about creates your reality. So, if you say you're sad, then you're going to be sad. What if you call it like uh ecstatic, you know, and that would stand for um everybody is chanting about the seasonal changes and things in cats. >> Yes, everyone is talking about changes in seasons and cats and uh the common symptoms if you if you are concerned that maybe you have the SAD um is uh fatigue. Anybody fatigue? Okay, you could have the SAD. Uh increased a need of sleep. Do you need to sleep more? Not looking good for you people. And then uh craving sugary or starchy foods. Ch. >> Yeah, I know. When I realized when I read the the symptoms, I realized uh this morning when I dozed off during my third donut, I said I have the sad. There's light therapy people are doing. If you sit in front of a light box, if you work in an area that's dark, people put light box in front of them and uh and that that helps you feel better. We've turned up the lights on the audience, so you should feel very very happy because we have all the lights on you. And uh great exercise, they say, is very important. If you have plenty of light and exercise, if you exercise in front of a bright light, to me, that is the most uh and I know it works because I have never seen Madonna sad. I know that. I don't know about you, but I'm going to be giddy. This is what I'm going to do today. I am going to be giddy. And it's a challenge to the sad. I def I How dare you? Uh giddy is how I feel every single day around this time. It stands for glad I dance. Do you? [Music] Heat. Heat. Heat. Heat. on the show today. Uh, you can't be sad with her around. Allison Janney is here. What is that? Is that like a portrait of her from a It looks like she should be over a fireplace right there. That is not a head shot. I I don't know. I've never seen anything like that. It looks like it's made from velvet or something. And that's a knee right up there. I guess we'll talk to her about that. She's a big big cheater and you know that. Um every time she's on the show, she has to she she's so competitive. So, we challenge each other to different things and every single time uh if she has won, which is really I don't even think she has, but she she cheats like crazy. Um anyway, so we're going to do another thing today that we're going to we're challenging each other at and we'll see. That should be fun. And uh we have Do we have a doctor standing by for this one? We should because I just saw I we didn't rehearse this and it looks like someone could get hurt badly, which is always good TV. and uh on the show also very very first time a very first talk show appearance from Grey's Anatomy you know mixy right Eric Dane is here and uh Mix Deei is his name so uh and this is his first uh talk show all right And also, bam, emeraldi here. Bam. Bam. He also Do we have the clip of him with the towel? >> We do. >> We don't have it. We don't have it. All right. And uh performing today, which I I you know, I just danced to it just now. I love I love him so much. Right over there is Chinny is gonna be performing with Tyrese right there. Tyrese and Chinny. >> All right. And yesterday on the show, uh, Tiger Woods was here, which, uh, oh, I love him so much. So, we had a thing where we had we were we were going to hit golf balls into an area back there, two small tiny holes to see if we can make it through. And, uh, during rehearsal, I was not getting one in at all, and I haven't played in years, but I used to play golf anyway. So, uh, but the whole audience was going to get something if we got it through the hole. So, uh, take a look at Tiger just right away. Look at the in the force that he had. Look at this. [Applause] Can we show me hitting that again? Just uh just want to show me hitting that one more time. surprised me. All right. Hey, we asked you to send them in and you did it. I appreciate it. Fall photos, everybody. So, this is uh from Christina Grost. Grost. Grost. I'm so sorry if you send it how to fanatically do it. I'll do it right from Ravina or Ravvena. Uh oho. Um uh all right. I want to put the picture in this in the screen. It's absolutely beautiful. This is a picture that she sent in. Isn't that gorgeous? And she she uh the letter reads like she's a novelist. I'll tell you that. So maybe we can have some music while I read her letter. I drive by this reservoir quite frequently as it is only a few miles from where I live. And one early morning last autumn, I happen to have my camera with me. Oh, I couldn't resist as fall is the best season in Ohio. Sincerely, Christina Gro. That's very pretty. This one is from Cindy Vinsky from Grace Lake, Illinois. Uh Ellen and I have started a new tradition. We go apple picking. This year we came home with four bushels of apples, a bushel of potatoes, and over 50 pounds of pumpkins. Take a look at this. Look at the look at the junk in her trunk. And uh this is now I know why there's a pumpkin shortage. Cuz Cindy's hoarding them all. Um I mentioned that that we're having a pumpkin shortage. Do you know that >> that we are the lack of rain? There's a a shortage. Um, without pumpkins, there's no pie at Thanksgiving. There's no soup. There's no uh cute pictures like this one right here. Look at this. Ain't that adorable? That's one of our sound guys. That's Durk's little baby girl. Uh, what's her name? Sabrina. >> Dirk. >> Let's call her Sabrina. Um, >> she's cute as can be. Hey, Dirk. Where's Dirk? That's a cute picture. Dirk. >> Hi. Thanks, Alan. That's cute. Yeah. Don't go away. Alison Jany's gonna be sitting right here right after this. All right. So, because we have a pumpkin Oh, sorry to stop that. Um, because we have a pumpkin shortage, we're going to try to carve other things. We don't always have to use a pumpkin. So, uh, we have a professional pumpkin carver. Number one, uh, pumpkin carver is Jean Granada. Uh he's a master carver. He's going to carve a watermelon. Hi, Jean. >> Uh he's a master carver. And uh carver number two is uh Kelsey Pile and she's an amateur. She's going to uh try a a honeydew and see what she can do with that. >> Carver number three is uh Joan uh Clareout. Is that right? Clareout. She's a she's actually uh she's a audience member and uh she's from uh India Indianola >> Indianola >> Indianola Iowa and you are going to uh carve of course a holiday ham and uh it >> all right we'll uh we'll be checking on uh you throughout the show and see how you're coming along and good luck to all of you and let this be a lesson just cuz there's a pumpkin shortage. Do not let it stop your festivities. There can still be a holiday cheer. All right. Well, our first guest is uh one of our alltime I'm just going to say my all-time favorite. She is. Uh, please welcome back fourtime Emmy award winner Allison Janney. Oh, I could. You know, I could dance with you forever. >> We both got our haircut. >> We did. I know. It's It's fun to have short hair. >> I want to go as short as yours. I could have gone a little shorter, I think. >> I think it looks good, though. Thank you. >> Yeah. You don't need to do anything. >> I had a thought about uh the anidote for the sad is the steamy. Cuz I was feeling the sad back there. I was thinking, I've been napping a lot. And then I saw the steamy and I was like, >> \"Oh, >> yeah. That's the That's good that we have him on today because that that'll help anyone with the sad. >> Absolutely. >> Yeah. The steaming. Um, so how what's it like to all of a sudden be on WestWing for so long? Do you still drive there every day? And >> I tell you it I know it's it didn't hit me until mid July when I was supposed to go back to work and it feels something like did you ever see the movie North by Northwest? You know where Carrie Grant gets dumped off in the middle of a in you know a field and a road and he's left there and you have no idea what bus is gonna pick you up and is there a plane that's gonna try to kill you? Is there a you don't know? Well, that's kind of a that's a stretch there, but >> there's a lot going on in your network. >> A feeling like you don't know what's next. >> Yeah. >> You're there and you're like, \"Wow, that was what what was that?\" >> A huge chunk of your life. >> What was that? Seven years and it's over and you know, it's like on the one hand the world is my oyster and I have a lot of wonderful things that are coming up, but on the other hand, I really liked having a steady job. It was it was kind of nice. Yeah. >> I really like that. >> Yeah. Well, you you're you know, but there's like you said, you have tons of stuff going. Did you take anything? You said you were going to take stuff from the set. >> Yeah, I was going to take the president's balls, which was all the thing that I wanted. That was my joke that I always said because that's what I wanted and I somebody got them before me. I did not get them. Did not get them. >> What are they? What What are the president's balls? >> They're glass. They're beautiful glass paper weights that were on the president's desk. >> Okay. Well, then call them paper weights. >> Well, I should have. >> So, you didn't take anything? >> I did. I got a plaque outside uh that that says when CJ became chief of staff, there's a plaque outside the office that says chief of staff, CJ Craig. >> Oh, well that's uh so I have that. >> Yeah. And what about And we gave you the the plate. We gave you the commemorative plate. >> Yeah, the plate. I loved that plate. >> What what's that face? >> Uh well, the plate I didn't you didn't tell me I couldn't put it in the dishwasher. So, I I came out of the dishwasher. I came out of the dishwasher half peeled off. And then >> what? Did you eat on it or something? What do you Why was it in the dishwasher? >> Yeah, it was going to be my plate that I ate every meal off of. It was my plate. >> And then, you know what? I actually did hear I I didn't know how. I heard something happened to your plate. I can't believe it was. But I had one more made for you. And this is like one more. And please don't put this in the dishwasher. Just just just stay put and just you just calm down. Um >> All right. But I have one more and that's >> Oh no. Oh no. You're so mean. Oh, I'm so sorry. >> You're so mean. >> No, that's a breakaway. This is the real thing. This is the real thing. >> Be careful. >> All right. So, we're talking about when we when we we're going to go to break and we come back, we're going to have another challenge. But, I've been going through all the old challenges that we've had here on the show. There have been many of them. >> There have been. >> Many many. And uh I just want to refresh your memory. Are you this competitive all the time by the way? >> I have. Yes. There's a pathology there that I don't you know. >> So at home you're this competitive cuz you cheat when you're not winning. >> No. You cheat too. You cheat too. >> No. No. I've never cheated. >> And since it's your show they all say let her win. >> No. No. Go ahead. No, no, no. It's okay. >> Yeah. >> They'll turn on you. All right. So, let's just take a look back at and it's going to be clear. Uh, and this time you well, you'll see clearly who wins and who cheats. >> You can't hear the the >> See, there you go. >> See, she decides next. >> Right way. Here we go. >> No, >> that was a better ball. Yeah. See, this was actually my ball that they cut into. >> No, that was not your ball at all. I want to get [Applause] >> Yeah, I want to get there. Here's where you cheat. Right here. Look at that. Cheater. Cheater. >> I was trying to help you. You were falling. I was trying to help you up. >> No cheating there. I want Oh, look at that. >> Yeah. Ow. Ow. In the face. >> This is too I can't believe this keeps going on. [Applause] >> All right, we come back. One more challenge. We'll be right back with another one. All right, we're back with Alice and Janney and what we're going to do is we're going to joust and uh neither of >> whatever that is. >> I know. All right, so we're going to be on top of here. We're going to put helmets on because we have to be careful. And uh whoever gets knocked down three times is that we decide three or four times. Five. So if you get knocked down, Allison, just get right back up. Okay. >> And when you get knocked down again, you get right back up. >> When you get knocked down, you get up. >> All right. So, we put our helmets on. >> Okay. >> And uh Oh, I have a tiny head. This is not going to work for me. I can't see. This is not fair. Hold on. Hold on. Hold on. Don't cheat. [Applause] Time. [Applause] Yeah. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Come on. Oh my god. Round one. We'll be right back. Cooking with Emerald Legos right after this. >> Our next guest is America's Most Famous Chef and his new cookbook is called There's a Chef in My World. He also happens to be from a hometown in New Orleans. Please kick it up a notch for Emerald Legos. You guys all right? Got it ready. >> You got it out of your system? >> Yeah. >> Y's all right. >> She's a lot of trouble, I'll tell you that. >> All right. No throwing shrimp at that even. >> All right. So, here your first time on the show. I'm very, very happy to have you here. >> I'm delighted to be here. >> I'm delighted to have you here. What are we cooking today? >> Well, we're going to uh do something from uh I have a brand new kids book out called There's a Chef in My World. >> I know it's Now, what do you mean it's for kids? What is that? Well, it's to get families involved and get kids involved. And the dish that we're going to do is a real simple one uh called shrimp teriyaki, which is probably one of the one of the I mean the earliest international dish. >> Yeah. All right. So, I'm on that side. Is that >> Yeah, it's hot over there. I think >> you know it's it's a cooking thing, you know. It's kind of stoves and stuff like that. All right. Here we go. We're going to All right. So, >> if you can't stand the heat >> Yeah. Get out of there, will you? All right. So, we're going to make We're going to make a teriyak sauce. So in this right here is soy sauce mirin. >> Oh, we're making homemade teriyaki sauce. >> Oh yeah, we're making the real be. >> I like by the way the idea of putting kids to work in the kitchen. Make them cook for you. >> That's right. >> Yeah, that's good. >> And then come on, you got to do yours. >> Okay. So >> So then you putting soy sauce, mirin, and a little bit of uh peanut oil in there. This is a little bit of sugar >> and a little bit of sesame oil. All right. You saw how just quick and easy that was, right? >> All right. So, now we're going to put that together. Oh, here we go. Don't you love these things? When that happens, you just shake it like this. You see? Just >> There you have it. Like that. It's just perfect. You see that? Look at that. Oh, mom. Okay. So, >> now now you marinate the shrimp. You want to have the shrimp marinated for about 20 minutes, 30 minutes in the refrigerator. And that's what I have right over here. But before that, you got yours? Yeah, I got Perfect. All right. Now, on your cutting board right over here. >> Yes. We We need some scallions. So, you know, green onions. So, you need to just kind of That's perfect, Ellen. That's really perfect. Now, let's try a red pepper. Let me get over this way, though, while you All right. We're just going to Right. Exactly. You got it. >> Perfect. There you go. >> Good. >> All right. That was another B. Okay. So, now now that you got that, we got the shrimp marinade. Alice, you all right? Okay. >> Yeah, I'm good. Okay. All right. >> Put it in. >> All right. All right. >> Come on over here. Now, here's here's what we're going to do. We're going to have a little peanut oil and a little peanut oil. You could use canola oil as well, folks. >> What's better for you? >> There's your shrimp right there. Canola probably. I would be uh safe. So, look. You want to >> Oh, you want to >> you want to just kind of drain this in the colander and then inside the uh in the pan it's going to go. >> There you go. No, don't don't throw that out. >> I didn't do it. >> Don't throw that out because don't throw that out here. We're going to combine them. How's that? >> All right. So, now we have this over here. >> And uh you know what? I'm kind of thinking we should just combine that, too. Why? Why not? All right. >> All right. We got some heat. >> Yep. >> All right. So, now here's for you. >> Yep. >> This is for me. So, now we're going to cook this here. >> We're cooking these shrimp. >> All right. >> And then, uh you you know, you just kind of want to slowly We're just going to just kind of flip them a little bit. You can just try a little bit now. >> That's it. Just there. Oh yeah. >> Okay. There we go. >> Yeah. >> So now what we're going to do is we're going to add the green. >> Right. Right in here. Right in here. Right in here. Oh, right in there. There we go. Perfect. >> And then a little green onions like this. And >> all righty. >> All right. Now that was really good. Now we're getting some stuff in here. How you doing? >> Okay. Now, >> yeah. Look at that. >> All right. Then >> Yeah. >> You still with me? >> Yeah, I am. I'm right here. >> All right. So once the shrimp start cooking and the great thing about this, >> we're both like this. Like we don't know what to do. Yeah. Yeah. >> You could dance. >> Yeah, we are dancing. All right. All right. >> You still have the flame on right there. >> No, that's okay. >> Really? >> Yeah. Now we're going to add some of the sauce back to this. >> All right. >> All right. So, it looks like All right. Now, this is those beautiful green onions that you had. We just sort of >> Okay. We have some of the pepper that we do this >> and some of the cilantro like this here. >> Go on to our website for this recipe. It's in Emerald's new cookbook. It's in bookstores now. Chini is going to perform when we come back. Don't go away. On the number one mega hit, Grey's Anatomy. Our next guest goes by one name, Mc Steamy. Take a look. Manuel audience. But yeah. So >> yeah, >> I am I am honored. I am honored that you chose us for your very first talk show appearance. I thank you very much. >> How do you feel? Do you feel nervous or you feel good? >> You know, I'm Yeah, I'm a little nervous. I thought I actually Let me tell you, I got you a present because it it is my first talk show. I was told Yeah, I brought you a little something. I was told that I was told that you have to get, you know, you're on your first talk show, you have to get the talk show host a gift. >> So, I ran out. I got you a little something. >> I didn't know that was >> Yeah. No, just a little something. Don't worry about it. >> My goodness, >> how sweet. >> Well, I was told that that women love diamonds. >> Yeah, I do. I have I happen to have this one, but I definitely uh >> That is so sweet. There's nothing wrong with having two. I will definitely >> Okay, good. >> I will wear this a little later. >> All right, good. >> God, that's sweet. And I got you something, too. >> What'd you get me? >> Not I don't know yet. Um, >> it's not But is it something you've Thank you so much, by the way. That's really really sweet. Those are real, right? >> Yeah. Now, uh, tell me if you if you knew when you did that, first of all, was that embarrassing or did you have Let's back up. Did you have anything on under that towel? [Applause] >> I I I did actually. >> Yeah. >> What? >> I didn't have much on under the shower. >> What did you have on? >> I had on a little thing. >> A thing? >> Yeah. That's not a little thing. >> Not a little thing. >> Just a little thing. >> Lots of uh lots of double stick tape. >> Ouch. >> That had to come off. How do you do a double stick without hurting yourself? >> You pull it real fast. >> Oh, that's >> Didn't start out that way. I actually just had the towel on and and and right when we were about to shoot, you know, after I figured out a great way to keep the towel up, they said, \"You know, we're going to need to see a little less of the towel.\" and a little more of you. And I was like, \"What do you mean? I've been working on this all day. I got the towel to stay. It's great.\" >> They said, \"Yeah, no. We're going to need to take the towel off.\" >> Oh, wow. Well, people I mean, >> right, >> cute. I mean, people went crazy on the internet. Have you heard the people going nuts on the internet? >> I haven't because I found that if you're going to, you know, you're going to read the good, you got to read the bad, too. And >> I'll just read you the good. >> Okay, good. >> Uh, I just want to say thank you uh for Mc Steamy. I'll take him on a silver platter, please. Medium rare. Oh, that's >> that was my wife wrote that. >> Your wife wrote that? >> Yeah. >> M Steei, can we say yummers? Oh my god. Thank you for giving us fresh out of the shower mixie. That's my mama. >> That's your mom? >> All right. >> I know her writing. Um, and do you are you thinking that they're going to do more stuff like that? Like very little clothes? No, I get, you know, I traded in the towel for a lab coat. And uh >> I don't know how many more towel scenes they're going to have for me. >> What's Do we have another clip? Let's see what you have on in this. >> Well, Mc Steamy. >> Yeah. >> Um I have a nickname around here. McNuggets. And um >> you got McNuggets? I didn't think of that. >> Look what uh look what I have for you. If you're going to be in a towel again, and I hope I hope you are. Um, I'm sure they don't want to see such a big towel. Uh, so if you want to hold something up, put that over you. I hope that's big enough. >> You're going to need >> We're going to need a lot more of these. >> And then if you have to wear Ellen underwear, we gave you the Ellen underwear to to wear underneath that if you have to. >> Excellent. >> All right. >> Perfect. >> Come back and see us anytime. See, this was >> love. No, it was it was fun. know anytime there's always a gift on the second appearance as well. >> Oh, good. >> Yes. Uh yeah, it's the first 10 you're supposed to give a gift. >> I'll be back tomorrow. >> All right, great. Grey's Anatomy airs Thursday nights at 9 on ABC. We're going to see what our nonp pumpkin carvers are doing. Uh we'll we'll check in with them when we come back. All right. I know you're Allison is involved in an organization she wants to tell us a little bit about and we'll tell you more about it on our website. It's an organization called Modest Needs, and it's basically a nonprofit organization that uh that helps uh hardworking individuals and families who are struggling with emergency short-term emergency expenses. So, let's say a family has a child who needs to go to the doctor and they have to pay, they don't have enough money to pay the doctor, so they have to use the rent money to pay the doctor. Modest needs will come in and pay their rent. So, it's a wonderful organization and uh and uh you should check it out online and they have a matching grant right now. So, anything you give from now till the end of the year, they match. So, go on the website. >> Um, all right. Uh, let's see what happened with our uh our situation here. We have Jean, you made a Frankenstein. >> Yeah, we got a Frankenstein right here. >> Wow, you really did make Frankenstein. That's Oh, that's amazing. That's great. Kelsey, you made a spider. And then, uh, you had the ham >> and appropriately, you made a pig out of the ham. >> All right. supposed to be Wilbur from Charlotte's Web >> and I think you win. Um, everybody can pass out. Everybody's getting XM radios for playing along. Everybody in the audience and a one-year subscription. By the way, I want to thank Allison Janney, Emerald Legosi, Chingy, and Tyrese, Eric Dayne as well for his first appearance on a talk show. I thought I thought he did very well. And because there's a pumpkin shortage, everybody in the audience is going home with a pumpkin. And I'll see you tomorrow. Hold on.",
    "start_time": 0.4,
    "end_time": 1908.919
}