{
    "video_id": "LDCvcrcWQRI",
    "channel_url": "@theellenshow",
    "transcript": "Over the past six months, our first guest has become a hip hop and pop culture phenomenon. Fasten your seat belts and please welcome Cardi B. Hey, Cardi B. >> Hey. >> Hey. >> Hi. >> Hi. >> What's good everybody? What's up? Let's go. All right. So, first of all, it's nice to meet you and uh your name is really not Cardi B. Do I call you Cardi B even though that's not your name? >> I mean, can you even pronounce my real name? My real name is Belise. >> Bel. I can pronounce Belise. >> Do you know a lot of people be like Bellales? >> Yeah. Well, if you read it, you probably would, but but Belise, but you don't go by that. You go by Cardi B. [Applause] >> Cardi or Cardi B or B? What do you What is it? >> You know, like it really depends. I really like what people call me, but it's like Cardi, right? You know, cuz you know, people in the hood called me Bardi. >> But you know, on Instagram, my my my Instagram used to get deleted a lot because you know, Bardi. Oh, trademark. >> Sure. >> Illegal, >> right? >> Yeah. >> So, it's changed to Cardi. >> Yeah. I prefer her. >> So, I'll call you Cardi. Yeah. >> But do I add the B? Do I do Cardi B or just Cardi? I wanted to act like I know you like >> No, my friend just call me Cardi. >> Cardi. All right, I'll call you Cardi. >> All right, Cardi. Um, >> you're doing Congratulations. You're doing very, very well right now. You're very popular. Really? They love you. >> I try. I didn't mean to start a beef, but I decided to call myself Cardi E. And I I I posted that. And did I start a beef? that I started rap beef. >> You know, maybe so. You know, Ellen, I trademark my name. I pay $2,000 for Cardi. >> Oh, really? >> Yeah. You going to pay $2,000? [Applause] >> Maybe. I don't know. If I pay $2,000, I can use Cardi E. >> Well, can you pay me the $2,000? >> Sure. Um, by the way, you were awesome on Saturday Night Live. Awesome. That's a big deal. Like I mean like like that's I I know you've done a lot of things and you're doing well, but that's live and it's Saturday Night Live. It's this amazing, you know, institution. Were you nervous doing that? >> You know what? I was nervous for my second performance. for my first performance. I was like, \"Party record with Carter.\" Yeah. And then on my second one, I don't know. Like I I was sweating. My underarms started itching a little bit cuz it's like, \"Oh my god, the world's going to know that I'm pregnant. Oh, here we go.\" Right. >> Opinions coming. >> Oh, that's Yeah, cuz that's when you revealed it all of a sudden. >> So, you were more nervous to reveal that you were pregnant. >> Yeah. >> Uh-huh. And uh And now, do you feel good that you've re First of all, you don't really There you look pregnant. You don't look pregnant here. You're hiding it. Well, >> oh, well, you know what I'm saying? I got Spanx. I got >> Uhhuh. >> I got three layers of clothes. You know what I'm saying? Like, >> right. And you're you're twerking at at Coachella. I saw there's a lot of twerking going on. >> Uh now, >> yeah. It looks like you're getting ready to give birth right there. It looks like But you know they say the the more you move the easier it will come out. >> Uhhuh. >> You know what I'm saying? And I >> come out. Okay. >> Yeah. Yeah. Well, especially if that's comfortable for you to do, it'll be easy to to >> Yeah. I was just trying to show the world how I got pregnant in the first place. >> I see. Like that. Like that. like that. That's how it happened. >> That's how it Okay, good. >> That's where I am. >> Right. We were all curious and we didn't know how. So, >> and now we do. So, that's great. That Yeah, like that. Just like that. Right. The baby daddy was here not too long ago. Offset who is, you know, he's in Migos. Everybody knows that. And I um I helped I helped him buy a car. Do you know that I helped him buy a car? >> Yes. He said all the time that you gave him a that you helped him get like a discount. I was like, \"Oh, well, she got to help me cuz I got to take car, too.\" >> Well, >> wish I was friends with her. >> Well, now you are, Cardi. >> Yeah. >> Cardi, all you have to do is tell me what you want. He told me what he wanted. I made a call and I found him the car. So, you What kind of car do you want? >> You want to know something? I think I want like a Lamborghini truck >> cuz I need like a baby car even though I don't drive, but you know what I'm saying? >> You don't drive, but you want a Lamborghini truck. I am a professional passenger. >> Uh-huh. Okay. >> Do you have a license? >> No. >> You don't have a license? >> No. I'm from New York. >> Still the Bronx? >> Yeah. But people in the Bronx drive, right? >> You know, I was so used to taking the train. >> Uhhuh. >> That I was like, why I need a car for >> No. And now you've surpassed all that. You have people that drive you around. So, you don't need your license at all. You're absolutely right. But so, that's not the smoothest riding car, the Lamborghini truck. I don't think >> it's pretty. >> Oh, it is. It is. All right. We'll think about it. But if that's what you want, what color do you want? >> Red. [Applause] What color interior? A sign that is baby friendly. >> Baby friendly. >> Yeah. >> Brown. >> Brown. [Applause] >> Yeah. Then then nothing really shows. You don't want white interior with a baby. >> Yeah. >> No. We'll think about it. I'm going to I'm going to look up uh my friends and see if I can get you a Lamborghini uh truck. All right. >> See, I need friends like you. All my friends is getting me into fights and trouble. >> No. You're from the Bronx and you're 25 years old. And what were you like as a kid? >> Uh, as a kid I was just always like the funny kid. I used to get kicked out of class. >> Like it's like balconies and it's like, \"Okay, I know.\" >> Yeah. It's the principal's office >> for acting up. >> I wasn't like a bad kid. I was just I was just very disruptive. Like I I don't know. It just It's so hard not to tell jokes and stuff. >> Yeah. Well, it's good. What you're doing is disruptive, which is the most important thing in the music industry. You want to be disruptive. You want to introduce something new, which is what you're doing. >> Yeah. But it wasn't that good in school. >> Oh, no. It wasn't good to be disruptive. But but you were a good student, I heard. >> Uh on things that I liked. Yes. Like I I was really good in history. >> Mhm. >> Look at you. >> Oh, are you you look better? >> Where? I don't know. I think I have that up in my dressing room. It's a It's I have that framed. Um, how old were you there? Look at you with your rose. Is that like a >> 17? >> You were 17. And did you have any Did you want to be a rapper then? >> I always wanted to be a artist, but I just like gave up on my dream because it's like I felt like music is not paying my bills. >> Right. So, and that's when you became a stripper. >> Yes. >> Okay. And how long did you do that? I did that for um 19 20 21 like three three and a half years. >> Three years. And did you did you like it? Did you hate it? >> Yeah. You >> I did. >> Tell me why. >> I mean, you know, a lot of people want me to be a lot of people want me to be like, \"Oh, I hated it. I I don't recommend it to nobody.\" I don't recommend it to any everybody because it's not for everybody. But it made me money. It paid my bills. It got me my own apartment. It got me my boob job. You know what I'm saying? I had about $20,000 when I was 20 years old already. And it just helped me a lot, you know? >> Yeah. But then and then how did you make the transition then from that to rapper? >> I did that transition because it's like I started getting a lot of money and the money I could the money I made I used it for invest to invest in my dream. >> In yourself. >> Yes. in my dream. >> And then the VH1 show helped you >> or were you kind of famous before that? >> I, you know, I already had like a million a million and something followers on Instagram. Like people, what helped me was my personality. >> Mhm. >> My personality took me places. You know what I'm saying? >> For sure. Yes. >> Who would have known? >> Yeah. Yeah. Well, all your classmates knew, your teachers knew, your classmates knew. But I think people don't see that that personality in a in a child is important in school. And they should, you know, like you said, not always at the same time when you're trying to work, but I think it's important. >> I made teachers cry when I left. Like it's like, we love you so much, Belise. Are we really going to miss you? But the smartest person, the teachers, wasn't crying for them. >> Yeah. >> You know who you are, smarty pants out there. >> Yeah. >> All right. So, um, let's talk. You're going to have a baby. And have you thought of names? >> Uh, yeah. my dude um named the baby. I really like the name. >> He named it already. >> Mhm. >> And what is it? >> I'm gonna let I'mma let him say the name. >> Okay. >> Since he named the baby, >> right? I'm just going to guess. Um Susan. >> No. >> No. >> No. More complicated than that. >> Yeah. >> Is it going to be like a tricky name? >> It's It's like almost tricky, but when like it comes out, it's like ah >> Yeah. I'll give you $20,000 if you name it Ellen. [Applause] >> Can I put in the middle name? >> Let me think about it. Maybe. Maybe. All right. Maybe. So, I'm going to think about that. I got something for her. I hopefully it's a it's a her. I'm just guessing. I got >> That is so You >> come on. Thank you, y'all. All right, we'll play a game. We'll be back. We're back with Cardi B and we're going to play one of my favorite games. It's 5-second rule. [Music] Here's how it works. I'll name a category. Actually, Twitch will name a category. And I we have five seconds to name three things in that category and then you hit the button. I'll start so you see how it goes. And five seconds goes real fast. Okay. Okay. >> Okay. Ellen, name three things that can fit in your pocket. >> Uh, money, um, marbles, and, uh, a Kleenex. >> Yes. >> So, I had 1.7 seconds left. >> Okay. Cardi, name three things you say when you're surprised. >> Oh, snap. Oh, sis. Come on. Oh, >> hey. No, wait. >> No, you have to do it after you name it. >> Who said Who said that? >> After you name it. All right, that's okay. >> Okay, >> it's a tie. >> Ellen, name three words that sound disgusting but aren't. >> Um, uh, wussy. Um, sludge. And, uh, smut. >> You know what word? Moist. >> Moist. >> Yeah. >> Yes. >> Moist. >> Darn it. >> Yes. Moist sounds bad and it's not really. >> Yeah. >> Okay, Cardi. Besides boobs, what are three different names for breast? Uh, watermelons, melons. You did it. >> Watermelons and melons. >> All right, Ellen. What are three things you wish you owned but don't? >> Uh, um. No, >> she got a Lamborghini truck connection. >> Yeah, I kind of did. >> Yep. Yep. >> Yep. >> All right, Cardi, name three things you shouldn't do at a strip club. >> Uh, not give money, slap the booty real hard, and uh, eat chicken wings. Eat chicken. eat chicken wings. >> People eat chicken wings in a strip club. >> That's gross. >> It's kind of gross. >> Yeah, they should not eat chicken wings in a strip club. >> It's gross. >> All right, Ellen, name uh name the last three celebrities you text with. >> Uh uh uh Bruno, uh Justin, and uh Anna Ferris. >> Wow. Okay, Cardi, name three things that make you laugh. Uh uh money, chocolate, and you win. Six. Hallelujah. You are a winner. Money makes you laugh. Chocolate makes you laugh. Yes. All right. How was that? Um, well, I did my my makeup in the car and I'm, you know, I'm unhuggable right now cuz I couldn't take a shower. But, you know, >> you smell fine. >> But how was it in Paris? >> It was It was a It was amazing. I had a good time. >> Yeah. What shows did you go to? >> I went to the Chanel show and to the Tom Brown show. [Music] >> Fancy. You You like to go to those, right? >> Yeah. >> And do you buy things there? >> Oh, yeah. Of course. You know what I'm saying? Mhm. >> Wonderful. It wasn't really busy that day on the street. Um, >> what's this? What's happening? Are you fencing somebody? >> No, it's fashion. >> Oh, I Sorry. Sorry. Um, and Chance, I just saw you recently. >> Every day I see you. >> I know. Now you're just here weekly or something. I like it. Um, and uh, so let's talk about the let's talk about the show and how this came about. >> Yeah. So, uh, it's, uh, hip-hop's first legitimate TV competition series, uh, on Netflix, and it's basically myself, my fellow judges, uh, seeing the greatest talent in hip-hop across the nation and bringing them into one place and trying to, you know, see what they got >> and and, uh, who's who's the hardest on them? So, so far, I've seen the first episode, and who do you think is the hardest? >> It's definitely not Cardi. I was hard. >> Yeah. Cardi. Cardi. She was We'll be there all day. >> We'll be there all day. Will I like you, but I don't know. So, what do you think? Chance. >> Yeah. It comes down to me every time. >> Yeah. It's always to chance, >> right? No. You told somebody you didn't like them. >> Oh, a couple of them. >> Yeah. Yeah. Yeah. I say a couple of them. >> Now, do you think you're tougher on women than than they are? >> Um, no. Well, kind of because you know when when when it comes to women, I feel like it's like you have to have like the whole package. You know what I'm saying? Like it's like you got to have >> like the right voice because let me tell you something. There's some women on Instagram that they could rap, but their voice is just like I don't feel like people want to hear it for too long. So, it's just like that, you know, you have to have the confidence. You almost have to be like also like like not even really like a open book, but everybody just want to know you. I always tell the girls it's like you got to be that girl that guys want to be with and girls want to be like. >> Yeah. Well, that's kind of that's with guys, too. That you that guys want to Well, not be with, but but guys want to like and be like, right. >> Yeah, sure. >> Wasn't it So, you're married to Offset, just in case you didn't know. Um, and >> wasn't wasn't it Offset who kind of told you it's time for you to get married? >> Yeah, I was at Coachella when you performed. What was this? Two years ago, I think. And uh I met Set. He had a party at uh we went to French's house to French Montana's house. We were all in the backyard and he pulled me to the side and told me that you guys had just got married in the backyard. He was like, \"Yo, you need to >> take care of business, blah blah blah.\" And then Yeah. And then I came back home and I I proposed like two months later. >> Wow. Did you know that? I I know that too. He said that in the interview and I was like, \"Oh my is so beautiful.\" And marriage marriage is such a crazy unity. >> Yes. >> In a good way. Right. >> In a good way. >> In a good way. Yeah. >> Yeah. Y'all have a very unusual way of showing your affection in public. [Laughter] >> Oh. Well, >> do y'all always kiss like that? only when we in French >> supposed to be covered up with the mouth. The mouth and then that stuff happens inside the mouth. >> Yeah. But you know what I'm saying? Sometimes when we do all of that, you know what I'm saying? I have makeup and then all that lip glosses and the concealer gets on his face. Then he look like he ate a donut and >> so we just got to You know what I'm saying? >> No, now I get it. That's >> that happened before to you. Uh, no. But now that I see that that's why we should do it. Yeah. Ladies, men, that's the way you kiss when you're when you've got makeup on so you don't have to get it all over his face. >> That's when the lips are in the way. >> Yeah, the lips are in the way. >> Just in the way. Get straight to the good stuff. >> We're going to we're going to take a break. Um, and see if any of that airs. We'll be back. All right. This part of BTI trans rapper in rhythm. All right. Right. So, Nifty Hustle is in it as we said and that was kind of the last thing he did right before he was killed. >> Yeah, it was a huge I think. So, I mean it was a huge >> one of It was very close to that was the same night actually that um we went to to his Grammy uh uh nomination party. >> Uh me, him, Jay, and Dave Chappelle, Snoop, we was all there and we shared, you know what I'm saying? Some we had we had some laughs and it was a great time. >> Yeah. What a great guy. What a what a loss. Um, I I can't let uh you sit here without me telling you how great you were in Hustlers. >> Yeah. >> Yeah. >> Thank you. >> I got it. I know we're talking about H rhythm and flow, but Hustlers, did you enjoy doing that? Um, I enjoyed it and I was just like I couldn't believe that I was like on set for like 16 hours and then like god like do this what what uh actors and actresses got to go through. Like you know artists we have long days but it's just full of excitement. It's it's like we move around. We doing something. It's like you got to wait on the trailer till it's your turn. >> Turn the lights around the cameras around. >> Yes. You got to do the same scene like 20 times. >> You're not going to do that again, are you? >> Oh, yes, I am. >> Yep. >> I'm going to film for a movie this month. >> Well, you just said you didn't enjoy it, but it but you don't care. >> I enjoy the check. >> Is that why you did Rhythm and Flow? >> Yes. You want to know something? We did it for the We Everybody do it for the check. But once we was there, you know, >> we came for the check, but we stayed for the artist. >> Yes. And you want to know something? I grew a connection to the to the contestants and to everybody. I was really emotional the last day. Like I just couldn't believe it. It was so sad. >> Good. I feel bad cuz I feel like we crushed a couple of people's dreams. >> The dream. The labels. neighbors would have done that. >> Well, you know, this is the thing though, because people actually have like uh uh something in them, like a gift that they're actually put on earth to go do. And and music is not it for some of them. So, we need to get them off of that path so they can clearly find their life purpose. >> You're helping them >> expeditiously. We should do this. >> Exactly. Yes. All right. So, uh you're going to answer some tough questions. We're going to we're going to take a break. I'm going to ask questions and uh Pure honesty. That's all we want from you. That's all we ask is is complete honesty. >> Does the fifth amendment apply? No. >> You have to answer. We'll be back. >> Can I call my lawyer? >> We're back with Cardi B. TI Chancellor Rapper's time for a game we call never have I ever and I'll ask a question and uh you will say uh I have never or I have. And it's again complete honesty and we will know if you're lying. >> All right. Never have I ever hooked up with a fan. >> Well, wait, wait a second. Cuz my husband say he was a fat of me before he met me. >> Well, then he Yeah, you have. >> Yeah. Uh, never have I ever sent a dirty text to the wrong person. Just you. >> So the wrong person, Carter. >> The wrong person >> because I just be typing so fast and I just >> Who did I be like, \"Oh, sorry. Sorry.\" >> But that's not for you. >> Who did it go to? >> Girlfriends. They I go, \"All right. Never have I woke up in a strange place without remembering how I got there.\" >> Does home count? Sure. Oh, all right. Only one there that never have ever gotten a tattoo I regret. >> What do you regret? >> I got like three different men tatted on me. You know what I'm saying? >> They got a ga. And what do you have on you? >> I have a It's not really funny. I just have a really bad tattoo on my chest. >> What is it? It says uh it says get back to work, but it's like backwards so that when you read it in the mirror, it's like get back to work. [Applause] >> It's the worst thing I ever did. Was that a dare? No, I thought it was deep. I thought it was cool. >> Oh my god. >> It's so stupid though. >> Oh my god. Chance, how old were you when you did that? >> Uh I think I was 20. 19 or 20. Yeah. >> Old enough to know better. Um, never have I ever snooped through my significant other's phone without them knowing. >> Well, I had some other things I was looking for. >> I see. >> Yeah. >> Uh, never have I ever gotten engaged and kept it a secret. >> What? I got >> I got married. [Laughter] >> I kept it a Yeah. Well, that counts, right? >> Yeah. Okay. So, I have >> all right. Never have I ever lied to Ellen while playing Never Have I Ever. >> Yeah. >> Thank you, TI. I appreciate it. Every year I'm forced to dress up in a costume. And every year they try to make it sexier than the year before. I'll know it's time to stop doing the show when they send me out in two coasters and a dinner napkin. Honestly, it's it's amazing that I can I can be wearing so little and yet sweating so much. Feels like I'm I'm smothered in a sexy futon or something. So, in the movie Hustlers, Cardi B plays a stripper named Diamond. And she was actually a stripper in real life before she went into music. And that is a coincidence because before I became a comedian, I was also a stripper. I was uh stripping paint from houses, but still I was a stripper. I was trying to get into character backstage. I'm working on my [Applause] Heat. Heat. [Applause] Hi. Did I Did I do it wrong? [Applause] >> You know, I you I like that yours are softer than mine, too. >> Really? >> I I'm I'm I should be mad at my doctor. Oh, really? >> Are they softer? I don't want to touch them, but they are softer. >> Yeah. >> Oh, >> wow. >> Yeah, they feel good. They They're fun. >> That's good. >> Yeah. Thanks a whole lot. So, um, thanks for being here, Cardi B. I'm Cardi E. So, uh, I I've been, uh, >> did you see my twerking? Did you see what I did? >> Well, let me see it. >> Okay. Okay. Should I face you? Okay. Um, No. How's it go? >> I mean, if you're trying to get higher >> Uh-huh. How do I do it? >> A little bit more. Uh, >> I'll give you a couple of bucks right there. >> Yeah. >> Yeah. >> I'll give you $20 for I'll buy a lap dance for you. >> Yeah. >> Yeah. >> Oh. Oh. I need to put it on. >> All right. Yeah, you're supposed to do that, right? >> Yeah. >> All right. Thank you for helping me get into character. So, you dressed up for Halloween, right? You had a party. >> Uh um I did went to my husband's show. I was dressed as a nurse. >> Uhhuh. >> Cuz these girls been sick a year. >> So, let's see the costume. >> Who got a fever? That's nice. I think you could make anything look naughty, though. I think I mean, you look very, very classy in this and yet naughty. >> I look naughty. >> Yeah. But it's very it's it's fantastic. >> What are you wearing tonight on your Halloween show in Vegas? >> Well, right after this, I am going to dress up as Moana cuz my baby's dressing up as Moana. >> Oh. >> So, I'm trying to go trick-or-treating for me. Yes. >> Yeah. cuz she can't eat candies. But you know, I mean, you know, that's the fun thing about being a mom. >> Yes. >> You got a reason to trick or treat now. >> That's right. And she and you're both going to be Moana. >> Yeah. >> That's cute. That's cute.",
    "start_time": 0.0,
    "end_time": 1717.1589999999999
}