{
    "video_id": "BbdQpGBuex4",
    "channel_url": "@theellenshow",
    "transcript": "Heat. Heat. Wait a minute. Wait a minute. You got to meet these two guys. How about Bryce Harris and Rashad Ballard right here, everybody? All right. So, have a seat. Here's what happened. Have a seat, everybody. I I watch, of course, I talk about it all the time when I work out in the morning. I watch BET. I watch my videos. And I was watching Monica who's on the show today and I was watching this video and they were in it and I was like we have to first of all book Monica and these two guys have to come on the show. They're amazing. Bryce and uh Rashad uh take me out. I'm going to go over there but I want to see you two do a little something something. All right. >> Well, before you do that, I got to give you something. >> Oh, really? >> This I want you to keep because one day it's going to be very valuable. You're absolutely right. You're absolutely right. You give me some, too. It's going to be valuable, too. All right. >> Yes. I'm going to give you some. >> All right. Good. You can maybe give me that watch. I know what that is. >> I know what that is. All right. So, uh, do a little something and and, uh, keep going. >> All right. Heat. Heat. Oh, thanks so much. I'll see you later. He's right. I am going to uh this is I'm going to keep that. And uh this is ridiculous. [Applause] [Music] All right. On the show today, Leah Reiny is here. from the King of Queens. Also on the show for ABC's What About Brian Barry Watson is here. And here to sing every time the beat drop music superstar Monica is here. Also here today, three competitors from Dancing with the Stars. Joey Lawrence, Mario Lopez, and Monnique Coleman are here. on Tuesday and Wednesday at 8:00 on ABC. Today you guys are stars in your in your own right cuz right now it's time for audience dancing. Heat. Heat. Heat. Heat. Oh, what we have to do is we have to get y'all here sooner. I know you just got in here and had a little bit of time to dance. We have to start spreading it out so you each take your time on the floor because the guy in the black jacket was so good when you individually What is your name, sir? >> Tim. >> Tim. Uh, let's take a look at Tim on the floor because that was better. We come back, Leah Reman, he's going to sit right here. But first, from Dancing with the Stars, please welcome Joey Lawrence and the dance part Eddie. [Applause] [Music] Tell me about cuz you were the first person to see Baby, baby Suri. You went to see Suri and uh and then the pictures came out. How cute is that baby? >> Beyond >> stunning. >> Ridiculous. >> Stunning. >> That's the thing. I couldn't believe when I saw the pictures. First you just said, I saw the baby. Cute. And then I see the pictures and I'm like, I would have been going out of my mind if I would have seen that baby. I mean, >> she's just stunning. Stunning. She looks like Tom and Kate. >> Yeah. I have said before, I know anybody who And you have a baby, but you got to know it's not as cute as that baby. I mean, >> no. >> No. As a matter of fact, Angelo Angelo, you know, he's looking at the pictures and he's seen her and he's like, I I think uh Tom said, \"Isn't she gorgeous?\" And he said, \"Well, yeah, but I there's one other girl that's a little prettier than her.\" And, you know, and I was like, \"Dangel, you know, this is just not appropriate conversation.\" But then later on, I said, \"Actually, I think she might be a little bit >> No, >> no. Siri being a little better looking.\" >> Right. Right. Um, hey, listen. For for Tom and uh Katie, we gave her uh them uh a really cute little baby present. We gave them a pink Yeah. >> Adorable. It was like a pink airplane. >> Was it big? Was it big? >> Look at a little airplane stroller that they can walk it in. >> It's pretty substantial. >> Yeah, it's amazing. >> Considering I got some freaking booties from you. >> Is that what I gave you? >> Yeah, some booties that you also gave Deborah Messing. >> I'm sure they were different. >> Okay. They were different. I don't know why they were different cuz I had a boy. I had a girl and she had a boy, >> right? >> But but it wasn't substantial. For all I know, you get that crap for free and people go, \"Hey, give it to your guests. It's horrible. >> That's horrible. >> It's horrible.\" >> I don't know. >> I mean, and we're friends and people don't even know that, even though I haven't heard from you in the last two years. Um, >> I consider us friends. And for you to just give me some freaking booties. >> Yeah. >> That you probably got for free. >> No, I think I paid for those. >> I don't think so. I'd like to actually see the credit card. I >> probably didn't. But here's the thing. >> Just so we're clear. >> I still love you and adore you. I love you, too. And uh and you have really good ideas for me. She was voted best dressed uh for the Emmys this year, which it was a beautiful dress. >> Yeah. And so since I'm hosting the Oscars this year, I heard you have some suggestions for me and I'm going to take your advice because if you got voted one of best dressed Emmys, I I want to be best dressed and so >> Ellen, >> but here's the thing. What? You don't listen. You don't listen. >> No, you don't listen, baby. You right. Exactly. Now, I really Ellen, I want to help you, but you can't. Baby, >> what? >> Okay, before >> we have to do this now. We have to take a break. All right. She She wants to tell me a problem. >> But are you going to open up your mind to maybe something different? >> I always open up my mind. >> All right. We'll see about that. >> All right. We'll be right back and I'll I'll hear you out. >> Okay. >> We're back with my friend Leah Remany. And uh so what are you saying that I need to open my mind about? >> Okay. So I did a little research on you. Okay. Now look, this is what you wore to the um Ray Charles tribute a suit. Okay. Surprise. >> Okay. Then at the Screen Actors Guild Award. Why are you showing me >> baby? Cuz I don't want to show. Okay, fine. She wore a suit to the whatever awards. Then another suit over here. And then Oh, look at this. What' Ellen wear here? The Emmy Awards. A suit. That's a surprise. Okay. And then Oh, Ellen. >> The daytime Emmy is another suit. >> Okay. I mean, I could go on, baby, but please. >> I wear suits. >> You wear suits, but enough. Okay. Now, I just you guys. Okay. Listen. >> Yeah. I don't want them to not be on my side because you're charming and sweet and they're your audience, okay? So, I don't want them to listen. >> Listen, okay, because people love you, Ellen. Okay, but I think >> I know you do, baby. Okay, >> but >> All right. All right. But I'm opening my mind. What do you >> I just want you to think about showing a little skin, maybe a little dress. Okay, show a little of this, you know. Show a little of that. Okay, >> Ellen, you have nice boobies. Okay, I'm not saying flaunt them. Show them. Okay, I don't show my boobs. Okay, but a little something, Ellen. >> A little Don't See, why are you buttoning? >> Cuz now you're making me >> show a little something, baby. Okay, so we have some models here for you. >> Oh, models. >> Okay, and to show a little thing. Okay, now they're all wearing they're are they're all wearing Ellen wigs. Okay, now this is a Versace silver gown. >> That's pretty. >> Now look at the Jimmy Chu shoes. >> Okay. Diamond earrings and cuff by Martin Catz. >> Yeah. >> Now, now Okay, look. She is a model. >> I'm not. Yeah, I'm not going to wear that. >> I All right. Oh, >> it's beautiful. It's beautiful. >> She won't wear it. She won't wear it. Get off. >> No, but you look beautiful. That's not me. Fine. All right. So, this is a Bagley Misha black velvet suit >> but with a busier. >> Yeah, I like that. >> Okay. >> And look, it looks good with the Ellen hair. >> Yeah, it does. >> Ellen hair. >> Look, here comes somebody else. Here we go. David Meister red satin dress. >> That's pretty. >> Okay, >> now look at the necklace. Very simple. >> I like the necklace. >> Gary's diamond necklace and Martin Cat's diamond hoop. All right, here's the next one. Gian Franco Fereet. Okay, this is Gian Francet. And this is my favorite. This is my favorite. Now listen. >> Well, >> listen. Look how good it looks with the Ellen hair. >> Look. >> Yeah, but it's >> Why not, Ellen? >> Don't yell at me. I think that it's beautiful. >> We can push your boobs down. You don't have to show that many that much boobs. >> That many boobs. >> That much boobs. >> That's beautiful. I I that's that's nice on you. Hear it. >> Oh, a Gucci sho suit. >> Yes. >> Yes. That's a suit. >> Yes. >> And I like the watch, too. >> Yeah. Okay. That's the Rolex watch. >> Yeah. >> Okay. It's a cream wool Gucci. >> Beautiful. Beautiful. >> So, Ellen, that maybe with a little open shirt. >> What shirt does she have? Yeah. Yeah. That's beautiful. You're all You're all coming up. Okay. >> All right. I think [Applause] >> if you weren't wearing sneakers, Ellen, you would be as tall as them, >> right? And uh you're wearing saw you in a suit and sneakers. I swear, Ellen, I swear I would kill you. >> Well, all right. Here's what we're going to do. We're going to let the audience vote for their favorite thing and be really think about me. Don't just But uh at the end of the show, we're going to decide uh which outfit you like the best for me. And uh thank you. All look beautiful. All right. And vote for one of these. We'll be right back with Barry Watson after this. Don't go away. Our next guest is known for his long run on Seventh Heaven. Now you can see him every Monday night on the ABC drama What About Brian? Take a look. Please welcome Barry Watson. My knees are killing me. >> I bet you didn't. Was that a last minute decision? >> I don't know what the hell I'm doing. And you got the Dancing with the Stars people here. >> I liked it. You almost put a hole through your pants. That's >> These are my pants. This is wardrobe. >> Oh, I see. >> I just came from work. >> You look nice. It looks like uh I like it. >> Oh, you're Well, you're lucky I didn't wear those shoes. I was going to dress like you today. >> Really? Well, you kind of did. Except for the shoes. >> Except for the shoes. >> Yeah, I like it. >> We can switch. >> So, welcome. And uh >> by the way, I just want you to know I love you. I love this show. Thank you. >> I love your old show. >> Thank you. >> And I love you. Stop it. >> Okay. >> And my son loves you. >> My son My son I have a I have a 17-month old son and we go hiking every day um if I don't have to go to work too early and he he got that for you. It's a pine. What's your son's name? >> Uh Oliver. Oliver Gray. Adorable. >> And then there's this one. >> Now, did he really get this? >> And that's like a necklace. >> I I think I've seen flavor flavor. >> And a rock. >> I love your son. And tell your son, thank you so much. I really Now, Seventh Heaven, you were on for how long? How many seasons? >> I did um six years straight. And then I came back and directed some and you know, guest starred in a couple and wrote an episode and Yeah. >> Um this is something that I found out about you today. That's we're, you know, it's breast cancer awareness month. We're talking about that a lot. And you found out you had cancer when you were 28. >> Yeah, I uh I had Hodkins disease. I had uh you know, it's a form of lymphoma >> and uh I found How did you find that out? Found a hardened lymph node on my neck. I was actually uh >> I was in New York doing some uh press for a movie I was doing and I was really uh tired uh tired in a way I've never been before. And uh it was St. Patty's Day and um you know I'm Scottish Irish and I like to have a pint you know and I didn't feel like going to have one and so my brother knew something was going on and then I had uh breakfast with my mom and we just noticed this lump and I went to the doctor and that was it. >> Wow. 28 years old. >> 28 years old. I didn't think it was supposed to happen to people that >> No. No does whenever something like that happens. >> Yeah. But that that form of cancer it happens a lot between the ages of uh you know 18 and 32 for a lot of males really and women as well. But uh mainly hits men >> and and so to those people obviously you're healthy. You're fine. >> I am great. >> You went through chemo and everything. >> I went through chemo. I lost my eyebrows, my eyelashes, all my hair. You know what I'm talking about. And I shaved my head and did all that. Um. Yeah. >> What would you say to people that that are faced with when finding out information like that? >> Uh, well, hopefully your doctor has like a family member or a friend to come with you. my doctor forgot to do that. So, I was like by myself in the doctor's office when he told me and the first thing I thought was >> of my my parents and my family. But, um the only thing I can say to anybody who's uh you know, find I mean it's it's so common nowadays, everybody knows somebody or or knows somebody that's had it or a relative or whatnot. And uh the one thing I can say is just um don't give into it, you know, just think about fighting it no matter what. You know, I mean, I never considered myself a cancer patient, and I learned that from a lot of people that were in the treatment center with me. So, >> attitude has a lot to do with everything >> completely. >> And the more people I I I meet a lot of people who, you know, and I feel very grateful that I'm a part of it. But that that from watching either this show or HBO specials or whatever attribute laughter to a lot of healing. And so, that really is important to keep your attitude up and to keep happy. >> Of course. >> And uh and you're you're uh are you now engaged? Is that right? I'm engaged to uh my beautiful fiance Tracy Hudson >> who's on Extreme Makeover. >> Who's on Extreme Makeover Home Edition. She's not doing too many right now because of our >> Oh, there she is. >> Hi, baby. >> She's not She can't She can't hear you. >> Oh, that's just a picture. >> That's weird. >> Yeah. Um anyway, um so and now do you do you feel like you're lucky because she can do your home? Like you you have great taste and you don't have to do anything? >> Yeah, I I Yeah, I do. Except it's always it's it's always going on. there's always something happening or a new idea. So, u I'm sure once we get the whole house finished, uh, we'll probably sell it and move and start all over again. >> That's how I am. I think that's the fun part is the process. >> Sure. >> So, tell us about the second season of What About Brian? >> Well, it's weird because we only aired five episodes last year, so it's it feels to me like we're just kind of continuing the first season. >> Um, but it's really good. I mean, there's uh some changes, some new characters kind of brought onto the show. Um, but we're we're kind of, you know, taking off >> six months later from where we left off last year. >> That's great. Well, congratulations. Tell Oliver, thank you so much for all of this and uh I will wear this to the Oscars and uh >> with one of my dresses. It's very fancy. >> I doubt it. Um, all right. What about Brian airs Monday nights at 10 o'clock on ABC. We're going to be right back with three competitors from Dancing with the Stars. Don't go away. Please welcome our next team from Dancing with the Stars, Monnique and Louie. [Music] Heat. [Music] Heat. All right. So, here are the three teams. Hey, how are you? Hi. Good to see you. Hi. So, here are the three teams uh still left on ABC's hit show, Dancing with the Stars. Please welcome Joey Lawrence, Monnique Coleman, Mario Lopez, and their partners, Edita, Louie, and Karina. Hi. Hi. Hi. Hi. >> Hello. >> All right. Uh, let's just get this straight first. Who's dating who? >> I'm married. >> Oh, is he serious about that? >> Yeah. >> Yeah. Well, Joey's happily married. >> You're married? Uhhuh. >> Yeah. Karina and I are together. >> Oh, okay. Good. >> It's funny cuz it's not. Yeah. >> Hooked up with somebody different every week. First week I was with Karina. This next past weekend I was with Eva Loria. I think I'm with Emtt Smith. Next weekend. >> Are you? >> So, yeah. >> All right. Well, it's good to know that everybody's still happy though. >> Yeah. Yeah. >> All right. Good. All right. So, uh, what is what is hard about because you've had time to get ready for the show way ahead of time. Now, what's the hard thing? Is it the pace? >> It's crazy now. I mean, well, there's a new dance every single week, you know, so it's literally I mean, if you have no dance background like me, I mean, it's uh four days a brand new dance. Um, and uh you have to learn how to perform it and and and and know it to the point where you can perform it. And it's just uh it's just incredibly trying. I mean, it's I had no idea how hard it was actually going to be. >> Well, it it looks like it to me. I mean, as a dancer, it's different because you're used to that, but as someone learning how to do that >> Yeah. because you're learning it, too. You're you're you have to remember the actual moves themselves, not just Yeah. And there's a timing and there's a count. And if you're off count by one count, the whole thing gets messed up. You got a minute and 23 seconds. I mean, it's just it's amazing. >> But Ellen, our poor instructors/p partners, and I say that because obviously they're like they're like the best in the world, but they have to put up with us. And I know I'm beating mine up constantly accidentally kicking her, elbowing her in the face. So, she looks like she was playing rugby as opposed to dancing. >> It too. I mean, come up with something. We get the music. If we make it Wednesday night, we get the uh song and the and the dance and then edit it and the rest of the professional have to go home and try to choreograph it and come in Thursday morning and start teaching us. >> That's why y'all are so relieved when when basically when you get back on the >> you're like, \"Thank God we have another week.\" >> So now, what happened with you've had two hard weeks, right? You had a wardrobe. >> The first week I showed my booty on national television, right? >> And it was aired in slow motion several times. >> Uh entitled Moon Dance. >> Uhhuh. And now you have broken the rules twice in a row. >> No, a correction. Here's the deal. I didn't break the rules. I merely misinterpreted the rules, you know. So, that was uh that was an innocent mistake, but we were trying to entertain. And, you know, we're not professionals, so we just wanted to entertain and and make sure everybody at home was like really liking it, but I got scolded like I stole something in front of national television by a couple of judges, so I didn't like that too much. >> No, that doesn't feel good. >> My last question is, how long do you think Jerry Springer's going to last? >> Oh, we love Jerry. We hope he lasts time. You know what? you see a whole new side of him that I mean, you know, I mean, I had no idea that this that this man is is like, you know, married. He's got a daughter. He's like a really nice guy. He's like looking forward to being a grandpa one day and like giving his daughter away. And it's like it's really cool to see that. He's a really genuine guy, you know. >> I agree. He's a sweet guy, but I don't see any of these moves happening out there with him. >> Right. Right. >> I mean, he's basically standing there like somebody's doing all the work and he's just, >> you know, >> I'm waiting for that routine. I'm just saying. >> That's that's the gist of it. >> I could do that. >> Yeah. But he's so charming. >> Yeah. No, he is. He seems like it was very touching and his >> love thing. Everybody's got their own little vibe, you know, and that's and that's his vibe and it's kind of great. >> That's why America loves the show. It's really exciting. >> Yeah. >> All right. Uh well, who's left to dance? >> Anybody dance? Yeah. [Music] Heat. Monica's going to perform when we come back. We'll be right back. Don't fall away. >> We have the result of uh your your votes and I'm learning with you what what it's going to be. Leah, what is >> Okay. So, this So, third place is the black suit. >> I would have liked to seen you in a second. >> That's third place. That means there's >> second place is the black dress. Sorry, I cut you off. Did you want to say something? No. First place is the white suit. >> Thank you. >> Thank you. >> Yeah. You know what? That's actually that actually may be something that I would consider. >> If you wear that, I want to see a little something here. >> A little something. Ellen, >> watch out. I'm sorry. Just a little a little something. >> All right. >> A little lacy something showing a little something. >> That's something you have to deal with. That's your issue. >> Baby. >> Um, >> a little something. >> All right. >> What do you have? You got a gift? >> I have a gift for you. >> Small >> for the baby. >> That This is a little onesie. And I had a customized >> Great >> to say this. >> It's fantastic, Ellen. But I want to thank Ley, Barry Watson, Monica, Mario Lopez, Monique. >> But the real gift is coming in the mail. >> Tomorrow, Wanda Sykes is going to be here. >> The real big gift is going to come. Yeah. >> Okay. Soon soon, sweetie. Goodbye. I know it's all funny.",
    "start_time": 0.0,
    "end_time": 1620.44
}