{
    "video_id": "pE7eB_PBTTc",
    "channel_url": "@theellenshow",
    "transcript": "back with Rod Stewart who uh you know I get to know you more and more each time and I really like you. I like you in so many ways and I feel close to you and trust you in many many ways and yet I shouldn't. Um, we were at a a kind of a dinner party one night and we were sitting next to each other and uh throughout the night I'd turn around and my silverware would be missing. And I just thought, well, I guess that someone's picking it up and not realizing I'm still eating. So, I just stopped eating. And then I went to go put my jacket. I I had I had my jacket. I was leaving and he said, \"That's a great jacket.\" I said, \"Oh, thanks.\" I went to put it on. He had tied my jacket sleeves in knots and I couldn't put my jacket on and so I definitely owe you. Don't think I'm forgetting about it. >> Just a little practical jokes that you learned after being in rock and roll for so long. >> Yeah, I like it. I like it. It keeps you on your toes. >> It does keep me on my toes. And so >> can I ask you a question? >> What? >> Why haven't you got a picture of me outside in the hallway? >> Do I not have a picture of you? >> Everyone else but me, >> Mary. Why would you do that? Why wouldn't you have a picture of of Rod in the hallway when I've asked over and over again? >> How many times have I asked why I don't have a picture of Rod? >> Have you got a good picture of me? >> You've asked a lot and um and we're really really sorry. >> We'll do it tonight. No. >> Tonight. Tonight. As a matter of fact, we're going to do it. By the time we finish talking, we're going to cut away to a hole. We're going to be taking someone down. Who' you Who do you want us to take down? Did you Anybody back there? >> Um there must be somebody else out there. Let me think. We'll scan the hallway with a camera and we'll all vote on who comes down. >> Yeah, great idea. That's good. >> That's good. >> So, it's not just you. >> Yeah, that'll be good. >> All right. And the last time you were here, we you were getting ready, uh, you and Penny were going to have a baby. And since then, now, uh, do we have a picture of your baby? Look at that. >> Oh, little bugger. Look, there he is. >> That is adorable. >> That's my house in the background. >> There he is. >> I thought you said that's your I thought you said >> that's my house on behalf. Well, of course it's in the background. Um, >> my ass is not that big, I tell you. >> No, it's not. It's a good one. I'll tell you that. Yeah, you've got a good house. Um, >> that is a cute picture and that's a cute little outfit you've got on that little baby. >> Yeah. >> And how is it now? What are you are you just overjoyed? I know you have other kids, but like is this at this time in your life? Is it a whole new experience? >> Well, I wouldn't say it's a new experience. I certainly have got more time this time around because I can make time for myself, you know, but when I was chasing the wild dollar across America when the other kids were born, you know, I got tour after tour after tour and why, you know, they're the most important thing. So, I've learned one lesson, you know, give them more time. >> Yeah. Oh, that's good. Well, this baby's going to get a lot more time with you. >> Yes, he is. >> That's great. >> Important. Now, speaking of your other kids, you have your son is going to do a reality show right now. >> He is. He's done How do you Oh, he's already done it. >> Yeah, he's done it. It comes out in January. >> How does that feel that that Sean, is that his name? >> Yes. >> His head's already swollen. Don't make it worse. >> Yeah. >> No, he's he's a he's a really good kid. He's done well. And the thing is, he's done it all off his own back. He hasn't asked me to make phone calls for him. So, I'm very proud of him. It's called the Hollywood Sons of Hollywood. Comes out in January. >> And now, and also, your daughter Kimberly is good friends with Paris Hilton. >> Yes. >> Now, do you know another side of Paris that we don't know? Because you watched her grow up. She was in your house a lot. >> No, she I I always found Paris to be extremely polite, well-mannered. She is when she's around me. Yeah. >> She's a very nice girl. I think sometimes she gets a bad rap. You know, she enjoys her publicity, but >> she sure does, >> you know. >> No, she really does. She embraces it fully. She She's in this business and she's like, I'll I want as as much attention as I I can get. And you know, that's not to say anything's wrong with it, but that's >> She'll go out of it, I think, too. I think when she finds the right guy in her life, she'll get everything in perspective and leave the press alone. and the press will leave her alone hopefully. >> Right. You You want a glass of water? >> No, I'm fine. I'm just getting ready to sing again. I'm going to sing another song. >> Oh, yeah. >> So, you don't want water? >> All right. >> Just have a right. >> That doesn't work at all. >> What? Whatever. >> It was a dribble glass. They gave me a dribble glass and it didn't even dribble. >> Oh, you're supposed to spill all over me or something. >> Yeah, but it didn't. >> No, it didn't dribble. No. No dribbling going on there. >> All right. Well, do you want any jelly beans? >> Good. Goody. Good. >> Yeah. You want it? >> Yeah. >> Can I have a jelly bean, Rod? >> Hey, it's amazing what they can do on this. >> What about >> What about a peanut? Would you like >> Oh, don't say the peanuts are going to come out all over me. No. Careful. Oh, no. the vast expense of it all. >> All right, wait. Let's go out in the hall. I think they're going to look at some uh That's a Great Dane. We could take the Great Dane down probably. It's a shame we have a Great Dane and not Rod. >> There's Hillary Clinton is next to that. >> Uh and then uh that's Kanye. >> All right. So, should we take down the Great Dane? >> Yeah. Thank you, my friend. >> All right, great things going down. >> Beginning Tuesday, you can log on to our website to purchase a copy of Rod's new CD, Still the Same. Great rock classics of our time, which I love this. And I love all the songs you chose. I like the one you're doing. You're doing Father and Son next year. >> Father and Son. Very appropriate. >> All right. You can also catch him on AOL.com's All Rod Stewart video channel. You have a All Rod Stewart video channel. >> So they tell me. >> Wow. We'll be right back. Don't go away.",
    "start_time": 3.04,
    "end_time": 350.0
}