{
    "video_id": "d55HO6ESMRo",
    "channel_url": "@theellenshow",
    "transcript": "[Applause] Heat. Heat. Happy Halloween. Thank you so much. Have a Have a seat. Thanks so much. You look great, all of you. Before we start, I want to say my eyes are up here. My boobs are everywhere else. My costume this year is a tribute to Cardi B's character in the movie Hustlers. I can't be Cardi B. >> I'm Cardi E. E is for Ellen. It's also my bra size. This outfit has a whole lot going on from every angle. I don't know if you can tell, but How did I do that so fast? It actually was a lot. Oh, hair. Lot to get me dressed like this. Uh, there's wardrobe, there's hair, makeup, and a special thanks to the people at Goodyear for inflating me. Every year I'm forced to dress up in a costume, and every year they try to make it sexier than the year before. I'll know it's time to stop doing the show when they send me out in two coasters and a dinner napkin. Honestly, it's it's amazing that I can I can be wearing so little and yet sweating so much. Feels like I'm I'm smothered in a sexy futon or something. So, in the movie Hustlers, Cardi B plays a stripper named Diamond and she was actually a stripper in real life before she went into music. And that is a coincidence because before I became a comedian, I was also a stripper. I was uh stripping paint from houses, but still I was a stripper. I was trying to get into character backstage. I'm working on my o [Applause] [Applause] Yeah. Hi. Did I Did I do it wrong? [Applause] You know, I you I like that yours are softer than mine. Really? I I'm I'm I should be mad at my doctor. >> Oh, really? >> Are they softer? I don't want to touch them, but they are softer. >> Yeah. >> Oh, >> wow. >> Yeah, they feel good. They They're fun. >> That's good. >> Yeah. Thanks a whole lot. So, um thanks for being here, Cardi B. I'm Cardi E. So, uh I I've been uh >> Well, did you see my twerking? Did you see what I did? >> Well, let me see it. >> Okay. Okay. Should I face you? Okay. Um No. How's it go? >> I mean, if you're trying to get higher >> Uh-huh. How do I do it? >> A little bit more. Uh, >> I'll give you a couple of bucks right there. >> Yeah. >> Yeah. >> I'll give you $20 for I'll buy a lap dance for >> Yeah. >> Yeah. >> Oh. Oh. [Applause] I need to put it on. >> All right. Yeah, you're supposed to do that, right? >> Yeah. >> All right. Thank you for helping me get into character. Uh we should hustle over there and Twitch is going to come out and dance. All right. >> Okay. All you got to do now, [Applause] [Music] you never had a friend like me. Life is your [Music] [Applause] friend like me. We find ourselves on service. You the boss, the king, the sh. Say what you wish is yours to dish. How about a little more? Have some of column A. Try all of column B. I'm in the mood to help you, dude. You ain't never had a friend like me. Oh, >> Twitch. Twitch. I like your costume. >> Thank you very much. I like yours, too. Do you have a a magic carpet to get to the hospital in case Allison gives birth in uh during the show? >> 100%. Absolutely. We're ready to be whisked away%. >> Cuz really it could be any minute now. >> Could be any minute. 100%. >> All right. Well, we're waiting for a phone call for you. >> I like everybody looks great. Thanks for dressing up everybody. [Applause]",
    "start_time": 0.06,
    "end_time": 345.92900000000003
}