{
    "video_id": "gsZjk7ZvhNQ",
    "channel_url": "@theellenshow",
    "transcript": "Oh, my knees are killing me. >> I bet you didn't. Was that a last minute decision? >> I don't know what the hell I'm doing. And you got the Dancing with the Stars people here. >> I liked it. You almost put a hole through your pants. That's >> These aren't my pants. This is wardrobe. >> Oh, I say I just came from work. >> You look nice. It looks like uh I like it. >> Oh, you're Well, you're lucky I didn't wear those shoes. I was going to dress like you today. >> Really? Well, you kind of did. Except for the shoes. >> Except for the shoes. >> Yeah, I like it. >> We can switch. >> So, welcome. And uh >> by the way, I just want you to know I love you. I love this show. Thank you. >> I love your old show. >> Thank you. >> And I love you. Stop it. >> And my son loves you. >> My son My son. I have a I have a 17-month old son and we go hiking every day. Um if I don't have to go to work too early and he he got that for you. It's a pine con. >> What's your son's name? >> Uh Oliver. Oliver Gray. Adorable. And then there's this one. >> Now, did he really get this? >> And that's like a necklace. >> I I think I've seen Flavor Flave wear >> and a rock. >> I love your son. And tell your son thank you so much. I really now Seventh Heaven, you were on for how long? How many seasons? >> I did, um, six years straight and then I came back and directed some and, you know, guest starred in a couple and wrote an episode and Yeah. >> Um, this is something that I found out about you today. That's we're, you know, it's breast cancer awareness month. We're talking about that a lot. And you found out you had cancer when you were 28. >> Yeah. I, uh, I had Hodkins disease. I had, uh, you know, it's a form of lymphoma. >> And, uh, I found, how did you find that out? found an hardened lip note on my neck. I was actually uh I was in New York doing some uh press for a a movie I was doing and I was really uh tired uh tired in a way I've never been before. And uh it was St. Patty's Day and um you know I'm Scottish Irish and I like to have a pint, you know, and I didn't feel like going to have one. And so my brother knew something was going on. And then I had uh breakfast with my mom and we just noticed this lump and I went to the doctor and that was it. >> Wow. 28 years old. >> 28 years old. I didn't think it was supposed to happen to people that >> No, no, it never does. Whenever something like that happens, >> yeah, but that that form of cancer, it happens a lot between the ages of uh, you know, 18 and 32 for a lot of males really and women as well, but uh, mainly hits men >> and and so to those people obviously you're healthy, you're fine. >> I am great. >> You went through chemo and everything. >> I went through chemo. I lost my eyebrows, my eyelashes, all my hair. You know what I'm talking about. And I shaved my head and did all that. Um, yeah. >> And so what would you say to people that that are faced with when finding out information like that? >> Uh, well hopefully your doctor has like a family member or a friend to come with you. My doctor forgot to do that. So I was like by myself in the doctor's office when he told me and the first thing I thought was >> of my my parents and my family. But um, >> the only thing I can say to anybody who's uh, you know, find I mean it's it's so common nowadays. everybody knows somebody or or knows somebody that's had it or a relative or whatnot. And uh the one thing I can say is just um don't give into it, you know, just think about fighting it no matter what. You know, I mean, I never considered myself a cancer patient and I learned that from a lot of people that were in the treatment center with me. So, >> attitude has a lot to do with everything >> completely. Then the more people I I I meet a lot of people who, you know, and I feel very grateful that I'm a part of it, but that that from watching either this show or HBO specials or whatever, attribute laughter to a lot of healing. And so that really is important to keep your attitude up and to keep happy. >> Of course. >> And uh and you're you're uh are you now engaged? Is that right? >> I'm engaged to uh my beautiful fiance Tracy Hudson, >> who's on Extreme Makeover. >> Extreme Makeover Home Edition. She's not doing too many right now because of our >> Oh, there she is. Huh? Hi, baby. >> She's not. She can't She can't hear you. >> Oh, >> that's just a picture. >> That's weird. >> Yeah. Um anyway, um so and now do you do you feel like you're lucky because she can do your home? Like you you have great taste and you don't have to do anything? >> Yeah, I I Yeah, I do. Except it's always it's it's always going on. There's always something happening or a new idea. So, uh I'm sure once we get the whole house finished, uh we'll probably sell it and move and start all over again. >> That's how I am. I think that's the fun part is the process. >> Sure. >> So, tell us about the second season of What About Brian? >> Well, it's weird because we only aired five episodes last year, so it's it feels to me like we're just kind of continuing the first season. >> Um, but it's really good. I mean, there's uh some changes, some new characters kind of brought onto the show. Um, but we're we're kind of, you know, taking off six months later from where we left off last year. >> That's great. Well, congratulations. Tell Oliver, \"Thank you so much for all of this.\" And uh I will wear this to the Oscars.",
    "start_time": 0.16,
    "end_time": 281.16
}