{
    "video_id": "h58oSWLCbU4",
    "channel_url": "@theellenshow",
    "transcript": "Hi, Ellen. >> How you doing? >> Great. I love your show. I love you. >> I love you and I love your show. >> Thank you. >> I'm happy to see you and that's cute, too. >> Don't touch me on national television. >> Sorry. >> Won't do it again. Uh, you look fantastic. Thank you. You really look good. Now, I just before we start talking, I have to ask uh uh Johnny. >> Yeah. Yeah. Johnny, >> there's a there you went to a Halloween party and ran into John, right? >> That's right. Last year. Uh >> tell I think we have a photo. Tell the story. >> You do. Well, me and my friend went to a Halloween party last year. We were the Olsson twins. >> Which one is me? >> Uh, well, the guy on the left is uh is Mary Kate and I was Ashley. And you're Uncle Jesse, so it worked out great cuz we ran into you at the party and there you are. >> Now, did you look at that? I mean, can you believe that their lives have turned out like that? >> I know. They owe me actually. They they um they were they you know, you get twins, so you use one if one cries then they, you know, switch them out. They were both, you know, crying like in the pilot. We couldn't get the show done. >> They were six months, I think, and they just wouldn't stop crying. So, I said, \"Get rid of these kids, you know. I got >> I got some serious acting to do on Full House, you know, >> and uh but seriously, they were they were crying the whole time. And so, I then we brought in these these these redheaded kids that were kind of uh what's the word I'm looking ugly redheaded kids. And I hope they're not watching.\" >> Yeah. I'm sure you don't mean that. >> No, I don't. But but they uh they just didn't uh they weren't they didn't work. So I said, \"Okay, bring the Olson twins back and then the rest is history.\" >> Wow. Incredible. >> Yeah. >> Great story. >> So they it is a it is I mean they were almost replaced and look what they became. That's just you know so >> good memories. >> Um so I was saying you look great and how how is uh bachelorhood treating you? >> The whole thing is about bachelors today. Huh? >> It is. >> Yeah. I like it. You know I'm a relationship guy. So it was it's you know it was different to become a bachelor all of a sudden but um >> because how long were you married? >> I was married a long time and then I had you know relationships before that you know I was always kind of in a relationship so and and when you're finished as soon as something ends you go I have to replace that I have to but now I'm at the point where I'm really happy just being a bachelor and I'm you know being alone I'm used to that I enjoy getting home and reading a book and although I went on a date I was just thinking this I had I was in New York and I'm on I'm at the h at the at the uh the hotel and somebody's coming over. We're going to have lunch and a speaker fell on my head. Look, can you see this? >> Oh god. Yeah. >> You see that? >> That's horrible. >> So, I start bleeding, right? And I know she's coming over and I'm like, \"Okay, good. This is going to get some sympathy.\" And then I get a text and she says, \"I'm not going to be there for 30 minutes.\" So, I'm like pushing the bleeding. >> Yeah. >> Yeah. >> Terrible. And the other day I was And when I'm at work, I'm always getting hit on ER. I'm like wet and scratched and stuff. So, I try to leave that makeup on, too, for sympathy. >> I don't think I don't think you need to work on any kind of sympathy. I think you've got a lot going on that people would just be crazy about you, >> but not that you have any time anyway. Those shows take up all of your time, but you know, eventually. Would you do, you know, we have the Bachelor on from The Bachelor. Yeah. Uh would you would you do that? Would you do a a No. No. >> People are always try I don't even need to be on the show. Everywhere I go, people are like trying to fix me up like, \"Oh, you have to go.\" It's the fun game down at er like all the girls that work on they're like how about you and so and so and how about you and so it's like they think you can just call them or something you know not you know >> you can no >> well if they if they know them and if you're in the business or you can run into somebody >> right and my mother is always trying to fix me up >> is she really >> she was she was in God bless you she she she burned her house down and >> how did she do that >> I'm going somewhere with this >> okay >> but but how did she do that >> uh she it was an accident candle or something And so it was it was pretty serious, but she was okay. But she got rushed to the emergency room. So I, you know, immediately ran down there. Now I'm thinking like, you know, okay, I can do some research while I'm here, you know, >> because of ER. And um, but, you know, but once I knew my mom was fine. I was like, oh, you okay, mom? And I'm looking around to see how the doctors are doing this and, you know, how they hold this stuff. And she's, you know, poor thing is was fine, but you know, charred to hell. And she's trying to fix me up with nurses while she's in this hospital. And she, I'm not kidding you. And she finds this one who thinks she thinks really, \"Oh, you have to meet my son.\" And she br she goes, \"Oh.\" And and my mom says, \"Are you are you single?\" She says, \"No, I'm engaged.\" She's like, \"Do you love him? Is he really the one?\" You know? So, uh, but I, you know, it's it's it's it's, you know, Bachelorhood is interesting, but I'm really settled. Like, I felt like before it was like you're starting over, starting over. And I feel right now with my life and the my new job that I love so much, I'm really like I'm I've landed. You know what I mean? Like I'm just here and I'm happy with every day and just excited to see what happens next. >> Well, good. Well, then that's going to be better for you to start a relationship that you're you know that you are in that place instead of just rushing into it. >> Exactly. >> But yeah, but you look good and you seem you seem really happy and healthy. >> Thank you. >> Um All right. So, I want you to explain I don't know where you know in the meetings in the morning I talk to the producers and we go over stuff that you know what's going on with you and things we want to talk about. I someone showed me these pictures and I'd like you to explain there's a picture of you and I think it's Ryan Serest on the beach, right? All right. So, this is explain what's happening here. >> Well, here's the deal. Take that off for a second and I'll do the setup. >> Okay. >> Damn you. I'm I'm I'm I'm in Miami for the It's okay. I'm in Miami for New Year's >> and uh >> and I I'm I'm having an anxiety attack anyway because it's there's so many people around. The f first night I get there, I'm sitting at dinner and I see Lindsay Lohan, her mother and Lindsay's like and then try to fix me up with her mother. So I was like her mother's very pretty but you know. So I I stayed in my hotel room for most of the of the holiday and I was like I have to get out. So I went out and on to the beach and then I saw Ryan, you know, with wine and a bunch of girls and so I went over to say I had him and then, you know, he kind of takes his shirt off and then it was cod. So I kind of took mine and then, you know, but I, you know, pretty much stayed, you know, I tried not to get I thought Brian and I topples on the beach would be, you know, frightening and, you know, and who, you know, I hope they don't get a picture of it type of thing. And um but sure enough like over the sand dune were like 80 photographers like you know peeking over you know >> like a little prairie dog. >> Yeah. Like a prairie dog. And I'm like the road runner like go start running and sand is like flying up behind me. >> Well not before they got another picture of of y'all. >> Oh that is >> what's wrong with that? It's just >> get off. >> It's just you two hanging out. >> Making out. >> Um all right. So let me take a break. we come back. The last time you were here, you talked about uh something you were involved with and you actually changed uh this story is beautiful >> and you changed someone's life as well. >> I'm thrilled that I could even be a tiny part of it, but it's what you do. But anyway, we'll come back and we'll talk about this. This is a beautiful story. We'll be right back. Now, that's tonight's er and you you that's that's hard work, that kind of dialogue to learn every day. You're loving it, though. >> Oh, I love it's literally this is the best job I've ever had in my life. I'm so grateful to be on this show and I've been wanting to We've been trying talking about it for so many years and it just didn't make sense and now it really makes sense and the show is so good. Have you been I mean it's >> it is and it's better now and the reviews are better and if you're not I can't believe it's been on this long and it just keeps getting >> it's still relevant. It's still really smart. The writing is so good. The acting and this year we're running it consecutively 13 episodes so there's no reruns and it's really >> Yay. Yay. >> It's it's it's the best. >> Well, good. Well, congratulations. I'm glad you're happy. It shows and >> you you seem very happy, too. I am very happy. I love the haircut, the little chopper. >> Oh, thank you. Yeah, it was an accident. I thought, \"Oh, I'll just make it better.\" Um Um So, okay, tell this great story. I love this. >> This is a great story. I was on the show. I work for this this uh organization called Project Cuddle, and it's about baby abandonment. And so, if a woman is going to abandon her baby, a girl, or if she's hiding it from her parents or if she needs prenatal care, if she needs help, you know, they call us and we help. And if she's going to get rid of the baby, then we find adoptive parents. So, I was talking about the the the project cuddle on here. Last time I was here, there was a girl who was watching who didn't quite know what to do and knew that she wanted a a father and a mother and she couldn't provide that and a good happy home. So, she saw us on here and she called and we found parents for the baby and she's here today. Little Morgan, >> that baby Leanne and Gary Ays are in the audience. Their adorable baby girl Morgan who they adopted. Congratulations. And Leanne, how long and Gary, how long have you had her now? >> Since she was born. Um, she'll be six months on Friday. >> That's fant and she is absolutely precious. Congratulations. That's amazing that that happened. >> It happened to you. Thank you so much for listen because you had me on here. >> I want to say and and I hope it happens again. If anyone is watching, there are solutions. You don't have to. I mean, there are people that want babies, that can't have babies, that need babies. So, please, if you're watching, Project Cuddle. >> Yeah. Debbie Magnuson. Project Cuddles. >> Okay. >> Beautiful organization. >> And uh so that's great. I'm so happy to hear that that that worked out.",
    "start_time": 0.32,
    "end_time": 557.0799999999999
}