{
    "video_id": "b9kNe5QQo2E",
    "channel_url": "@fallontonight",
    "transcript": "-Paige, welcome back\nto the show. -Thank you for having me. -Thanks for coming back\nto see us. Last time you were a guest\non the show, we all played a game -- you and Hannah and\nme and Patrick Schwarzenegger. We played charades.\n-Yes. -And then I heard that you\nran into Patrick Schwarzenegger. -Okay, so I'm on vacation\nwith my family. I'm in Italy.\n-Tell me. -It was like we were\nat summer camp. We're in this big, like,\ncircle pool, and I just see a guy swim by me,\nPatrick Schwarzenegger. -Hello.\n-And I go, \"Hi. We played charades together,\"\nand, like, he was like, \"Oh, yeah,\nI think I recognize you.\" -That's what you open up with?\n-Yeah, that's how I opened. I wasn't like, \"Hey, Patrick,\nnice to see you again.\" I was like, \"Hi.\nWe played charades.\" -And he's, like, doing laps\nnext to you, yeah. And then did you guys\nend up bonding and hanging out? -We talked a little.\nHe was there for a wedding. He was with his gorgeous wife, and they were having\na great time, so, yeah, it was nice\nto see him. -Yeah. Good.\n-But that's how we're bonded. -Yeah, now you're buds forever.\nYeah. -We both\nbeat Jimmy Fallon at charades. You know, like -- [ Laughter ] We're friends. We can --\nI can say that. -Yeah.\n[ Chuckles ] [ Laughter ] Well, it was nice seeing you.\nPaige DeSorbo, everybody. Good to see you.\nFantastic. Thank you so much.\nWe'll be right back. No, I'm just kidding. No, we have to talk about a lot\nof things that are happening, 'cause you have so much\ngoing on. First of all, you're\na best-selling author now. -Yes, thank you.\n-Congratulations. Paige, I'm excited for you.\n-Thank you. -\"Giggly Squad\" is one of\nthe top podcasts in the country. And you launched\nyour own loungewear. -I did, yes.\n-Talk to me about Daphne. -Okay, so I launched Daphne. I named it after my cat,\nwho's -- She's gorgeous.\nShe has piercing blue eyes. And on our podcast,\nwe had a cat psychic come on. Well, a pet psychic.\n-Okay. -We don't do guests. We only do pet psychics\nfor guests. And you don't know\nif she's telling the truth. -No. You never --\n-You never know. -That's little Daphne. -And so she starts\ntalking to me about Daphne. And the first thing she said was that I let a lot of people\ninto my home and I let a lot of people\nsay hi to her, and she would like\nif I would stop doing that. -That's not true.\nThis is not real. -Because a lot of people smell\nand Daphne is not a fan. -What are you -- This is --\n-Yeah. -So the psychic said\nthat the cat said that she doesn't like to get\nintroduced to too many people. -She was like, \"Too many people\npick me up and they kind of smell,\nand, like, Mom, please stop letting\nthem do that.\" -That is ridiculous.\nThere's no way. -Then the psychic goes,\n\"Oh, she keeps making a motion. She keeps going like this.\nBlah.\" I was like, perfect. And I was like, \"Why?\" And she was like,\n\"Well, she thinks that her cat carrier is cheap. It's cheap.\nIt's tacky. She doesn't like the way\nthat smells either.\" -It's tacky?\n-It's tacky. -The cat says\nthat the thing is tacky. -Yeah,\nthat her carrier is tacky. I just want to let you know,\nit's Louis Vuitton. -What?\n-Yeah. So she needs to chill out. -Yeah, sometimes\nit could get a little tacky. I don't know.\n-Yeah. -I'm just so happy\nto see your success. And now you're about to launch\nyour fall collection... -Yes.\n-...for Daphne today. -Today. -So thank you\nfor coming on our show. -Yeah. -Talk to me about some of the --\nthe fall, and why loungewear,\nby the way, for you? -Okay, loungewear because\nwhen I was on \"Summer House,\" everyone would call me a bedbug\nbecause I was always in the bed. And here's one thing about me. Don't insult me,\n'cause I'll start a business. And so I was like -- -That's funny.\n-I was like -- -\"Don't insult me.\nI will start a business.\" -I will make money from it.\n-Yes. -So I started loungewear, but our number-one product\nis our Hannah Tee, after my co-host, Hannah Berner. -We love Hannah Berner.\n-We love her. And so it's just\nlike your everyday T-shirt. Like, you can do a spray tan\nin it. You can get ready in it. -Now, why did Hannah get a tee? -So Hannah got a T-shirt\nbecause during COVID, Hannah wore the same T-shirt\nevery single day. And I actually started\nto get nervous, and I was like, \"Are you okay?\"\n-Yeah. -And so she was really\nmy inspiration. I actually brought you one, too,\nand I monogrammed yours. -You did?\n-Yes. So yours has your initials\non it. So you can have\na Hannah Tee, as well. -There's my Hannah Tee. -Yeah.\nNavy blue. -I'm looking for the initials. -Oh, right here on the side. -Oh!\n-Right. -Ooh.\nYou got my middle name, too. -Yeah, we had to look that up. -That's right. Whoa! That's what I'm talking about.\n-Yeah. -It's so cozy.\n-It's so cozy. -I love it so much.\n-Yes. -Paige, congrats\non all this stuff. You're the best. Congrats.\n-Thank you. -Paige DeSorbo. The fall collection of Daphne\nis available now. This is soft, too. We'll be right back\nwith a performance from Hayley Williams. Stick around.",
    "start_time": 1.167,
    "end_time": 281.314
}