{
    "video_id": "0O5aUcTFeKM",
    "channel_url": "@mashabearen",
    "transcript": "[Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] Huh. [Music] What a morning. What a morning. La. What? Bear. Is it porridge again? Look, it has lumps in it. No, no, no, no. [Music] Milk skin. Yuck. Soup for breakfast. Ew. [Music] Bear, you know nothing at all about child nutrition. And you made some lumpy porridge. I'll check the neighbors since our neighbors always have something yummy to eat at home. [Music] Not tasty enough. [Music] Not sweet enough. [Music] This is gross. And there's nothing good to eat here. Bye-bye. What a morning. What a morning. All I want is yummy things. [Music] Ew, it's so sour. [Music] Ah, it's so bitter. No. [Music] Tap tap tap tap. This thing is just impossible to eat. [Music] Aha. So you are having lunch. [Applause] [Music] Gotcha. No, not ripe enough. No, that is not even worth trying. Where is my baby girl at? Where could my Rosie be? [Music] It tastes almost like an eraser. [Music] Oh, wow. Let's try this. [Laughter] [Music] Ew, all the eggs are not boiled. I want something yummy. [Music] [Applause] [Music] I bet that you guys must have something yummy hidden somewhere. [Applause] Maybe we need to look around better. I found it. Boys, boys, wait a minute, boys. But it has But it has this thing. Stop. Stop. Hold on. Boys, please. Wait up. Wait up. [Applause] Turn the can over and open it. You see the ring? [Music] [Music] This really looks stale. [Music] My oh my. Oh, poor me. I'm starving. Don't you see? [Applause] Oh, what is that? It smells so yummy. Orange. [Music] Yum, yum, yum, yum, yum, yum. Now that hit the spot. Nice porridge. Yum, yum, yum, yum, yum, yum, yum, yum, yum. [Music] with yummy lumps. [Music] Boys, hello you guys. Ah, you guys are making borch. Do you know how to? You're lucky I know how. I'll show you what to do. All right. What exactly do we have here? Oh, a nice pot. That's great, guys. And what about this? Do you have these? You need to go get all of that. And only then can we make this borch. [Music] [Applause] [Music] Heat. Hey, heat. Hey, heat. [Music] Uh-huh. Okay. [Music] [Applause] Come on. [Music] Where are you? [Music] [Music] [Music] [Applause] [Music] What about this guys? [Applause] No, we can't make it without meat. Fine, I'll ask her. Start boiling it. [Music] Right. [Music] >> Hello, dear bear. We're making borch. Do you have any meat? >> Oh, you're making borch, too? [Music] Let's try and catch Watch it you guys. [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Yeah. [Music] [Music] Oh [Applause] [Music] [Applause] [Music] [Music] I got to feed my baby. I got to feed my baby. I got to feed my baby so my baby will grow big. Aw, you're my pretty little baby. Is my baby's belly feeling full? Did my teeny tiny one grow up a little bit? We are going to double check it now. Bear. Let's check if baby grew up. Bear. Bear. Bear, where are you when I need you? Bear. Oops. But I don't know if my baby grew up. [Music] >> Baby groom. Baby groom. Baby groom. Baby groom. Baby groom. Baby groom. Baby groom. [Music] There. Oops. [Applause] [Music] [Music] We forgot to check if I grew up. [Music] Does this mean that I didn't grow at all? [Music] So that's how it looks. The growing potion. [Music] Oops. [Music] [Applause] Help me. [Music] bear. I grew up a little in here by mistake. You are mean and I do not like you. [Music] >> Go on. You get out of me. [Music] What about me? I need help, too. [Music] Huh? [Music] Bye. [Music] How did you get to be so big? [Music] What is happening to me? [Music] >> Oh, great. I do not like being a grown-up. [Music] Tell me, did I go back down? [Music] And we're going to doublech check it now. Yep. It's great to be small again. So, so, so, where could all of the cartoons be hiding? H, let's start an investigation. Ah, 1 2 3 4 5 6. Let's look for cartoons to pick. I will press this microphone. Masha and the bear. Let's go. That's how easy it is. And now you try it.",
    "start_time": 0.15,
    "end_time": 1191.2
}