{
    "video_id": "epojxFKzZ3k",
    "channel_url": "@mashabearen",
    "transcript": "[Music] [Music] [Applause] [Applause] [Music] [Applause] [Music] Huh? [Music] [Applause] [Music] [Applause] [Music] Huh? [Music] [Music] Huh? [Applause] [Music] Look at that. [Music] [Music] Come on. Huh? [Music] [Music] [Music] Hey, hey, hey. [Music] [Applause] [Music] Yay! [Music] Bye-bye. [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] >> Oh, hey Bunny. Where is bear? [Music] Bunny, you're here instead of bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapie giant number two. [Music] >> Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] >> Oh, Bunny. He had enough fun and flew away. Yes. Yes, >> Bear. Are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Music] [Applause] Wow. [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] there. Look what I found on our doorstep. [Music] >> Oh, wow. >> Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and there have to break out of this egg. And I'll be right back. And right forth and back again. [Music] Where are [Music] [Applause] [Music] And you call this incubating? To incubate you have to be in, not out. We're good at this. [Music] >> Maybe you should play some music. [Music] >> So that's how you become a daddy. We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. >> What? This is for kids. [Music] This is what kids really like to eat. [Music] Oh, yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Fair. He's getting hotter and hotter. You need to be cooled down now. [Music] >> We're just chilling out in here. [Music] That's [Music] contact. Off you go. Huh? >> Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. [Music] Masha's tails. >> Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Because you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a dear and please let me stay in your home.\" And the rabbit was very kind. \"Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty.\" So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can, or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey, crosseyed, why you cry? Well, dog, you see, I had a house made of bark, and the fox's house was all ice and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs the fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me. And I'll sing you a pretty song. And he sang old woman as fast as you can catch a gingerbread man. No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" \"Okay, I'll help you out,\" the wolf told him. \"I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him. Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring. in the house was breaking. They all ran and of course they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? >> I get it. Your mommy got lost somewhere. Hey bear, we need to find their mommy bunny. I think that we should make some posters. [Music] No, not even their own mother would recognize them. [Music] I'm trying. [Music] [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. Attention [Music] children. It's time to play a game. [Applause] [Music] [Applause] [Music] Ow. >> Oh, but how did I end up outside? [Music] >> You're not allowed to misbehave without me. >> Go and wash your paws right now. It's dinner time. [Music] Stop that at once. No attacking the nanny. [Music] Aha. Look, I want you to follow Ros's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded now. It's nap time and no complaints. Honey, [Music] [Music] it's mommy. This isn't me. [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] What? Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. [Music] Oh. [Music] Please enjoy yourself. out there. [Music] Hello. Heat. [Music] Heat. [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear. Hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? [Music] You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, big bad wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and be speedy. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back. cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweeties, little titties, I don't ask any more than you open the door. mother is back with cabbage in her sack. >> He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy, mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and re gobble them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to let a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then mother goat started the fire. It burnt the tail of Big Bad Wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Hello. Hello. [Music] Oh boy. [Music] Oh boy. [Music] Uh-huh. Cool. [Music] Woohoo! They're out away. [Music] [Applause] [Music] Hi. Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place to you. Home sweet home, the place where you belong. [Music] very special together family and friends. Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] Ha. [Music] [Music] Holy [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] [Applause] [Music] Huh? [Music] Huh? [Music] Oh my words. [Music] [Music] Hey, [Music] [Applause] what do you want? Yay! [Music] [Applause] >> Hi, Bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] [Applause] Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] I can't. [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny. He had enough fun and flew away. Yes. Yes. Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] [Music] Wow. [Applause] Wow. [Music] [Applause] [Music] H. Who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. and right forth and back again. [Music] [Applause] [Music] [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat [Music] bear. He's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] >> Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's tails. >> Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home, and the rabbit was very kind.\" \"Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty.\" So the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cran? Well dog, you see I had a house made of bark and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away and I let her stay at my house and she threw me out. Don't you worry, Long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs a fur. The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey, old woman. Hen, run as fast as you can. Catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out. Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him. Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zill. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. Attention [Music] children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] >> Stop that at one. No attacking the nanny. Aha. Look, I want you to follow Rosy's example. Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded now. It's nap time and no complaints. [Music] [Music] Stop me. [Music] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] >> That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] Let's move. Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. [Music] Heat. Heat. [Music] May for Woohoo! [Music] Never [Music] heat. Heat. [Music] Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear, hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? H. You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and be speedy. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little titties. I don't ask any more than you open the door. Mother is back with cabbage in her sack. He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of Mother Goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No, with cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. and his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and regleb them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to light a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then mother goat started the fire. It burnt the tail of Big Bad Wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother Goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Hello. [Music] Hello. Over. [Music] Over. [Music] Uh-huh. Cool. [Music] Huh? Woo! Clear out the way. [Music] Wow, that's [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you even if you've traled far and long [Music] you will find your way back to the place to you for the place where you belong. [Music] I special come together family and friends. Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] [Music] [Music] [Applause] out. [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] [Applause] Huh? [Music] [Music] Mhm. [Music] [Music] going. [Music] Hey. Hey. [Music] [Applause] [Music] Yep. [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] >> Oh, hey Bunny. Where is bear? [Music] >> Bunny. You're here instead of bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] So be giant number two. [Music] >> Bunny, hold on. That one didn't count. Attack number three. [Music] [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] There's only [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny. He had enough fun and flew away. Yes. Yes. [Laughter] >> Bear, are you sure this will make a giant one? [Music] And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Music] [Applause] [Music] [Applause] Heat. [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] >> Bear, look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and there have to break out of this egg. And I'll be right back. And right forth and back again. Wow. [Music] Wow. [Music] [Applause] [Music] [Music] And you call this incubating. To incubate, you have to be in, not out. We're good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] He is getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a dear and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny. It was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can, or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cran? Well, dog, you see, I had a house made of bark and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there, all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs a fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Ha woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of ice and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zill. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at once. No attacking the nanny. Aha. Look, I want you to follow Ros's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded. Now it's nap time and no complaints. [Music] [Music] Honey, it's funny. [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. Here, [Music] >> that is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] Let's go. Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. H. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. [Music] Ow. Ah. [Music] What? [Music] You I love you. [Music] You're never [Music] Heat. [Music] Heat. [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] >> Rosie, dear. Hello, my little baby. Please come home. Did you see my pretty Rosie anywhere here? H. You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? What big ears do you have? Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweeties. Open the door and bey. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. We need to sing the song about cabbage. Listen, sweeties, little kitties. I don't ask anymore. When he opened the door, mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big bad wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, >> \"Listen, sweeties, little titties. I don't ask any more than you open the door. Mother is back with cabbage in her sack. He pretended to be their mother. But his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then he opened the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right, and he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time, he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big bad wolf. His voice was very high and very scary. And he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start puffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof. His knees were scraped, his fur covered with burs, but he still crawled up there. Well, he got up there all right, but he couldn't get in. His belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and re gobble them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to light a match. It was mother goat. She'd come back home and started to heat the oven to cook the cabbage. While big bad wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlestless kid he shouldn't have gone into the oven. Then mother goat started the fire. It burnt the tail of big bad wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] Hello. [Applause] Heat. [Music] [Applause] [Music] Hey, [Music] Oh no. [Music] Oh boy. [Music] Oh boy. [Music] Uh-huh. Cool. [Music] Yep. [Music] Woohoo! Clear out the way. [Music] Huh? [Music] What? [Music] [Applause] Wow. What's wrong? [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place you knew. Home sweet home. A place where you belong [Music] together and friends. Let's enjoy the best of celebration. Having fun that never ever ends. >> Having fun that never ever ends. [Music] Ha. [Music] [Music] Oh my god. [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] [Applause] [Music] Huh? [Music] Look at that. [Music] [Music] [Music] Hey, hey, hey. [Music] [Applause] [Music] Yay! [Music] Okay. [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] >> Oh, hey Bunny. Where is bear? [Music] Bunny, you're here instead of bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] So bey giant number two. [Music] [Applause] >> Bunny, hold on. That one didn't count. Attack number three. [Music] [Applause] Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] [Music] [Applause] [Music] Nice [Music] [Music] bear. There. All my bubbles are gone now. [Music] >> Oh, Bunny. He had enough fun and flew away. Yes. Yes. Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Music] [Applause] Wow. [Music] H. Hey, who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back and right forth. And back again. [Music] [Applause] [Music] [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's tails. >> Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home?\" And the rabbit was very kind. \"Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny it was laughable. So, the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cran? Well dog, you see I had a house made of bark and the fox's house was all ice and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there, all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grab a fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zill. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran and of course they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at. No attacking the nanny. [Music] Aha. Look, I want you to follow Rosy's example. Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded. Now it's nap time and no complaints. [Music] Honey, [Music] nanny, swim. [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. >> That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] What I'm Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Let's [Music] go. [Music] Get up with Okay. [Music] Okay. [Music] Never [Music] heat. Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] >> Rosie, dear. Hello, my little baby. Please come home. Did you see my pretty Rosie anywhere here? H. You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? [Applause] What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and be spitty. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big bad wolf was a real baddie. It's really not nice to listen at the door. So, as soon as mother goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little titties. I don't ask any more than you open the door. Mother is back with cabbage in her sack. He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. and his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and regleb them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to light a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of Big Bad Wolf. and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So, if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Hello. [Music] Hello. Over. [Music] Over. [Music] Uh-huh. Cool. [Music] Welcome. Boo! Clear out the way. [Music] [Applause] Wow. [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their neck. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place to you. Home for the place where you belong. [Music] very special together family and friends. Let's enjoy the best of celebrating. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] Oh yeah. Huh? [Music] [Music] [Applause] [Music] [Applause] [Music] Heat. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] [Applause] [Music] Huh? [Music] work. [Music] Aha. [Music] [Music] Hey. Hey. [Music] [Applause] What do you want? Yay! [Music] [Applause] >> Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. >> Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] There's only [Music] [Applause] [Music] huh. [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. [Laughter] Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] [Music] Wow. [Applause] Wow. [Music] [Applause] [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and there have to break out of this egg. And I'll be right back. And right forth and back again. [Music] [Applause] [Music] [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] He is getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tails. >> Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a dear and please let me stay in your home?\" And the rabbit was very kind. \"Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny, it was laughable. So, the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cran? Well dog, you see I had a house made of bark and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there, all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs a fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. This is big enough for two and you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house and she threw me out. \"Okay, I'll help you out,\" the wolf told him. \"I'll sort it out. Let's go get her.\" Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him. \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here.\" The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So they came to the rabbit's house and it was full of all sorts of animals just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran and of course they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. or you'll see. [Music] >> Attention children, it's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] >> Stop that at one. No attacking the nanny. [Music] Aha. Look, I want you to follow Ros's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] That's it, bunnies. You are all grounded now. It's nap time and no complaints. [Music] [Music] me. This isn't [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] Heat. Heat. [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. >> That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] I'm Robert. Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Let's [Music] go. [Music] Maybe by yourself. It's all out there. [Music] Nothing. [Music] Heat. [Music] Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear. Hello my little baby. Please come home. Did you see my pretty Rosie? Any anywhere here. [Music] You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. >> Nah, my baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? >> What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother, and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet and don't open the door for anyone. Even if they say it's the police or that it's the maintenance guy, you can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and bey. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. We need to sing the song about cabbage. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. there. Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweeties, little titties, I don't ask any more than you open the door. Mother is back with cabbage in her sack. >> He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy, mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and re gobble them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to let a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of Big Bad Wolf. and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So, if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Hello. Hello. [Music] Oh boy. [Music] Oh boy. [Music] Uh-huh. Cool. [Music] Welcome. Boo! Clear out the way. [Music] Wow. [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind the nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place you knew. Home sweet home, the place where you belong. [Music] I special together family and friends. Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] What are [Music] [Music] Oh, [Music] [Applause] [Music] heat. [Music] [Applause] [Music] [Applause] [Music] [Applause] Huh? [Music] Hey. [Applause] [Music] Oh no. [Music] [Music] [Music] Hey, Wow. [Music] [Applause] [Music] Yay. [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] [Applause] Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] I can't. [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. between >> bear. Are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. Wow. [Music] [Applause] Wow. [Music] H. Who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. and right forth and back again. [Music] [Applause] [Music] [Music] And you call this incubating? To incubate you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long. His eyes were too crossed. And his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cry? Well, dog, you see, I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grab the fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you, crosseyed, get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house and it was full of all sorts of animals just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? >> I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at one. No attacking the nanny. [Music] Aha. Look, I want you to follow Rosy's example. Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded. Now it's nap time and no complaints. [Music] [Music] What is my name? Hey, nanny. [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. Here, [Music] >> that is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] Uh-huh. [Music] Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Let's [Music] go. [Music] I get a for yourself. [Music] You never [Music] heat. Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear, hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? [Music] You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? [Applause] What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and be spitty. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen sweeties, little kitties. I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little titties. I don't ask any more than you open the door. Mother is back with cabbage in her sack. He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No, with cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. and his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and regleb them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to light a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of big bad wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Oh no. Over. [Music] Uh-huh. Cool. [Music] Huh? Woo! Clear out the way. [Music] [Applause] [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traled far and long, you will find your way back to the place to you. Home sweet home, the place where you belong. [Music] very special together family and friends. Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] Ha. [Music] [Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] Huh? [Music] Honestly, [Applause] [Music] freaky. Yeah. [Music] Oh, nice. [Music] [Music] Hey, [Music] [Applause] you want Yay! [Music] [Applause] >> Hi, Bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. >> Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] [Applause] Bunny, hold on. That one didn't count. Attack number three. [Music] [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] [Music] [Applause] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. [Music] Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Applause] Wow. [Music] H. Who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. and right forth and back again. [Music] [Applause] [Music] [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long. His eyes were too crossed. And his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you crying? Well, dog, you see, I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just scraps the fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you, crosseyed, get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh. [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at light. No attacking the nanny. Aha. Look, I want you to follow Rosy's example. Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded. Now it's nap time and no complaints. [Music] Honey, [Music] nanny. This isn't [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. Here, [Music] >> that is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] Let's move. Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. H. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Let's [Music] go. [Music] Did you watch me for yourself? [Music] Woohoo! Heat! Heat. [Music] Heat. Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear, hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? [Music] You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and be spitty. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little titties. I don't ask any more than you open the door. mother is back with cabbage in her sack. He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy, mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. and his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and regleb them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to light a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of Big Bad Wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother Goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] Hello. Hello. Over. [Music] Open. [Music] Uh-huh. Cool. [Music] Look at Boo! Clear out the way. [Music] Heat. Heat. [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day When they spread their wings and leave behind their nest [Music] from their homes, like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place you found the place where you belong. [Music] Are you special together and friends? Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] What are you Heat. [Music] [Music] Heat. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] [Music] [Applause] [Music] Yeah. [Music] Oh my words. [Music] [Music] Hey. Hey. [Music] [Applause] What do you want? Yay! [Music] [Applause] >> Hi there. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. >> Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] There's only [Music] [Applause] [Music] nice [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny. He had enough fun and flew away. Yes. Yes. [Laughter] Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Applause] Wow. [Music] [Applause] [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. and right forth and back again. [Music] Oh, [Music] [Applause] [Music] haha. [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he is getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. They'll come visit us. [Music] Bear, look what else I found on our doorstep. [Music] Masha's tails. >> Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a dear? And please let me stay in your home.\" And the rabbit was very kind. \"Of course, my dear fox, you're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty.\" So the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you crun? Well dog, you see I had a house made of bark and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away and I let her stay at my house and she threw me out. Don't you worry, Long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs the fur. The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me. and I'll sing you a pretty song. And he sang, \"Ha woman, hen, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here.\" The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zill. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. It got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house out just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] No, not even their own mother would recognize them. down. [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. Attention [Music] children. It's time to play a game. [Applause] [Music] [Applause] [Music] >> Wow. Ow. >> Oh, but how did I end up outside? [Music] >> You're not allowed to misbehave without me. >> Go and wash your paws right now. It's dinner time. [Music] Stop that at once. No attacking the nanny. Aha. Look, I want you to follow Ros's example. Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded now. It's nap time and no complaints. [Music] [Music] is only mommy. [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] What? Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Please. [Music] Hey, please enjoy yourself. Sh. [Music] Hey. You never [Music] heat. [Music] It's [Applause] [Music] [Applause] [Music] good. [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear. Hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? [Music] You'll want this for sure. You'll run to your mommy now. [Music] >> You're Rosie. Nah, my baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? [Applause] What big ears you have. Can you tell me why they are like that? What a big nose you have. Tell me why is it like that? It is because you never listen to your mommy. >> So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet and don't open the door for anyone. Even if they say it's the police or that it's the maintenance guy, you can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie, open the door and bey. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen sweeties, little kitties. I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. there. Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little titties, I don't ask any more than you open the door. Mother is back with cabbage in her sack. >> He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy, mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right, and he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time, he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and re gobble them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to let a mash. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then mother goat started the fire. It burnt the tail of Big Bad Wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] Hello. Hello. Over. [Music] What? [Music] Uh-huh. Cool. [Music] Woohoo! [Music] Woo! Boo! Clear out the way. [Music] [Applause] Wow. [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day When they spread their wings and leave behind their nest [Music] from their homes, like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, you will find your way back to the place to you. Home sweet home, the place where you belong. [Music] What is very special [Music] together and friends? Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] Ha. Holy [Music] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] [Applause] [Music] Yeah. [Music] Oh my words. [Music] [Music] Hey, [Music] [Applause] you want Yay! [Music] [Applause] >> Hi, Bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. >> Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] [Applause] Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] I can't [Music] [Applause] [Music] huh. [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. Wow. [Music] [Applause] Wow. [Music] [Applause] [Music] H. Hey, who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. And right forth and back again. [Music] [Applause] [Music] [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long. His eyes were too crossed. And his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you crying? Well, dog, you see, I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grab the fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you, crosseyed, get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house and it was full of all sorts of animals just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. >> Go and wash your paws right now. It's dinner time. [Music] Stop that at no attacking the nanny. Aha. Look, I want you to follow Rosy's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] That's it, bunnies. You are all grounded. >> Now it's nap time and no complaints. [Music] [Music] anything. This isn't [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] Huh? [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. >> That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What [Music] [Applause] [Music] are [Music] you? Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Let's [Music] go. [Music] May for [Music] You never [Music] heat. Heat. Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear, hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? H. You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? [Applause] What big ears you have. Can you tell me why they are like that? >> What a big It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave, be nice to each other, and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale, I'll tell you their scary story, >> the wolf and the seven young kids. Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother, and the wolf listened to no one. That's why he grew to be an angry, ill-mannered group. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet and don't open the door for anyone. Even if they say it's the police or that it's the maintenance guy, you can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and bey. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. We need to sing the song about cabbage. Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. there. Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little treaties. I don't ask any more than you open the door. Mother is back with cabbage in her sack. >> He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, then come back up and re gobble them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to let a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of Big Bad Wolf. and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So, if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] Damn it. [Applause] [Music] Oh no. Over. [Music] What? [Music] Uh-huh. Cool. [Music] Woohoo! They're out away. [Music] [Applause] [Music] Daddy. Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place to you. Home sweet home, the place where you belong. [Music] is very special together. Family and friends. Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] Where are we? [Music] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] assist. [Music] [Applause] [Music] [Applause] Huh? [Music] Huh? [Applause] Huh? [Music] Look at [Music] it. [Music] Oh my god. [Music] [Music] Huh? [Music] Hey, hey, hey. [Music] [Applause] [Music] Yay! [Music] Hi! [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] >> Oh, hey Bunny. Where is bear? [Music] Bunny, you're here instead of bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] So bey giant number two. [Music] [Applause] >> Bunny, hold on. That one didn't count. Attempt number three. [Applause] Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] >> Oh, Bunny, he had enough fun and flew away. Yes. Yes, >> Bear. Are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Music] [Applause] Wow. [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] Bear, look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. Uh-uh. Uh-uh. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. And right forth and back again. Wow. [Music] Woohoo. [Music] [Applause] [Music] [Music] And you call this incubating To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long. His eyes were too crossed. And his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you will regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cry? Well, dog, you see, I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs a fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you, crosseyed, get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh. [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at one. No attacking the nanny. [Music] Aha. Look, I want you to follow Rosy's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded now. It's nap time and no complaints. [Music] [Music] is going to be in. This isn't [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] What? Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Heat. Heat. [Music] Did you watch Spider out there. [Music] Nothing. [Music] Heat. [Music] Heat. [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear, hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? H. You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah, my baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? [Applause] What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and be spitty. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweeties, little kitties, I don't ask any more than you open the door. Mother is back with cabbage in her sack. He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy, mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and regleb them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to let a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of big bad wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Oh no. Over. [Music] Oh boy. [Music] Uh-huh. Cool. [Music] Welcome. Boo! Clear out the way. [Music] [Applause] [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind the nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place to you. Once we found the place where you belong [Music] together and friends, let's enjoy the best Celebrating. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] What are you doing? [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] assist. [Music] [Applause] [Music] [Applause] [Music] [Music] Hey. [Applause] [Music] I can't do it. [Music] Oh, nice. [Music] [Music] Hey, Hey, [Music] [Applause] [Music] yay. [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] >> Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] I can't. [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. [Laughter] Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] [Music] Wow. [Applause] Wow. [Music] [Applause] [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. and right forth and back again. [Music] Oh, [Music] [Applause] [Music] haha. [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. No, kids don't like this kind of food. >> What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. He'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a dear and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny. It was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cran? Well dog, you see I had a house made of bark and the fox's house was all ice and sparkly. When the spring came, the fox's house melted away and I let her stay at my house and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grab the fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you, crosseyed, get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf, dear, please don't eat me. And I'll sing you a pretty song. And he sang, \"Hey, old woman. Hey, old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house and she threw me out. Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him. Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So they came to the rabbit's house and it was full of all sorts of animals just like a zill. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] >> Stop that at once. No attacking the nanny. [Music] Aha. Look, I want you to follow Ros's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] That's it, bunnies. You are all grounded now. It's nap time and no complaints. [Music] [Music] is only [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. That is where she is. One little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] I'm Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Green. [Music] by yourself. out there. [Music] Woohoo! [Music] Huh? Heat. [Music] Heat. [Music] It's [Music] [Applause] [Music] [Applause] [Music] hot. [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear. Hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? H. You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah, my baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? What big ears you have. Can you tell me why they are like that? What a big nose you have. Tell me why is it like that? It is because you never listen to your mommy. >> So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet and don't open the door for anyone. Even if they say it's the police or that it's the maintenance guy, you can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and bey. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. We need to sing the song about cabbage. Listen sweeties, little kitties. I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. there. Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweeties, little titties, I don't ask any more than you open the door. Mother is back with cabbage in her sack. >> He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy, mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right and he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, then come back up and re gobble them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to let a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then mother goat started the fire. It burnt the tail of Big Bad Wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Oh no. Hey Oh boy. [Music] Oh boy. [Music] Uh-huh. Cool. [Music] Huh? Look, clear out the way. [Music] Children know that their parents parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their nest. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place you knew. Home sweet home, the place where you belong. [Music] I special together family and friends. Let's enjoy the best of celebration. Having fun that never ever ends. >> Having fun that never ever ends. [Music] [Music] [Music] [Applause] [Music] [Applause] [Music] Assistant [Music] [Applause] [Music] [Applause] [Music] [Applause] Huh? [Music] Hey. [Applause] [Music] Get yourself. [Music] Oh, nice. [Music] [Music] Hey, Hey, [Music] [Applause] [Music] yay. [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] [Applause] >> Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] I can't [Music] [Applause] [Music] fire. [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. >> Yes. Yes. Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Music] [Applause] [Music] Woo! [Music] [Applause] [Music] H! Who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. And right forth and back again. [Music] [Applause] [Music] [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. No, kids don't like this kind of food. >> What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's tails. >> Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home?\" And the rabbit was very kind. \"Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty.\" So, the fox stayed at the rabbit's house and dried it off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cran? Well dog, you see I had a house made of bark and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there, all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grab a fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf, dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. >> Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at light. No attacking the nanny. [Music] Aha. Look, I want you to follow Rosy's example. Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded. Now it's nap time and no complaints. [Music] [Music] What is going on? Hey, nanny. This isn't [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. >> That is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] Uh-oh. [Music] Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Let's [Music] go. [Music] May for [Music] Woohoo! [Music] Never [Music] heat. Heat. [Music] Heat. [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear, hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? [Music] You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? [Applause] What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother, and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweetie. Open the door and be spitty. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little titties. I don't ask any more than you open the door. Mother is back with cabbage in her sack. He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of mother goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start puffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. and his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and regleb them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to light a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of big bad wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] Hello. Hello. Over. [Music] Over. [Music] Uh-huh. Cool. [Music] Look at Boo! Clear out the way. [Music] [Applause] Heat. Heat. [Music] Hi. Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their neck. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, [Music] even if you've traveled far and long, [Music] you will find your way back to the place you found the place where you belong. [Music] Are you special [Music] together family and friends? Let's enjoy the best of celebration. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] What do you [Music] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] [Applause] [Music] Look [Music] I can't [Music] work. [Music] [Music] [Music] Hey. Hey. [Music] [Applause] What do you want? Yay! [Music] [Applause] >> Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. >> Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] Bunny, hold on. That one didn't count. Attack number three. [Applause] >> Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] There's only [Music] [Applause] [Music] nice [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Applause] Wow. [Music] [Applause] [Music] H. Who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and there have to break out of this egg. And I'll be right back. And right forth and back again. [Music] Huh? [Applause] Huh? [Music] [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No kids don't eat this kind of food. No, kids don't like this kind of food. >> What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear. He is getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a dear and please let me stay in your home?\" And the rabbit was very kind. \"Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried it off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cry? Well dog, you see I had a house made of bark and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there, all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs a fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you crosseyed. Get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Ha woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house and it was full of all sorts of animals just like a zill. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house down just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey Bear, we need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D [Music] down. [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at once. No attacking the nanny. Aha. Look, I want you to follow Ros's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] >> That's it, bunnies. You are all grounded. Now it's nap time and no complaints. [Music] [Music] Honey, it's funny. [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. Here, [Music] >> that is where she is. My little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] Let's go. Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. H. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Let's [Music] go. [Music] for Heat. Heat. [Music] Hey, hey, hey. Heat. [Music] Heat. [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] >> Rosie, dear. Hello, my little baby. Please come home. Did you see my pretty Rosie anywhere here? H. You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah, my baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? What big ears you have. Can you tell me why they are like that? >> What a big nose you have. Tell me why is it like that? >> It is because you never listen to your mommy. So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation. Like the seven young kids from a fairy tale. I'll tell you their scary story. >> The wolf and the seven young kids. >> Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother and the wolf listened to no one. That's why he grew to be an angry, ill-mannered brute. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet. And don't open the door for anyone, even if they say it's the police or that it's the maintenance guy. You can open the door only if you hear the following song.\" Little kitties, listen to me, sweeties. Open the door and bey. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. We need to sing the song about cabbage. Listen, sweeties, little kitties. I don't ask anymore. When he opened the door, mother is back with cabbage in her sack. There, Big Bad Wolf listened at the door and heard this song. Big bad wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, >> \"Listen, sweeties, little titties. I don't ask any more than you open the door. Mother is back with cabbage in her sack. He pretended to be their mother. But his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of Mother Goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right, and he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time, he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big bad wolf. His voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney and he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly.\" He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. and his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and re gobble them all up again.\" Big bad wolf was crawling down the chimney, barely making it. Then he heard someone down there trying to light a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlestless kid he shouldn't have gone into the oven. Then Mother Goat started the fire. It burnt the tail of Big Bad Wolf. and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So, if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] Hello. Hello. [Music] Oh boy. [Music] Oh boy. [Music] Uh-huh. Cool. [Music] Oh [Music] Woo! Clear out the way. [Music] Hello. Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind the nest [Music] from their homes. Like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place to you. Once we found the place where you belong [Music] together, family and friends, let's enjoy the rest Celebration. Having fun that never ever ends. >> Having fun that never ever ends. [Music] [Music] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] Huh? [Music] [Applause] Ah, [Music] Look at that. [Music] Oh no. [Music] [Music] [Music] Hey, Woohoo! [Music] [Applause] [Music] Yay! [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] >> Funny. Hold on. That one didn't count. Attempt number three. [Applause] Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] I can't go. [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Applause] Wow. [Music] [Applause] [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and Bear have to break out of this egg. And I'll be right back. and right forth and back again. [Music] Oh, [Music] [Applause] [Music] hey. [Music] And you call this incubating? To incubate, you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No, kids don't eat this kind of food. >> No, kids don't like this kind of food. What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he's getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. You'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. Like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a dear and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox. You're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long, his eyes were too crossed, and his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can, or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it.\" The rabbit was walking down the road crying when he met the dog. Hey, crosseyed. Why you crying? Well, dog, you see, I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just grabs the fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you, crosseyed, get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, \"Hey old woman, hey old man, run as fast as you can catch a gingerbread man.\" No, I don't think that's the right song. Oh, like this. And the rabbit tells him, \"I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house, and she threw me out.\" Okay, I'll help you out, the wolf told him. I'll sort it out. Let's go get her. Just when the wolf was ready to kick the fox out, she saw him through the window and shouted to him, \"Look who came to live with us. Great. This house is big enough for three. Why did you have to drag this terrible rabbit with you? Kick him out of here. The rabbit was walking down the road crying and met the bear. Rabbit, why are you crying? Well, dear bear, you see, I had a house of lights and sparkling. The fox's house was made of bark. Oh, no. It was the other way around. Well, it doesn't matter. In the end, the fox threw me out of my house. Let's go. I'll show you. So, they came to the rabbit's house, and it was full of all sorts of animals, just like a zoo. There was a mouse in the house and a frog who could croak. The house was full. It even had a bull and an elephant. All kinds of creatures. They barely all fit in there. And then the bear had an idea and started roaring. What a wonderful house this is. I want to live in here, too. He tried with all his might to get inside like a bulldozer that can't be stopped. Then it got very noisy. The very small ones were squealing. The very big ones were roaring and the house was breaking. They all ran. And of course, they brought the house out just like that. They almost crushed each other to pieces in there. That's what I'm telling you. If you're friends with all sorts of weirdos, then build yourself a house that's very big and very strong. [Music] >> Hold on, little buddy friends. Masha and Bear are rushing to your rescue. [Music] Oh, you guys are just the fluffiest. Oh, you're so cute. And look at those ears. [Music] But where is your mommy bunny? I get it. Your mommy got lost somewhere. Hey, bear. We need to find their mommy bunny. I think that we should make some posters. [Music] >> No, not even their own mother would recognize them. D. [Music] [Music] Huh? [Music] [Music] Okay, all the posters are ready now. Okay, bear. Here you go. Can you put them up everywhere? I'll look after these cuties. I am the best nanny ever. You'll see. [Music] >> Attention children. It's time to play a game. [Applause] [Music] [Applause] [Music] Wa! Ow! Oh, but how did I end up outside? [Music] You're not allowed to misbehave without me. Go and wash your paws right now. It's dinner time. [Music] Stop that at once. No attacking the nanny. [Music] Aha. Look, I want you to follow Ros's example. [Music] Sit here quietly for me. I'll go and get your food and then be right back. [Music] That's it, bunnies. You are all grounded. Now it's nap time and no complaints. [Music] [Music] me. This isn't me. [Music] [Applause] [Applause] Wow, that's awesome. Look, aren't my little darlings so talented? [Music] [Music] [Music] Hooray! We found Mommy Bunny. All thanks to my poster. [Music] Come back and visit sometime and we'll do some more drumming. [Music] Oh, hey there guys. >> Wait, hold on. Are you lost, too? [Music] Rosie dear, where are you? Come eat your breakfast. [Music] Wake up. That is where she is. One little baby. [Music] Oh, you are so squeaky clean and you are so pretty cute. Oh, you are my royal queenly princess. [Music] What? [Music] [Applause] [Music] What? Wa! Rosie dear, just look who was left on our doorstep. A, you are my favorite. You are adorable, twin babies. My new babies are woofing everything down. What an appetite they have. And where is my Rosie? [Music] H what happened to my oldest? Where did she go to? I will go look for her tomorrow. Green. [Music] by yourself. out there. [Music] Heat. Heat. [Music] Heat. Heat. [Music] Heat. [Music] [Applause] [Music] [Applause] [Music] Something must have happened to my little Rosie. You stay here and play. I'll have to run some errands. [Music] Rosie dear, hello my little baby. Please come home. Did you see my pretty Rosie anywhere here? [Music] You'll want this for sure. You'll run to your mommy now. [Music] You're Rosie. Nah. My baby has ears like little bows and a little snout nose. And you have what? How can you prove that you're my baby? What big ears you have. Can you tell me why they are like that? What a big nose you have. Tell me why is it like that. >> It is because you never listen to your mommy. >> So go now and think about why you behaved like such a pig. It's hard to be a parent. [Music] Listen, I have to leave you now, my darling toy friends. I'll be back by lunchtime. While I'm out, please don't misbehave. Be nice to each other and don't open the doors for strangers. Then nothing very scary will happen to you, and you won't end up in bad situation like the seven young kids from a fairy tale. I'll tell you their scary story, >> the wolf and the seven young kids. Once upon a time, Big Bad Wolf was living next to the seven young kids. The kids listened to their mother, and the wolf listened to no one. That's why he grew to be an angry, ill-mannered group. So then one day, the mother of the kitties went to a store to buy some milk. No, not milk. Well, anyway, she had to go to the store to buy something. Maybe it was cabbage. Before going to the store, Mother Goat told her seven young kids, \"Stay inside and be quiet and don't open the door for anyone. Even if they say it's the police or that it's the maintenance guy, you can open the door only if you hear the following song.\" Little kitties, sweetie, open. No, no, that's wrong. Here's the right one. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk in her sack. She went to get some cabbage. You need to sing the song about cabbage. Listen, sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with cabbage in her sack. there. Big Bad Wolf listened at the door and heard this song. Big Bad Wolf was a real baddie. It's really not nice to listen at the door. So, as soon as Mother Goat left, Big Bad Wolf ran up and started to pound the door and he sang, \"Listen, sweetest little titties. I don't ask any more than you open the door. mother is back with cabbage in her sack. >> He pretended to be their mother, but his voice roared like a motor. So then the seven young kids spoke up and told Big Bad Wolf, \"Go away. You're not our mother. Our mother left to get some cabbage.\" And they didn't open the door. Big Bad Wolf really wanted to gobble up the seven young kids. And this is what he came up with. He went to the blacksmith and asked him to make his voice really high, as high as the voice of Mother Goat. So the blacksmith took out a huge sledgehammer. And then he used that sledgehammer to make big bad wolf a voice that was really high and whiny. So now Big Bad Wolf could bleed as well as a goat. So he ran up again to the house with the seven young kids and started singing. >> Listen sweeties, little kitties, I don't ask anymore. Then you open the door. Mother is back with some milk. No. With cabbage in her sack. The silly seven young kids got so happy they started screaming, \"Mommy! Mommy came back.\" And then they opened the door. Only the seventh little kid, the smallest one of all, felt that something was not right. And he hid in the oven. Big bad wolf ran into the house and gobbled up all the six little kids one by one. And he didn't even have a problem swallowing them. And the entire time he kept looking around and searching for the seventh little kid, but he couldn't see him anywhere. Then he heard someone sneezing in the oven. Ah! He screamed. That's where you hid from me. Just you wait a second. I will get you too. Big Bad Wolf's voice was very high and very scary, and he was shaking with rage, his teeth shattering away. But he still couldn't reach the little kid. That's when Big Bad Wolf decided to start huffing and puffing to break down the oven. He huffed and puffed and only got dirt to come out of the oven. He huffed and puffed again and the wind made noise in the chimney. Then Big Bad Wolf ran out of the house. He ran in and huffed and puffed hard. In fact, he huffed and puffed so hard that he got all red. Big bad wolf was huffing and puffing, but the oven felt nothing. It was kind of like an elephant bitten by a small mosquito. He couldn't huff and puff it away. The oven was made of bricks. Then Big Bad Wolf thought, \"I'll get to the tiny kid through the chimney.\" And he started climbing up to the roof. It wasn't easy to climb up the roof with a full belly. He fell down twice. His knees were scraped, his fur covered with burrs. But he still crawled up there. Well, he got up there all right, but he couldn't get in. and his belly full of the young kids got in his way. Then he got all the young kids out of his belly, put them down on the roof, and said, \"Don't make any noise, and if you don't behave, I'll come back and eat you.\" And then he thought, \"I'll get to the littlest kid, eat him, and come back up and regleb them all up again.\" Big bad wolf was crawling down the chimney, barely making it, and he got all dirty from soot. Then he heard someone down there trying to light a match. It was Mother Goat. She'd come back home and started to heat the oven to cook the cabbage. While Big Bad Wolf was going through the chimney, she had time to come back with the cabbage to sing the proper song to get her young kids down from the roof and to tell the littlest kid he shouldn't have gone into the oven. Then mother goat started the fire. It burnt the tail of Big Bad Wolf and he started screaming, \"What are you doing to me? It hurts.\" He barely made it out of the chimney and ran into the forest to nurse his wounded tail. Mother Goat was surprised because she couldn't understand how Big Bad Wolf had ended up in her oven. Then the seven young kids told her the whole story. And that's the story of what happened to them. Oops, I forgot all about the time. Now I'll be late. So if you want to eat cabbage again, don't open the door to dangerous strangers. [Music] [Applause] [Music] [Applause] [Music] Huh? [Music] Oh no. Over. [Music] Over. [Music] Uh-huh. Cool. [Music] Welcome. Boo! Clear out the way. [Music] [Applause] [Music] Children know that their parents wish them very best. But when kids grow up, then comes a day when they spread their wings and leave behind their neck. [Music] From their homes like birds, they fly away. [Music] But no matter where winding roads have taken you, even if you've traveled far and long, [Music] you will find your way back to the place to you. Once we found the place where you belong [Music] together, family and friends, let's enjoy the best Celebrating. [Music] Having fun that never ever ends. >> Having fun that never ever ends. [Music] What are we doing? [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Music] Hey, [Applause] Huh? [Music] I got it. I'm not [Music] [Music] [Music] Hey. Hey. Yes, [Music] [Applause] [Music] [Applause] [Music] bye-bye. [Music] [Applause] Hi bear. Look at the bubbles I'm going to make with this. [Applause] [Music] [Applause] Oh, hey Bunny. Where is Bear? [Music] Bunny, you're here instead of Bear. Well, then you're in luck. Check out the bubbles that are coming now. [Music] And now a soapy giant. [Music] [Applause] Soapy giant number two. [Music] >> Bunny, hold on. That one didn't count. Attack number three. [Applause] Bunny, don't fly away. Let's just keep on playing. [Music] [Applause] I can't. [Music] [Applause] [Music] Nice. [Music] [Music] Bear, all my bubbles are gone now. [Music] Oh, Bunny, he had enough fun and flew away. Yes. Yes. [Laughter] Bear, are you sure this will make a giant one? [Music] >> And higher and higher and higher. Bubbles flying into the clouds. [Music] Wow. [Applause] Wow. [Music] [Applause] [Music] Hey, who's there? Hey, I must I must introduce you to a bear. [Music] There. Look what I found on our doorstep. [Music] Oh, wow. Oh, someone really has an ear for music. [Music] Ah, so that is who he is. Yep. You have to incubate it. [Music] You bear have to be careful not to break this egg. And you and there have to break out of this egg. And I'll be right back. And right forth and back again. [Music] Huh? [Applause] Huh? [Music] [Music] And you call this incubating? To incubate you have to be in, not out. We are good at this. [Music] Maybe you should play some music. [Music] So that's how you become a daddy. >> We will be eating now. We will be having good food now. [Music] >> No kids don't eat this kind of food. No, kids don't like this kind of food. >> What? This is for kids. [Music] [Applause] [Music] This is what kids really like to eat. [Music] Oh yes. [Music] And now the dance of the little penguin. [Music] What a scorching heat. [Music] Bear, he is getting hotter and hotter. You need to be cooled down now. [Music] We're just chilling out in here. [Music] contact. Off you go. [Music] Don't be sad. They'll come visit us. [Music] Bear, look what else I found on our doorstep. Masha's Tales. Looks like I need more colored building blocks. What's this? Can you call this a tower? If you plan on doing something, do it so it will stand the test of time. Cuz you never know what can happen. like this story. Once upon a time, >> the fox and the rabbit. >> There were the fox and the rabbit. The fox had a pretty house, all icy and sparkly. The rabbit's house was made of bark. Of course, when spring came to the forest, the fox's house melted away immediately. Only a puddle was left. The fox, all wet, came to the rabbit's house and told him, \"Rabbit, would you be a deer and please let me stay in your home?\" And the rabbit was very kind. Of course, my dear fox, you're more than welcome. Please come in and feel at home. Just be careful and don't make my floor dirty. So, the fox stayed at the rabbit's house and dried off. She looked very foxy with her cello bushy. She looked in the mirror, admiring herself. Then, the gray rabbit started to get on her nerves. His ears were way too long. His eyes were too crossed. And his tail was so tiny it was laughable. So the fox decided to throw the rabbit out. Get out of here while you still can or I will get angry and I will get hungry and I will eat you up. Go now and don't ever come near here or you'll regret it. The rabbit was walking down the road crying when he met the dog. Hey crosseyed, why you cry? Well, dog, you see, I had a house made of bark, and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away, and I let her stay at my house, and she threw me out. Don't you worry, long ears. I'm going to help you. Let's go, Short Tail. You and I will deal with that fox in no time. When they got there, the dog started barking, but the fox didn't get scared. The fox was lying there all calm and relaxed. Suddenly, she screamed out, \"Hey, you! How dare you come barking in here? I will jump. I will pounce. I will get you. Nothing will be left of you. Just scraps the fur.\" The dog started shaking with fear with his tail between his legs and ready to run away. The fox looked out the window and said, \"Don't be afraid. Come back inside. This house is big enough for two.\" And you, crosseyed, get out of here. How dare you spread nasty rumors about me, you tattletail. The rabbit was walking down the road crying and met the wolf. Hey rabbit, I want to eat you. Wolf dear, please don't eat me and I'll sing you a pretty song. And he sang, hun as fast as you can catch a gingerbread man. No, I don't think that's the right song. Oh, like this. and the rabbits and the fox's house was all icy and sparkly. When the spring came, the fox's house melted away. I let her stay at my house and she threw me out. Okay, I'll help you",
    "start_time": 0.07,
    "end_time": 39575.52
}