{
    "video_id": "58oAbYBN04o",
    "channel_url": "@mashabearen",
    "transcript": "[Music] Hello bear. Are you painting the fence? That is exactly what I would love to do. This red fence is blazing. It's just amazing. I will paint it faster and I will help her out. I will paint it faster and I will help her out. [Music] >> Done. It's finished. Oh, I am so helpful. Right bear. [Applause] >> Hey, why would you ruin what I just did? >> Do you see the red? It looks better. [Music] >> No, I like red. [Music] Give it back. Give it back. Give it back. Give it back. If not, if not, if not, we won't be friends anymore. Is that how you're going to be? If you act like that, no one will ever want to be friends with you. [Music] Huh? [Music] No big deal. You'll see. I will find a new friend, too. Oh, I found my new friend. Hey there, Sporty. Your kettle bell is ginormous. [Music] Your strength is so enormous. [Music] [Applause] [Music] Huh? Huh? [Music] [Applause] [Music] Wait, wait. A photo for your fans, please. [Music] [Applause] [Music] [Applause] Excellent. Great. Amazing. Perfect. [Music] You are a shining athlete. [Music] [Applause] Wait, wait, wait. The athlete is shining, but your kettle bell is not shining yet. I'll polish it for you. It's all polished now. [Applause] You look great. [Music] Huh? [Music] They're ready. [Music] Wait, hold on. Please, let's play. Let's play. Let's play househ. Hooray! 1 2 3 4 5. Ready or not, here I come. [Applause] [Music] Hey, bear. Can we just start over again? [Music] Look, [Music] >> come on. Come on. Keep up, Bear. [Music] [Music] It's been a long time since I've tried my hand at checkers. [Music] Huh? [Music] Wait. [Music] [Music] Hey goalie. Hey, get ready to play. [Music] [Music] Woohoo! I scored again. Masha has a two to zero lead. Woohoo! I scored. I scored. Masha has a three to zero lead. Bear, we're done playing. We're hungry now. [Music] >> Huh? What's this? Porridge. Yep. No, no, no. I'll make a better meal of oatmeal. Aha. [Music] Oh, wow. Now we're cooking. [Music] M. Yum. Yum. Yum. Yum. Woo! Heat! [Music] [Music] [Music] Huh? [Music] Woohoo! [Music] Hey, pilot. [Music] [Music] Woo! Boy! [Music] [Music] Bear, I cleaned everything. I'm hungry now. [Music] What again? Uh, is there nothing else? [Music] Oh, I've made such a cruel grat. [Music] [Music] Oh, finally awake. [Music] >> I got so tired of waiting. [Music] >> Spring is here. I'm coming to see you. Your dad. Hooray. Hooray. Guests are coming. [Music] [Applause] [Music] [Music] Help [Music] [Music] me go. [Music] Hey, bear. Salt. Salt. >> Read this in black and white right here. Spilling salt brings bad luck. Well, well, well. How do we get your luck back? No way. We need a bunny. Aha. Just rest for now. [Music] Bunny, help me. I just need your backpack. [Music] [Music] M [Music] [Music] >> shake his paw. >> Well, there you're going to be lucky now. [Music] He could really use some luck. Um, where do we have horses here? [Music] [Music] You've held a horseshoe and now you need to grab Piggy by the snout. [Music] Oh no. Oh my. Oh my. Poor little thing. Weird. Nothing helps him. Oh, knocking on wood may work. [Music] I am very lucky indeed. Oh, there me. Your lucky charm is me. >> That's good. That brings good luck. [Music] [Music] It's all superstition and it might be true. It's all superstition. And what would you do? If you see a black cat, get out of it. If you spill some salt, then wait for a bad day. If you break a dish, then shame on you, they say. Leave this room. Go outside here. You cannot play. All this grown up should know. Break a dish for good luck. Break a dish for good luck. Break a dish for good luck. That's the way we go. Knock on wood and make sure you knock. Rub a rabbit's foot. Hit a piggy's fun instead of tokens. Signs and strange beliefs. Best friends make you lucky. Fast friends make you lucky. Best friends make you what you need. [Music] [Music] Oh, what a blessing. [Music] >> Who came to grace us with his presence? [Music] Are you? It can't. Are you the king? >> Really? >> Oh, goodness gracious. It's not a proper welcome for a king. >> It's not fit for a king to arrive with no welcoming committee. [Music] Your royal magic streak. Come on now. Please go back and arrive one more time. [Music] [Music] But that's our bear. Allow me to escort you to his humble abode. [Music] I would imagine that it's not fit for a king to just walk about. [Music] >> It's not fit for a king to bend and pick berries. [Music] It's not fit for a king. No, not at all. >> But it's not fit for a king to fix cars like that. Not for a king, I tell you. That is not what kings should do. [Music] >> Uh-oh. It's not fit for a king to rub noses with bears. [Music] >> Kings are not supposed to wash dirty dishes and it's not fit for a king to clean up messes. I am telling you. Oh, what are you thinking? Is it really proper for a king to fish for some fish and get mosquito bites [Music] on vacation? King Lion III. In my royal absence, the crown will be temporarily bestowed on Queen Mariana. 101. It's for me. I'm the queen. Why am I waiting when I have a kingdom to rule? >> Wow, [Music] his royal majesty made me his new favorite queen. [Music] [Applause] [Music] It's not fit for a queen to use her own feet. I want a queen mobile. A queen ball field. [Music] You dare to raise your paw? A then I praise you for your service to me to the palace. [Music] H It's not fit for a queen to have such a small house. Hey people, all hands to the palace building. [Music] [Music] See, you can do it when I force you to. Okay, you go and prepare a piece fit for a queen. And you build me topiaries, aviaries, and fountains. I have to check it if all's up to royal standards. Woohoo! I like this a lot. A royal affair. [Music] The people I'm ruling are actually not bad. That's what I call a good fit. Wow. Now this I like a lot. A great art. What's good for the queen is what's good for her people. I am so regally majestic. So magnificently imperial. We are ready for our royal food. Hey, what is up with you? Come on. It's the queen's order. You must obey your queen. [Music] Three seconds. [Music] Whoa. [Music] While you're getting ready to have your dinner, I am being dethroned around and stuff. Don't you dare telling your queen to be quiet. It's not fit for a queen to stand in the corner. >> Something happened to me. The power has gotten to my head. >> It's not good at all. Oh no. I realize standing in the corner just now, it's not fit for a royal to alienate their people. [Music] Huh? [Music] [Applause] Well, well, well. Who's there? Aha, it's you, my cutie patootie. [Music] My cute little spiky baby. [Music] [Applause] [Music] So this is your home now, right my cutie pie? [Music] [Music] Good there. You're such a fidgety baby. [Music] Hey, and where do you think you're going? Just curious. [Music] Huh? Huh? [Music] Don't you run off. You're still wet behind the ears to do that. [Music] [Applause] [Music] Ah, [Music] [Music] [Applause] [Music] [Music] Hey, hey, hey. [Music] [Applause] Hey, [Music] come down quickly and I won't say it again. Come down now. Down. Can't you hear me? [Music] Huh? [Applause] [Music] Ow. So, what do we have here that's so spiky? Huh? [Music] Do you want some strawberries, my little kitty patootie? [Music] [Applause] Oh. Oh. Aha. [Music] There you are, my little thumper. [Music] That's enough of your hiding game. [Music] [Music] [Music] Oh, but I've run out of more strawberries. Woohoo! [Applause] [Music] [Applause] [Music] So now they're leaving their nest. Spiky little ones. How quickly someone else's kids grow up, don't they? >> My dear Cutie Patootie. [Music] Wow. [Music] Hey. [Music] How is my baby feeling? Tired after a swim? And are you sure that you didn't catch cold, my love? [Music] >> Don't you worry, my pretty. Mommy will get you out right away. [Music] Okay. Oops. [Music] I'm so scared. I'm so [Music] Everyone's okay. No one needs to see a doctor. [Music] But I only wanted to play doctor. [Music] Fire. [Music] Oh my god. I think I'm pretty good. [Music] All right. [Music] Come on. Come on. [Music] I wouldn't [Music] [Music] [Music] Give me, give me, give me. Go higher and higher and higher like birds you will fly. in the sky. [Music] Bear, are you sick or what? Then I'll be your doctor. It's a good thing I came. I know how to treat a patient. Well, my dear, let's give you a checkup. Okay. Okay. Mhm. Mhm. Ooh. Doesn't look good. That's the problem. Yes, it is a complicated case. The only thing that will help you is some bed rest. [Music] Lay down, my dear, and rest. [Music] Let's have some tea with raspberries. [Music] Medicine has to be tasty and sweet. [Music] Wait. [Music] And you don't get out of bed. [Music] Did you get out of bed and still you're sick? Well, all right. So, let's check you out. Okay. It seems okay. It's all right here, too. [Music] Oh my, you are seriously sick. You urgently need a very restful bed rest. [Music] [Applause] [Music] You were sick yesterday. You're sick today. Aren't you tired? Okay. Okay. I will try to check you out. [Music] You'll get the most restful of all the bad rest. I'll go get the medicine and be right back. [Music] Woo! [Music] [Applause] Hurry! It's an emergency. [Applause] [Music] Whoa! Whoa! Whoa! Whoa! Whoa! And one and two and one and three. [Music] and two and three. We [Music] faster, faster, faster. Go faster. Go faster. Faster. Go faster. Shut out. [Music] [Music] I do know how to treat a patient. [Music] Woohoo! You [Music] Hey, aren't you tired? I'll help you if you want. Well, then, bye-bye. You all have a great day. [Music] H I think I do not want to play. I better go then and clean our bear's house. Here. [Music] Don't drop it anymore. [Music] like a film. It was just like a film, but who knows? >> I'm fine. I'm really truly fine. Just wanted to clean it all up a little. Maybe we are destined to begin on another show [Music] like a film. Rewind and let it play. Watch the show over again. Like a film laughing your gloom away. Like a film [Music] like a film wonder. [Music] Do you know >> I accidentally grew a little and grew up a little? >> Are you sure you grew up? >> Mhm. >> Okay. >> Tomorrow I'll come get you. >> Well, then that's all. Tomorrow I am leaving. I have to go too. [Music] Well, okay. Okay. I'll sleep over cuz it'd be the very last time. [Music] Like a film. If dreams could come to life [Music] the screen. [Music] Make a wish and let the magic fly. Hold on to your dreams. Like a film, all can begin again. Like a film. Live and play games. Like a film cry. >> But bear, I'm great. Like a film wonder. Like a fish. [Music] Wonder way. [Music] And see you later. [Music] Huh? [Music] [Music] Oh, wow. What's the special occasion, Bear? [Music] >> Ah, I get it. Today is your birthday. I'll go get your present. I'll be right back. [Music] Ah, bear, that was a long time ago. I've learned so many manners. I What do you call it? I'm wellmannered. But I promise. [Music] Hooray. [Music] [Applause] [Laughter] Good morning. Oh my, what a striking resemblance, huh? [Music] Please excuse me, everyone. [Music] Ooh, I really have such good manners today. [Music] >> Hey bear. Hey bear. I won. I won. I won. I won. I won. I won. I won. I won. I won. I want to congratulate you for your birthday too. Happy birthday to you my dear bear. [Music] [Laughter] Oh, I am so pleased to see you again. [Music] Just so you know, I have the very bestest manners here today. [Music] >> Allow me to give you a hand there. [Music] You look like an adorable little cutie pie. Isn't that right, Bear? [Music] Hop. [Music] [Applause] Ah. May I please have this dance, my friend? [Music] [Applause] die. [Music] >> Oh, pardon me. I am so very sorry. Would you like to dance with me? [Music] [Applause] It's okay. Don't worry. I'll be sure to save the next dance for you. [Music] >> I could eat that whole entire cake. It looks so good. [Music] Happy birthday. Happy birthday. Happy birthday, dear bear. [Applause] [Music] Oh my. Oh my. Oh my. Happiest birthday, my dear bear. [Music] Oh, my mistake. Sorry about that. Here's yours. [Music] And this one is for my little Rosie. Bonap petit, everybody. [Music] Hey, [Music] [Applause] [Music] got it. [Music] [Music] Just as I figured, I knew that I would be the one with the best manners here. [Laughter] [Music] Just let me have another [Music] One more millisecond. [Music] Oh no, I have overslept and I'm late. [Music] Why is everything so wrong? [Music] [Applause] [Music] Oh, mommy dearest. [Music] [Applause] [Music] [Music] Do I have to choose my future profession? H. It is a very serious business. Oh, I will pick a career that no one will dare to laugh at. A scientist. That is a very serious job. It's nothing to joke about. And no kidding about it, too. [Music] But then, no, sometimes it's a funny business with scientists, too. I'd rather be a doctor. I just don't want anyone laughing at me ever. Whoever giggles, I will give them a big shot. a better idea. A teacher. They giggle. They get an F. They laugh out loud. They go to see the principal. [Music] Oh my god. My way. I'm coming. I'm coming. All right. All right. I'm coming. I'm coming. I'm running as fast as I can. [Music] Hello dear students. I will be your brand new all day green teacher. >> When you are feeling sad and blue, when everything has been so wrong, so long. Just let the talent that's in you shine through and sing a funny sunny song. You'll realize this is the new you. Your sense of humor is a key that lets you open any door anymore. Cuz everybody will agree with me that it can make you fly and sore. Well, looks like for now I'm good for nothing at all. [Music] So this is the only thing I'm good for. I can make everybody laugh. >> Friends laugh at you and laugh with you. >> You make them happier this way. Life should be funny too. It's true. Make people smile and they will say that everything is a okay. [Music] Turn. [Music] Oh, yeah. [Applause] So, so, so, where could all of the cartoons be hiding? H. Let's start an investigation. Ah. 1 2 3 4 5 6. Let's look for cartoons to pick. I will press this microphone. Masha and the bear. Let's go. That's how easy it is. And now you try it.",
    "start_time": 0.25,
    "end_time": 4045.0389999999998
}