{
    "video_id": "wjyN1fwtU7Y",
    "channel_url": "@mashabearen",
    "transcript": "[Music] [Music] Why did it turn off? Did the battery die on us just now? [Music] Honeybees, did you come here for our candies? [Music] Oh yeah, Bear got the music working, but we already ran out of candies. [Music] They don't look okay to me. Bear, we have to call the ambulance. [Music] [Applause] [Music] [Applause] [Music] It says here they're overweight. They need to exercise. [Music] Aha, it's all clear now, Bear. We need some candies to exercise. [Music] And now we're starting our exercise class. Place your feet at shoulder length. Extend arms towards your side. And one, two, three, four. Don't hold your breath. One, two, three, four. One, two, three, four. Hold your posture. Try harder. Try harder, my friends. >> See for yourself. What can we do without any candies? >> It's time for your next exercise. Bending sideways. And one, two, three, four. Bend a little more. >> Hi, athletes. Bend a little more. 1 2 3 4 5 to the other side. Now all you do is show off, but you can't exercise. Well, [Music] [Music] [Applause] Oh. H. [Music] [Applause] [Music] Get be. Hey, honey bees. Come on. Repeat after us. [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] Ooh, he doesn't look okay to me. Hey, Bear, go call the ambulance. [Music] Huh? [Music] Huh? [Music] Did you see that bear? Give me some candy. [Music] Who wants candy? It's sweet and delicious. It's as sweet as it gets. It's the sweetest candy ever. Sweet and delicious. The sweetest candy ever. Hey, and whoever catches up with me will get a delicious candy. [Applause] [Music] Come and get the sweet candy. Honeybees, I'm right here. I'm right here. [Music] Delicious candy. [Applause] [Music] Hey, look. It's as good as a new one. Bear, do you want to lose weight? >> Okay, then get me candy. [Music] I was playing. I was playing. [Music] I was playing. [Music] Oh no. Oh my. Oh my. [Music] [Applause] All of this is my fault. That is not my fault. [Music] There he is. [Music] Oh, wow. What a cool gadget this is. [Music] [Music] Wow, I'm looking so very photogenious. [Music] Okay, where should I hang this up? Cool. [Music] I completely forgot to shoot bear. [Music] Bear, please say cheese. >> Oops. I think it's time to go shoot something out in the nature. [Music] Bunny dear, please say cheese. [Music] You forgot to pick up your picture. [Music] Oh, there you are. Please say cheese. [Music] >> Hello boys. Please say cheese. [Music] Heat. Heat. [Music] [Music] Please say cheese. Mommy. [Music] Heat. [Music] [Music] Heat. [Music] I was playing. [Music] Hey, [Music] [Laughter] [Music] hey, hey. [Music] [Laughter] [Music] Nobody's here. Where are you all? [Music] Where did everyone go? [Music] Boom. I'm feeling boom. I'm feeling boom. I'm feeling bum boom. feel [Music] like with I'm [Music] never [Music] Oink [Music] zombie. [Music] Huh, this is so cool. [Music] [Music] [Music] Wait. And who are you? >> One more. [Music] Woohoo! Woohoo! [Music] [Laughter] [Music] Hello. [Music] Oh no. [Music] I got to go home. [Music] Hey hol. [Applause] [Music] [Music] la. [Music] Oh. [Music] [Applause] [Music] Are you okay? [Music] Huh? Huh? No. [Music] You nailed that nailing. [Music] >> Give me your paw. [Applause] [Music] Pear, are you asleep? Come play with me. Come play with me. Come play with me. Come play with me. Come play with me. Come play with me. Come play with me. Are you sleeping or what? [Music] O, oy. [Music] [Music] Huh? [Music] [Music] Maybe maybe now we could eat something. Maybe [Music] [Music] Oh my god. [Music] [Music] The match. The match. [Music] I'm going to eat now. Now I will get some food. Now I'm going to eat. Feed me. Feed me. Feed me. Feed me. Feed me. Feed me. Feed me. [Music] Woo! [Music] Woo! bad. [Music] [Music] [Applause] [Music] there. [Applause] >> Check out what I can do. [Music] >> Great. Oh, wow. Easy now. Yummy, yummy. Something's missing, though. Maybe add some salt. [Music] Bear, look, I'm an astronaut. Awesome. Wow. We have liftoff. Wait, [Music] >> we have a problem. Kids may have a problem. Ouch. My ears. My ears. >> I think my ears are okay. [Music] Let me help you. [Music] [Applause] [Music] [Applause] [Music] Bear, let me come with you. [Music] >> Aha. Got to get the pandemonium. And that means I'll pans and pots. Clear the way. I need to make room to make jam and to make. What was on the garden patches? What girl on the tree? I got made from it. Some mix and matches. Put it all in one big pot. All I care is for some nicest to the portabell jams. But the juiciest and sweetest will be pine and the y [Music] and as I'm looking at the weird brew I yell. Now I know what's really cooking. I am in a jam as well. [Music] Huh? [Music] [Laughter] [Music] Huh? [Music] Bear, where have you been? Everything is ready already. [Music] Here. [Music] And this one. [Music] [Music] [Applause] [Music] Look at me. I am moonwalking. All systems go. We have liftoff. [Music] Hm. [Music] Huh? [Music] [Music] [Music] [Applause] [Music] Huh? [Music] Oh, wow. [Music] I don't remember the last time I had a strawberry. [Music] Okay, I'll go for a walk. [Music] What is happening to me? [Music] [Applause] Ah, you want me to hold my breath? [Music] Good. It's gone now. Actually, it didn't help. [Music] [Music] This one didn't help either. Kids are always asking lots and lots of questions. I will only ask you one. Please give me suggestions. Where the silly hiccups come from? Worldly. Do I have to suffer night and day? High and low and up. I pick up way below the top. When I stop will pick up the hiccups ever stop [Music] every word I shatter. I'm trying everything but it does not matter. Could you please a cure? This is something that I can't endure. High and up. [Applause] Will these hiccups? Will these hiccups ever stop? [Music] >> Oh, great. Just like us, you have hiccups. [Music] >> That's enough, Bear. Breathe out now. [Music] [Applause] [Music] What? [Music] Hey. Hey. [Music] Oh no. What is wrong with me now? [Music] [Applause] [Music] Oh, you woke up already. I just rolled over to have some breakfast. [Music] If you want the fish to bite, you first have to feed the child. [Music] [Applause] Meow. Thanks. But I want something sugary. [Music] It's not my fault that my sweet tooth is craving some sugar. [Music] [Music] Yep. No, I'm craving sweets and I'm going to have them. H. Yeah. Well, I have to do all of it all by myself. [Music] Yep. Best flavor of life is sweet. [Music] [Applause] [Music] Oh, wow. [Music] Oh yeah, [Music] bear. Look at all the lollipops I've made to make my life sweeter. [Music] Ouch. I think I broke my sweet tooth. Ow. Ow. [Music] Longer than a munch candy. Life will be improved by as much as can be. It'll be easy as a piece of cake. Every time I see a truck selling ice cream, I run up to it very fast and ice cream. Give me a zillion billion or they say that soon all my teeth are going to break and that I will have a terrible toothache. know that's a mistake. My teeth will not break. [Music] [Applause] [Music] I eat a bunch of lollipops and suckers. Something in my mouth crumbles down like crackers. I'm so terriied. I cannot cry. I cracked my tooth and now I need a dentist. Please don't you tell me how big the dentist. Will I ever smile? What if I try? Am I to kiss all my greatest hopes goodbye? That one day I'll eat the biggest apple pie. Pass me by. Someone tell me why. Children, now you know the hard truth. Here's a wedious pearl of wisdom. If you want to keep three of them, children know the hard truth. You're the whiteest pearl of wisdom. If you want to keep her sweet, get your brushes clean and wisdom. [Music] Yep. I'm over for some breakfast. [Music] The sweet life isn't a piece of cake. [Music] [Applause] [Music] [Applause] [Music] Hey bear, can you see the cloud over there? Looks just like an ice cream, right? [Music] [Applause] [Music] And that one over there resembles a giant strawberry. [Music] And this one looks like an orange. No, no, no. It's a bunch of grapes. [Music] [Applause] >> There. You see that? And that cloud right over there looks exactly like a savory cream pie. It must be such a delicious cream pie. Bear, shall we fly up and try some? >> Well, whatever. Do as you please. [Music] Hey Bear, have a great time at home then. Bye-bye, Bear. Oh, it tickles me. Let go of me. [Applause] [Music] >> So, you don't want to fly? Then nobody's going to fly. And you call yourself a good friend. [Music] Oh wow. Are we going to fly this thing up there? >> Hooray, my bear. You are a true friend indeed. [Music] Hey, bear. And why are you taking so much food? Remember that when we go up there, we can eat as many clouds as we wish. >> Bear, where are you going? Let's fly over here. [Applause] [Music] [Applause] [Applause] [Music] [Applause] [Music] [Applause] [Music] I'm happy [Music] [Applause] There. Look up. Look up. [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] Hey. [Applause] [Applause] Oh no. [Music] I I I want to have a look, too. [Music] >> Hey, Bear, how can we get that back here now? [Music] Oh. [Music] [Applause] [Music] Hey, how's it going, boys? So, have you guys already tried the clouds? [Music] I know. It's strawberry. Um, awesome. It tastes just like an orange. [Music] >> Hey Bear, here you go. I can't make this one out. It tastes so familiar to me. Try one. [Music] Ah, I got it. This is caramel cream. [Applause] [Music] Hey, [Music] [Music] come. [Music] Lemonade. Let let me help you. And where are the lemons? [Music] Oh, here I go. [Music] Stand aside. >> Huh? [Applause] [Music] [Music] Lemonade. Lemonade. Nice and cold. Lemonade. Freshly made lemonade. Come and try it. [Music] Hey. [Music] >> Hey, wait for your turn. Little one's hurt. Huh? [Music] [Music] Help. [Music] Huh? Hey, Bear. Weren't you the one who taught me to share? [Music] Who wants a refill? Stand in line. In line. There's too many of you and I'm alone. It's ready now. [Music] [Music] [Music] Oh. [Music] Thank goodness. [Music] [Applause] [Music] Hey, [Music] [Music] Oh, [Music] [Music] Nice and tasty, but a little sour. They're mine. [Music] Mm- [Music] [Music] There is never too much lemonade. [Music] Uh-huh. [Music] Woohoo. [Music] [Applause] [Music] This place is exactly what we need. >> Hello there, Bear. [Applause] Take the picture. [Music] Come on, hurry up. I'm about to fall. Huh? [Music] >> Rosie, who am I supposed to be posing for? I can't ask you for anything. [Music] [Applause] Hey Bear, you're the best photographer around. Can you take a beautiful picture of me? [Music] [Music] There we go. You can tell the work of an expert. [Music] Hey, Rosie, feast your eyes on this shot. Hey, stop, stop, stop. Before anything, you have to take the picture, and only then can you eat. >> That is such a great idea, Bear. Snap a picture of us at the picnic [Music] >> now. Bear, come on. What's the big deal? Rosie has never been to a picnic before. [Music] Huh? [Music] [Music] Bear. Rosie doesn't like it. She says it's not her good angle. It needs to be retaken. [Applause] [Music] Are you ready? [Music] Uh, now that one came out great, but it's not beautiful. >> Bear, we're not looking for great. We need beautiful. But what did I just say? [Music] [Applause] [Music] [Music] [Applause] [Music] Wow, It's so beautiful, Bear. This is the best picture that you ever taken in the world. [Music] >> Well, hello. [Music] >> We'll be out of your way. [Music] smile. Ready, set, take. [Music] Ready for the next. Now smile. And next. Okay. Smile. So, so, so. Where could all of the cartoons be hiding? H. Let's start an investigation. Ah. 1 2 3 4 5 6. Let's look for cartoons to pick. I will press this microphone. Masha and the bear. Let's go. That's how easy it is. And now you try it.",
    "start_time": 2.31,
    "end_time": 3875.1600000000003
}