{
    "video_id": "Ysleu_HAft4",
    "channel_url": "@mashabearen",
    "transcript": "Yum. [Music] [Applause] Huh? You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored um gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our team crafty. I'm all buttoned up. [Music] No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, Tiny Wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha. And this one's mine. [Music] Have you seen Lisa Mona in the Liver Museum? I pose for that statue. [Applause] Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Ah, [Music] bear. Bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms and I And that's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] You can't misbehave with me around. Naughty whack. Time out. Naughty. Whack. No dessert for you. Naughty and whack. There. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Babe, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] H. [Music] Hm. [Music] Yep. [Music] >> So, who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way. >> And I'm Marsha. If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear and that's my cat. [Music] What brings you around here? >> It's all because of the book. [Music] Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. >> That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey, bear. What do we catch a book with? [Music] [Music] Hello. [Music] [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] Ow. I told you that I would catch it. Voila. Spell and do abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell and do. Crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to Doll toy. And there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Tuli's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Toique. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Tonyi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tony with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. Toique wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiiki wanted to climb a tree, but all the trees had been cut down. It tell your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Tiki was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Toique shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tik had kept his distance from shooting computer games. Now he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes, late, late at night, when the monsters are sleeping, they dream of to how terrible. [Music] [Music] papa. Papa. [Music] [Applause] Papa. Papa. Chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft key to start. Zip. Be careful, Bear. We're taking off. [Music] Attention Earth. The astronaut's overboard. He's conquering outer space. [Music] >> Hey, bear. The spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Yum. Oh. Beep beep. Huh? >> No, bear. Our teeth can wait for that, but great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get battle. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily >> like this. [Music] Okay, crocodile. You know what to do now. [Music] Ooh, the gale force is above 10 points. H, it doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] Yeah, nice storm. [Music] Oh dear froggy bear, the deck boy wants 30 points. [Music] [Music] Huh? Huh? [Music] Hi bear. >> Are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Applause] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Ta. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Applause] [Music] >> Here. [Music] [Applause] Wow, that is very impressive. [Music] [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence and strangers who you should never talk to. And yet this boy did not want to sleep. His batteries just wouldn't die. So he decided to pass the time telling horrifying spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black hand. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, >> \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! Yep. Woohoo! [Music] Huh? [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. [Music] H Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. many languages and words in different but when you're in Spain or Mexico [Music] and they will open any door you'll find yourself in harmony with everyone in Germany. And if you are traveling to France, then you should never miss a chance to be polite and always say [Music] in the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very much friends who stay in touch very love We'll help you travel any world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored out gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> H look, I'm our team crafty. I'm all buttoned up. >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha. And this one's mine. [Music] Have you seen Lisa Zamona in the Liver Museum? I pose for that statue. Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Huh? [Music] Bear. Bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty. Whack. Time out. Naughty. Whack. No dessert for you. Naughty and whack. >> Bear. Dear. I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] >> Babe, please read a little bit more. Please read some more. [Music] Just one more time. My favorite. Can you [Music] Hm. [Music] Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail. You know, >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way, >> and I'm Marshall. If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear. And that's my cat. [Music] So I wonder what brings you around here. >> It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. >> That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. No problem. Hey bear, why don't we patch a book with [Music] [Music] Hello. [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh. again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good and then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day morning to night shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Toi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Ti with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiik wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Tiki was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Tulique shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now he prefers different games, regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes, late, late at night, when the monsters are sleeping, they dream of how terrible. [Music] [Music] Bubba papa. Woohoo. [Music] [Applause] Papa Chug chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft. Key to start. Zip. Be careful, Bear. We're taking off. [Music] Attention, Earth. The astronaut's overboard. He's conquering outer space. [Music] Hey bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. Meow meow meow. >> Yeah. You will never find such food on planet Earth. >> Yum. Meow. Oh. Beep beep. Huh? No. Bear. Our teeth can wait for that, but great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] >> Your teeth will be much better if you brush them daily >> like this. [Music] Okay, crocodile. You know what to do now. [Music] [Applause] [Music] Ooh, the gale force is above 10 points. It doesn't really look like much. >> Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] >> Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] Yeah, nice storm. [Applause] [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Hi bear. >> Papa, are you playing right now? >> Hooray! We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] [Music] Happy Morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Taa. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] >> Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Applause] >> Here. [Music] Wow, that is very impressive. [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] bear. Give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass a time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black pant. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. Mr. Scary, you're frightening all the campers with your silly scary tail. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets and the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. Well, I had to chase after you up and down the camp. I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior, so he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others. about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid, but instead he promised to handle the situation. [Music] Woohoo! Woohoo! [Music] Woo! Woo! [Applause] [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen, huh? [Music] Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. languages and words in different but when you're in Spain or Mexico [Music] and they will open any door you'll find yourself in harmony with everyone in Germany. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say [Music] the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very much friends who stay in These very magn [Music] Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. >> So, you are the watercolored out gardeners. Expressionist. Impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] Look, I'm our team crafty. I'm all buttoned up. [Music] No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. [Music] Ha. This one's mine. [Music] Have you seen Lisa Zamona in the Liver Museum? I posed for that statue. [Applause] Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. H and I am an endless source of out and inspiration. [Music] Bear. Bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. >> Bear. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Bear, please read a little bit more. Please read some more. Just one more time. My favorite. Can you H. [Music] Hm. [Music] Yep. [Music] >> So, who is it that came to visit us? >> Get your hands off now. That's our tail. You know, >> I won't let go. >> Yeah. Well, you should know. I'm a witch, by the way. And I'm Masha. >> If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear. And that's my cat. [Music] So I wonder what brings you around here. It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. [Music] I just wanted to say reopen. >> That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. No problem. Hey bear, why don't we patch a book with [Music] [Music] a [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. [Music] Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell and do crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to And there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, prodigy from the games. We will have you for dinner or something like that.\" And they started chasing Toi anxiously. But he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Toi with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch. burning it all down. Tiik wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Ti was really scared. He's thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Toique shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you and then we'll eat you. Leak had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now, he prefers different games, regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of how terrible. [Music] Bubba papa. Woohoo. [Music] [Applause] Bubba papa cha chubby cha cha cha cha cha. Chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft key to start. Zip. Be careful bear. We're taking off. Attention, [Music] Earth. The astronauts overboard. He's conquering outer space. [Music] Hey, Bear. The spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yow. Meow. Oh. Beep beep. Huh? No, bear. Our teeth can wait for that. But great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. [Music] Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily. Like this. [Music] Okay, crocodile. You know what to do now. [Music] Ooh, the gale force is above 10 points. It doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] Yeah, nice storm. Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Huh? Huh? [Music] Hi bear. >> Papa, >> are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] [Music] Hm. Be quiet. The child is creating. >> Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Mhm. Come on. [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Tada! Open your eyes already. [Music] I see you like it, huh? Yeah, it's cool, right? Don't be so sad, Bear. One day you will make something like this for sure. [Music] That's not bad. Now I will race you. Ready, steady, stitch. [Music] Here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Wa! [Music] Got it. [Music] [Applause] >> Here. [Music] Wow. That is very impressive. [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass a time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black hand. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who you should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! Woohoo! [Music] Woo! Woo! [Applause] [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? >> We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. [Music] H Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different but when you're in Spain or Mexico [Music] and they will open any door you'll find yourself in harmony with everyone in Germany. Just memorize from early. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say [Music] the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks along and please Great Russian words to know [Music] like the pretty flowers always and thank you very much. making friends who stay in touch. These very magical love words will help you travel any sea up to North Sea. There is a world. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. >> So, you are the watercolored out gardeners. Expressionist. Impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] H. Look, I'm our team crafty. I'm all buttoned up. [Music] No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha. This one's mine. [Music] Have you seen Lisa Zamona in the Liver Museum? I posed for that statue. [Applause] Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] bear. Bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. >> Bear. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Appear. [Music] >> Well, you didn't believe me, but I found it. Now swirl and swoosh and come to me with a whoosh. >> No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Babe, please read a little bit more. Please read some more. [Music] Just one more time. My favorite. Can you [Music] h [Music] See? [Music] Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way. >> And I'm Masha. >> If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh. [Music] You see him? That's my bear and that's my cat. [Music] >> So, I wonder what brings you around here. >> It's all because of the book. [Music] Open recroening. Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey, bear. What do we catch a book with? [Music] [Music] Hello. [Music] [Applause] >> Oh, no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] Oh, what is it? [Music] >> Come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] And now let's read. [Music] [Music] Masha's spooky stories. >> Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good and then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day morning to night shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Tuli's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as a computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Toique. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him and they said, \"We got you now. You have tormented us, chased us, and shot us with guns.\" >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Tonyi anxiously. But he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tony with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back with you. >> Ti wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Ti wanted to climb a tree, but all the trees had been cut down. It tell you chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night scaring us and chasing us around because of your actions. Now we have to eat you. Tiki was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today and soon we're going to eat you. The monster screamed. Hey, wait a second. Tuli shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late late at night when the monsters are sleeping they dream of toik. How terrible. [Music] Papa. [Music] Woohoo. [Applause] Papa chug chug chug chug chug chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see, this is our spacecraft. Key to start. Zip. Be careful, Bear. We're taking off. Attention, [Music] Earth. The astronaut's overboard. He's conquering outer space. [Music] >> Hey Bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Meow. Oh, beep beep. Huh? >> No, bear. Our teeth can wait for that, but great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get that. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily. >> Like this. [Music] Okay, crocodile. You know what to do now. [Music] [Applause] [Music] Ooh, the guild force is above 10 points. H, it doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the duck boy. [Music] [Applause] Yeah, nice storm. [Music] Oh dear Froggy Bear, the deck boy wants 30 points. [Music] [Music] Hi bear. >> Are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Applause] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Ta. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Music] >> Here. [Music] [Applause] Wow, that is very impressive. [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass the time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black hand. He jumped, scared in bed, and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut, ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! Yep. Woohoo! [Music] [Applause] [Music] Huh? [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. [Music] H Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. languages and words in different but when you're in Mexico [Music] and they will open any door you'll find yourself in harmony. with everyone in Germany. And if you are traveling to France, then you should never miss a chance to be polite and always say [Music] in the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very much friends who stay in touch very love We'll help you travel any world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored out gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our team crafty. I'm all buttoned up. >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] >> I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. [Music] Ha. This one's mine. [Music] Have you seen Lisa Zamona in the Liver Museum? I pose for that statue. [Applause] Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Bear. Bear, we're hungry. [Music] We didn't want to We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can't. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him, so he is afraid of me. [Music] He can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. Bear dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] >> Babe, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] Hm. [Music] Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail. You know, >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way, >> and I'm Marshall. If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear. And that's my cat. [Music] So I wonder what brings you around here. >> It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. >> That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. No problem. Hey bear, why don't we patch a book with [Music] [Music] a [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good and then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day morning to night shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Toi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Ti with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiik wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Toique was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Tulique shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now he prefers different games, regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes, late, late at night, when the monsters are sleeping, they dream of how terrible. [Music] Bubba papa. Woohoo. [Music] [Applause] Papa Chug chug chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft. Key to start. Zip. Be careful, Bear. We're taking off. [Music] Attention, Earth. The astronaut's overboard. He's conquering outer space. [Music] Hey bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. Meow meow meow. >> Yeah. You will never find such food on planet Earth. >> Yum. Meow. Oh. Beep beep. Huh? No. Bear. Our teeth can wait for that, but great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] >> Your teeth will be much better if you brush them daily >> like this. [Music] Okay, crocodile. You know what to do. [Music] [Applause] [Music] Ooh, the gale force is above 10 points. It doesn't really look like much. Hey dear goldfish, come here. Queen of the seas. [Applause] [Music] >> Oh no. Who are you? So are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] Yeah, nice storm. Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Huh? [Music] Hi bear. >> Papa, >> are you playing right now? Hooray! We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Applause] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Come on. [Applause] [Music] That's it. [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Taa. Open your eyes already. [Music] I see you like it, huh? Yeah, it's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Music] here. [Music] [Applause] Wow, that is very impressive. [Music] [Music] Huh? Oh. [Music] Ah. [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Ha! [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today, I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning. After you eat a nice plate of warm porridge, you still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. his batteries just wouldn't die. So, he decided to pass the time telling horrifying spooky stories. Stories about a black black hand and white white ghosts, about a door to a dungeon, a coffin on wheels, and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden he dreamed of a black pant. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed, a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary. You're frightening all the campers with your silly scary tails. Look around. You have scared them all.\" Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid, but instead he promised to handle the situation. [Music] Woohoo! [Music] Woo! [Music] [Applause] Yep. [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. Huh? [Music] H. Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different corners of the world. But you can be a polyot by learning please and thanks a lot when you're in Spain or Mexico. These words are really fast to know [Music] and they will open any door. You'll find yourself in harmony with everyone in Germany. Just me from early on. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say [Music] in the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very much friends who stay in touch very of words. We'll help you travel up to North. There is so much of world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] Huh? You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored out gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our theme crafty. I'm all buttoned up. >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] >> I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. [Music] Ha. And this one's mine. [Music] Have you seen Lisa Zamona in the Liver Museum? I pose for that statue. Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Bear. Bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms and I can That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. Be there. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] Well, you didn't believe me, but I found it. >> Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh. What is happening here? [Music] Babe, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] Huh? [Music] Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know I'm a witch, by the way. >> And I'm Masha. >> If you don't let go, then I will freeze you. >> Yeah, right. I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear and that's my cat. [Music] >> So, I wonder what brings you around here. It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. >> I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey, bear. What do we patch a book with? [Music] [Music] Hello. [Music] [Applause] >> Oh, no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. [Music] Spell and do abracadoo. [Music] H spell and do abracadoo. [Music] Spell and do crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] >> Come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] And now let's read. [Music] [Music] Masha's spooky stories. >> Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good and then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tli. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day morning to night shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Tuli's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as a computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiik. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him and they said, \"We got you now. You have tormented us, chased us, and shot us with guns.\" And now, prodigy from the games. We will have you for dinner or something like that. And they started chasing Tony anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tony with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. Toique wanted to hide in the bushes. But you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiq wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. >> It's not true. I didn't do anything. >> It was you. you from morning to night, scaring us and chasing us around because of your actions. Now we have to eat you. To was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Tuli shouted. I'll wake up and turn off the power. >> We're having dinner way before that, the monsters cried. We are cooking you and baking you. And then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now he prefers different games, regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late late at night when the monsters are sleeping they dream of toique. How terrible. [Music] [Music] Papa. [Music] Woohoo. [Applause] Papa chug chug chug chug chug chug chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft key to start. Zip. Be careful, Bear. We're taking off. Attention, [Music] Earth. The astronaut's overboard. He's conquering outer space. [Music] >> Hey Bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Yum. Oh, beep beep. Huh? >> No, bear. Our teeth can wait for that, but great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. [Music] Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily. >> Like this. [Music] Okay, crocodile. You know what to do now. [Music] Ooh, the gale force is above 10 points. H, it doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the duck boy. [Music] [Applause] Yeah, nice storm. [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] Huh? Huh? [Music] Hi bear. >> Papa, >> are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Applause] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Taa. Open your eyes already. [Music] I see you like it, huh? Yeah, it's cool, right? Don't be so sad, Bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Applause] [Music] >> There. [Applause] [Music] Wow, that is very impressive. [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary. full of wolves howling on the other side of the fence and strangers who you should never talk to. And yet this boy did not want to sleep. His batteries just wouldn't die. So he decided to pass a time telling horrifying spooky stories. Stories about a black black hand and white white ghosts. about a door to a dungeon, a coffin on wheels, and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep, and in no time, he was dreaming. All of a sudden, he dreamed of a black pant. He jumped, scared in bed, and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed, a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more gas at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! [Music] Woohoo! Woo! Woo! [Applause] [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen, huh? [Music] Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different but when you're in Mexico these words are really fast to know [Music] and they will Open any door, you'll find yourself in harmony with everyone in Germany. Just memorize from early on. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say [Music] in the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please. Great Russian [Music] flowers always and thank you very much. Magical of words. We'll help you travel any seas up to North Sea. There is so much of world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] Huh? Huh? You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored um gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our team crafty. I'm all buttoned up. >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] >> I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these bones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. [Music] Ha. And this one's mine. [Music] Have you seen Lisa Mona in the Liver Museum? I posed for that statue. [Applause] Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] bear. Bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can't. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. >> There. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Oops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Bear, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] Hm. [Music] >> Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way. >> And I'm Marsha. >> If you don't let go, then I will freeze you. Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear and that's my cat. [Music] So I wonder what brings you around here. >> It's all because of the book. [Music] Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey bear, what do we catch a book with? [Music] [Music] Hey [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh. again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> What is it? [Music] >> Come by again so we can play. I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Toique. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Tonyi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Toni with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back with you. Toique wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiq wanted to climb a tree, but all the trees had been cut down. It tell your fault. You chased us with a chainsaw cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Tiki was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Toique shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. To had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tik had kept his distance from shooting computer games. Now, he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of to how terrible. [Music] Papa. Papa. Woohoo. [Music] [Applause] Bubba papa chug chug chug chug chug chug chug. Chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see, this is our spacecraft. Key to start. Zip. Be careful, Bear. We're taking off. Attention, [Music] Earth. The astronaut's overboard. He's conquering outer space. [Music] >> Hey, Bear. The spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Meow. Oh. Beep beep. Huh? >> No, bear. Our teeth can wait for that, but great adventures never do. Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get battle. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily >> like this. [Music] Okay, crocodile. You know what to do now. [Music] Ooh, the guild force is above 10 points. It doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] >> Oh, no. Who are you? So, are you the frog princess? Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] >> Yeah, nice storm. [Music] Oh dear froggy bear. The deck boy wants 30 points. [Music] [Music] Hi bear. >> Are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] [Music] Hey Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Ta. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Cool. [Music] Got it. [Music] >> Here. [Music] [Applause] Wow, that is very impressive. [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass a time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black hand. He jumped, scared in bed, and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut, ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, >> \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! [Music] Woohoo! [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen, huh? [Music] H. Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. languages and words in different but when you're in Spain or Mexico [Music] and they will open any door you'll find yourself in harmony. with everyone in Germany. [Music] If you are traveling to France, then you should never miss a chance to be receive [Music] the US and UK. Canada, Australia. Put anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very much. making friends who stay in touch. These very magical love words will help you travel any up to North Sea. There is so much world. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored out gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] Look, I'm our team crafty. I'm all buttoned up. [Music] No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. [Music] Ha. This one's mine. [Music] Have you seen Lisa Mona in the liver museum? I pose for that statue. Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Ah! [Music] Bear! Bear! We're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms and I hand. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] You can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. Be there. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Babe, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] H. [Music] Hm. [Music] Yep. [Music] >> So, who is it that came to visit us? >> Get your hands off now. That's our tail. You know >> I won't let go. >> Yeah. Well, you should know. I'm a witch, by the way. >> And I'm Marshall. If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear. And that's my cat. [Music] So I wonder what brings you around here. >> It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. >> That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. No problem. Hey bear, why don't we patch a book with [Music] [Music] Hello. [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. >> Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. [Music] Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh. again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good and then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day morning to night shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Tuli's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Tony anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Ti with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiik wanted to climb a tree, but all the trees had been cut down. It's probably your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Ti was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Tuli shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now he prefers different games, regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late late at night, when the monsters are sleeping, they dream of how terrible. [Music] Bubba papa. Woohoo. [Music] [Applause] Bubba papa cha cha. Chug chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft. Key to start. Zip. Be careful, Bear. We're taking off. [Music] Attention, Earth. The astronaut's overboard. He's conquering outer space. [Music] Hey bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are Marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Yum. Oh, beep beep. >> Huh? >> No, Bear. Our teeth can wait for that, but great adventures never do. >> Navigator. Come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get [Music] >> And why are you not trying to bite us? You're a crocodile. Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] >> Your teeth will be much better if you brush them daily like this. [Music] Okay, crocodile, you know what to do now. O [Music] ooh. The guild force is above 10 points. It doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the duck boy. [Music] [Applause] Yeah, nice storm. [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Hi bear. >> Papa, >> are you playing right now? Hooray! We have a new game. [Music] >> And the prize for the best fisher of the year goes to the bear. [Music] [Applause] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Come on. [Applause] [Music] That's [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Taa. Open your eyes already. [Music] I see you like it, huh? >> Yeah, it's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. Cool. [Music] Got it. [Music] [Applause] [Music] Here. [Music] Wow. That is very impressive. [Music] [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass a time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black hand. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! [Music] Woo! Woo! [Applause] [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. [Music] H Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different but when you're in Spain or Mexico [Music] and they will open any door you'll find yourself in harmony with everyone in Germany. Just me from early. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say [Music] the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks along and please Great Russian words to know [Music] like the pretty flowers always and thank you very much. Making friends who stay in touch. These very magical love words. We'll help you travel any road from South Sea up to North Sea. There is a world. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words, [Music] voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. >> So, you are the watercolored out gardeners. Expressionist. Impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] H. Look, I'm our team crafty. I'm all buttoned up. [Music] No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wig whams not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha. This one's mine. [Music] Have you seen Lisa Zamona in the Liver Museum? I pose for that statue. Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. H. And I am an endless source of out and inspiration. [Music] Bear. Bear, we're hungry. [Music] >> We didn't want to We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can't. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him, so he is afraid of me. [Music] He can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. Bear. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon? hiding the cannon. [Music] Now catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Bab, please read a little bit more. Please read some more. [Music] Just one more time. My favorite. Can you [Music] Hm. [Music] Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail. You know, >> I won't let go. >> Yeah, well, you should know I'm a witch, by the way. >> And I'm Marshall. >> If you don't let go, then I will freeze you. >> Yeah, right. I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear and that's my cat. [Music] >> So, I wonder what brings you around here. It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. >> I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey bear, why don't we patch a book with [Music] [Music] a [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day morning to night shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as a computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Toi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tony with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back with you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tique wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Ti was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Toique shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now, he prefers different games, regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of how terrible. [Music] [Music] Papa papa. Woohoo. [Music] [Applause] Bubba bubba chubby chubby chubby chubby cha chubby. Chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft key to start. Zip. Be careful bear. We're taking off. Attention, [Music] Earth. The astronauts overboard. He's conquering outer space. [Music] Hey, Bear. The spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Oh. Beep beep. Huh? No, bear. Our teeth can wait for that. But great adventures never do. Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily. >> Like this. [Music] >> Okay, crocodile. You know what to do now. [Music] Ooh, the gale force is above 10 points. It doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] Yeah, nice storm. [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Huh? Huh? [Music] Hi bear. >> Papa, >> are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. >> Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Ta-da. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] >> Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Applause] [Music] >> Here. [Music] Wow, that is very impressive. [Music] [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass the time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black pant. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut, ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more gas at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! [Music] Woo! Woo! [Applause] [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? >> We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. [Music] Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different but when you're in Mexico these words are really fast to know [Music] and they will Open any door, you'll find yourself in harmony with everyone in Germany. Just memorize from early on and if you are traveling to France then you should never miss a chance to be always [Music] in the US and UK too in Canada Australia could Anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very much [Music] will help travel any up to North Sea. There is so much of world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] >> Ah, where the three bears were painted. So, you are the watercolored um gardeners. Expressionist. Impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our team crafty. I'm all buttoned up. >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Huh? Something got into my shoes and my I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha. And this one's mine. [Music] Have you seen Lisa Mona in the Liver Museum? I pose for that statue. [Applause] Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Bear, bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms and I can't. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I am strict with him. So, he is afraid of me. [Music] You can't misbehave with me around. Naughty, whack. Time out. Naughty, whack. No dessert for you. Naughty and whack. Bear, dear. I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Oops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Babe, please read a little bit more. Please read some more. [Music] Just one more time. My favorite. Can you [Music] Huh? [Music] Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know I'm a witch, by the way. >> And I'm Masha. >> If you don't let go, then I will freeze you. >> Yeah, right. I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear and that's my cat. [Music] >> So, I wonder what brings you around here. It's all because of the book. [Music] Open rec. No, no, no, no. That's not what I meant. >> I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey, Bear, what do we catch a book with? [Music] [Music] Hello. [Music] [Applause] >> Oh no, don't panic. I'm now going to cast a spell on you. >> Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. >> Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. >> Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? >> Uh-huh. One sec. [Music] >> What is it? [Music] >> Come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] And now let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to and there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Tuli's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as a computer. But it could also be very scary. And so he played all day long. But the day came to an end and the night had finally arrived. It was bedtime for Toique. He fell asleep and then he had a horrible nightmare. Terrible monsters from his gadgets visited him and they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Tonyi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tonique with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back with you. Toique wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiki wanted to climb a tree, but all the trees had been cut down. It tell you chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Tiki was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. To shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tik had kept his distance from shooting computer games. Now, he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of to how terrible. [Music] Papa, papa. [Music] [Applause] Bubba papa chug chug chug chug chug chug chug. Chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft key to start. Zip. Be careful bear. We're taking off. Attention [Music] Earth. The astronauts overboard. He's conquering outer space. [Music] >> Hey Bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Meow. Oh. Beep beep. Huh? >> No, bear. Our teeth can wait for that, but great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get battle. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily. >> Like this. [Music] Okay, crocodile. You know what to do now. [Music] Ooh, the gale force is above 10 points. H, it doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] >> Oh, no. Who are you? So, are you the frog princess? Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] >> Yeah, nice storm. [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Huh? Huh? [Music] Hi bear. >> Papa, >> are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Ta. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] >> Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Applause] Here. [Music] Wow, that is very impressive. [Music] Huh? Oh. [Music] Ah. [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today, I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning. After you eat a nice plate of warm porridge, you still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence and strangers who you should never talk to. And yet this boy did not want to sleep. his batteries just wouldn't die. So, he decided to pass the time telling horrifying spooky stories. Stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden he dreamed of a black hand. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed, a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary. You're frightening all the campers with your silly scary tails. Look around. You have scared them all.\" Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets and the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid, but instead he promised to handle the situation. [Music] Woohoo! [Music] Yahoo! [Music] [Applause] [Music] Ah! [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen, huh? [Music] H. Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. languages and words in different but when you're in Spain or Mexico [Music] and they will open any door you'll find yourself in harmony with everyone in Germany. And if you are traveling to France, then you should never miss a chance to be polite and always say [Music] in the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very Making friends who stay in touch of words will help you travel up to North Sea. There is so much world. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored out gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] Look, I'm our team crafty. I'm all buttoned up. [Music] No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, Tiny Wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha! This one's mine. [Music] Have you seen Lisa Mona in the Liver Museum? I pose for that statue. [Applause] Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Ah, [Music] bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can That's nothing. I claw and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty. Whack. Time out. Naughty. Whack. No dessert for you. Naughty and whack. Bear. Dear. I'll behave now. I'll be good. [Music] You know what? Flying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] >> So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Bear, please read a little bit more. Please read some more. [Music] Just one more time. My favorite. Can you [Music] h [Music] See? [Music] Yep. [Music] Who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way. >> And I'm Marshall. >> If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh. [Music] You see him? That's my bear. >> And that's my cat. [Music] >> So, I wonder what brings you around here. >> It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey bear, why don't we patch a book with [Music] [Music] a [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. >> Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. [Music] Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to And there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Toi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tony with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiik wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Ti was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. To shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now, he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of how terrible. [Music] Bubba papa. Woohoo. [Music] [Applause] Bubba papa cha chubby cha cha chubby cha chubby. Chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft key to start. Zip. Be careful, Bear. We're taking off. Attention [Music] Earth. The astronauts overboard. He's conquering outer space. [Music] >> Hey Bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh wow, it's a real Martian. Oh look, it's Martian porridge. Let's try it out. [Music] >> Yeah, you will never find such food on planet Earth. Yum, yum. Oh, beep beep. Huh? >> No, bear. Our teeth can wait for that. But great adventures never do. Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily. Like this. [Music] Okay, crocodile. You know what to do now. [Music] [Applause] [Music] Ooh, the guild force is above 10 points. It doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] Yeah, nice storm. [Applause] [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Huh? [Music] That's right. [Music] Hi bear. >> Papa, >> are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Ta-da. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] >> Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Applause] [Music] >> Here. [Music] Wow, that is very impressive. [Music] [Music] Huh? Oh. [Music] Ah, [Music] [Applause] [Music] bear. Give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass a time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black pant. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tail. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more gas at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! [Music] Woo! Woo! [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? >> We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. [Music] Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different but by learning please and thanks a lot when you're in Spain or Mexico. These words are really fast to know [Music] and they will open any door. You'll find yourself in harmony with everyone in Germany. Just me from early on. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say receive a crew in the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please [Music] know [Music] please and thank you very much who Stay in touch. These very mag. [Music] >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear. Have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored out gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] Look, I'm our team crafty. I'm all buttoned up. [Music] No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Huh? Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. [Music] Ha. And this one's mine. [Music] Have you seen Lisa Mona in the liver museum? I pose for that statue. [Applause] Oh, that's funny. If you post, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Bear, bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can't. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty whack. Time out. Naughty whack. No dessert for you. Naughty and whack. >> There. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Babe, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] Hm. [Music] See? Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail. You know, >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way, >> and I'm Marshall. If you don't let go, then I will freeze you. >> Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear. >> And that's my cat. [Music] So I wonder what brings you around here. It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. >> That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey bear, why don't we patch a book with [Music] [Music] a [Music] [Applause] Oh no. >> Don't panic. I'm now going to cast a spell on you. >> Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell and do. Crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiki. His parents would call and call for him but he would never answer. They shouted to Doll to there was no answer because this boy would spend the whole day morning to night shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as a computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him and they said, \"We got you now. You have tormented us, chased us, and shot us with guns.\" And now, prodigy from the games. We will have you for dinner or something like that. And they started chasing Tony anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tony with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back at you. Toique wanted to hide in the bushes. But you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiq wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. >> It's not true. I didn't do anything. >> It was you. you from morning to night, scaring us and chasing us around because of your actions. Now we have to eat you. >> Tulip was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Tuli shouted. I'll wake up and turn off the power. >> We're having dinner way before that, the monsters cried. We are cooking you and baking you. And then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, to had kept his distance from shooting computer games. Now he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late late at night when the monsters are sleeping they dream of toique. How terrible. [Music] Bubba papa. [Music] [Applause] Papa chug chug chug chug chug chug chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft. Key to start. Zip. Be careful bear. We're taking off. Attention, [Music] Earth. The astronaut's overboard. He's conquering outer space. [Music] Hey Bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] Yum yum yum. >> Yeah. You will never find such food on planet Earth. >> Yum. Yum. Oh, beep beep. Huh? No, Bear. Our teeth can wait for that, but great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. [Music] Oh no, it's going to bite us so hard. Let's get that. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] >> Your teeth will be much better if you brush them daily >> like this. [Music] Okay, crocodile. You know what to do now. [Music] [Applause] [Music] Ooh, the gale force is above 10 points. It doesn't really look like much. >> Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] >> Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the duck boy. [Music] Oh, [Applause] >> yeah. Nice storm. [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Huh? [Music] Hi bear. >> Papa, >> are you playing right now? Hooray! We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Applause] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Come on. [Applause] [Music] That's [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Taa. Open your eyes already. [Music] I see you like it, huh? >> Yeah, it's cool, right? Don't be so sad, Bear. One day you will make something like this for sure. [Music] That's not bad. Now I will race you. Ready, steady, stitch. [Music] Here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] [Applause] here. [Music] [Applause] Wow, that is very impressive. [Music] [Music] Huh? Oh. [Music] Ah. [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! H. [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat. A nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary. full of wolves howling on the other side of the fence and strangers who you should never talk to. And yet this boy did not want to sleep. His batteries just wouldn't die. So he decided to pass a time telling horrifying spooky stories. Stories about a black black hand and white white ghosts. about a door to a dungeon, a coffin on wheels, and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep, and in no time, he was dreaming. All of a sudden, he dreamed of a black pant. He jumped, scared in bed, and looked all around. And to his surprise, coming out from under the bed, the nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed, a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself without a doubt? The boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more gas at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead he promised to handle the situation. [Music] Woohoo! [Music] Woo! Woo! [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? >> We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen, huh? [Music] Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different but when you're in Spain or Mexico these words are really fast to know [Music] and they will Open any door, you'll find yourself in harmony with everyone in Germany. Just memorize from early on. [Music] If you are traveling to France, then you should never miss a chance to be always [Music] in the US and UK in Canada, Australia. Could any You meet at ease by saying thanks and please [Music] know [Music] please and thank you very much [Music] will help Travel any seas up to North Sea. There is so much of world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] >> Ah, where the three bears were painted. So, you are the watercolored um gardeners. Expressionist. Impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our team crafty. I'm all buttoned up. >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha. And this one's mine. [Music] Have you seen Lisa Mona in the Liver Museum? I posed for that statue. Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Bear. Bear. We're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can't. That's nothing. I fought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him, so he is afraid of me. [Music] He can't misbehave with me around. Naughty, whack. Time out. Naughty, whack. No dessert for you. Naughty and whack. There, dear. I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Oops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Bear, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] Hm. [Music] See? Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way. >> And I'm Marsha. >> If you don't let go, then I will freeze you. Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear and that's my cat. [Music] So, I wonder what brings you around here. >> It's all because of the book. [Music] Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey bear, what do we catch a book with? [Music] [Music] Hey [Music] [Music] [Applause] Oh no. >> Don't panic. I'm now going to cast a spell on you. Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh. again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> What is it? [Music] >> Come by again so we can play. I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to Doll toy. And there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Tuli's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Toique. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Tonyi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Toni with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back with you. Toique wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Tiq wanted to climb a tree, but all the trees had been cut down. It tell your fault. You chased us with a chainsaw cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night scaring us and chasing us around because of your actions. Now we have to eat you. Tiki was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Tiki shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tik had kept his distance from shooting computer games. Now, he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of to how terrible. [Music] Papa. Papa. Woohoo. [Music] [Applause] Papa chug chug chug chug chug chug chug. Chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see, this is our spacecraft. Key to start. Zip. Be careful, Bear. We're taking off. Attention [Music] Earth. The astronauts overboard. He's conquering outer space. [Music] >> Hey Bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] >> Yeah. You will never find such food on planet Earth. Yum. Yum. Oh. Beep beep. Huh? >> No, bear. Our teeth can wait for that. But great adventures never do. Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get that. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] Your teeth will be much better if you brush them daily >> like this. [Music] Okay, crocodile. You know what to do now. [Music] Ooh, the guild force is above 10 points. H, it doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] [Applause] Yeah, nice storm. [Music] Oh dear froggy bear. The deck boy wants 30 points. [Music] [Music] Huh? Huh? [Music] Hi bear. >> Papa, >> are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Applause] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Taa. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. [Music] Wo! [Music] Got it. [Music] >> Here. [Music] [Applause] Wow, that is very impressive. [Music] [Music] Huh? Oh. [Music] Ah, [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop! Pop! [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence, and strangers who you should never talk to. And yet, this boy did not want to sleep. His batteries just wouldn't die. So, he decided to pass the time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black hand. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more guests at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! Yep. Woohoo! [Music] Huh? [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You look. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen, huh? [Music] Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different but you can be a polyot by learning please and thanks a lot when you're in Mexico [Music] and they will Open any door, you'll find yourself in harmony with everyone in Germany. Just memorize from early on. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say [Music] in the US and UK in Canada, Australia, put anyone you meet at ease by saying thanks and Great Russian [Music] flowers always and thank you very much. [Music] of words. We'll help you travel any up to North Sea. There is so much of world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] H. You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored out gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our theme crafty. I'm all buttoned up. [Music] >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] >> I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. [Music] Nah, tiny wigwams not for me. Have you seen the pyramid in ancient Egypt? My famous design. Ha. And this one's mine. [Music] Have you seen Lisa Zamona in the Liver Museum? I pose for that statue. Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Bear. Bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can't. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty. Whack. Time out. Naughty whack. No dessert for you. Naughty and whack. >> Bear. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Whoops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Oh, what is happening here? [Music] Bab, please read a little bit more. Please read some more. Just one more time. My favorite. Can you [Music] Hm. [Music] Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail. You know, >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way. >> And I'm Marsha. >> If you don't let go, then I will freeze you. Yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear. And that's my cat. So I wonder what brings you around here. >> It's all because of the book. [Music] Open recroen. Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. >> That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey bear, why don't we catch a book with [Music] [Music] a [Music] [Applause] Oh no. Don't panic. I'm now going to cast a spell on you. >> Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do. Abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell and do crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to And there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Ti's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as the computer, but it could also be very scary. And so he played all day long. But the day came to an end, and the night had finally arrived. It was bedtime for Tiq. He fell asleep, and then he had a horrible nightmare. Terrible monsters from his gadgets visited him. And they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Toi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Tony with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back with you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Toique wanted to climb a tree, but all the trees had been cut down. It's all your fault. You chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Ti was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. To shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tiki had kept his distance from shooting computer games. Now, he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of how terrible. [Music] Papa papa. [Music] [Applause] Bubba papa chubby chubby cha cha cha cha. Chug chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft. Key to start. Zip. Be careful, Bear. We're taking off. [Music] Attention, Earth. The astronaut's overboard. He's conquering outer space. [Music] Hey bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh, wow. It's a real Martian. Oh, look. It's Martian porridge. Let's try it out. [Music] Meow meow meow meow. >> Yeah. You will never find such food on planet Earth. >> Yum. Meow. Oh. Beep beep. Huh? No. Bear. Our teeth can wait for that. But great adventures never do. >> Navigator, come back to the car now. Turbo mode goes on. Zip. Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Music] >> Your teeth will be much better if you brush them daily >> like this. [Music] Okay, crocodile. You know what to do now. [Music] [Applause] [Music] >> Ooh, the gale force is above 10 points. It doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] >> Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the deck boy. [Music] Oh [Applause] yeah, nice storm. [Music] Oh dear Froggy Bear, the deck boy wants 30 points. [Music] [Music] Huh? [Music] Hi bear. >> Papa, >> are you playing right now? Hooray! We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] Help me. [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Come on. [Applause] [Music] That's [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Tada! Open your eyes already. [Music] I see you like it, huh? >> Yeah, it's cool, right? Don't be so sad, Bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch [Music] here. [Music] Wow, not too bad. [Applause] [Music] I can do better. Cool. [Music] Got it. [Music] >> Here. [Music] Wow. That is very impressive. [Music] [Music] Huh? Oh. [Music] Ah! [Applause] [Music] [Applause] [Music] Bear! Give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop pop pop. [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day and not in the night and not even in the morning after you eat a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary. full of wolves howling on the other side of the fence and strangers who you should never talk to. And yet this boy did not want to sleep. His batteries just wouldn't die. So he decided to pass a time telling horrifying spooky stories. Stories about a black black hand and white white ghosts. about a door to a dungeon, a coffin on wheels, and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep, and in no time, he was dreaming. All of a sudden, he dreamed of a black pant. He jumped, scared in bed, and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed, a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and the strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more gas at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead, he promised to handle the situation. [Music] Woohoo! Yep. [Music] Woo! [Music] Yep. [Music] Bear, what's with you? Did you lose something? Oh, something happened. Bear just misplaced his prize winning ticket. [Music] That's where the ticket is. Go and get it. I'll go and try to distract it. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen, huh? [Music] Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. many languages and words in different corners of the world. But you can be a polyot by learning please and thanks a lot when you're in Mexico. These words are really fast to know [Music] and they will open any door. You'll find yourself in harmony with everyone in Germany. Just memorize from early on. [Music] If you are traveling to France, then you should never miss a chance to be polite and always say [Music] in the US and UK in Canada, Australia. Put anyone you meet at ease by saying thanks and please. Great Russian [Music] prettycore. Please and thank you very much. Magical of words. We'll help you travel any seas up to North Sea. There is so much of world to see. >> Oh, but what about your suitcase? We forgot to look there. [Music] [Music] Go Bear, have a safe journey and remember the important words. [Music] Voyaging for a whole month. What a big expedition. I'm much better. I managed to travel around the world in 1 hour. [Music] Shh. Did you know that you can watch our cartoon with no ads? Just subscribe to YouTube Premium. [Music] [Applause] Huh? Huh? You're planning an escape to some far away landscape. [Music] [Applause] Ah, where the three bears were painted. So, you are the watercolored um gardeners. Expressionist impressionist. I'll go with you then. I'm super expressive and extra impressive. [Music] >> Look, I'm our team crafty. I'm all buttoned up. [Music] >> No, don't you dare. You don't even know how strong I am. I am incredibly resilient. [Music] >> I can and I did. I raised the bar so high and won. [Music] And the most amazing thing about me, no matter what I do, I never get tired. Once I walked around the world and back, never even stopped. [Music] You know what I did? Woohoo! Woohoo! Woohoo! Yep. [Music] Something got into my shoes and my feet hurt. I don't know how all these stones managed to get inside. Nah, tiny wigwam's not for me. Have you seen the pyramid in ancient Egypt? My famous design. [Music] Ha. And this one's mine. [Music] Have you seen Lisa Mona in the Liver Museum? I posed for that statue. Oh, that's funny. If you posed, your portrait would end up being a square. Yeah, the black square. And I am an endless source of out and inspiration. [Music] Bear, bear, we're hungry. [Music] We didn't want to. We just did. [Music] You know, I'm such a great cooking chef that I can oven roast a layer cake with marshmallows and mushrooms. And I can't. That's nothing. I brought and watered down much bigger forest fires. What? You're scared of bear? I'm not scared of bear. Not even a little. It is because I'm strict with him. So, he is afraid of me. [Music] He can't misbehave with me around. Naughty. Whack. Time out. Naughty whack. No dessert for you. Naughty and whack. >> There. Dear, I'll behave now. I'll be good. [Music] You know what? Lying is so hard. Well, let's not lie anymore. We should use our great imaginations. [Music] So, have I told you a story of me flying to the moon, riding the cannon? [Music] Now, catch and snatch. Hey, stop. Come back here now. Catch and snatch. Catch and hatch. Come down a notch. Aha. Oops. [Music] Let's go or we'll lose it. Hurry up. It's getting away. There it is. There it is. Let go of me. Come near and reappear. [Music] >> Well, you didn't believe me, but I found it. Now, swirl and swoosh and come to me with a whoosh. No, no, no, no, no, no. Not all of you. Just the purple one. Oh, no. No, no, no. Oh, no. Huh? Oh, what is happening here? [Music] Bear, please read a little bit more. Please read some more. [Music] Just one more time. My favorite. Can you [Music] Hm. [Music] See? Yep. [Music] So, who is it that came to visit us? >> Get your hands off now. That's our tail, you know. >> I won't let go. >> Yeah, well, you should know. I'm a witch, by the way. >> And I'm Marshall. >> If you don't let go, then I will freeze you. Oh >> yeah, right. >> I cast and freeze you fast. Oh, [Music] >> you see him? That's my bear and that's my cat. [Music] So, I wonder what brings you around here. >> It's all because of the book. [Music] Open rec. No, no, no, no. That's not what I meant. I just wanted to say reopen. That was my granny's favorite book of spells. If I don't get it back, my grandma will turn me into a frog instead. >> That's awesome. I also want to be a frog. >> What? Uh, but without the book, I won't be able to since it's croaking. >> No problem. Hey bear, what do we catch a book with? [Music] [Music] Hello. [Music] [Applause] Oh no. >> Don't panic. I'm now going to cast a spell on you. >> Wag your tail and set the sail. [Music] [Music] I told you that I would catch it. Voila. Spell and do abracadoo. [Music] H. Spell and do. Abracadoo. [Music] Spell undo. Crocod. Oh, again. That's not how you uncro the spell on a frog. [Music] You need to read fairy tales. Oh, yeah. And now you'll finally turn me into a frog, won't you? Uh-huh. One sec. [Music] >> Oh, what is it? [Music] come by again so we can play. >> I sure will. I'm Vivy, by the way. So, to turn into a frog, you'll need [Music] >> And now, let's read. [Music] Masha's spooky stories. Listen carefully because I'm about to tell you one of the scariest stories I have ever heard in my entire life about a boy who thought everything was really good. And then suddenly it all turned really bad. Once upon a time there was a very brave boy. His name was Tiik. His parents would call and call for him but he would never answer. They shouted to Doll toy. And there was no answer because this boy would spend the whole day, morning to night, shooting at his computer. Oh. Oh. Um, what I mean is that he was playing shooting games at his computer. At home, he would play on a laptop where he would shoot monsters with all kinds of computer weapons. When his mom and dad took him to visit someone, he would play on a tablet where he would ride a virtual horse and chase monsters while waving a virtual sword and shooting virtual arrows. While he was riding a bus, he would play on his phone, smashing all the monsters he came across. And if all of Tuli's gadgets were taken away from him, he could still pound his calculator. It's certainly not as interesting as a computer. But it could also be very scary. And so he played all day long. But the day came to an end and the night had finally arrived. It was bedtime for Tiik. He fell asleep and then he had a horrible nightmare. Terrible monsters from his gadgets visited him and they said, \"We got you now. You have tormented us, chased us, and shot us with guns. >> And now, Prodigy from the games, we will have you for dinner or something like that. And they started chasing Tonyi anxiously, but he just kept trying to dodge the weapons that were thrown at him. But the monsters were getting closer and closer, shooting at Toi with whatever guns they had. There was nowhere to hide because everything around him was destroyed. Just look at this. It's all your fault. You have destroyed the houses and ruined our home with your explosions. Screamed the monsters. And now it is time to get back with you. To wanted to hide in the bushes, but you can't do that when all the bushes have been burnt to the ground. It's all your fault. You ran after us with a flame torch, burning it all down. Ti wanted to climb a tree, but all the trees had been cut down. It tell you who chased us with a chainsaw, cutting all the trees. It's not true. I didn't do anything. It was you. You from morning to night, scaring us and chasing us around. Because of your actions, now we have to eat you. Tiki was really scared. He thought I need to end this game. How can I get to the main menu? Actually, you will be on the menu today. And soon we're going to eat you. The monster screamed. Hey, wait a second. Toique shouted. I'll wake up and turn off the power. We're having dinner way before that. The monsters cried. We are cooking you and baking you. and then we'll eat you. Toique had nowhere to hide. The monsters had him surrounded from all sides. He sat down and cried. He probably sat down on the escape key. Every game has one. And finally, he woke up. From that day on, Tik had kept his distance from shooting computer games. Now, he prefers different games, the regular ones like hockey, soccer, and even curling. After playing so many games out in the fresh air, it's impossible to have nightmares. He doesn't even dream. He is so tired from running and playing all day that he can hardly crawl to bed. [Music] Well, that's after being barely awake for dinner. And the computer monsters also had the chance to rebuild their home. They repaired and painted their houses, planted trees, bushes, and flowers. Everything looked beautiful. Now they also have time to play soccer all day long. But sometimes late, late at night. When the monsters are sleeping, they dream of to how terrible. [Music] Papa. Papa. Woohoo. [Music] [Applause] Papa chubby chug chug chug chug chug. Chug chug chug chug chug chug chug chug. >> Oh, hi there. Did you see that? I'm a train driver. Choo choo. [Music] [Applause] [Music] [Applause] You see this is our spacecraft key to start. Zip. Be careful bear. We're taking off. Attention, [Music] Earth. The astronaut's overboard. He's conquering outer space. [Music] >> Hey Bear, the spacecraft is not a place to eat porridge. We're on a mission right now. Hey, hop in. Attention space crew. We're approaching planet Mars. [Applause] We are landing. No, it's not like that. We are marsing. [Music] Let's take a good look around. Is there any life on Mars? Oh wow, it's a real Martian. Oh, look, it's Martian porridge. Let's try it out. [Music] >> Yeah, you will never find such food on planet Earth. Yum, yum. Oh, beep beep. [Music] Huh? >> No, bear. Our teeth can wait for that, but great adventures never do. Navigator, come back to the car now. Turbo mode goes on. [Music] Oh no, it's going to bite us so hard. Let's get out. [Music] And why are you not trying to bite us? You're a crocodile. >> Ah, you have a toothache. >> Don't cry. We can help you with that. [Applause] [Music] Your teeth will be much better if you brush them daily >> like this. [Music] >> Okay, crocodile. You know what to do now. [Music] Ooh, the guild force is above 10 points. H, it doesn't really look like much. Hey, dear goldfish, come here. Queen of the seas. [Applause] [Music] Oh, no. Who are you? So, are you the frog princess? >> Dear frog princess, can you storm us 20 points? It's for the duck boy. [Music] [Applause] Yeah, nice storm. [Music] Oh, dear Froggy Bear. The deck boy wants 30 points. [Music] [Music] Huh? Huh? [Music] Hi bear. >> Papa, >> are you playing right now? >> Hooray. We have a new game. [Music] And the prize for the best fisher of the year goes to the bear. [Music] [Music] [Music] Happy morning, Bear. Today is a perfect day for arts and crafts. >> Be quiet. The child is creating. Bear, look. Give me a snack. [Music] Bear. Bear. Come on. The artist is really hungry. [Music] Huh? [Music] Mhm. [Music] [Applause] [Music] You are right on time. Give me a snack. [Music] Bear, look at what I've done. Oh no, don't look. Not yet. Taa. Open your eyes already. [Music] I see you like it, huh? Yeah. It's cool, right? Don't be so sad, Bear. One day you will make something like this for sure. [Music] >> That's not bad. Now I will race you. Ready, steady, stitch. [Music] here. [Music] >> Wow, not too bad. [Applause] [Music] I can do better. [Music] Cool. [Music] Got it. [Music] [Applause] >> Here. [Music] Wow, that is very impressive. [Music] Huh? Oh. [Music] Ah. [Applause] [Music] [Applause] [Music] Bear, give me a snack. [Music] Just kidding. Huh? [Music] Woohoo! Pop. [Music] Just remember, Bear, there can never be too much art in your life. That's right. [Music] Today, I'm going to tell you a very scary story. After I'm done, you won't be able to fall asleep. Not in the day, and not in the night, and not even in the morning after you eat. a nice plate of warm porridge. You still won't be able to sleep. And it all happened at a children's summer camp when a very fun boy arrived. All the children in the camp were having fun. But this boy knew how to have a lot of fun. He spent all day running and jumping around. It was like he received an electric shock. Or maybe he had never any batteries. And later that evening, it was all dark outside. The streets were very quiet and scary, full of wolves howling on the other side of the fence. And strangers who you should never talk to. And yet this boy did not want to sleep. His batteries just wouldn't die. So he decided to pass a time telling horrifying, spooky stories. stories about a black black hand and white white ghosts about a door to a dungeon, a coffin on wheels and ghouls covered in hair. The boy told everyone, all the children, these very scary tales. Then he calmly fell asleep and in no time he was dreaming. All of a sudden, he dreamed of a black pant. He jumped scared in bed and looked all around. And to his surprise, coming out from under the bed was a real black hand. The nails were long, dirty, and uncut. Ew, disgusting. The boy decided to run away from it. But then he stumbled and fell because under the other bed a black leg was sticking out. The boy got up and right in front of him there was a ghost wearing glasses. It was completely white and totally scary. What should he do? Jumping, he went from one bed to the other. He opened the door and went screaming and running away from the body parts. He had decided it was better to take his chances with the wolves and strangers who he should never ever talk to. He was running and screaming through the streets when he was spotted by the headlights of a coffin on wheels. He continued running towards an alley, but the headlights were still chasing him. The boy was terrified. He kept running and screaming. Suddenly, he heard a loud voice coming from the coffin on wheels. Stop. What are you doing? Why aren't you asleep? He's trapped. The boy couldn't escape. With his back against the canteen wall, the boy closed his eyes, thinking everything was over. Now, a vampire will come out from the coffin to suck my blood. But there was no blood sucking. It was a camp counselor's vampire voice that said, \"I'm wondering what are you doing, Mr. Scary? You're frightening all the campers with your silly scary tails. Look around. You have scared them all. Mr. Blackhand climbed under his bed. Mr. Ghost hid his head under the sheets. And the Blackfoot locked himself in the bathroom and is so afraid that no one can make him come out. You have even pulled a joke on me, the director of the whole camp. While I had to chase after you up and down the camp, I ran out of gas. Well, Mr. Scary, aren't you ashamed of yourself? Without a doubt, the boy was ashamed. He was really embarrassed of his behavior. So, he apologized to the boys in his dorm for the scary, creepy things he had said before their bedtime. He also promised to buy more gas at the camp director. Well, he will do that when he gets his first job. But I guess the director didn't believe him because he sighed heavily. First thing in the morning, he called the boy's parents to tell him the horrible story their son had told the others about a black black hand and a coffin on wheels and the horrible trick he had played the night before. For some reason, only his mother was frightened. His dad, on the other hand, was not afraid. But instead he promised to handle the situation. [Music] Woohoo! [Music] Woohoo! Woo! Woo! [Applause] [Music] Bear, what's with you? Did you lose something? [Music] Oh, something happened. Bear just misplaced his prize winning ticket. That's where the ticket is. Go and get it. I'll go and try to distract Bear. [Music] You looked. Did you find it? We will find it if we look together. [Music] [Music] How can you possibly find anything in such a messy place? [Music] [Music] Did we look in the bedroom? [Music] [Applause] [Music] Well, then I guess we'll have to search the kitchen. [Music] H Did we forget something? The broom closet. [Music] Bear, do you know which words are the super most important in the world? Listen carefully and memorize them. There are many languages and words in different corners of the world.",
    "start_time": 0.16,
    "end_time": 39539.756
}