{
    "video_id": "azpZ0AysAZU",
    "channel_url": "@bebefinn",
    "transcript": "[Music] Happy birthday to 100 friends >> surprise. >> Hi Liam. I'm Betta Finn. Happy birthday. >> Happy birthday Liam. Happy birthday. [Music] Happy birthday, dear Liam. Happy birthday, Liam. >> Liam, blow out the candles. 1 2 3. [Music] >> Hi, Olivia. I'm Betta Finn. >> Happy birthday, Olivia. Happy birthday, Olivia. Happy birthday, dear Olivia. Happy birthday, Olivia. >> Olivia, blow out the candles. 1 2 3. >> Yeah. >> Hi, Noah. I'm Da Finn. Congratulations. Happy birthday, Noah. Happy birthday, Noah. Happy birthday, dear Noah. Happy birthday, Noah. >> Noah, blow out the candles. 1 2 3. Yay! >> Hi, Ella. I'm dead. Happy birthday. Happy birthday, Emma. Happy birthday, Emma. Happy birthday, dear Emma. Happy birthday, Emma. Emma, blow out the candles. 1 2 3. Hi Oliver. I'm Ben Finn. Today's your day. Happy birthday Oliver. Happy birthday Oliver. Happy birthday dear Oliver. Happy birthday Oliver. >> Oliver. Blow out the candles. One, two, three. >> Hi, Charlotte. I'm Betta Finn. Congratulations. Happy birthday, Charlotte. Happy birthday, Charlotte. Happy birthday, dear Charlotte. Happy birthday, Charlotte. Charlotte, blow out the candles. 1 2 3. [Music] >> Hi, Eliza. I'm Ben Finn. Happy birthday. >> Happy birthday, Elijah. Happy birthday, Elijah. Happy birthday, dear Elijah. Happy birthday, Elijah. >> Elijah, blow out the candles. 1 2 3. [Music] >> Hi, Amelia. I'm Ben. Today's your day. Happy birthday, Amelia. Happy birthday, Amelia. Happy birthday, dear Amelia. Happy birthday, Amelia. Amelia, blow out the candles. 1 2 3. [Music] Yeah. >> Hi, James. I'm Betta Finn. Congratulations. [Music] Happy birthday, James. Happy birthday, James. Happy birthday, dear J. Happy birthday, J. >> James, blow out the candles. 1 2 3. >> Hi, Ava. I'm Betta Finn. Happy birthday. Happy birthday, Aa. Happy birthday, Aa. Happy birthday, dear AA. Happy birthday, Aa. Aa, blow out the candles. 1 2 3. [Music] >> Hi, William. I'm better. Today's your day. >> Happy birthday, William. Happy birthday, William. Happy birthday, dear William. Happy birthday, William. >> William, blow out the candles. 1 2 3 [Music] Hi Sophia, I'm Ben. Congratulations. >> Happy birthday Sopia. Happy birthday Sopia. >> Happy birthday dear Sopia. Happy birthday Sopia. >> Sopia, blow out the candles. 1 2 3. Yay. Hi Benjamin. I'm Ben Finn. Happy birthday. Happy birthday Benjamin. Happy birthday Benjamin. Happy birthday dear Benjamin. Happy birthday Benjamin. >> Benjamin. Blow out the candles. One, two, three. [Music] >> Hi, Isabella. I'm Betta Finn. Today's your day. >> Happy birthday, Isabella. Happy birthday, Isabella. Happy birthday, dear Isabella. Happy birthday, Isabella. Isabella, blow out the candles. 1 2 3. >> Hi, Lucas. I'm Ben Finn. Congratulations. >> Happy birthday, Lucas. Happy birthday, Lucas. Happy birthday, dear Luc. Happy birthday, Lucas. >> Lucas, blow out the candles. 1 2 3. [Music] >> Hi, Mia. I'm Finn. Happy birthday. Happy birthday, Mia. Happy birthday, Mia. Happy birthday, dear Mia. Happy birthday, Mia. >> Mia, blow out the candles. 1 2 3. >> Hi, Henry. I'm Ben and Finn. Today's your day. >> Happy birthday, Henry. Happy birthday, Henry. Happy birthday, dear Henry. Happy birthday, Henry. >> Henry, blow out the candles. 1 2 3. >> Hi, Evelyn. I'm Betta Finn. Congratulations. Happy birthday, Evelyn. Happy birthday, Evelyn. Happy birthday, dear Evelyn. Happy birthday, Evelyn. Evelyn, blow out the candles. 1 2 3. [Music] >> Hi, Theodore. I'm better at Finn. Happy birthday. Happy birthday, Theodore. Happy birthday, Theodore. >> Happy birthday, dear Theodore. Happy birthday, Theodore. Theodore, blow out the candles. 1 2 3 [Music] Hi Harper. I'm Jenna Finn. Today's your day. >> Happy birthday Harper. Happy birthday Harper. Happy birthday dear Harper. Happy birthday Harper. >> Harper. Blow out the candles. 1 2 3. Yay. Y >> hi Jack I'm better congratulations happy birthday Jack happy birthday Jack happy birthday dear Jack happy birthday Jack blow out the candles One, two, three. Yay. >> Hi, Luna. I'm Ben Finn. Happy birthday. Happy birthday, Luna. Happy birthday, Luna. Happy birthday, dear Luna. Happy birthday, Luna. Luna, blow out the candles. 1 2 3. [Music] >> Hi, Levi. I'm Ben Finn. Today's your day. Happy birthday, Levi. Happy birthday, Levi. Happy birthday, dear Levi. Happy birthday, Levi. >> Levi, blow out the candles. 1 2 3. [Music] >> Hi, Camila. I'm Jenna Finn. Congratulations. >> Happy birthday, Camila. Happy birthday, Camila. Happy birthday, dear Camil. Happy birthday, Camila. Camila, blow out the candles. 1 2 3. Yay. >> Hi, Alexander. I'm Dennis Finn. Happy birthday. Happy birthday, Alexander. Happy birthday, Alexander. Happy birthday, dear Alexander. Happy birthday, Alexander. Alexander, blow out the candles. 1 2 3. [Music] >> Hi, Diana. I'm Denn. Happy birthday, G. Happy birthday, G. Happy birthday to G. Happy birthday, G. >> Giana, blow out the candles. 1 2 3. Yay. [Music] >> Hi, Jackson. I'm Denn. Congratulations. [Music] >> Happy birthday, Jackson. Happy birthday, Jackson. Happy birthday, dear Jackson. Happy birthday, Jackson. >> Jackson, blow out the candles. 1 2 3. Yay. Hi, Elizabeth. I'm Dennis Finn. Happy birthday. >> Happy birthday, Elizabeth. Happy birthday, Elizabeth. Happy birthday, dear Elizabeth. Happy birthday, Elizabeth. >> Elizabeth, blow out the candles. 1 2 3. Yay. Hi, Matteo. I'm Ben. Today's your day. Happy birthday, Mateo. Happy birthday, Mateo. Happy birthday, dear Mateo. Happy birthday, Mateo. Mateo, blow out the candles. One, two, three. Yay. >> Yeah. [Music] >> Hi, Elanor. I'm Denn Finn. Congratulations. Happy birthday, Elanor. Happy birthday, Elanor. Happy birthday, dear Elanor. Happy birthday, Elanor. Eleanor, blow out the candles. 1 2 3. >> Hi, Daniel. I'm Dennis Finn. Happy birthday. Happy birthday, Daniel. Happy birthday, Daniel. Happy birthday, dear Daniel. Happy birthday, Daniel. >> Daniel, blow out the candles. 1 2 3. >> Hi, Ella. I'm Jennif. Today's your day. Happy birthday, Ella. Happy birthday, Ella. Happy birthday, dear Ella. Happy birthday, Ella. Ella, blow out the candles. 1 2 3. [Music] >> Hi, Michael. I'm Dennis Finn. Congratulations. Happy birthday, Michael. Happy birthday, Michael. Happy birthday, dear Michael. Happy birthday, Michael. >> Michael, blow out the candles. 1 2 3. >> Hi, Abigail. I'm Dennis Finn. Happy birthday. Happy birthday, Abigail. Happy birthday, Abigail. Happy birthday, dear Abigail. Happy birthday, Abigail. >> Abigail, blow out the candles. 1 2 3. [Music] >> Hi, Mason. I'm better at Finn. Today's your day. >> Happy birthday, Mason. Happy birthday, Mason. >> Happy birthday, dear Mason. Happy birthday, Mason. Mason, blow out the candles. 1 2 3. Yay. Hi Sophia, I'm dead. Congratulations. >> Happy birthday Sopia. Happy birthday Sopia. Happy birthday dear Sopia. Happy birthday Sopia. >> Sopia, blow out the candles. 1 2 3. Yay. Yay! >> Hi, Sebastian. I'm Dennis Finn. Happy birthday. Happy birthday, Sebastian. Happy birthday, Sebastian. Happy birthday, dear Sebastian. Happy birthday, Sebastian. Sebastian, blow out the candles. One, two, three. Yay. [Music] >> Hi, Avery. I'm Denn. >> Happy birthday, Avery. Happy birthday, Avery. Happy birthday, dear Avery. Happy birthday, Avery. Avery, blow out the candles. 1 2 3. [Music] >> Hi, Ethan. I'm Denn. Congratulations. Happy birthday, Ethan. Happy birthday, Ethan. Happy birthday, dear Ethan. Happy birthday, Ethan. Ethan, blow out the candles. 1 2 3. Yay. >> Hi, Scarlet. I'm Dennis Finn. Happy birthday. >> Happy birthday, Scarlet. Happy birthday, Scarlet. Happy birthday, dear Scarlet. Happy birthday, Scarlet. >> Scarlet, blow out the candles. 1 2 3. >> Hi, Logan. I'm Dennis Finn. Today's your day. >> Happy birthday, Logan. Happy birthday, Logan. Happy birthday, dear Logan. Happy birthday, Logan. >> Logan, blow out the candles. 1 2 3. >> Hi, Emily. I'm Dennis Finn. Congratulations. Happy birthday, Emily. Happy birthday, Emily. Happy birthday, dear Emily. Happy birthday, Emily. >> Emily, blow out the candles. 1 2 3. Yay! >> Hi, Owen. I'm dead. Happy birthday. Happy birthday, Owen. Happy birthday, Owen. >> Happy birthday, dear Oen. Happy birthday, Owen. >> Owen, blow out the candles. 1 2 3 Yow. Hi Ara, I'm Dennis. Today's your day. >> Happy birthday, Ara. Happy birthday, Ara. Happy birthday, dear Ara. Happy birthday, Ara. >> Ara, blow out the candles. 1 2 3. Yay! Y. >> Hi, Samuel. I'm Da. Congratulations. Happy birthday, Samuel. Happy birthday, Samuel. Happy birthday, dear Samuel. Happy birthday, Samuel. Samuel, blow out the candles. One, two, three. Yay. [Music] >> Hi, Penelope. I'm Dennis Finn. Happy birthday. >> Happy birthday, Penelope. Happy birthday, Penelope. Happy birthday, dear Penelope. Happy birthday, Penelope. Penelope, blow out the candles. 1 2 3. [Music] >> Hi, Jacob. I'm Dennis Finn. Today's your day. >> Happy birthday, Jacob. Happy birthday, Jacob. Happy birthday, dear Jacob. Happy birthday, Jacob. >> Jacob, blow out the candles. 1 2 3. Yay! Woohoo! >> Hi, Leila. I'm Dennis Finn. Congratulations. >> Happy birthday, Lea. Happy birthday, Leila. Happy birthday, dear Leila. Happy birthday, Leila. >> Leila, blow out the candles. 1 2 3. Yay. >> Hi, Asher. I'm Dennis Finn. Happy birthday. >> Happy birthday, Asher. Happy birthday, Asher. Happy birthday, dear Asher. Happy birthday, Asher. >> Asher, blow out the candles. 1 2 3. [Music] >> Hi, Chloe. I'm Dennis Finn. Today's your day. Happy birthday, Chloe. Happy birthday, Chloe. Happy birthday, dear Chloe. Happy birthday, Chloe. >> Chloe, blow out the candles. 1 2 3. Yay. >> Hi, John. I'm dead thin. Congratulations. >> Happy birthday, John. Happy birthday, John. >> Happy birthday, dear John. Happy birthday, John. >> John, blow out the candles. 1 2 3. Yay. Woohoo. Hi ma, I'm dead. Happy birthday. >> Happy birthday. Happy birthday na. Happy birthday dear Na. Happy birthday. [Music] Mila, blow out the candles. 1 2 3. Yay. Hi, Joseph. I'm Dennis Finn. Today's your day. >> Happy birthday, Joseph. Happy birthday, Joseph. Happy birthday, dear Joseph. Happy birthday, Joseph. Joseph, blow out the candles. One, two, three. Yay. >> Hi, Nora. I'm Dennis Finn. Congratulations. >> Happy birthday, Nora. Happy birthday, Nora. Happy birthday, dear Nora. Happy birthday, Nora. Nora, blow out the candles. 1 2 3. >> Hi, Wyatt. I'm Dennis Finn. Happy birthday. >> Happy birthday, Wyatt. Happy birthday, Wyatt. >> Happy birthday, dear Wyatt. Happy birthday, Wyatt. >> Wyatt, blow out the candles. 1 2 3. >> Hi, Hazel. I'm Ben. Today's your day. Happy birthday, Hazel. Happy birthday, Hazel. Happy birthday, dear Hazel. Happy birthday, Hazel. >> Hazel, blow out the candles. 1 2 3. Yay. >> Hi, David. I'm Dennis Finn. Congratulations. >> Happy birthday, David. Happy birthday, David. Happy birthday, dear David. Happy birthday, David. >> David, blow out the candles. 1 2 3. [Music] >> Hi, Madison. I'm Dennis Finn. Happy birthday. Happy birthday, Madison. Happy birthday, Madison. Happy birthday, dear Madison. Happy birthday, Madison. >> Madison, blow out the candles. 1 2 3. [Music] >> Hi, Leo. I'm Dennis Finn. Today's your day. Happy birthday, Leo. Happy birthday, Leo. >> Happy birthday, dear Leo. Happy birthday. >> Leo, blow out the candles. 1 2 3. Yay! Hi Ellie, I'm dead in. Congratulations. >> Happy birthday Ellie. Happy birthday Ellie. Happy birthday dear Ellie. Happy birthday Ellie. >> Ellie, blow out the candles. 1 2 3. Yay. Hi, Luke. I'm Ben Finn. Happy birthday. Happy birthday, Lou. Happy birthday, Lou. Happy birthday, dear Lou. Happy birthday, Lou. Lou, blow out the candles. One, two, three. Yay. [Music] >> Hi, Lily. I'm Ben Finn. Happy birthday. >> Happy birthday, Lily. Happy birthday, Lily. Happy birthday, dear Liy. Happy birthday, Liy. Lily, blow out the candles. 1 2 3. [Music] >> Hi, Julian. I'm Betta Finn. Congratulations. >> Happy birthday, Julian. Happy birthday, Julian. Happy birthday, dear Julian. Happy birthday, Julian. >> Julian, blow out the candles. 1 2 3. Yay. >> Hi, Nova. I'm Finn. Happy birthday. Happy birthday, Nova. Happy birthday, Nova. Happy birthday, dear Nova. Happy birthday, Nova. >> Nova, blow out the candles. 1 2 3. >> Hi, Hudson. I'm Betta Finn. Today's your day. >> Happy birthday, Hudson. Happy birthday, Hudson. Happy birthday, dear Hudson. Happy birthday, Hudson. Hudson, blow out the candles. 1 2 3. >> Hi, Isa. I'm Betta Finn. Congratulations. Happy birthday, Isa. Happy birthday, Isa. Happy birthday, dear Isa. Happy birthday, Isa. >> Isa, blow out the candles. 1 2 3. [Music] >> Hi, Grayson. I'm better at Finn. Happy birthday. >> Happy birthday, Grayson. Happy birthday, Grayson. >> Happy birthday, dear Grayson. Happy birthday, Grayson. >> Grayson, blow out the candles. 1 2 3. Yay. Wow. >> Hi, Grace. I'm Betta Finn. Today's your day. Happy birthday, Grace. Happy birthday, Grace. Happy birthday, dear Grace. Happy birthday, Grace. >> Grace, blow out the candles. 1 2 3. Yay. Yay! >> Hi, Matthew. I'm Betta Finn. Congratulations. Happy birthday, Matthew. Happy birthday, Matthew. Happy birthday, dear Matthew. Happy birthday, Matthew. >> Matthew, blow out the candles. One, two, three. [Music] >> Hi, Violet. I'm Dennis Finn. Happy birthday. Happy birthday, Violet. Happy birthday, Violet. Happy birthday, dear Violet. Happy birthday, Violet. Violet, blow out the candles. 1 2 3. [Music] >> Hi, Ezra. I'm Ben Finn. Today's your day. >> Happy birthday, Ezra. Happy birthday, Ezra. Happy birthday, dear Ezra. Happy birthday, Ezra. >> Ezra, blow out the candles. 1 2 3. >> Hi, Aurora. I'm dead in. Congratulations. Happy birthday, Aurora. Happy birthday, Aurora. Happy birthday, dear Aurora. Happy birthday, Aurora. >> Aurora, blow out the candles. 1 2 3. >> Hi, Gabriel. I'm Ben Finn. Happy birthday. Happy birthday, Gabriel. Happy birthday, Gabriel. Happy birthday, dear Gabriel. Happy birthday, Gabriel. >> Gabriel, blow out the candles. 1 2 3. [Music] >> Hi, Riley. I'm Betta Finn. Today's birthday. Happy birthday, Riley. Happy birthday, Riley. Happy birthday, dear Riley. Happy birthday, Riley. >> Riley, blow out the candles. 1 2 3. >> Hi, Carter. I'm better. Congratulations. >> Happy birthday, Carter. Happy birthday, Carter. >> Happy birthday, dear Carter. Happy birthday, Carter. >> Carter, blow out the candles. 1 2 3 [Music] Hi, Zoe. I'm Ben. Happy birthday. >> Happy birthday, Zoe. Happy birthday, Zoe. Happy birthday, dear Zoe. Happy birthday, Zoe. >> Zoe, blow out the candles. 1 2 3. Yay. Hi, Isaac. I'm Ben Finn. Today's your day. Happy birthday, Isaac. Happy birthday, Isaac. Happy birthday, dear Isaac. Happy birthday, Isaac. Isaac, blow out the candles. One, two, three. Yay. [Music] >> Hi, Willow. I'm Betta Finn. Congratulations. Happy birthday, Willow. Happy birthday, Willow. Happy birthday, dear Willow. Happy birthday, Willow. Willow, blow out the candles. 1 2 3. [Music] >> Hi, Jaden. I'm Ben Finn. Happy birthday. >> Happy birthday, Jaden. Happy birthday, Jaden. >> Happy birthday, dear Jaden. Happy birthday, Jaden. >> Jaden, blow out the candles. 1 2 3. >> Hi, Amelia. I'm Betta Finn. Today's your day. Happy birthday, Ameilia. Happy birthday, Ailia. Happy birthday, dear Ameilia. Happy birthday, Amelia. >> Amelia, blow out the candles. 1 2 3. [Music] >> Hi, Luca. I'm Ben Finn. Congratulations. Happy birthday, L. Happy birthday, L. Happy birthday, dear L. Happy birthday, L. >> Luka, blow out the candles. 1 2 3. >> Hi, Stella. I'm Betta Finn. Happy birthday. Happy birthday, Stella. Happy birthday, Stella. Happy birthday, dear Stella. Happy birthday, Stella. >> Stella, blow out the candles. 1 2 3. [Music] >> Hi, Sean. I'm better. Today's your day. >> Happy birthday, Sean. Happy birthday, Sean. >> Happy birthday, dear Sean. Happy birthday, Sean. >> Sean, blow out the candles. 1 2 3 [Music] Hi, I'm Jenna. Congratulations. Happy birthday, Z. Happy birthday, Z. Happy birthday, dear Z. Happy birthday, Z. So, blow out the candles. 1 2 3. Yay. Hi, Finn. I'm better at Finn. Happy birthday. Happy birthday, Finn. Happy birthday, Finn. Happy birthday, dear Ben. Happy birthday, Ben. Ben, blow out the candles. One, two, three. [Music] >> Hi, Victoria. I'm Betta Finn. Today's birthday. >> Happy birthday, Victoria. Happy birthday, Victoria. Happy birthday, dear Victoria. Happy birthday, Victoria. Victoria, blow out the candles. 1 2 3. >> Hi, Lincoln. I'm Ben Finn. Congratulations. Happy birthday, Lincoln. Happy birthday, Lincoln. Happy birthday, dear Lincoln. Happy birthday, Lincoln. >> Lincoln, blow out the candles. 1 2 three. Yay. >> Hi, Hannah. I'm Jenna Finn. Happy birthday. >> Happy birthday, Hannah. Happy birthday, Hannah. Happy birthday, dear Hannah. Happy birthday, Hannah. >> Hannah, blow out the candles. 1 2 3. >> Hi, Tom. I'm Ben Finn. Today's your day. >> Happy birthday, Tom. Happy birthday, Tom. Happy birthday, dear Tom. Happy birthday, Tom. >> Tom, blow out the candles. 1 2 3. >> Hi, Addison. I'm Ben. Congratulations. [Music] Happy birthday, Addison. Happy birthday, Addison. Happy birthday, dear Addison. Happy birthday, Addison. >> Addison, blow out the candles. 1 2 3. >> Hi, Timothy. I'm Dennis Finn. Happy birthday. >> Happy birthday, Timothy. Happy birthday, Timothy. Happy birthday, dear Timothy. Happy birthday, Timothy. >> Timothy, blow out the candles. 1 2 3. Yay. Hi Satie. I'm Jenna Finn. Today's your day. Happy birthday Satie. Happy birthday Satie. Happy birthday dear Sat. Happy birthday Satie. Satie. Blow out the candles. One 2 3 Y. Yeah. >> Yeah. >> Hi, Justin. I'm dead and thin. Congratulations. >> Happy birthday, Justin. Happy birthday, Justin. Happy birthday, dear Justin. Happy birthday, Justin. >> Justin, blow out the candles. One, two, three. Yay. >> Hi Millie. I'm Dennis Finn. Happy birthday. Happy birthday Millie. Happy birthday Milly. Happy birthday dear Milly. Happy birthday Milly. Millie, blow out the candles. 1 2 3. [Music] >> Hi, Will. I'm Dennis Finn. Today's your day. >> Happy birthday, Will. Happy birthday, Will. Happy birthday, dear Will. Happy birthday to you. >> We'll blow out the candles. 1 2 3. Yay. >> Hi Sabrina. I'm Jenna Finn. Congratulations. Happy birthday Sabrina. Happy birthday Sabrina. Happy birthday, dear Sabrina. Happy birthday, Sabrina. >> Sabrina, blow out the candles. 1 2 3. [Music] >> Hi, Harry. I'm Dennis Finn. Happy birthday. Happy birthday, Harry. Happy birthday, Harry. Happy birthday, dear Harry. Happy birthday, Harry. >> Harry, blow out the candles. 1 2 3. [Music] >> Hi, Za. I'm dead. Today her day. >> Happy birthday Zena. Happy birthday Zena. Happy birthday dear Zena. Happy birthday Zena. Zena blow out the candles. 1 2 3. Yeah. Hi Aiden. I'm Dennis Finn. Congratulations. Happy birthday Aiden. Happy birthday Aiden. Happy birthday dear Aiden. Happy birthday Aiden. >> Aiden. Blow out the candles. 1 2 3. Yay. Thank you. >> Hi, Billy. I'm Finn. Happy birthday. Happy birthday, Billy. Happy birthday, Billy. Happy birthday, dear Billy. Happy birthday, Billy. Billy, blow out the candles. One, two, three. Yay. [Music] >> Hit the subscribe button.",
    "start_time": 5.37,
    "end_time": 3251.16
}