{
    "video_id": "TXdGGfCeEb0",
    "channel_url": "@bebefinn",
    "transcript": "[Music] Happy birthday to my friends. >> Surprise. >> Hi Liam, I'm Ben Finn. Happy birthday. Happy birthday, Liam. Happy birthday, Liam. Happy birthday, dear Liam. Happy birthday, Liam. >> Liam, blow out the candles. 1 2 3. [Music] >> Hi, Grace. I'm Jenna Finn. Today's your day. Happy birthday, Grace. Happy birthday, Grace. Happy birthday, dear Grace. Happy birthday, Grace. Grace, blow out the candles. 1 2 3. Yay! Hi, Matthew. I'm Dennis Finn. Congratulations. >> Happy birthday, Matthew. Happy birthday, Matthew. Happy birthday, dear Matthew. Happy birthday, Matthew. >> Matthew, blow out the candles. 1 2 3. Yay. Yay! >> Hi, Violet. I'm Dennis Finn. Happy birthday. Happy birthday, Violet. Happy birthday, Violet. Happy birthday, dear Violet. Happy birthday, Violet. Violet, blow out the candles. One, two, three. >> Yeah. [Music] >> Hi, Ezra. I'm Ben Finn. Today's your day. Happy birthday, Ezra. Happy birthday, Ezra. Happy birthday, dear Ezra. Happy birthday, Ezra. Ezra, blow out the candles. 1 2 3. Yay. >> Hi, Aurora. I'm Jenna Finn. Congratulations. >> Happy birthday, Aurora. Happy birthday, Aurora. Happy birthday, dear Aurora. Happy birthday, Aurora. Aurora, blow out the candles. 1 2 three. Yay. >> Hi, Gabriel. I'm Devon Finn. Happy birthday. Happy birthday, Gabriel. Happy birthday, Gabriel. Happy birthday, dear Gabriel. Happy birthday, Gabriel. >> Gabriel, blow out the candles. 1 2 3. [Music] >> Hi, Riley. I'm Dennis Finn. Today's her day. Happy birthday, Riley. Happy birthday, Riley. Happy birthday, dear Riley. Happy birthday, Riley. >> Riley, blow out the candles. 1 2 3. >> Hi, Carter. I'm Denn. Congratulations. Happy birthday, Carter. Happy birthday, Carter. Happy birthday, dear Carter. Happy birthday, Carter. >> Carter, blow out the candles. 1 2 3. Yay! >> Hi, Zoe. I'm Jenna Finn. Happy birthday. Happy birthday, Zoe. Happy birthday, Zoe. Happy birthday, dear Zoe. Happy birthday, Zoe. Zoe, blow out the candles. 1 2 3 Hi, Isaac. I'm Ben. Today's your day. Happy birthday, Isaac. Happy birthday, Isaac. Happy birthday, dear Isaac. Happy birthday, Isaac. >> Isaac, blow out the candles. 1 2 3 Thank you. >> Yeah. [Music] >> Hi, Willow. I'm Da Finn. Congratulations. Happy birthday, Willow. Happy birthday, Willow. Happy birthday, dear Willow. Happy birthday, Willow. Willow, blow out the candles. One, two, three. Yay. >> Hi, Jaden. I'm Dennis Finn. Happy birthday. >> Happy birthday, Jaden. Happy birthday, Jaden. Happy birthday, dear Jen. Happy birthday, Jen. Jaden, blow out the candles. One, 2, 3. Yay! >> Hi, Amelia. I'm Jenna Finn. Today's your day. Happy birthday, Ameilia. Happy birthday, Ailia. Happy birthday, dear Ailia. Happy birthday, Amelia. Amelia, blow out the candles. 1 2 three. Yay. >> Hi, Luca. I'm dead in. Congratulations. >> Happy birthday, L. Happy birthday, Luga. Happy birthday, dear L. Happy birthday, L. >> Luka, blow out the candles. 1 2 3. >> Hi, Stella. I'm Dennis Finn. Happy birthday. >> Happy birthday, Stella. Happy birthday, Stella. Happy birthday, dear Stella. Happy birthday, Stella. Stella, blow out the candles. 1 2 3. [Music] >> Hi, Sean. I'm Dennis Finn. Today's your day. Happy birthday, Sean. Happy birthday, Sean. Happy birthday, dear Sean. Happy birthday. >> Sean, blow out the candles. 1 2 3. Yay! Hi Zo, I'm Dennis Finn. Congratulations. >> Happy birthday, Zo. Happy birthday, Z. Happy birthday, dear Zo. Happy birthday, Z. Blow out the candles. 1 2 3. Yay. Hi, Finn. I'm better at Finn. Happy birthday. Happy birthday, Finn. Happy birthday, Finn. Happy birthday, dear Ben. Happy birthday, Ben. Ben, blow out the candles. One, two, three. Yay. [Music] >> Hi, Victoria. I'm Dennis Finn. Today's her day. >> Happy birthday, Victoria. Happy birthday, Victoria. Happy birthday, dear Victoria. Happy birthday, Victoria. Victoria, blow out the candles. 1 2 3. >> Hi, Lincoln. I'm Denn. Congratulations. >> Happy birthday, Lincoln. Happy birthday, Lincoln. Happy birthday, dear Lincoln. Happy birthday, Lincoln. >> Lincoln, blow out the candles. 1 2 3. Yay. >> Hi, Hannah. I'm Jenna Finn. Happy birthday. >> Happy birthday, Hannah. Happy birthday, Hannah. Happy birthday, dear Hannah. Happy birthday, Hannah. >> Hannah, blow out the candles. 1 2 3. Yay. >> Hi, Tom. I'm Dennis Finn. Today's your day. >> Happy birthday, Tom. Happy birthday, Tom. Happy birthday, dear Tom. Happy birthday, Tom. >> Tom, blow out the candles. 1 2 3. >> Hi, Addison. I'm Dennis. Congratulations. Happy birthday, Addison. Happy birthday, Addison. Happy birthday, dear Addison. Happy birthday, Addison. >> Addison, blow out the candles. 1 2 3. Yay! [Music] >> Hi, Timothy. I'm Dennis Finn. Happy birthday. >> Happy birthday, Timothy. Happy birthday, Timothy. Happy birthday, dear Timothy. Happy birthday, Timothy. Timothy, blow out the candles. 1 2 3. Yay. Wow. >> Hi Satie. I'm Dennis Finn. Today's your day. >> Happy birthday Satie. Happy birthday Sat. Happy birthday dear baby. Happy birthday baby. Baby blow out the candles. One 2 3. Yay. Yay! Woohoo! >> Hi, Justin. I'm dead and thin. Congratulations. >> Happy birthday, Justin. Happy birthday, Justin. Happy birthday, dear Justin. Happy birthday, Justin. >> Justin, blow out the candles. One, two, three. Yay. >> Hi, Millie. I'm Dennis Finn. Happy birthday. >> Happy birthday, Millie. Happy birthday, Millie. Happy birthday, dear Milly. Happy birthday, Milly. Billy, blow out the candles. 1 2 3. [Music] >> Hi, Will. I'm Dennis Finn. Today's your day. >> Happy birthday, Will. Happy birthday, Will. >> Happy birthday, dear Will. Happy birthday to you. >> We'll blow out the candles. 1 2 3. [Music] >> Hi Sabrina. I'm Dennis. Congratulations. Happy birthday Sabrina. Happy birthday Sabrina. Happy birthday, dear Sabrina. Happy birthday, Sabrina. >> Sabrina, blow out the candles. 1 2 3. Yay. >> Hi, Harry. I'm Dennis Finn. Happy birthday. Happy birthday, Harry. Happy birthday, Harry. Happy birthday, dear. Happy birthday, Harry. >> Harry, blow out the candles. 1 2 3. [Music] >> Hi, Za. I'm Din. Happy birthday. Happy birthday Zena. Happy birthday dear Zena. Happy birthday Zena. >> Zena. Blow out the candles. 1 2 3. Yay. [Music] >> Hi Aiden. I'm dead at thin. Congratulations. Happy birthday, Aiden. Happy birthday, Aiden. >> Happy birthday, dear Aiden. Happy birthday, Aiden. Aiden, blow out the candles. 1 2 3. Yay. Wow. >> Hi, Billy. I'm dead. Happy birthday. >> Happy birthday, Billy. Happy birthday, Billy. Happy birthday, dear Billy. Happy birthday, Billy. >> Billy, blow out the candles. One, 2, 3. Yay. Yay! [Music] Hit the subscribe button.",
    "start_time": 5.37,
    "end_time": 1122.8400000000001
}