{
    "video_id": "ZqHsuM07hXk",
    "channel_url": "@mrbeastgaming",
    "transcript": "Behind me is a fleet of real life police officers. If any of these officers manage to arrest us, they will win $10,000 in cash. But whichever one of us is arrested last wins $100,000 to give our mom. What? Oh, they're not catching me. Server, teleport us to random parts of the map. Cops, arrest us if you want 10 grand. Good luck. Oh, let's go. Let's go. Let's go. We got to sniff him out. Come on. He smells like Beastable. He smells like Fastable. We're coming for you, Jimmy. Oh, Drake. We were teleported together. Oh, what? What are you? Who are you? I got to find a good spot here to hide from the cops in plain sight. Maybe I just joined this group. Nolan, play it cool. I'm not meant for jail. Boys, there's one final rule I didn't tell any of you about. All your locations just got pinged on the map. Oh no. Oh, I was crying, dude. Yeah, Drake, I would find a new spot and pronto. Oh, they're coming. Timmy, it's ping. It's over here. He's at the airport. We got one at the airport. I think I got one that just left in this vehicle right here. Oh, one of them is on to me. No, I'm right. I'm on it. It's definitely one of them. A black SUV going to Great Ocean Highway. No, they're on to me. How did I get caught so quickly? All right, this ping is going to make it way harder on me and the boys to not get arrested. Why would you ping me, Jimmy? Black SUV in pursuit, boys. Oh my gosh. Oh, he split. He flipped. I'm flip. Dude, they're after me. I need to get out of here. I need to find this faster car. Bro, the cops are driving right past me and don't even recognize me. Hey, you're welcome for the distraction, Jimmy. They don't Oh, I think one's on to me. I think one's on to me. Oh, they're shooting. I think I'm supposed to run. All right, I'm running. I'm running out of fear. Oh, the cops are running into each other, bro. They don't recognize that I'm not an NPC. Going for garage. Going for garage. Red garage. They pinged somebody here. Going to second floor now. I'm going to second floor. They're circling in on us. We got to get out of here. I have an escape route I made. Let's do this. Oh, you missed. Ready? We're getting out of here. Go. Come on, moped gang. Out, bro. There's three cops behind me. Bro, does this cop suspect me? Oh, I think I got one. Maybe. Oh my gosh. They think it's him. They think it's that guy. We saying that wasn't it. All right. Hey, no worries. No worries. Dude, I'm going to steal this cop car. They won't suspect a thing. I'm so nervous. All right, I'm going for it. Dude, I'm actually so nervous. Dude, I stole the cop car. I think I just made the craziest play ever. Jailer, I'm coming to you. Dude, I I stole a cop car. That's genius, dude. My heart's racing, dude. I just drove past the cop. If you look at your mini map, boys, you'll notice a zone that is shrinking every second. And if you step outside the zone, you'll be pinged permanently on the cops maps until you get back in the zone. Hey, uh why are we on the edge of the zone, Jimmy? I don't know. I think this is one of the I think this is one of them. I don't know. I'm I'm in a gunfight. Get me out of here. I got one I got one on me. He's driving a black purse. I I'm in a gunfight. No. Oh, Jimmy, I got to drive by you. I'm sorry. Wait, Chandler, help me. Jimmy, get in the car. Drive. Drive. Okay. Oh, I'm losing so much health. Ah. All right. I I managed to get in a cop car. Maybe I can blend in with them. All right. I'm taking this car. Finally. I'm losing them. I am literally stopped at a red light like a normal citizen. Okay. It's green. It's green. It's green. All right. Good. Good. Good. Good. Good. Hey guys, remember stop at the lights. Dude, I'm in a cop car. It doesn't matter what I'm doing. I think that's them right in front of you. It's a cop car. Someone cop car. Ow. Ow. Ow. Yeah, I got him. Go, go, go, go, go. Pinch it. Pinch it. Oh my gosh. No. I'm surrounded. I'm right behind Jimmy. I'm by a thousand cops right now. Yeah, they're all over me. Oh, there is a shoot out here. Got him pinned in. I'm getting him pinned in. Oh, he is lit up. I I hit him. I hit him. I hit him. I hit him. Get that tang. Get that. Yeah, I need to get out of here. Get away from me. Oh my gosh. Get me out of here. He's running away. He's running away. I'm fighting off so many cops. Get back here. Oh man, I've lost half my health so far. All right. How do I get out of here? How do I get out of here? All right. All right. Oh my god. I think I might make an escape. Let's go, Jimmy. Oh, I got away. I got away from the cops. Oh no, I'm losing a lot of HP. Dude, I'm surrounded, boys. Yo, me and Carl are chilling right now. I see cops all over the place. Oh, cops are zooming past me. They have no idea. Oh, there goes a cop. Yeah, hit that left seat. Behind us. Behind us. There's a cop behind us. I got one on a motorcycle in Legion Square. They're on us right now, Carl. Oh, no. No more motorcycles. No more motorcycles. I won't. Stop resisting. Stop resisting. I'm out of here. Oh my god. I have a cop in my back seat. I'm in the car with him, Sheriff. Yeah, I'm beh I'm behind you. I'm getting back in the motorcycle, dude. I'm getting out of here. All right. How's everyone doing? Oh, I'm living. I have probably a thousand gunshots in my back. Get off of me. I'm at the parking garage where we started. I can't even hear you right now. Nolan, we got to come back together, dude. I need your help. I got a fast car. I'm coming to you, buddy. I'm going to come save you. Please come help me. I'm not in the fastest of cars. Okay. Okay. Box him in. Box him in. Hell yeah, dude. Are you in the road above or below, Carl? Nolan, I can't hear you. I'm getting destroyed right now. I got Carl, boys. Get him, Rooster. Go. I got him in the car. No, we lost Carl. Yeah, I lost. Dude, I couldn't catch a break out there. Oh, wait. They just pinged us. No, I just escaped. Dude, I'm going to the shop, Jimmy. I need to change my disguise. Hey sir, sorry. I need to borrow this car ASAP. I need to get out of here. Oh no. I got to leave this place. There's cops all over the place. Guys, I successfully changed my outfit and I'm on a phone call, baby. Oh, dude. I'm just going to get in a fire truck. Boys, do you love your mom or not? I love her. Then don't get arrested. I won't. I won't. Jimmy, no. No, no, no, no, no. The cop is behind me. Oh, he's on to me. No, no, no. All right, stop at the light. Relax. Oh, they're on to me. Go, go, go, go, go. I'm just little old Beverly. Leave me alone. You better not be dying already. Help me. There's so many cops. No. Golf course female. Help me. Where do you find this many cops? Jimmy, give me a hand. Give me a hand. Get away from me. This is for my mom. No. Oh, hey, one's down. They're surrounding me. I can't get out of it. I'm under a car. I'm under a cop car. I can't get out. Oh, I got in a car. Yes. So long, suckers. Oh my gosh. I don't know how I escaped that. I'm in the fire truck and I'm spraying water. I'm spraying water on the cop. That's it, buddy. Oh my. On top of fire truck, white male, black pants, gray, and blue top. Who wants it? Who wants it, baby? Oh, don't be. I'm out shooting the police. What's up, boys? Where are you? Where you boys at? I'm trying to hang out. I'm stuck in a parking lot trying to get out through the gate. I got to get out of here. Nolan. Hi, Nolan. Yeah, I'm not doing well, Jimmy. I'm helping the cops hunt you down, Nolan. I'm one of them. Yeah, and I don't appreciate it. Guys, look. There's a Nolan over here. Dude, I wish I could tell them. I can't believe you're doing that. Oh my god. Oh my god. Oh my god. I don't know where to go. Oh, it's the pier. I'm going to go act like I'm just a normal human being. There is literally a million cops here. Oh god, guys. I'm screwed. No. Let's go. Box him in. Mox him in. They're shooting me while I'm on the ground. Chandler, stay in it. I'm going upstairs. I got to get to the roof. It's for my mom. Going up. He's going up. Upstairs. Upstairs. Upstairs. Upstairs. Going after him. We got to get some rest. I'm coming up on one of the boys. Give me help. Oh, it's Chandler. Hey, Chandler. Chandler, what are we doing up here? I'm taking cover on the roof. Hey, Chandler, guard the stairs. You guard those stairs. I'll guard these. Where's Jimmy? Where's Timmy? I got a proposition for you. Don't shoot. Just tell me where Jimmy is. I'm out shooting the police. What's up? Just tell me where Jimmy is and I'll let you go. You're a farm in these guilds. No, he got me. You're still on top of the movie set. Oh, dude. I jumped from roof to roof. I'm a beast. Oh, I fell. Oh. Oh, I actually fell all the way to the bottom. Oh, I'm about to die. I'm about to die. Jimmy, I jumped from building to building. I'm out of there. Dude, I got to hit a clothing shop. All right, I'm hiding in a trailer. Inside the submarine. Inside the submarine. Guys, I need help. I need help. Dude, I'm going to act like I'm on the phone. Just a normal dude at the pier on my phone. Guys, I need help. Help. Help. Help. Help. Just a normal guy on my phone. Nothing to see here. Someone help me. Someone help me. Someone help me. All right, Jaylor. I'm out. I'm in. I'm in a car with him. Oh no. Oh, I'm about to die. I'm about to die. Hey, he's in a cop car going south out of the movie theater. Jaylen, we're on the edge of the zone. I know. I need to hit a clothing shop, though. Dude, I'm outside the zone. They can see exactly where I'm at. I got a ping at the pier. One's at the pier. He's pinging live right now in front of me. Screw it. I'm jumping in the ocean. Oh my gosh, the zone is still shrinking. This is tough. Okay, stop at a red light. Act cool. Oh, I think my car broke. Yes, I took his cop car. I can't believe I'm alive. Oh, I thought I was a goner. Oh, I'm about to die. I'm about to die. I'm about to die. No. No. He's down. He's down. Get you in cuffs, buddy. I think I got Jimmy. No, that's 10 grand. College bills are getting paid, friends. I'm pinged. Oh no, I'm pinged again. All right, I got to change clothes. I got to change clothes. All right, who do I want to be? Who do I want to be? Oh, I could be a cop. Oh my god, guys. I am literally an undercover cop. That's genius. This where a ping was here. He's changing his clothes. Chandler, lock in. You can win. Oh god. Oh, there we go. Save. I This guy just switched to a cop. I'm changing my clothes. You didn't fall for it. Wait, what? They didn't let me change. Oh, this is brutal. Hey, Chandler, where are you? I'm by the clothing shop. I'm by the clothing shop. No. Which one? There's so many. Dude, I can't even get up. They're just beating me. I'm done. Let's go. Yes. Oh, I'm done. I got arrested. No, Jailer. Tariq, it's down to me and you, buddy. Is it me being Nolan? Tariq versus Nolan. Last seen arrested. Wins their mom $100,000. All right. Act cool. Act cool. I'm so close to victory. I'm so close to victory. I just got to stop at these red lights. T. You might end up winning. This might be it for Nolan. No, I'm just going to run. I'm just going to run. I'm just stopped at a red light. I can't believe I'm going to win this. Yeah. Hey, D. Come over to me, bro. I'm good. Thanks, bro. Hey, I'm going to win this for my mother. I'm dead, guys. I can't even get up. This is it. I got him. Go, go, go. I'm dead. He got me. Let's go. I think you should FaceTime your mom and let her know she won 100 grand. You want to use my phone? She'll answer. Don't ask how, but I just won you $100,000. Oh my god. Thank you. Thank you.",
    "start_time": 0.16,
    "end_time": 739.88
}