{
    "video_id": "jEG8wuUE1pY",
    "channel_url": "@mrbeastgaming",
    "transcript": "I paid the best builders in Minecraft to build some of the coolest things you have ever seen and to hide secret rooms inside for us to try to find. Starting with this $1 dirt hut. Let's go check it out. >> Come on, >> Jelly Pop. >> Yo, how you doing? >> You uh built this $1 dirt hut. >> It is my true Pride and Joy right here. >> So, we got to find this secret room. Let's go find it. I wonder if this secret room is under this trap door. Wow. Predictable. Find the green wool and break it. So, we have some hints here. Huh. The green wool's over here. Oh, another secret room. Oh, okay. Now, the actual secret room. >> This is crazy. >> This is pretty cool for a $1 build. >> That's why you can never judge a book by its cover. >> Where does this lead? >> Another elevator. >> We're just to the outside world. I want you to judge these builds fairly because the one with the highest rating at the end of this video will get an extra 10 grand in cash. >> What? 10,000? >> Chandler, what do you rate our secret room? >> I give it a five. That's very generous. I was going to give it a 3.5. >> Truthfully, it wasn't so secret. I got to give it a three. >> Thanks for coming over, >> Jelly. That gives you a final score of 11.5. Next, we have the $100 castle again with a secret room. Diego. >> Hey, everyone. >> How do we get in? >> Oh, there's a button right here. >> Oh. >> Oh, wa. That was crazy. >> All right. This build's off to a really cool start. >> This place is insanely huge. How are we going to find the secret room? >> Yeah, it's very large. >> Wait, what what happens in here? >> Oh. Oh, we're going up. >> What's at the top? >> Wo. >> Wo. >> We cannot find the secret room. What is this castle? Oh, where's the smoke coming from? You're very close to it. Start to open door. What door is he talking about? Did we miss one? What is this? Little roller coaster to the secret room. >> Wa! >> I'm in. Wait, don't leave me. >> Oh, dude. This is sick. >> I hate roller coasters. >> Wait, this is going so fast. We're going through the whole castle. Where are we now? >> Dude, where is this taking us? Wait, we just came back to where we started. >> Oh, the roller coaster opened the secret door. >> I see something here. Is it up here? >> Oh, I found it. Oh, wait. The fireworks are going off. It's even got a Mr. Beast Panther. I've seen what I need to see. It's time to rate the $100 build. I'll go first. This secret room was way better than the dirt hunt. I'm going to give it a 6 and 1/2. That's a high score. I think the secret room itself was lacking, but everything leading up to it was pretty cool. I'm just going to give it a six. >> Okay. 12.5. I guess I'm going to have to tag along. I love the architecture. I'm going to give this a six. >> Wo. 18.5. >> I hope I got a good score. Let's find out. Next build. Now we are at the $500 mountain secret base. Ducky, how's it going? >> It's good. Wait, Chan's already exploring. Come on. >> All right, we have entered. Sure. Jimmyth the fifth. What happens when I hit this? No way. This is the secret room. This is too easy. That wasn't very secret. >> No, there's no way. Wait, what's in these chests? There's mine carts in here. >> Here, I'm going. Boys, it was nice knowing you. Ooh, wait a minute. These are like prison cells. The throne room. >> Look at all these fish. >> Oh, the bedroom. Wait. Oh, a secret library. >> Wait, wait, wait, wait, wait. Guys, come back here. Come back here. There's a secret door in this bookcase. >> Wait, how do you know? >> Right here. Run through. Run through. Run through. >> Wo. >> Wo. Look at this. >> Now, this is crazy. Look at the beast logo right there. Look at the ceiling. This is what I'm talking about. Could you imagine having to build this in survival? >> It would take a very long time. Uh, did you see the book? >> Chapter one, the calling of the beast. In the beginning, the algorithm moved across the face of the internet. All right. >> Yeah. >> Over here. Button. >> Taylor, we're in the secret room. >> Okay. It says do not press. >> Then don't press it. >> I'm not going to press it. >> You literally hit it. >> Run. >> Taylor. >> Wait. No. It's another secret room. >> Wait. I told you not to press it. Enjoy the next 100 days. Ah, cuz I trapped people in a bunker for 100 days. This is a recreation of our video. This is crazy. This is the vault with the money. No way. >> Ducky, is that 100 days and bunker video that you created? Is that your favorite video? >> Definitely. >> She liked the bunker video over your video. Called this out, M. >> Can't believe you. You know what? I'm going to have to give you a 0.5 out of 10. >> Match, you can't bring favoritism into the rating. >> You're right. A 6 and a half. I I really did enjoy it. >> Ducky, I rate this build a seven. Here's the thing. I think the secret room is very cool, but to be honest, it wasn't that hard to find. That does negatively affect the score. I'm going to have to give you a six. >> I appreciate it. >> Your final score is 19.5, putting you currently in the lead for $10,000. >> Really? >> Congratulations. >> All right, let's go to the $1,000 pyramid. >> Rob. >> Rob got hacked. >> Rob, why'd you get hacked? >> Um, I lost my account. >> Got banned for hacking, huh? Maybe I should lead the way here. Hey, Chandler. Remember the tour guide we had in the pyramids? >> Yeah, Dr. Zahi. >> Today I'm your tour guide, Dr. Zahi. Welcome to the Great Pyramid of Minecraft. >> You're way too good at this. >> Today, we are trying to find a secret room. >> Dr. Zahi, what's this? What's this? Dr. Z, >> this >> Why did the Egyptians put a lever right here? >> Oh, wait. We need to turn all three lights on. >> There's another lever over here. I press it. Oh, I found the last one. Wait, so what happens when I flick this? >> I fell. >> Now we are in the next layer of the pyramid. >> Wait, there's four buttons in this tomb. >> Oh, this is a tomb of the puzzle. Wo! >> Oh, we we have found the diamonds. >> Wait, wait, wait. Don't go. Don't go. Don't go. It might be a trap, >> bro. We went in the pyramids. There were no booby traps. Chill. Me and Chandler know what we're doing. >> Come on. I mean, look at me. I'm all up in here on these diamonds. >> Hey, Chandler. Remember in the real pyramids where they built fake tunnels to divert you from the tomb? >> That's true. might be doing that here for $1,000. I thought this would be a little more. You know, >> we got to be missing something, right, >> Rob? Is this a secret room or is there more to it? >> Yeah, this was a secret room. >> We found it pretty quickly. You know, it wasn't that secret. All right, Rob. This pyramid from the outside is very beautiful. I'll give it a 6.6 out of 10. >> Oh, I'll take that. >> Some of the secret rooms are a little better, so I'm going to have to give you a six. >> Badge. Are you going to be the dagger or are you going to help him? Raph, listen. As much as I would love to help you, I have to be brutally honest. We were looking for secret rooms. The outside's beautiful. I'm going to have to give you a 5.5. >> Oh my god. Rap is not in the lead. >> I'm so I'm so sorry. >> I guess I've learned it's not always just about aesthetics. >> Sometimes it's about the secret room. Let's go to the next build. I paid $2,500 for a volcano secret base. Wo. Hey man, how's it going? This is a pretty sick little island house. I could live here. Chandler, why didn't you build a house like this on the island you want? I was 19 years old. I knew nothing. Dang, look at this car right here. I think I had an island before I had a car. Okay, I'm loving the house. But obviously the secret room's in the volcano. So, we got to go. We'll be climbing up the mountain where we come. Oh, what is this? >> Oh, right here. Right here. >> There we go. >> We're in the volcano. >> Wo! >> There's a rocket in here. >> Wait, that's a Fastable rocket. Ah, that's sick. Sprint two, I see this giant Fastables rocket and I just wanted to know what is this map here. Wait, wait, hold up, hold up, hold up. Are these torches located where Hershey offices are? Guys, I love Fastables. I love what it stands for, but the answer to our problems is not to build a Minecraft rocket pointed at other chocolate companies HQs. >> Oh, this map locations that do not have any festivals in the areas. >> Oh, it's a delivery rocket. Oh, see I thought you were trying to threaten other chocolate companies with a giant missile. >> Oh, and this is a pallet of beast. >> One more thing. Did you notice when you fly up in the sky the shape of the island? >> No. What is it? >> Oh. >> Oh, that's sick. It's the beast logo. >> Mad Chandler, I don't know about you guys. I'm ready to vote. >> I am ready. I have my number. >> That secret room was hard to find. So, that's a point. The fact that you made a Fastables rocket, that also really moved me. You're talking about Feastables, not because you're trying to get my votes, but because it ethically sources it's cacao and it's the best tasting chocolate. Am I right? >> Oh, yeah. For sure. You're going to get the highest rating I've given so far. Completely unbiased. I'm going to give you an 8 out of 10. >> I was going to give you an 8 out of 10 as well. >> Wo! Spritzer, we've been pretty firm on our ratings. I'll say that. You know what? I'm going to give you an eight. >> Come, let's go. You are now in the lead with only three builds remaining. Ah, no way. Now, the $5,000 build with a hidden secret layer. X90. Hello. You built this all by hand, dude. Took me like a full week. >> All right, boys. We got to find the secret passage. >> Ooh, a book. What does this say? All right, the book's empty. >> Bro, this looks suspicious right here. Maybe I should go to this pressure plate. Oh, wait. There's like a chest down here. Oh, yeah. >> Super secret button. Oh, so we got to place it down somewhere. Right here. Right in front of you. You're right. It did nothing. Maybe it goes over here on this red cube. Okay, let's see. Go ahead and hit it. >> Wa! Jimmy! No! >> Wa! >> No way, bro. This is crazy. This is insane. >> This is my secret villain base. >> This is Doof and Smur's layer. If he was actually a good evil villain, it's huge, bro. Where do we even go first? All right, let's check out whatever this thing is. A little mech robot. Oh, transportation. This is really cool. Oh, he got tanks. Oh, dude. There's freaking mechs everywhere. Wait, look at the beast logo. >> Oh, yeah. This looks insane. >> You built this by hand. You didn't use any modding tools? >> No. All night, dude. I stayed up hours and hours. >> Wait, wait. Come, come back to the center. Look at this. Like, just horns all over. Come up here. Are these hands? Are they hands? >> Yeah. What the heck, bro? That is crazy. If you come right up here, there is the master bedroom. the master bedroom overseeing all the secret evil stuff going on. >> And there is one last secret room. Press this button right here. >> There's a secret room in the secret room. Wo. Oh, this is for my armor. I mean, bro, I've never seen anything like that in Minecraft. I've seen all I need to see. X90. This is one of the best builds I've ever seen. And I'm going to have to give it a nine. And I don't give those out. That's pretty tough. I'm not going to lie. X90. I've played Minecraft for a very long time. This is the craziest thing I've ever seen in Minecraft. I'm going to have to give you an 8.5. >> 8.5? Wo! These are two very high numbers. All right, Jimmy, I'm going to be honest. The hidden chest was very creative. The fact that you built this by hand is very impressive. I will say I do think that is the best secret room so far. I'm going to give you a 7.5. You're in first. Congrats. >> Yeah, I'm happy with that. 90. If I was you, I would pray the next two builds suck. Let's go to the $10,000 build. Wo! What? This is insane. The dragon looks sick, bro. There's bubbles. Look at the jellyfish. Drago, do you have a microphone? Drago, I paid you $10,000 for this build and you don't have a microphone. XD, thank you. If I was a secret room underwater, where would I be? Wait, it's got to be in the mouth. The mouth is the entrance for sure. I found it. I found it. >> Wait, did you really find it? Oo. >> All right, let's get in here. >> It's gone. It's got It's got >> all the way down to the bowels of the keeper. >> What are we looking at, bro? It's so dark in here. What block is this? >> Enjoy the feast. I mean, is this supposed to be a festival's bar? >> I don't know. It doesn't look like one. >> I don't get it. That was abysmal. Let's go up. Let's go to the tail. H. Interesting. Wo. Down right in front of the table. Why is the arrow pointing left? Wo! Here it is. >> Wait, what's inside? Congrats, you found me. It's cozy here, isn't it? What the Hey, sorry. You scared me. Wait, there might actually be a door here. This kind of looks like an entrance. No way. This was hard to find. Passageway to somewhere mysterious. Okay, somewhere mysterious. Wa. Okay, look at that. He's holding the world. The giant Mr. Beast Panther. That is cool. Oh, what's up here? My skin's up here. Okay, that's sick. There's got to be something here. What's this on me? Beyond me, gentlemen. I'm here. Secret room went down even further. Okay. Okay. Okay. Jimmy's personal quarters. What's in here? Oh, the golden shower. Ooh, a bed. Okay. Cute little secret room. Wait, I hear something crazy. When I start hearing crazy things, that's when you know it's real. Right here. This is the colorful fish. >> Oh, I see it right here. >> Oh, wow. >> Dude, no way. >> Yo, >> okay, that's sick. Wait, what's welcome? Mama M. No way. >> Get that out of my face. Get out of here. All right, we found all the secret rooms, boys. Let's raid his build. I'm going to be the first to give you a rating here. The outside is beautiful. It's majestic and it's huge. But the inside secret rooms were lacking for that. It did take away some points. I'm going to have to give you 7.5. Wow. Chandler with the 7.5. What does match give him? Drago, this build is crazy, but the theme was secret rooms. And I'm going to have to piggyback off what Chan said. Secret rooms were kind of lacking. They were hard to find, but weren't very interesting. I'm going to have to give you a 7.5. Another 7.5. That puts him at 15. Meaning even if I gave him a 10, he would not be in the lead. He'd be tied for the lead. Drago, I'm sorry, but this is not a 10 out of 10 build. I'm going to give this a 6.5. Sorry, Drago, but uh you did not win the extra 10 grand. Let's go to the final $25,000 build. Sendus, how you doing? >> Hello, guys. >> Show me around. >> Okay, so here's the hint for the secret rooms. >> Okay, let's see here. >> Can you find all five secret rooms in this map? Read book first. I have the book. Chad, what does the book say? Hint for the rooms. Four are hidden deep in the bunker. The last one. Try checking above. >> Right here. >> Hidden room number one. >> It's one of your latest video, you know. >> A, that's cute. >> Let's move on. >> Let's go into space. Oh, I'm floating. Wo! This is actually insane. >> How did you do this all in 12 hours? >> Wait, look to your right. >> There's got to be a secret room over here. This is just a totally normal button with no function. Wait. Woah. Woah. Woah. Woah. Woah. Look. So, the button did have a function. >> Wo. This is sick. >> Jeez. Look at this shrine, dude. >> What's the upstairs like? >> I'm liking it. The upstairs is pretty sick. Is there a hidden room in here? Oh, wow. Every minute someone is eliminated. Oh, so these are all around our videos. Let's go to the next room. >> What's on that sign? Oh, hidden room. I swear Sinduce is lying because there's something right here. Last loose circle wins 500k. >> Oo, wait. I was in that video. I was in that video. Where's the next secret room? >> Oh, I found it. No way. What? How'd you get there? >> Oh, behind the painting. Ah, Squid Game in real life. Okay, another video. >> Wait, I was in Squid Games, too. Let's go. Two for two. >> All right, let's go back outside. >> I did the I did the pillars of creation. >> This is the pillars of creation for what? >> Wo, that's cool. The outside of this base is amazing. >> No way. >> Now, let's see who is going to win $10,000 in cash. Server, bring in the build of the evil secret layer currently leading with 25 points. All right, do you think he beats your score of 25 points? I hope not, dude. I need this. Let's get to rating. >> All right, Sinduce, you had a great build. It's pretty creative. You know, we're in space, which I like. I like the secret space bunker. I mean, for $25,000, this is pretty crazy. >> I do think this build was amazing, but I don't think it was better than the 5K build, so I'm going to have to give this one this seven. >> Chandler, you gave it a seven. >> I'm feeling great about it. >> Good news. Not going to lie, we're in space and there were beastables, but it wasn't enough to sway me to a8. So, I'm going to have to give you a 6.5. Even if I gave you a 10, you still won't win the 10 grand. >> 90. You want 10 grand? No way. That's 90. Let's go. >> Let's go. You're joking. >> Hey, congrats, dude. >> Congrats on the money. Subscribe, guys.",
    "start_time": 0.16,
    "end_time": 975.32
}