{
    "video_id": "xiFsAjUDwdU",
    "channel_url": "@mrbeastgaming",
    "transcript": "These seven contestants\nare currently racing to see which one of them\nwill win a brand new Lamborghini. Let's go! Y’all don’t want it\nas bad as I do! We have six special\nGTA races planned. Whoever places last loses a chance\nto win this Lamborghini. Oh, I'm spinning! Oh my God! No, no! Oh! I'm coming back. Oh my God. Yo, they\nspinnin’ me out. You're currently in last. I'm ‘bout to come back, aye. I don't lose, man.\nI don't lose. Wait, you’re second to last. If he passes you,\nyou lose the Lambo. Don't worry about—\nI'm not gonna lose! Oh, he just passed you. He did?! No! You're in first! Of course I'm in first!\nI’m that dude! Yo, I see you, Jefe! Oh my God. We’re sliding,\nwe’re sliding… Yeah, Vadriss.\nYeah, spin out, Vadriss. Oh my God, I’m last! Whatever you do,\ndon't crash. I'm on the wall! Yo, get out of the way, Flack! No, Flack! Oh, everybody spinnin’ out. Oh, yeah.\nThis is my race. Let’s go! Hype me up, man. Second place, man.\nLet’s go! Oh my God! No, no! I locked in.\nThird place, baby! Fourth, I’m fourth.\nAll right. I’m gonna lose! Oh my God, let's go.\nOh my God. Oh my God,\nI just lost. No! Oh my gosh. - Can I leave?\n- Yeah, well, you kind of have to. Bye, everyone! We don't need this anymore. You guys ready for\nthe next race? Whoever comes in last\nwill be eliminated. Start it! Immediately knocked off! Come on! If they get knocked off the map,\nthey just restart at the front. I'm good—\nNo! This is the most\nfrustrating thing. Crazy idea: Dodge the hammer. Back it up.\nWe need some speed. All right.\nWell, I give up. Slow and steady\nwins the race! This is so hard.\nIt is so hard. No one has finished. This is not goin' well, Jimmy.\nIt's not goin' well. If you guys are struggling on this one,\nlater in this video, it's gonna get crazy. Slow and steady. No! What am I doing? You all seem to be struggling.\nSlow down the hammers a little bit. Thank you, Jimmy. Oh, you might\nmake it first. Oh, yeah! All right, Green,\nyou're in the lead. Green, you’re almost done! That's me! All right, we have\nour first finisher! Oh, no.\nJefe, my opp! My opp made it,\nI gotta make it. Dodge the hammers!\nDodge ‘em! Nolan! They're in the middle of a race. I’m pretty far up. No! I was all the way\nat the end. This race can determine if you win\n$200,000 worth of a Lamborghini or not. Oh my God, I see it— Wait, don't get hit by that.\nDon't let— Oh, you're about to do it! Wait, what are you doing? I don't know, man! You were the first person\nto mess up on that part. Come on! Let's go! Three spots remain! What are you doing? I’m failing— No! Ok, right here. I’m locked in! You're almost at\nthe finish line. I'm locked in. Oh my God!\nYes! Yes! Red’s almost there! And I did it! Jefe! I'm coming for you, buddy! Wendy, Tiny… To make it easier on you,\nI'm on one of the platforms. I'm not moving anymore. First one to hit me moves on. The other person is eliminated. I go over. Ok, I got this.\nI'm gonna get you. I go over. Oh— Wait, she hasn’t\nhit me yet. All right, she did it. No! After 19.5 minutes,\nTiny has finally lost. I appreciate it.\nCan you hold this for a second? Sure. Why? Oh… ok.\nYou're supposed to do this. Oh! Oh… sorry. And now five remain! And to remind you all what you're\ncompeting for… Nolan, rev it! That's insane. Whose Lamborghini\nis this gonna be? That's a beautiful car. Don't forget that’s what's on the line. 3, 2, 1… Go! Whoa! What just happened? This one is a straight down ramp\nwith a couple bumps. What is the strategy here? Aw! No, no! Kickflip it…\nDouble kickflip it… Triple kickflip it… Gotta slow down\nmy pace, oh my God. I don't know what's happenin' right now!\nOh my God! Oh, Red is just falling. Red, are you gonna be able to stop\nat the bottom, though? Dude, you're in\nlast place right now. Am I? Oh my God.\nI didn't mean to flip like that. You're way ahead of everyone. Are you gonna be able to\nrecover, though? Oh my God. Those are rocket boosts,\nin case you didn’t piece it together. Oh my God, no! I was killing it. Things are getting serious now! Nah, no, it is.\nBut guess what? Only the strongest survive. Come on… Oh my God. That's good.\nThat's big. Aw, I got flipped! Ok. Not off the map… Turn, turn! Not off the map! So close to being… off the map. Oh, yeah, I’m still—\nI'm still goin' down. - You're now in the lead.\n- Me? - Yeah, you're now in the lead.\n- Why? Those tokens are gonna\ngive you a rocket boost. Do I want that, though? Green’s in the lead. No! Yes! Oh my gosh,\nyou're saving it. I am! I'm savin' it! That's a rocket boost. I'm good! This is what I'm gonna do:\nnow I'm gonna slow it down. Green’s almost done! You know what? Sometimes, you gotta let\nthings have a mind of its own, right? I’ma let it go.\nI'm putting it in neutral. I wouldn't do that. Three times in a row. Let's go! Let's go! Once again,\nGreen finished first! Can he ever lose? Come on, Ray. Yellow’s in the lead now.\nYou're ahead of everyone. Am I? No need to rush. Ok. We just gotta do slow and steady.\nSlow and steady. This thing is never-ending. Every time I think I'm getting to\nthe end, there's more. I got flipped again! Oh, he hit the rocket boost. Oh, no.\nPlease, please… Ok, we’re good. Yellow's about to finish! Full send it! Oh, let's go! Two people have finished.\nThree of you remain. Why did I get a rocket boost? No! Do not fall off the map. We're never recovering. All right, you're in the lead.\nDon't mess it up. Your car looks like it\nshould not drive right now. Do I send it?\nI'm slowly goin’ down. You and orange are\nneck-and-neck. Now we’re really close,\nand I just took a risk. I'm not gonna lie.\nI took a risk. Come on, don’t flip again! Blue, it's now or never. It's now or never? They're both about to finish. Go! I'm going! Ooh, I can take a breath. Orange is done! It's now between red and blue! Oh my God.\nI feel the pressure. I like it. Full throttle! Full throttle, baby! And there we go! It was a good run. Hello. You lost the TNT video… Oh, no! Yep. And now, you lost this one. Yeah. I'm just gonna… Oh. Uh, yeah.\nOh… ok. All right. Enjoy that Lambo, Green. Damn, the glaze! You just glazed him! - You glazed him!\n- She just cooked you guys! Light work. For this next race,\nwe're gonna mix things up. Instead of going at the same time,\nwe're gonna have you all go one at a time. All right, Mr. Green. When you're ready,\nyou'll be doing the race first. If any of them get a higher time than you,\nyou instantly move on. His time has started. Oh, wow! All right, three seconds…\nfour seconds… Hey, don't mess up! Come on, Jefe. Wait. He's almost done. No way! No, no! Yes! Yes, yes. Oh, he recovered. Ok. Ok, let's go!\nWait, wait… Oh, wait.\nHe missed. Wait, what? He overshot it! No way! Do me a favor:\nmiss again! All right. If you mess up again, that\nmight literally cost you a Lamborghini. I gotta go. All right, 33 seconds. I'm good! Or am I!? No! You're closin' in\non a minute. Come on. Ok. Good recovery,\ngood recovery. Slow and steady.\nAnd that's good. That’s good. Very good. A minute and four seconds is his time. Oh, you finally done? I'm not gonna lie, man.\nYou might be cooked. I might. Oh, boy. If I were you,\nI'd be praying. Now I’m nervous. You ready? I'm ready. Start his race! All right, Yellow. Oh my God! Oh! Oh, wait— No, we're good, we’re good… He's already wasted 10 seconds. What? Oh my God,\noh my God. If I'm Green,\nI'm feeling good now. No way!\nI'm actually cooked. It's officially been a minute\nand four seconds. How did you manage to do that? Wait. I'm actually full stuck. Wait. No, you’re not. No, no. My God.\nPlease, dude. Oh, you're burnin' time. Jefe got a minute.\nHe's at a minute twenty. So what am I gonna get? Red has really been sucking, so you could potentially lock in here\nand still make it. If I lock in here, if I don't fall off—\ndon’t fall off, please! I actually wanna start giving him advice.\nI’m starting to feel bad. I should've just done it slower. The strategy was go slower. Oh my God, what am I doing?\nI was so cooked. Ok. Two minutes and 17 seconds. Green, you are moving on! No way, I'm so cooked.\nI think I lose there. Well, let's find out. Orange, it'd be pretty impressive\nif you did worse than yellow. Ready! Start the race.\nHold that W key. All right.\nHe's off— Oh! Oh! No, no shot.\nNo shot. Did he overshoot it?\nI don't like seeing this. Wait, wait. Nope. I overshot. No way! Wow, that woulda been insane. He almost did in like 10 seconds. But you're not even\nusing the mouse. I don't need to,\nit's a straight line. It's a straight line. Oh my God! Oh my God, no shot. 25 seconds! No! I told you I'm taking that first spot\nthis race, Jefe! I told ya I was taking that first spot. Brother, I got hit by that\nhammer five times. How am I so unlucky\nwith the timing? Your only shot is that Devonte\nis slower than you. It's a lot of pressure, man. All right. Roll him in! Oh. All right, that's good. That's good. Oh my God. No, no, no. Oh my god. If you just time this jump, you could have\nthe best time out of everyone. All right, I take my time\n'coz he got two minutes. He just literally has to\nnail this ramp. I'm actually in pain…\nin despair. Oh my God, did he hit it?\nDid he hit it first try? Oh, it did!\nOh my God! - He hit it! He did it!\n- Oh my God, Jimmy! Jimmy! Jimmy! Oh my God! - You got the best time!\n- Oh my God! Nolan, it hurts so much. Ray, if it makes you feel better,\nI'll let you flip your desk. Thank you, Jimmy. Hey, don't scratch my car! Oh, yeah he got close. I hope you guys win the car, man. - I want a hug, man.\n- Oh, you want a hug? You're awesome brother. This is very nice. Very nice. Look how nice this looks.\nPerhaps, may I sit in it? Perhaps you may.\nHow does it feel? Like my car. This is nice. Oh my God! About to be the coolest dad\nin the pick-up line! When we started this video,\nthere were seven contestants. And now, three remain. After two more races, one will remain and\ndrive off with this brand new Lamborghini! 3, 2, 1… Start the race. I'm not playing. Come on! For this next race,\nthere are only three jumps. Only three? Totally nothing else\nyou need to worry about. I’m not playing! We’re off, and as usual,\ngreen is in the lead. I'm locked in.\nI gotta win this. I gotta win this,\nI came too far. So unlike the previous races, whenever you fall off,\nyou respawn at a checkpoint. Oh my God. I got this bro,\nI’m locked in! Oh my gosh. Have you made it through the\nfirst hole yet? Still working on that part, Jimmy. All right, this is the one right here. Oh wait, I made it. Oh my God. I got this, bro.\nI’m locked in! Oh my God, bro.\nI got it dude. All right. Ready? Oh my God! All right! Hey, you got through. Oh, Red made it through?\nRed’s in the lead? Wait, if Red hits this jump\nit's game over. This is it. All right, this is the one\nright here. Wait, you made it through?\nWait, Green's in last place? Ok. Ok! Ok! All three of you are on the last jump. If two of you magically hit it,\none of you is going home! Oh my God. I made it—\nOk, I know it. Oh, you gotta find that perfect center! Bro, they could hit it right now. - Oh! I thought he did it.\n- Oh my God! Guys, you gotta do it.\nGreen’s almost there. Oh my God! Ok, that's not stopping the motion. That is not stopping the motion. That is not stopping the motion! Green finished! One of you, orange or\nred is going home empty handed. This could be your last try. Oh my gosh! Stop giving him time, Red! Come on! Oh, he did it! Thank you, appreciate it. I'm sorry you didn't win a Lambo. That's all right.\nNext time. Yeah, I don't know about next time. And then two remain! One of you is winning this\n$200,000 Lamborghini. Who's it gonna be? - Listen.\n- You don’t want that. - I do.\n- Trust me, you don’t want that. I need to post it on\nmy Instagram. I got to man. Bro, guess what? Before things get\nspicy in here, bro. This is my car. See my chest?\nIt’s puffed out. All right, boys. Boys!\nLet's let the racing do the talking. All right, maybe we shouldn't do\nIRL gaming videos. One of you is going home with\nthis Lamborghini! Who's it going to be? - It's gonna be me!\n- Gotta be me. And for this final race,\nyou will have two options. You can take the long squiggly road…\nThe long path, and win that way. Or, you will have what we call,\nthe 1 in 100 shot at skipping everything. You go up the ramp, you land it,\nyou instantly win. You can literally win in\nthe first five seconds. Gentlemen, are you ready? As ready as I can be. I'm locked in. Lambo on the line.\nStart the race! Let's go this mine. All right man,\nthis is it. No 1 in 100. We both took the safe route. Green is in the lead. But it's not how you start.\nIt's how you finish. Come on. You gotta hit these turns quick.\nYou gotta catch up. I gotta catch him on the lines bro. - You're ahead.\n- Slow and steady wins the race. You're coming into the turns faster.\nYou're hitting 'em sharper. I am. You need\na little drift. Yup. You're gaining distance on him. If for whatever reason you fall, at this\npoint, your only hope is the 1 in 100. I'm not gonna fall.\nThis is my Lambo! As of right now, it is. I gotta catch those\nturns, bro. That's it. You guys are now around\nhalfway done with the race! Right, you've really got to start\nhitting these turns faster and harder. I don't get cooked. Oh my God, I'm him.\nCome on, dude. Oh, he's coming up\non me. Oh! he's closing the gap!\nGreen is fumbling! I am. Oh, it's neck-and-neck. Come on, bro.\nCome on, Jefe! He's on him! Jefe, I'm on you. It's mine! 65% done!\nWe're coming up on it. My hands are shaking,\nI’m gonna fall off. Wait green,\nhe's catching up. Come on, bro. I think I'm gonna fall off.\nI'm too nervous. I'm way too nervous. This is your time, Devonte. - He's gonna catch me.\n- Come on. You might do it right now!\nYou guys are coming up on the end. Green, he is right behind you!\nOne mis-click and you lose the Lambo! He's about to overtake you!\nOh my gosh! Come on. Oh my God. No way! Oh! No wait,\nthey both fell! What? Oh my God! Nah, this is crazy. Wait, no one wants a take\nin the 1 in 100? Jefe, I’m on you gang.\nI'm on you. The back door? I see what type of\ngames we're playing. I ain’t no back door.\nCome on, bro. Drive better. Nah, nah. I see what type of\ngames we're playing. Now, are you gonna do it like last time\nand slowly give up your lead? Oh, yeah. I'm choking.\nI'm choking now. I got to. It's all patience, bro. Oh, no. He fell? Your only shot now is to\nhit the 1 in 100. Come on. This is a 1% chance. - Come on.\n- That's your only hope of catching up. Oh, God. You're gonna\nget a rocket boost. Oh my gosh. Oh my God. - Oh, no.\n- Oh my God. Oh my God. Wait. No! Oh my God. - Oh my God. Ok, ok.\n- You almost did it! He almost landed on your track. He almost did it. I got it.\nI got this. Green, he might hit this. I think I got it. - All right, he's going for another jump!\n- I gotta be locked in. Who’s gonna finish first?\nThree more turns. This is your final jump. Come on. This is it. Focus on what I have to do,\nand I'll be good. He's coming up on it. Come on. Let's go! Either you hit this jump,\nor you lose a Lambo. It's now or never. All right. This is… Come on! It's mine! This is it, bro. Oh my God, man. Let's go! - All right!\n- Let's go! It’s what I do! Let's go!\nI told y’all! - You hit it! Yes!\n- Let’s go! Let's go, Jimmy! Let's go! Here are the keys! Let's go! La-la-la-la! Devonte, I don't want you\ngoing home with nothing. You might not have won a $200,000 Lambo,\nbut here's $10,000. Bro, you don’t understand.\nI actually might cry. I actually might cry.\nOh my God. But more importantly,\nlet's get in your brand new Lambo. Subscribe! And don't forget\nto get your Feastables!",
    "start_time": 0.017,
    "end_time": 1073.5500000000002
}