{
    "video_id": "9OHRtUHezTk",
    "channel_url": "@mrbeastgaming",
    "transcript": "I've created the deadliest bosses\nin Minecraft, and for every one of them\nthis contestant kills, I will give him $10,000\nin real cash. That thing is massive! What am I supposed to do\nagainst that? Watch out! Oh, he's gonna burn me. Oh, ok.\nI'm on fire. Ok, I need to get away\nfrom this thing as fast as I can. I need to figure out a way\nto beat this thing. Bro. Whacking it with the sword\ndoes so much damage. Wait. I need to get close, then.\nOh my goodness. Alright. I'll keep on shooting\nfrom afar, guys. Ok, I'm gonna try\nclosing the gap. BT run! Wait, it knocks me back.\nWait, that's crazy! BT! Be careful. If you die\nat any point, you will lose all the money\nyou have earned up to that point. If I die, I lose all the money\nthat I accumulate. $10,000! It’s shooting\na bunch of fire at me. Dude there’s\nlittle firenados. Wait, I just need to go\nin between the flames. 'Ight, here's a crucial piece of\ninformation I haven't told you yet. If me or Nolan die at any point,\nwe do not respawn. What? I’m hitting its belly.\nIt's almost dead. Wait. There we go.\nHere we go. Oh my goodness.\nHe's so low! Kill it, BT! It's dead! Oh my God,\nit just fell down. Oh my goodness. BT, look at\nyour prize pool. It is now $10,000. 10,000! For this next challenge,\nto win another $10,000, we're gonna have to fight\nthe deadliest boss in the entire ocean. The Leviathan. Leviathan? Oh my goodness. Wait, I should start\nshooting at it. Ok. Oh, no. It can start\nchomping down. Maybe I shouldn't\nget too close. Oh, it breaks\nthe ground too. Oh, that does damage. Luckily, every time we fight a boss,\nwe get 5 health potions. I need to make sure\nI don't fall into the pits. Oh, it just bit me. Nolan you're losing health. It just destroyed\nlike half the floor. Wait, where is it? Where'd it go? Wait a second… It's charging towards us!\nRun! Oh! It's going. B! Don't die. If you die right here,\nyou lose the 10,000. Oh my goodness. Ok, I just need to make sure\nthat I get some distance and I'll keep doing\nsome damage on it. Alright, we dodged it. Hit it. Ok. We're doing good. Nolan, heal up. If you die,\nyou don't respawn. Dude, I would never even\ndream of dying. Now's our chance!\nLet’s get close! I need to close the gap\nso I can start smacking it. My sword does\nso much more damage. Oh my goodness,\nit does so much damage. Oh, it turned towards me. I'm running. I'm just running.\nI'm running right now. I'm going to the other side, dude.\nI’m just running. Run! It just literally\nbit Nolan. Yeah, it really hates you, Nolan.\nWhat's up with that? Where is—\nAh! It’s on me! Dude I’m coming! This is it. Yes! Let's go! BT, get the blows!\nYou can kill it right here. I'm shooting with arrows. It's so low. Come on.\nOnly literally like 5 more hits. We can finish it here. Don't stop whacking.\nIt's almost there. You can kill it! It's dead! It's dead! Yes! Oh my God. BT, you know what\nthat means? Your prize pool\nis now $20,000. $20,000. Dude, this is actually\nunbelievable. BT, this is where\nthings get interesting. In between each boss, I will give you\na choice to press this button and quit. What? If you press the button,\nthe video ends. You walk away with that prize pool,\nand it's done. Oh my God. Each one of these portals\nrepresents a different boss. It's either press the button,\ngo home with the money, or enter a portal and potentially add\nanother $10,000 to your prize pool. Ok, $100,000 could change\nmy family tree. If there's even a tiny chance\nfor me to make it, I have to take it. So let's keep\nthe challenge going. Alright. Which portal? Well, I see that there are little icons\nabove each one, but honestly, I don't really wanna\nuse my brain right now. So you want to face\nwhatever boss this is. I think we might as well\njust go in blind, yeah? No strategy whatsoever? If you enter this portal and die,\nyou will lose all $20,000 that you've won. - Let's see what happens.\n- Let's go. We're surrounded by mountains. The next boss is the largest boss\never made in Minecraft. The Colossal Rock Golem. He's huge! What he’s throwing rocks at us!\nWe need to dodge. Oh, shoot. Ok, this guy does\nserious damage. Yeah, this is not good. My arrows literally\ndon't shoot that far. Yeah, we have to get closer.\nWe can't even shoot him from here. Watch out!\nHe's gonna throw again. Hey, guys!\nSpread out! Yeah! We can't group up. If we're all together, he hits us\nall 3 at the same time. He's walking towards us. Do you hear that\nwhen he steps? Oh, he just stomped me.\nHe stomped me. I'm flying. This is easily the strongest boss yet. Where's it going?\nIt's like walking somewhere. Is he trying to stay away\nfrom us? You can't get close to it and\nyou can't shoot it from far away. Alright, it's walking towards me. Here we go.\nI’m attacking it! Oh! But the stomping attack\ndoes so much damage! Dude, BTMC, take a health potion\nnow, immediately. Good idea. Oh, bro. Hitting it does so much. Oh wait, I got the game plan. Hey, keep distracting it. I'm hitting it from behind.\nIt doesn't see me. Wait. That's huge. Keep distracting. I need to take another potion. Nolan! Just be the dummy.\nDo something useful with your life. I'll distract him by taking rocks\nto the mouth for you, Jimmy. Don't worry. Idea, I’m on it. Wait, it’s doing\nso much damage. Hey, it's almost dead. It’s throwing rocks again! Alright, I’m distracting him. Get it done, BT!\nGet it done! I can't do anything against that attack,\nI need to just back up. Come on. If I can just get\none good attack in, it's gone. Oh, dude.\nIt launches me so far. I'm firing from a distance. Alright, he's throwing rocks\nat me right now. Everybody go ahead.\nMove in! Wait. It's distracted\nby Nolan and Jimmy. I can go in. Go in! Finish him!\nWe're being the decoys. This is it! You got this! Yes! Yes! The bigger they are,\nthe harder they fall. It’s dead! Wait, that was actually\nso close. BT, you have the 30,000! Oh my God!\n$10,000 just like that. Oh, dude. I wanna remind you that\nthis is isn't V-Bucks. This isn’t fake money.\nThis is real money. $30,000 sounds nice, but I think as long as\nwe work together as a squad, we can beat any one\nof these bosses. And with the power\nof friendship, we're gonna help you take as much money\naway from Jimmy as possible. - Alright, well…\n- Sorry, Jimmy. Alright, so maybe choosing them\nat random is not the best idea, given we just faced\nthe largest boss in Minecraft. So let's take a gander at\neach one of these portals. I see one with, like, a ghost,\na lightning bolt. I don't even know\nwhat that one is. Is that a bee? Wait.\nThat's adorable. There's no way that a bee\ncan be that hard, right? So you, you wanna do the bee\n'cause you think it's easy? Yeah. Let's go to the bee. This bee can't be that hard, right?\nLet's squash this dude. Alright, famous last words. Alright. Here we go. Alright, do you hear the bee?\nWhere's it at? It sounds like there might be\na lot of ‘em. What? Wait, you're right. For this next boss, we will be fighting against\nthe most dangerous bug in existence. The Queen Bee. Yeah, there it is!\nAlright, here we go. It's shooting like honey. Wait guys notice how our arrows are\nhitting it, but it hasn't lost any health. Wait. I'm on it. Yo, it's just stung you. Oh, what is that? It just screwdrivered me! Hey, BTMC! Drink up a health pot,\nwhat're you doing? Oh my goodness! Bro, if you die,\nyou lose 30,000. Yo, this sword does\nso much damage. Wait, you’re so right. Here we go. Oh, it's doing the screwdriver! Dude, wait.\nI have to heal. Oh, BT! I'm good. Oh my goodness. No! There's lots\nof little other bees. Oh, baby bees. It brought in reinforcements? I'm sorry,\nbaby bees. Ok, I gotta heal. The bosses are definitely getting harder.\nGuys, we gotta really lock in now. Hey, let's kill\nthe little bees first. Dude, why are there so many\nlittle bees around me? Nolan's gonna get it done!\nNolan, I’m coming to save you! Dude, the little— I can't.\nThese little bees. I'm coming. Watch out,\nit’s screwdrivering again! Oh, you guys are both\nrunning out of health, man. Wait. I have to heal.\nHere we go. BT, we're not even halfway done and\nyou're almost out of pots. Yeah, I need conserve\nmy health potions now. I'm going in. Oh, gosh. Yeah, how’d that work\nfor you, Jimmy? You can't dodge the screwdriver. Yeah, it literally just\ndrills into you. Oh my goodness. BT, let me take damage.\nI still have 4 pots. I'm gonna fall back for a little bit,\nsee if I can do something at range. Alright I got it.\nWe're doing damage. Nice. Wait, there are more bees! Ah, the little bees! Nolan's getting swarmed. I'm getting pummeled\nright now, gentlemen. I'm here to help, Nolan.\nI'm here to help. Oh, wow.\nNever mind. I should not have tried\nto help Nolan. How are we losing\nto a bee right now? Don't worry. I'll just deal with\nthe 10,000 little bees. And I'll get screwdrivered! Nolan, drink a pot!\nHurry! You're about to die. Nolan, run!\nYou can’t die here! Run! Guys, I'm out of pots. I don't have any more heals.\nIt won't stop following me. Dude, there's no way that we can survive\nall the bosses if Nolan dies. Alright, we're almost there.\nCome on. There we go.\nIt's so low! Oh, it's screwdrivering me. Oh, I'm taking my last healing. Maybe we all just rush it\nat the same time and kill it? I think that's the plan.\nI just killed all the bees. Rush it! Oh no. Oh no, oh no. Actually, oh no. It’s focusing me. It missed!\nOh my God. BT, do you have heals? No, I've no heals.\nI'm at 4 HP. I have 2.5 hearts left.\nI'm running. Oh, Nolan.\nDon't die. Ok, I've got 1.5 hearts left.\nI need to run. Guys, just go for it.\nI can't do anything. No! Nolan, no! Ok, this is it.\nIt’s now or never! I have to make a choice here,\nI'm going for it! Oh my gosh, kill it. Alright, we got it. Oh my God! Wait, that bee was crazy. It actually killed Nolan and it took all\nof my potions all the way down to 3 HP! Your prize pool is now\nup to $40,000. It's actually at $40,000.\nBut at what cost? We lost Nolan! Well, he's dead…\nfor now. We have baked in\na one-time revival at a cost. What's it gonna cost? You would have to pay $10,000, the money you just made off the bee,\nto bring Nolan back. And you still have 5 gates to defeat,\nplus the locked 2X. To be honest, I don't even think\nwe would've won against that bee if it weren't for Nolan,\nwho tanked all the hits right at the end just for us to get\nthat final shot. He needs a second chance. I'm willing to put\n10K on that. Dude, I'm genuinely surprised\nyou did that. You just gave up a used car\nfor Nolan. Alright, which gate?\nLet's keep her going. Ok, so the only other gates\nI didn't really take a look at was this one\nthat has, like— What is that,\na leaf up there? There's this one that has,\nlike an ice icon on it. So what do we think\nis the weakest one? We know we're gonna be fighting a ghost\non this one over here. Let's go for the ghost. - Alright. Let's do this!\n- Let's go! For Narnia! To earn your next\n$10,000 BTMC, you'll have to kill something\nalready dead. This necromancer. Oh! It just appeared. Oh, this is scary. Here we go! Oh, it's summoning an army. Oh, no.\nThere's a lotta zombies. Oh, no. Ok, there's going to be a lot of monsters\nthat we need to take out. Thank gosh we brought\nback Nolan. Yeah, let's take out\nthe smaller monsters first. Ok. There’s like a horde,\nbut they only take one shot. Oh, these go down easy. Oh, wait. What's hitting us\nfrom the sky? Watch out!\nThere's flying skeleton heads. Alright, I'll take out\nthe ones on the left side. If we we can take ‘em\nout at range… Yeah, the arrows one-shot ‘em. So is the strategy to get rid of\nall the minions and then focus the boss? Yeah. Let's do that. Be careful for\nthe floating skeleton heads! Alright. I'm almost done\nclearing out the left side. I'm finishing off\nall the ones on the right. They're all dead. Alright, here we go!\nFocus on the necromancer! I won't let you down, BTMC. You mean you won't let him down again?\nYou already let him down. I won't let you down\na second time. Wait, it's focusing on Jimmy. Here we go. I'm going in!\nHere we go. Alright. I’m moving.\nOh, what is happening to me? What the—? That scythe just put me\nin the blender! Yo! Hey, this sword does\nan insane amount of damage. Look how much damage\nI'm doing. Yeah. Perfect.\nI'm gonna keep taking the damage. BT, just stay away from me. Oh, it vanished.\nIt’s gone. More minions.\nMinions spawned. Yeah, the minions spawned again.\nFocus on the minions. Alright, bro, I’m soloing\na whole army over here. Watch out, Nolan! Oh, no. It's doing\na helicopter scythe! Oh, Nolan, you got thrusted\ninto a bunch. I'm trying to\nclear ‘em all. Ok, I’m still alive. I'm not gonna use\nmy health potion yet. Yeah, I haven't used one.\nWe're in a good spot. We're doing good. I'm charging the necromancer! Alright, I gotta give up. Hey, idea: Let's just blitz\nthis necromancer. Wait. You're right, Nolan! It's already at half HP! The zombies and\nthe skeletons are too slow. If we just sprint towards him,\nwe can take him out. Oh, you're getting helicoptered. - Let's go.\n- I'm going in. Wait. We're taking\na risk here. Wait. The horde is huge, guys. We gotta finish him now or\nwe might be screwed. Yeah, we have to\ntake it out now. Yeah, the horde’s caught up. Hey, he's almost done. He's so close.\nIt’s another scythe! I'm getting helicoptered. Alright, I'm finishing this.\nI'm going in! Come on! No, it ran away.\nI'm not letting him get away! I'm charging! Watch out.\nHelicopter. Whoa, I'm almost dead. One more hit! Yes! Yes! Oh my goodness. Wait, that was actually so scary.\nJimmy, you were right. The monsters were just ganging up on us.\nIt was like a massive horde. For some reason, I'd rather fight\na necromancer than a bee. Yeah. BT, you're now back at the same money\nyou had before Nolan died. It's like it never happened. Now, I assume since you didn't press\nthe button last time you had 40,000, you're not gonna\npress it now. Definitely not. Let's go pick a portal. These 2 portals on the left\nwere actually kind of easy, so I think I'm just gonna keep\ngoing up in difficulty and to go for this\nlightning bolt one. When you think of bosses and\nlightning bolts, what do you think of? The God of Thunder!\nOr like, Zeus or something like that. Well… There's no way\nwe're facing Zeus, right? You’ve chosen to fight\nthe God of Lightning himself: Zeus. No, no!\nYou're joking. How am I supposed to\nbeat a god? Start firing!\nRain down! He has 2 lightning bolts. He just 360’d? He's targeting me! I took some damage. Guys, that does a heart and a half.\nLet's start tracking everything. Actually, he's taking way more damage\nfrom arrows than the other ones were. God of Thunder…\nIt's time. Alright everyone,\nspread out. Hey, this is great.\nOk, keep your distance. We already got 10%\nof his health. That's true, yeah. I think we can just take him out\nwith arrows. We're doing so much damage! - Oh, what is that?\n- What is that? It's a lightning storm! A wall of thunder! Ok, good thing\nhe missed all of us. We got 25% of his health and\nno one's had to use a health pot. Nolan, he’s targeting you!\nBe careful, alright? Took a lightning bolt\nto the face. BT, I’m gonna go in.\nYou guys stay at range. I'm gonna test what happens\nif you get close. Ok. Good luck, Jimmy. Alright, I'm whacking him.\nI’m behind him. What? You’re doing so much damage.\nJimmy, keep going! Wait, he's running away,\nhe's scared of you, Jimmy! He just missed me. Hey, can you guys distract him\nfor a second? I need to eat this Feastables. Oh, the brand-new,\nlimited edition Hazelnut Cup? Yeah, that's the one, Jimmy. I'm doing so much damage! BT, while you're killing it, I'm gonna tell them about\nour brand-new Hazelnut Cups. These things are filled\nwith creamy hazelnut wrapped in\nour milk chocolate shell. - How do you like it, Nolan?\n- Dude, it's so good. Just a couple more hits\nand I got him. Alright, I'm going in.\nDouble team. For a limited time only, you can buy our cups at Five Below,\nAlbertson’s, and Circle K. One more hit! We got him—\nYeah! Yes!! He's dead! Oh my God! The God of Thunder\nis no more! Dude, I actually couldn't imagine\nnot having a Hazelnut Cup right now. So good. Alright, the prize pool\nis up to $50,000. So, if I were to go\ninto that portal, this would be $100,000,\nassuming we beat whatever's behind there? Yes, but it's still locked. What am I supposed to do? Don’t tell me\nI have to sacrifice Nolan. Because I will. How many portals\ndo you see left? I see three portals left.\nOh my goodness. $50,000 is already so much money.\nI don't even know what to do with $50,000. Ok, then press the button. Press it and sure,\nI'll wire the money. Here's the thing: As long as we have Nolan here by our side,\nI think nothing can take us out. So let's go pick a portal. Ok. Us going in order\nseems to be doing pretty well. So let's keep going. What is that? It looks like\na sabertooth tiger. Yeah, it looks like a cat. Alright. Are you gonna\ngive us a speech? Yeah. Guys, I don't know what to expect\nbeyond this thing. - It could be—\n- Too late! I jumped in. - Wait a second.\n- Wait, there's nothing here. Oh, gosh. Wait.\nOh, there it is. It's crawling out\nof its den! It's a panther! A panther?\nIt is a cat! Start firing! What are you hooligans\nwaiting on? Oh my God! Shoot it! Oh my God,\nit’s massive! That did 2.5 hearts.\nThat's the most damage so far. Guys, I have a feeling we just walked\ninto a really hard one. Yeah, I think this\nis gonna be tough. My God! It seems to be taking\nmore damage, though. It deals more damage,\nbut it also takes more damage. Look, its health is melting Oh, gosh. Alright.\nI need to pop a potion. Come on. Wait, I'm doing so much damage!\nNolan, I need you to tank. I'm going in. It's coming at me. Alright. You know what,\nI'm going in. I'm going in. He bit you! Jimmy, you need to heal! Yeah, I need to pop one.\nI have 4 hearts missing. Here we go. Oh, wait. It went back up\nto its chamber. Dude, it’s scared of us! Wait, it's probably gonna pounce out!\nGet out from the middle! It pounced on me! Alright, I’m gonna hit it. Oh, it turned around! No! It's so low.\nCome on. It's jumping. Alright, everyone run at it.\nHit it from different angles. Alright. Charge! Alright. I'm going for the right. Dodge the paw. Oh, I got hit.\nI'm healing. Alright, we're going in. Here we go. I’m going for the tail. Oh my goodness, it's so low—\nIt’s jumping! I don't even care.\nJump on me. I don't care. It's either it dies or I die,\nI don't care! It's almost dead.\nFinish it off! We can finish it! It’s down! That was a close one. That cat was on\nits last life. And just like that,\nanother $10,000. Killing that panther\nnot only gave you $10,000, but it was also the mechanism\nthat unlocked this portal. You're joking. But this is only a one-time thing. So if I were to take it right now,\nit will double the 60,000. Not only is it the one time thing,\nit is the final 4. After that, the game's over. Oh, dude… This is the thing\nyou have to calculate, BT. If we have a bee episode and\nNolan dies in one of those, do you think me and you could actually\nbeat that without him? Or what if I die? I didn't even think about that.\nYou're right. Well, I'm assuming it's probably gonna be\nthe hardest boss out of all of them, so I'm gonna save\nthe 2X portal. I say we beat these\nother bosses, we run up this prize pool,\nand go for the money. Ok! I love how you're not even\nconsidering pressing that button as you stare $60,000\nin the face. $60,000 is insane. I used to scoop popcorn\nfor 7.25 an hour. And you're about to risk it\non another portal. Yeah, that's kind of dumb… But screw it! Oh my God,\nwhat is that? That's an ancient tree ent,\nand we're getting right into it, boys! Wait. If it's a tree,\nthat means it can't move, right? Oh! What is that? Wait. Where do I go,\nright here? Look at the ground, boys, to dodge it.\nLook at the ground. So it can shoot projectiles. Let's keep our distance\nuntil we can figure out its moves. It spawns creepers! Oh, creepers!\nCreeper. Ah, man— They’re one-shot, by the way,\nwith the arrow. I'm gonna focus on\nclearing creepers. It has a root attack! Yeah. Alright, guys, I'm just gonna run up\non this thing. Alright Nolan, let us know what happens\nif you run up on it. Nolan is dodging all of the roots!\nHe's crazy! Oh no! Yeah, you can't run up on it. But wait, Nolan, how many hearts\ndid you just lose? 3. Ok, so it's a 3 hearter. He's a tank, all of our arrows have only\nchipped like a tiny bit of its health. I'm gonna run\nhim again. Yeah, Nolan let's charge him together. Yeah actually,\nI'm gonna charge as well. Let's go.\nCharge! Charge! Oh, it hits you towards it? Yeah, it gave me a boost!\nI’m attacking it! Oh, this does way more damage. Yeah, I'm up behind it\nright now. We're all hitting it. Oh! Dude, this is crazy! It launches you. I took like 4 hearts\nof damage. That was insane.\nBe careful. Oh, what is this?\nThat's a new attack. It can smash you too! There are creepers coming up\non you guys! I'm coming. Wait, just killed the creeper. What if you go behind it?\nI don't think it hits behind. He can't turn around 'cause\nhe's a tree and he's stupid! As a blind spot? I'm hitting him\nin his tree legs! Let's go! Finish it off! Here we go! Yes! We fell the giant tree. BT, where's my praise?\nI literally found a cheat code. Jimmy, I think you were the sole reason\nwhy we won that. Honestly. In other words, you're saying\nI'm way more useful than Nolan. I have my uses! Alright, here we go. This is the last boss. Nolan, what do you think?\nWhat's going through your head? 70,000's a lot\nof money, man. I agree. Bro, this is ridiculous. And you have the 2X’er over there. You could also just quit now\nand have 70,000! Like there's a world where\nthis is more of a bee. Like yes, the tree one was easy.\nThe bee wasn't. You sure you want to do that portal?\nYou don't want to just go to the 2X now? I wanna just remind you, there is a chance you die\non the other side of this portal. I mean, during the bee fight,\nNolan was the one to go down. But literally, that could've\nbeen any of us. If I go through this portal,\nI'm basically taking that risk again. I think if there's a chance that we can\ndefeat this boss and take the 2X, I think that chance is worth taking. Let's do it.\nLet's go! Our next boss is the ice king. BT be careful, because\nthis is the only boss that has the ability\nto one shot you.  You're joking? Oh, no.\nI just got chills. I can get killed\nin one shot? We gotta keep our distance. Why is it just\nsitting there? Nolan, go touch it.\nSee if that wakes him up. I'll put my body\non the line. Oh, it's not moving. Wait, maybe he's friendly. Maybe he’ll just give us\nthe 10,000. Wait! Just kidding. Oh, I don't think\nhe's friendly. Fire boys! Attack! Watch out! I can't let you guys die here.\nBack up! That was a close range attack. We don't know what\nhis one hit is. Whoa, wait. Our arrows are doing\na lot of damage. Wait, you're right! Maybe we can just\ntake him out that range. Be careful. I have no idea what\nthe one shot is. Run, guys!\nRun! Nolan you're gonna get trapped. No, I won't.\nI won't get trapped. Nolan! No! Oh, that was the one shot. Alright BT, I just need to get you\nout of here alive. It’s running towards me! Shoot! I'm running. Alright, I don't think that's\nthe one hitter. I think the one hitter's\nwhatever hit Nolan. Icicles are falling\nout of the sky! Oh snap. Alright, he's coming for me.\nI gotta get out of here. I'm stuck,\nI gotta go. I'm nailing some shots in. Yeah, you keep laying shots.\nI'm just gonna run. I don't wanna lead him towards you\nso be careful. That's the one shotter! So the one shotter is\nright in front of ‘em. We have to make sure that\nwe have our distance against them. I'm worried if I go\nthe other direction, he'll corner me. Alright, this is perfect. I'm gonna go\nthe opposite direction now. Ice storm doesn't seem\ntoo dangerous. Alright, he's coming for me. Run, Jimmy! Keep hitting him. This would have been much easier\nif we had Nolan! He's almost at half HP! He's walking towards me.\nOh wait, the ice is blocking me! Get outta there!\nBT, don’t die. No, no. I'm gonna go through him! I'm going through him! I made it out! You just ran through his legs.\nYou are freaking insane. Listen, I have to do what\nI have to do. Be careful for those boulders! Wait. I'm going, I'm going… Jimmy! Watch out! Oh, wait. I'm going back this way. Oh, that was close. I see an opening. You only attacked\nin front of him. He's going for you!\nI'm gonna hit it from behind. Watch out, Jimmy! Oh, no. He can hit you\nif you're behind him. What? Wait, that’s insane. - Ok, I'm gonna run.\n- Yeah, just keep running. He's doing another\nsnow storm. Watch out for icicles.\nI need you to play close, ok? If you're low on the health pots,\ncome to me. I'm screwed. I'm running\nin between his legs. Go! Oh, that almost killed me.\nOh my gosh. Oh my goodness,\nI'm so scared. If I get one shot,\nthat's $80,000 gone. Yeah. That's not good, man. I'm running away. His health is just\nslowly depleting. We can just play it safe\nwith arrows. Keep shooting it! I'm going\nthrough his legs again. I'm still alive. I took 4 hearts.\nI'm healing. Oh, wait. Why is he\nmoving so quick? What was that? Oh my goodness,\nhe's so low! Oh wait, where do I— Going through his legs Oh Jimmy! Oh, that was so close. I think we got him though.\nI think we got him. He's so low!\nWe got him! Come on, fall! You killed Nolan and\nI will avenge him! He's like one shot. Come on,\none last hit! I got him! He’s dead! Yes! That was stressful. And there's your prize pool, $80,000. $80,000. Take us back to\nthe middle, server. 'Cause you press this button\nright here, this red button, I will literally wire you\n80,000. That's it. All you have to do now\nis press this button. If there was a chance to actually\npress the button, now would definitely\nbe the time. If we go in that 2X portal we die,\nyou literally will get nothing, and you will potentially\nregret this forever. My parents, ever since they immigrated to\nthe U.S., they haven't visited back home, but $80,000 can get all of them\nnice first class seats. I've been researching\nthe flights as well with the dream of one day\ngetting that for them. Are you gonna risk that?\nFor a chance to double it? Is it worth risking that dream\nfor another? If you do the 2X,\nI will give it all I got. I will help you win.\nBut we are down Nolan. I honestly don't know\nwhat to do. $80,000…. Or risk it all. This is life changing!\nI can do so much good with this! I can literally give my parents\na life changing experience, and I owe it\nto them for that. Here we go. He did it! He actually pressed it! I thought you were actually\ngonna do the 2X. That's crazy! I just won $80,000! Nolan, if you were there with me,\nI genuinely think we could've done the 2X. Oh dang, that makes me\nfeel terrible. And it makes me feel great.\nI saved 80,000!",
    "start_time": 0.0,
    "end_time": 1599.467
}