{
    "video_id": "npNmyb-qqGw",
    "channel_url": "@mrbeastgaming",
    "transcript": "If these four contestants can survive\nthe next 1000 days in hardcore Minecraft, I will give them $100,000\nin cash. You’ll notice you all started in a replica\nof the room we built in real life. Look at the beds! Yeah. This’ll work. Enjoy Day 1 of a thousand. On Day 100, I'll be back\nwith something special. Let's go, boys! Minecraft! They have no idea that\nas this video goes on, it's gonna get way harder. Pushing them to their absolute limits. Oh, I'm dead.\nI'm dead. Yes! Both in game\nand in real life. I’m so, so sorry, bro. But for now, they'll need\nto work together and prepare as much as possible\nfor Day 100. Boys, I already see a zombie.\nIt's dark. Alright, let's go. Day 1 done! Let's go! Imma make sure we're ready\nfor Day 100, brother. That’s all I’m sayin’. Yo, he got diamonds! Aye! And by Day 5, it became very clear\nwho was leading the group. Be extremely paranoid all the time.\nYou only get one life. I feel like we're the housewives\nand Sweat’s, like, the dad. I don't care what we do, bro.\nWe just needa win. And under his lead, the group went\nfrom surviving to absolutely thriving. You see that? My brother. Everyone was doing their part\nto prepare for Day 100. Except for Sunny, who didn't seem\nto take it all that serious. Day 12, fellas.\nEasy money. Hey, let's not get too cocky, bro before they start giving us\nsome crazy stuff. I dare ya. Dude, can I stop finding chicken eggs\nin the furnace? It's a little crazy in there. But even with Sunny messing around, the group managed to build\nan impressive base, including a farm,\nso they'd never have to worry about food and even a village\nand an XP grinder. So that way, they could upgrade\ntheir weapons and tools to be some of the best\nin the game. Let's go! The defense system.\nShout out to the boy, Chosen. Thank you, thank you. All I have is security,\nyou know what I’m sayin’? And as their base grew,\nthe days flew by. The boys started to feel\nvery confident that they could face whatever challenge\nI might throw their way. Let's just say Mr. Beast won't be so happy cause he knows we’re gonna beat this\nsuper easy now with this. So once they officially hit Day 100… [cheering] Day 100! It was time to put all of their confidence\nto the test. Yo! Congrats on making it to Day 100. Jimmy. Catch, brother. Oh, I thought this was a bag of poop. As you can probably piece together, every 100 days,\nI will give you guys a challenge. For challenge number one, you'll need\nto kill the Ender Dragon by Day 200. Or you all lose. Oh, boy. It's getting real now, boys. Have you beat the Ender Dragon before? Probably on like Xbox 360, bro. [laughs] Oh, yo. I'm terrified. Hey. For real, the challenges\nget harder with time, so I’d make sure you gear up. I'm scared. I'm probably the only one here\nthat hasn't beat the game yet. And under sweatgod’s lead, the team started to prepare\na game plan to gather all items needed\nto kill the Ender Dragon. Let's hit the Nether, fellas. The focus is right there, boys.\nDo you guys see it? Alright. Don't swing at any of these pigs,\nand just follow my lead. We can enter the fortress\nover here. It’s spawning right here.\nIt's right here, it's right here… And in no time at all… I already got four rods, bro. The team was ready to travel\nand fight the Ender Dragon. Here we go, boys. Oh! The 'E!' Towards the 'E.' Creeper, creeper, creeper… Yo! Sunny, shield up! There's a million of them! Oh my God, they're biting me! Dude, I saw 20 phantoms, brother. Whoa! It's here, boys! It's here. Sunny! Yeah! He found it. Let's go! And just seconds away\nfrom the first challenge of the video, the team realized that one mistake\nin this fight could cost them their share\nof $100,000. A lot of hard work,\na lot of hard hours, and we would not be standing here,\nthe four of us, together, if each and every one of us didn't put in\nan equal amount of effort, boys. There we go. Let's go fellas! Woo! Oh, relax, relax… Here, I'll go take care of the ones\nthat are enclosed, boys. I broke one. I broke a crystal. I'm trying to hit some nasty snipes, bro.\nOk, I think I got one. I got the one in the cage. Alright, fellas.\nMake it happen, bro. - Is that all them?\n- There's one more. There's one more. I think they're all good. Light 'em up boys. Love the flame arrows coming through.\nOh, a 100% hit. Shout out the infinity bow. This is it bro.\nFinal push. He’s just flying over my head,\nI think he likes me! I think baby bird is about to perch. We’re about to beat the Ender Dragon,\nend of Minecraft boss, fellas. Look at that damage! Hit it! This is it! Give it all you got boys! Challenge one in the bag, bro. Wait. That was only the first challenge. And with the first challenge over,\nthe team realized how hard the video might actually be. What's the plan to loot to Day 200?\nBro, what do we do? Literally, we'll just re-up the farm\nand then just kill time. Literally just kill time.\nKeep sleeping And as they prepared for Day 200, the boys decided to get to know\na little bit more about each other. Are you already back in it, bro? Yeah, bro. He's on that grind. I just like, the thoughts about\nlike home and stuff and like people just become louder\nwhen I'm not doing something. Yeah, no, I feel you man. Bro, I really missed my anniversary\nwith my girl for this, bro. Yeah. This the other reason to lock in. It's like, I can't talk to her\nfor so long. I gotta win now. Life was kinda hard\nfor me, bro, and I had to do a lot\nof growing on my own. Like, after my mom passed. Nah, bro.\nIt's not even that. Like, we all go through\nour own struggles, bro. No but still, bro.\nLike, I honestly admire, bro, cause you went through a lot of hardships,\nbro, and you're still here, bro. Like… If I hadn't lost my mom through the butterfly effect, bro,\nlike I would not be here, bro. Like. Yeah, cause what happened to me,\nit's like, it was a heartbreak. But like, the thing is, before that heartbreak,\nI was like 260 pounds. Like, after I got my heart broken bro,\nI was like, I'm going to love myself, bro. And after rearranging the room, the boys started to wonder what I might\nhave in store for them on Day 200. I'm just so curious because it's, like, the challenges also must get\nincreasingly harder, but it's, like, there's not enough things\nin the regular game. Some crazy stuff is gonna go down. I'm telling you bro,\nI don't know what. And they wouldn't have to wait long,\nbecause the very next day, the boys hit Day 200. Gentlemen, congrats on surviving 200 days! Thank you, thank you, Jimmy.\nThank you. From what I'm gathering,\nthis is a little too easy. I think we might be a little too good,\nbut there's a difference. What do you think\nyour Day 200 challenge is? $10,000 for every diamond we collect!\nBoys, let's get to it! This guy, bro. You're not far off because you'll have to\ncollect 1,000 diamonds and give them to me on Day 300,\nor else all of you will be eliminated. Goodbye! By 300? Oh. [laughing] Ok. Alright. We all have fortune 300 picks. So right now,\nour plan is to just split up, cave by ourselves, and try to get\nas many diamonds as possible. It's gonna be an easy challenge, boys. And although they had a strategy… Oh, diamonds.\nI got diamonds. Diamonds. Oh, more diamonds, boys. One mistake alone in the caves\ncould mean absolute death. And walking away with $0. Alright, Day 201, boys.\n99 left. Since we've been given our challenge,\nwe’ve all split up mining. I made my first stack of diamonds,\nit's only Day 1. I'm feeling really confident\nabout this challenge. We’re sitting at 29%.\n293 diamonds. Dude, we'll have this challenge done\nbefore Day 210. And then\nwhat are we supposed to do? Bro we're gonna be chilling\nand being friends. And to be honest, I think I underestimated\njust how good this group really was because in only 10 days,\nthey managed to gather all 1,000 diamonds. Yeah. Hey!\nHold on, let me go, let me go… 999 boys. Alrighty, boys.\nAnd with this, the final diamond. One thousand diamonds! Let's go! Challenge #2 complete. Next challenge is about to be\nupon us, boys. And what I'll tell you right now, no matter what it is, fellas,\nwe stick together. You know we gonna\nmake it happen, bro. And now that the group was finding\nthe challenges a little too easy, I decided to reveal\nthat the hardest one yet was sitting directly\nunder their nose the entire time. Welcome to Day 300. Since you gave me 1,000 diamonds,\nyou are all safe for now. For your next challenge,\nlook underneath green’s bed, not in Minecraft,\nbut in real life. Whoa, you got something under there? Boys, yo! - Has that always been in there?\n- Come on, fellas. Inside is a step by step blueprint\nfor a massive creeper build. Fail to build it in the next 100 days\nwill result in your elimination. No shot. We need beacons, boys. TNT. Oh my goodness, fellas. It's gotta be made completely\nout of emeralds, bro. This is where we'll need to use\nall 100 days. We need 64 TNT, 2 beacons, 254 coal blocks\nand 928 emeralds. I feel like we should\nknock out the Wither first. I feel like that’s\nthe hardest part. And with only 100 days to complete\nthis challenge, the boys decided that going after\nthe Wither would be their first goal, which turned out to be tougher\nthan they ever imagined. Two days in and no skulls. Has anybody got one? No. That's the hardest part,\nI told you. Wow. That's crazy. As days passed with no luck of getting\nthe materials needed to make the Wither, the boys decided it would be best\nto split up. Weaving chosen to continue farming,\nhaving Hassan gather all the emeralds, and leaving Sunny and Sweat to collect\nall the coal blocks and TNT. How many coal blocks do we need? 254. 254 coal blocks? Well, once we fill up\n2 whole chests, we might as well just start\nbuilding the thing. I say we don't start building\nuntil we kill the Wither. I got a skull, I got a skull. Nice, nice, nice boy. They were already 50 days in\nand had everybody working to do their part to gather materials\nand build this creeper. But unfortunately, time was not\ntheir friend in this challenge. Right now me and the boys\ngot a super good flow going. All the coal blocks,\nall the TNT. So now we're just grinding out\nthese emeralds. We're about 20% of our way\nthrough the emeralds. We're still not super ahead of like\nactually going through all 100 days. 10,000 emeralds. It's easy, it's easy.\nCome on. Dude what is up with this Fletcher asking\nfor 57 sticks, bro. We're at 61% complete\nwith the emeralds. Jesus, bro. But we still gotta have time to build it\nand kill the Withers. We really can't waste time, boys. How many emeralds, bro? With $100,000 on the line, each day that passed by\nmade the boys increasingly nervous. I think the biggest thing that I’m always,\nlike, what's going on outside? Like, what's going on with my people?\nWhat’re they up to? Coming here has always been kinda, like,\na night and day difference for me. I'm so used to doing stuff solo that it's\nhard to talk to other people sometimes. Like, I always feel like\nwhat I say is stupid. I just want to contribute. I got a skull! [cheering] Let’s go! Get me out of here, man. And with the final ingredient found, the group only had to kill\nthe second hardest boss in the game to get one step closer\nto completing this challenge by Day 400. I’m a little nervous, boys.\nI’m not gonna lie. We’re gonna get pretty far away so he doesn't destroy literally\nanything of ours. Guys ready?\nEverybody ready? Alright, boys, lock in.\nLock in boys. Not yet, not yet. Backup, backup. Watch out. Give it some space. - Alright, here we go.\n- Light ‘em up boys. Whoa! Watch out, watch out! Whoa, whoa! He's getting close, bro. Bro, immediately is above my head.\nOh, oh! Bro, he’s on you! He's on me, bro.\nHe’s on me. He wants me, bro.\nHe wants me. Hit your shots, fellas. I’m popping an apple. I’m meleeing. Yo, he's all up in your face.\nBro, are you good? He just wants me, bro.\nHe wants me, bro. Get him off him, boys. Kill him. He’s gonna kill me. Put him down! [cheering] I have it.\nI got it, I got it. And after easily killing it\none more time… I’m combo-ing it! I got it. Yeah! Let’s go! All of the boys could finally focus\non gathering their emeralds and collecting everything they needed\nin 41 days. Alright boys, we officially have\nenough emeralds for our build, bro. We got it, boys.\nOh my God. That took forever! My boys… This E right here man, this represents\nmy entire community, our community. I like to have all three of you in. I would not be standing here enjoying\nthis amazing time in my life without this big, beautiful E\nright here so destroy it in pride, knowing\nit will come back better than ever. There it goes. Oh, boys. RIP to E, bro. And after days of hard work,\nthey finally started to build the creeper. Ooh. It’s about to be all worth it. Take it in boys,\nwe’re about to beat it. And with last block placed,\nthey finally completed the challenge. Or so they thought. Wait, wait, wait… The head and everything is right,\nbut the legs are wrong. It's supposed to be front and back. Bruh. Let's get back to work. Yo, what? And after rebuilding it a second time,\nthey were finally done. It’s time to eat some\nFeastables bars, boys. Yeah, you already know it, bro. And with the challenge behind them,\nthe boys laid down to sleep for the last time\nas a group together, not realizing that they had built\ntheir worst nightmare ever and the thing that would\ntear their group apart. Yeah, yeah, look at him, bro.\nLookin’ nice and pretty. That last challenge almost tore us apart. I could put a hole in the wall, bro. Whatever it is,\nwe'll get through it together. Alright, gentlemen. - Whoa!\n- Jimmy! Was this the hardest challenge yet? I'd say it was pretty hard, man. Take a look.\nWhatchu think? It looks exactly like the blueprint\nI gave you guys. Congrats! [cheering] Thank you, thank you! Now, why do you think I needed a giant-sized creeper\nin this exact dimension? Because you're gonna blow it up, dude. Nah, he wouldn't do that\nto us. In exactly 100 days,\nthis creeper you guys just built will evaporate everything\nwithin a million blocks. What!? What? And to make it even more challenging…\nServer, disable the Nether. You'll have to run away\nin the real world. Have fun! Over a million blocks!? We're gonna die, bro. We got to get moving.\nWe gotta get away. Abandon everything, bro. And to realize the gravity\nof their challenge, they decided to measure\njust how long it would take them to do this whole thing\non foot. We’re at 4,000 blocks already,\nand it's been like what 10, 20 minutes? It might be impossible. I did the math, and without the Elytras,\nwe're not gonna make it. The only way to complete this challenge\nis by flying, which made one of them nervous because they've never done that\nin Minecraft before. Seven hours of flying is still insane. Like, I've never even touched the Elytra\nor like checked out an End City, so it's like, now you gotta master it\nand be a million blocks away in less than, like, 33 hours. Knowing that they would need to fly\nto win the $100,000, the group got to work getting\na pair of wings for everybody, sacrificing precious time\nthat they didn't have. This one's terrifying. Hey, we'll take our time. We're on fine pace, bro.\nWe'll take our time, boys. We got this. And after their most dangerous mission, where one fatal slip could end\nthe entire challenge, everybody got their wings,\nand they were ready to fly. Found it, boys. Found it, boys.\nFirst Elytra found, boys. Yessir! All four of us got Elytra already.\nBro, let's go! Alright, boys, this is it.\nOur last look at our world, men. Goodbye, Cream Cheese.\nGoodbye, Camoke. Four hundred days ago,\nwe started this base and we put all this work in. Fellas, life is all about starting anew, and if you're nervous about it,\njust do it nervous, boys. Let's ride! Like, we’re already at 500 blocks.\nThat’s actually crazy. And they had to be careful because\nif they flew into a wall or if they fell out of the sky,\nit would mean absolute death for them. Which is why I sent in Majd\nto send them a little surprise to help them on the rest\nof their journey. Aye! I heard you guys were bored!\nWhat are you doing? Man, you guys are locked in.\nI've never seen you guys so locked before. These are Jack Link's. Ooh! Me and Jack Link’s have partnered\nto create some of the best meat snacks ever made, like beef jerky\nand even these brand new beef steaks filled with 100% beef\nand packed with protein. Put it on your bed. Alright, bro, good.\nThis’ll keep us fueled, bro. We've got a bunch of different flavors, and they're available everywhere\nthat you shop for snacks. So go try them out,\nand let me know what you think. Wait, why is there a hole in the wall? Don't worry about it, bro. And after a few hours of flying,\nthe boys were finally on pace. But some of them\nweren't taking the challenge too well. Sunny? [unintelligible] Yeah, yeah. Sunny, you ok, bro?\nI'm concerned for you, bro. [sigh] [trills lips] We all gotta get through this together. Dude, I'm worried for you, bro. I mean, dude, I’m in some\nuncharted territory, boys. I'm not trying to be the deadweight. Yeah, I don't know. I don't like seeing\nmy brother feeling down, bro. Bring it in, bro. We got this, bro. We're gonna be locked in on this. Bro, you'll be an Elytra pro\nby the end of this, bro. I gotta ask boys, is there any more--\nIs there anything else I should be doing? What do you mean? Like, you guys bounce off\nof each other really well, and I feel like I'm very, just technical\nabout it-- Bro, you're just you, bro. Like, we all have a part to play\nin this dynamic, bro. I just wanna make sure\nI'm not killing the vibes or anything. Nah, bro. We’re chillin’. We want you to be you. If anything, I feel like I'm not the one\nbouncing off everyone. Nah, dude, what? Like, everyone's got\ntheir own thing, bro. Like… Our base wouldn’t look a third as good\nas it does without Chosen, bro. But now it's getting all blown up, like… And they just started\nto get confident flying… Oh… Oh… Oh… Ooh! Ooh, ooh! Nah, I just proved myself\nas a master right there, boys. I'm not even really--\nwe’re on pace.  We’re gonna be over pace soon. Ayy!! In the 100K club! What a fun challenge, right boys? [gasp] Oh, I'm dead, I'm dead! Ah… - Whoa, whoa. Chill, bro!\n- Yo, yo. Chosen, Chosen! Oh, my God… What just happened, bro? My heart just sank to my stomach, bro. I was eating, and since I had my armor\nin my off hand, when I finished eating,\nit switched out my armor and I couldn't get it switched\nquick enough. Do not offhand your chest plate, bro. Please, none of you, bro. Bro, I'm like physically shaking. Nah, it literally would've been\na nightmare scenario. I don't know what we would've done. Oh, God. If there wasn't a tree there,\nI'd have been 100% dead. One close call was enough to shake\nsome of the boys to go to sleep, while others decided to fly\nthrough the entire night. Are you trying to go all the way\nto the million, bro? 100%. It’s gonna be a lot, bro. This is 600,000 blocks.\n400,000 more to go. God… I don't even feel like\na real person right now. What is goin’ on? I'm starting to see two crosshairs, bro. Listen, bro. If there’s one person\nI don't wanna lose, bro, in this challenge,\nit's you, my friend. Chosen, whenever you're done, bro,\nyou should come eat with us. I just wanna catch up because I feel like\nI'm, like, draggin’ behind. I just don’t wanna be dead weight. Brother, you are not dead weight. You built our base, brother. You built the thing we sleep in\nevery night. Yeah, bro. We're all trying\nto make it happen. That is true. They finally started to get ahead and it looked like they'd have a chance\nat completing this challenge. But all of them forgot just how dangerous\nthis game is when you only have one life\nand $100,000 on the line. No-- [gasp] Oh my gosh. Oh my gosh, bro. The unthinkable happened. There's no way. Oh my god, bro. No, no, no… [weeping] No, bro.\nNo, please, no… I’m so sorry, bro… [sobbing] I needed this so bad… I needed this so bad, man…. Goin’ home a failure, bro… That’s not true. Don't say that, bro.\nDon't say that. Yo. You say you gave it\nyour best shot, and what happened to you\ncould have happened to anybody. But I wanted it to be the four of us\nmakin’ it to the end. Bring it in, bro. I’m good, man.\nI appreciate y'all, man. You're a brother for life, bro.\nFor life. It doesn't change any of that. How you doing, buddy? It's genuinely heartbreaking. To be runnin’ away from a creeper\nthat's gonna blow up a million blocks… To then run into a creeper. That's what takes me out.\nIt's kind of, it's very, uh, it's ironic. The number one thing that all three\nof our concern is right now is getting this video done\nso we can do you justice, man. For real. And with Chosen eliminated, all players now had a chance\nat winning $33,000. Alright well, the only way\nwe're gonna be able to make it through the next 552 days, boys, is with a good night's rest.\nYou especially. We need to win. And after getting some rest, each one of them started\nto finish the challenge. This is for my boy Chosen. There it is, baby! One million blocks travelled\nin hardcore Minecraft. Ay, I made it, bro. Let's go. Ayy! Let's go, fellas. Let's go, boys.\nI'm coming in, bro. I see him! It's a bird…\nIt’s a plane… Thread it, thread it! Yes!! Yes!! A million blocks, boys! A million blocks! Get me out of this Elytra, bro. [chuckling] We're gonna have to come back\nbetter than ever, fellas. Gotta do it for our boy. Our boy Chosen, man. Our boy Chosen. He's not here to see this.\nTook a lot of the journey with us. I'm actually very impressed you made it\nmore than a million blocks away. And now all that's left to do\nis blow up the creeper. Whoa, whoa, whoa! Whoa, whoa, whoa! No!! Emmy! Emmy! No! No! Alright, boys. Well… Everything from this point on, bro,\nis our new world. Everything we've ever known is gone. And after having some cake to celebrate\nsurviving over 500 days… There we go, boys.\nCheers, boys. It was time to reveal the next challenge. Boys. The TV. Clearly, you guys are good at the game,\nbut now let's see how good. Server, spawn the parkour course. No… You have 100 days to complete\nthis impossible parkour, but you need to complete it\nin the order you decide right now. Meaning that you all have to wait\nuntil the first player is done. And if you're the last player, you have to wait until everybody else\nhas completed the course. And anyone who has not crossed\nthe finish line when the 100 days is up, will be eliminated. I think he, he should go first.\nI'll go second. Yeah, and I can go last, boys. Oh, boys. I'm a little nervous, fellas. Alright, boys.\nI'm gonna go check it out. Good luck, Sweat.\nYou got this, bro. While Sweat’s doing\nthe parkour course, I’m gonna spend my time kinda\nrebuilding our base right now because we've got no home, man,\nthis is our new home. I think he’s gonna beat it\non day one. I think he's about to beat it\nright now. And like I told them,\neach challenge gets harder. Pushing everybody to their limit,\neven their best player. Nah, this is definitely gonna be\npretty hard. And green's got some decently hard jumps. The most annoying part about this is that\nit's just going to be very tedious, even like on the easy ones, like there's stuff where you can fail\nand you just have to restart. And he was right,\nbecause every attempt that he took ate up precious time from the rest\nof the group to complete their challenge. The longer he took, the less time they had\nto complete the challenge. And as time passed\nand tensions rose, the remaining players got\nincreasingly worried. My only concern over here is that\nwhen like, I do the parkour course, guys, that I wanna be able to finish it\nand leave enough time for Sunny to complete the course. I mean, boys, I don't know\nif you wanna know my opinion right now. I'm not gonna lie. And even though the energy\nof the team was at an all time low, Sweat made it further and further\nwith every day that passed by, until he finally reached the hardest part\nof the entire parkour course. Are you on red? Yeah. I've never been more nervous\nplaying parkour before. And after hundreds of attempts\nand eight in-game days, Sweat finally completed the course. Let's go!! You got it? Let's go! Let's go, dude! Alright, I gotchu, boys.\nBro, I leave you with 92 days. I'm goin’ in, I'm goin’ in. Alright, Hassan.\nYou got this, bro. 92 Minecraft days sounds like\na lot of time, but Sweat realized that their only chance\nof succeeding as a team would be if he worked together\nand coached them through one of the hardest\nobstacle courses he's ever done. I can't grab these ladders, bro.\nI don't know what's going on? Hold space.\nYou hold space on the ladders. Oh, you hold space\non the ladders… Yeah, you should always do that mostly. Oh, there we go. So, run a little,\nget some momentum… Aye, there you go.\nThere you go. Good stuff, good stuff. Ok. This next one's really tricky. Yeah. Just jump to the ladder… - Yeah, just sprint jump--\n- Bro. It's fine, bro. You’re fine. Your personal best, bro.\nDon't be upset about it. And after Hassan took over double the time\nthat Sweat used, the group started to think of genius ways\nthat they could skip parts of the course. I'm gonna grab some ice,\nand I’m gonna come back… and we're gonna see\nif we can launch Hassan in a boat onto the top\nof the parkour platform, bro. And claim victory. Even if you get to the red, like,\nwe’ll be good, I feel like. Let's just see what kinda\ndistance you get. This is test number one, boys.\nWhatever happens, happens. Just send it, bro. Just send it. Hassan, just hold 'W,' bro. Here we go, here we go. Lock in. Second yellow, second yellow! Almost second yellow. You can literally just skip it all\nand then start doing it like that. But even after building a skip and a beacon that gave the group\na power-up of jump boost, they still thought that Sunny might not\nhave enough time to actually beat the challenge. You should get some sleep, bro. Just petrified that I'm going to ruin\nboth of our chances out here, bro. But if you sleep\nand then you wake up fresh and you have the shortcut\nand you somehow lock in, that's your best bet, right? Yeah. Ok.\nOk, ok. I'm going to bed.\nI'll see you in the morning, bro. And as Hassan went to sleep,\nSunny couldn't help but think that this might be his last night\nin the entire challenge. It's just so crazy, bro, like… Oh, I've been in there having\nsuch a good time with the fellas. This is not something\nI could have ever done by myself. Like I'm so grateful and I just… I guess I want to be proud of myself for making it through this\nand winning and… Oh god, like… I wish I could tell my mom about it. Ok, here we are.\nWe’re on the first platform. Let’s lock in, boys. Hey, he's at red. He's at red? Sunny, I’m at red. Sunny, I’m at red! But as quickly as they gained hope,\nthey also lost it just as fast. No… No, no, no. It was the slime jump,\nI just miscalculated it. It’s not impossible. Like I think he’ll get it pretty soon.\nHe should. But-- You won't have that much time. No. No, I’ll have to basically like\nmiracle run it. Alright, I'm back on red again. Alright, bro. That's good. You just pretty much need to not hesitate\nafter you leave the first ladder. And you just kind of have to send it,\nand then like readjust yourself. Bro. You caught it there,\nbut then you kept like-- Yeah. Dude I want Hassan to get this\nso bad bro, like… That's all that matters, bro.\nAt this point, like… Bro, my chance of getting out--\nlike getting through it is… And 89 days into the challenge,\nHassan finally completed the parkour. And then, I did it. Yo, you did it? Did he do it? Yes! Yes! Yes! That is what I'm talking about, bro. Alright, bro. Lock in.\nGet off the course. We'll celebrate later, bro. And getting straight to work,\nSunny only had 11 days to complete this parkour challenge. Three hours and 40 minutes\nto give it my best shot. Alright bro,\nthat's all I can do is try. But even with the jump boost\nand the parkour skip, Sunny would need a miracle\nto pull this off. I got it. [sighs] - Don’t worry I’m gonna stop.\n- Good. Alright. Just take a sec.\nYou got it, bro. You got it, bro.\nWipe your hands. Bro, bro, bro.\nMy bad. Nah, you're good.\nWipe your hands, bro. Oh bro. Ok. And after only 4 days,\nSunny got to the red section faster than anybody else had. - You got this bro.\n- I know, I'm just-- Good pace. Yeah, I'm just centering myself. Yeah. You're good. Ok. Yep. Ok. Alright, bro.\nAlright, back to red. Yup. Like, just jump to a ladder. Like Hassan’s, like, issue was\nhe was jumping in between two ladders\non the corner. So I'm just saying.\nLike, yeah, just jump to a ladder. And then you go around\nto the right side. See, there's a ladder there? Just like you did it before.\nYup, there’s another one. Oh, oh, oh. Yeah. I'm freaking out, bro. I want to get in that mode of taking\na break to let myself relax, but I can't. You're capable of it easily. I know, man, if I just had\na little more time. Alright, that part’s done, bro.\nThat part’s done. Ok. It’s just a different color, bro. I’ve already won, bro.\nIt’s all good. It’s alright, bro. It’s alright, it’s alright, it’s alright… You good, Sunny? Yeah, man.\nI'm good, bro. I'm good, man. I just have so many\nemotions flowing through me right now. It's crazy, bro. Oh, dude, I’m gonna like\nburst down to tears, bro. And I don’t even know why, dude. I wanna win, I wanna be here\nwith you guys. But then I'm thinking about, like… Just how insane this is.\nLike, dude, there's so many emotions. And as the sun rose just seconds away\nfrom Day 600. I was, you know, putting a lot\nof pressure on you guys. And I wasn’t gonna let you down.\nI promise you. You were the glue, bro. Like, we wouldn’t have had half\nof these funny times, bro. I felt so comfortable\nwith you guys, bro, like… I was just so overwhelmingly happy that I got to be here, do this,\nand be with you guys. Ah, boys. Fellas. Oh… It's good boys.\nCome here. It's alright, bro. Don’t ever apologize, brother. You being here made this experience, like,\n100x better and 100x crazier, bro. I think if it wasn't for you, bro, we wouldn't have got to know each other\nas better as we did, bro. I felt so comfortable with you guys, bro. Like, it literally blew my mind, bro, like just how close we got\nand how fast, bro. And dude, it feels like I've known\nyou guys since, like, middle school, dude. How many days have you been living here? I've been in this room for 10 days. For 10 days,\nyou've been living in this make-believe Minecraft house\nplaying Minecraft. Now it's time to go to the real world. I love you guys, man. Thank you so much for this experience.\nLove you, guys - Love you, bro.\n- See you later, brother. At the start of this video,\nthere was 4 contestants. Now there's only 2. Is it gonna get down to 1? - I hope not.\n- I hope not, brother. And now with only 2 of you left standing, you each have the chance to win $50,000\nif you survive for the next 400 days. And now for Day 600.\nServer, summon the chests. Whoa, the chests? Whoa, whoa, whoa, whoa, whoa… What is this? Inside of each chest, I've hidden something that will help you\nin the next challenge. But you need to find your chest hidden somewhere randomly\nin this world before Day 700. If you fail to find your chest,\nyou will be eliminated. Take this item.\nIt'll help you find your chest. Good luck and I'll see you on Day 700. Alright, Hassan, bro. I hope you find your chest, man. With their golden eyes guiding them\nto where their chests were randomly placed Sweat realized very quickly that he might\nhave to travel to a different dimension. Ohh. It looks like mine's\nin the Nether, bro. What if mine's\nin the End Portal? It's possible, bro. The End portal is that way. And while Sweat journeyed\nthrough the Nether, Hassan headed\nto the nearest End Portal, convinced that that is where\nhis chest would be hiding. Where could you hide something\nin the End? It seems simple,\nbut it will not be easy. I want to go\nto the End right now. Have fun, I guess, bro. And now that he was all alone\nin the End, Hassan realized\njust how dangerous this actually was to travel with his limited resources and started to doubt\nif he was even ready for this challenge. The worst part is I’m gonna go all this\nway right now with my limited resources. Like the first two were, like,\nteamwork based and now this is just like,\nwhat are we doing bro? Bro, be careful, bro. But knowing that the clock was ticking, Hassan took the risk\nand pushed forward all alone. Damn, bro, how far\ninto the void is this? Dude, at least the End is, like,\neasy terrain where I can just fly\nover all of this. And only a couple of minutes\ninto the challenge, Hassan realized\nthat luck was on his side. Oh. I found it! You found the chest? I found it. Come here, look. - What? You found it already?\n- I found it! Yo, yo, yo! Aye, bro, that's the challenge.\nThat’s good to see, bro. Day 1. Yes, sir. What'd you get? What'd you get, bro?\nWhat happened? 64 sponges. Let's go. Hold on to those.\nThat's definitely-- we’re about to have to use them\nfor something, I bet. But unfortunately, as easy\nas it looked for Hassan, Sweat's journey into the Nether\nwas the exact opposite. Days passed by without him even knowing\nwhere his chest could possibly be. Continuing my trek through the Nether,\nlookin' for my chest. Like how far can this be?\nHopefully I find it soon. And with the challenge\ncompletely behind him, Hassan took the time\nto catch up on some sleep, which seemed to bother sweatgod. It’s actually kind of absurd\nthat he literally got his Day 1. I've traveled 50K blocks in here\nand don’t even know if I’m close or not. This is so annoying.\nLike, why is mine so hard? Oh, man.\nBro, why? And with every day that passed,\nSweat seemed to get more and more afraid, even questioning if he would make it\nthe rest of the 1,000 days. Yeah, I don't even know, bro.\nI might just give up on this, like, thing. And while Sweat was having problems\nof his own, Hassan decided to try\nand bring the mood back in, maybe, unintentional ways. Oh. Did you just break the bed? Yeah. [laughs] Yo, I just broke the bed! Yo, bro. Dude, I don't know. I think I’m eating\ntoo much Biscuitville bro. You’ve been eating too much Biscuitville. And after 60 long days\nof searching day and night, Sweat seem to have finally had\na glimmer of hope. What is this noise I'm hearing? Is it below the lava? Something’s going on\nwith my eye here. Yes! You got it? - Finally, bro.\n- Let's go! Let's go! 60,000 blocks in the Nether, bro. I finally found him. Now I gotta go\nall the way back. And after a long journey home, it was finally time\nto reveal the Day 700 challenge. Aye! Day 700! Another 100 days, bro.\nJust me and you, bro. We got this, brother.\nWe got this. Congratulations on finding your chest\nin the sponges on Day 700. By Day 800,\nyou need to use those sponges to drain the entire ocean\nunderneath the parkour course. If there's any block of water\nunder there on Day 800, you will all be eliminated. Yeah, bro, we got our work cut out for us. Here's what I think we do.\nWe're gonna rely on like blocks more. As we block off more of it,\nthen we can start using the sponges. Oh, yeah. Oh, yeah.\nI got the tech. Ok. You did? I figured it out.\nI think this will work. Ooh. You see what I mean? It's a lot of work,\nbut we’ll get it done for sure. Very tedious. And by trading with villagers, Hassan managed to get\na respiration enchantment for his helmet, letting them stay under water way longer\nwithout needing to worry about drowning. - Respiration III.\n- Huge. I'm telling you,\nthis is gonna be so clutch for like our pace underwater especially. And unfortunately for them,\nwith only 2 players left surviving, this challenge was proving\nto be way more difficult. We’re not letting water take us out bro,\nthat's not happening. I know, bro. That's not happening. And we're gonna get on schedule.\nWe're gonna get on pace. Wake up early, get back on the game,\nand get this done. Alright. Good night, bro. Yeah, good night, man. And after getting a good night's sleep,\nthey went right back to work, but realized\nthat they were way behind schedule. Feels super slow. Like I don't get, like,\nwe're missing something, bro. I don't get it, bro. I'm thinking the only way\nto pick up the pace is more sponges. Netherite might be faster. I feel like a zombie right now. And even with their strategy,\nthey were still off pace realizing that they were probably\nmissing something important. Let me go check out the monument, bro.\nWish me luck. The other guardian.\nWhat's going on in here, bruh? Let me come take a look. Are you attacking him?\nAre you fighting it right now? Yeah, I’m fighting him.\nOh. He's dead. Wait, I killed him already, bro.\nThere's a bunch of sponges in here. A mountain of sponges,\nthe thing they desperately needed. This is changing everything. But also a dark secret hidden\ninside of the chest. That carried something\nthat could tear their group apart. Wait, there's a book in here. Wait. There’s a book in here.\nWhat does it say? Hold on. Sweat was given the ultimate decision. If he took the book\nand kept it in his inventory, on Day 999, Hassan would die\na mysterious death, leaving only Sweat the winner\nof the $100,000. And nobody would know\nuntil the video is uploaded. What did the book say, bro? Or he could leave the book in the chest\nand pretend it never happened, but he would run the risk\nof Hassan finding the book instead. Can't do it. What happened? I put the book back.\nIt's all you gotta know. Yo. Tell me what the book said. Keeping it a secret.\nSweat decided to stay quiet. We need a break, bro. This is going to be, like,\nnonstop still for a while. If we tap out now, bro,\nwe’re the dumbest people on Earth, bro. A lot of work, but for 50K,\nbro, anyone's doing this. This is the first challenge where\nmy body's actually in, like, discomfort. It's crazy how much, like,\nthe vibes have changed in a few days. Even with the extra sponges, their pace was nowhere near\nwhere they needed to be. So I realized that I needed to step in. Gentlemen, how you doin’? Amazing. I wouldn't say that. You guys are now three fourths\nof the way through the video. Have you had any issues\nduring the last 12 days? Yeah, we had 4 contestants here,\nnow it’s just 2 of us in this-- Well, I mean, with the laptop.\nHave you had any-- Oh, no, no… That's because these laptops\nhave the power of Intel Core Ultra 9 processors\ninside of them. Which basically means even though\nthis is a laptop, it has the power\nof a desktop. I've actually noticed that. I'm looking at this ocean,\nand you're not halfway done. Would it help you\nif I put a sponge here for you? Yeah, no, this is fantastic. Maybe I should come\nhelp you, huh? I'll lay some sponges as long\nas you tell the viewers about Lenovo. Not only is it 240hz refresh rate, but I've been playing\naround the house, bro. In my beds, outside,\non the floor. It's basically like having a desktop,\nbut you can take it wherever you want. It's the best of both worlds. Dang, I might have to get one. And for whatever reason, Lenovo and Intel sent me a pallet\nof laptops, as you see right here to give away to random people\nthat subscribe to the channel. So if you haven't already,\nsubscribe to MrBeast gaming, you can literally win one\nof these laptops. Yo, good looks, Jimmy. You’re doing a great job\nwith these sponges, man. Well, I mean,\nyou're doing a great job. Oh wait, you stopped talking\nabout Lenovo laptops. Oh. You know what, bro?\nI’m about to pour lava on just this row. Yo Majd, bro.\nChill out, bro. Even with all this lava, bro,\nI’m still not dropping any frames, bro, on the Lenovo Legion powered\nby the Intel Core Ultra 9 processor, bro. You know, not only are the Lenovo laptops\nsuper powerful, but they also look pretty clean\nand sleek too. Look at the RGB on these things. Are you just saying that\nbecause I'm laying sponges for you? There's some crazy stuff\ngoing on up here. Absolutely not. That's the power of Lenovo\nwith Intel inside. Thank you Lenovo and Intel\nfor sponsoring this video. If you're using a different laptop\nthan their's, you're just an idiot. Unfreeze their game. - Oh, whoa. Watch out.\n- Yo, Jimmy! Good luck, gentlemen.\nI hope they don't die. Yo, what? And thanks to our friends\nat Lenovo and Intel, the boys were finally back on pace. But Sweat still had something\non his mind that he just couldn't\nkeep to himself any longer. Dude, basically,\nif I kept this book? Yeah? You would die a mysterious death\nand I would get the entire prize pool. You’re lying! Just know we’re in this together, bro. I could have done that,\nand I didn’t. I know, bro. We're not losin’ here, bro. And with this seemingly impossible task\nbehind them, the boys rearranged their room to prepare for what I might have\nfor them on Day 800. I think we only have 12 more lanes. I've been in this room too long. Whatever the next one\nthat’s gonna be more difficult, bro, there's no way that\nthere's gonna be a challenge more, just, evil\nthan this one, brother. Alright, Sweat.\nReady, dude, this is it. The last bit of water, Sweat. We completely emptied out\nthe entire ocean. And while Hassan was asleep, Sweat decided to take a secret trip\nin the middle of the night. Boys, over the last 100 days,\nyou have been draining this entire ocean. I’m pretty confident\nthere’s no water. Server, reveal the results. - Yeah!\n- Yeah! Let's go! Yes, sir! Congratulations. You both have\nsuccessfully drained the entire ocean. And with that, turn around\nand turn your attention to the screen. Here we go, bro. You're now 200 days away\nfrom locking in that $100,000 in cash. Because you've been doing so great, I'm not going to give you a challenge\non Day 800 or Day 900. In fact, you only have one challenge left,\nand that will be on Day 999. Server, spawn in the money! Yo, what is that? Look at all this money, bro.\nWhat's going on? MrBeast, what's going on, bro? You see, on Day 999, 999 creepers will rain from the sky\nand attack this money. Every block they destroy will remove\n$1,000 from your prize pool. And if the creepers destroy every block, you guys just did\nthis entire video for nothing. And in case you thought\nthis would be easy, we've genetically modified these creepers to make sure that they are the most\ndangerous ever made in the game. They can climb walls,\nthey can blow up obsidian, and they will stop at nothing\nuntil they've blown up every block of money that you have. Good luck. I'll see you on Day 999. Ok, so this is why we need\nall of the time to prepare. Even though he said\nit can break obsidian, that's still the strongest block\nwe can get. And with their money on the line,\nthey wasted no time thinking of what they could build\nto defend their money. Layers and layers\nof water and obsidian. If we just dig trenches\nthat they fall into, then they're just cooked. I'm-- dude, literally all I'm doing\nall day is mining obsidian. I think by Day 900, bro,\nwe can be prepared. That's it, bro.\nI’m eating a Feastable, I think. This cube is insane. The obsidian box for our money\nis coming along. We still got a ways to go, but sitting at about 60 Iron Golems\nright now as well that'll help us fight them. So, Hassan’s out collecting iron now. The more they built, the more confident\nthey got in their defenses. But there was still one thing\nthat they couldn't stop thinking about. Literally, I'm only worried\nabout it dropping directly on it. If it doesn’t,\nif it's not doing that a lot, we're good. It would be kind of ridiculous if they're just falling directly\nonto the top. And as the challenge went on,\nsomething seemed off about Sweat. Our priority is keep it away\nfrom the money. No creepers touchin’ my money, bro. It's also way more motivating going through all this for half\nof the amount that we're getting now. I’m gonna kick back for about 17 hours\nand then start mining obsidian again. I want that 50K, bro. You took that book, bro? How should I know? Good morning. Today we're back\nto the mines for one last time to get as much obsidian as we can\nto make our tarp above our layer\nof the obsidian block. We just gotta stall\nfor ten minutes, bro. I'm just worried it's gonna be literally,\nlike, impossible. What's psyching you out is you don't know\nhow the creepers are gonna spawn in. Yeah. Worst case scenario,\nthey break 5 blocks of our money. If they get that far, we're gone.\nLike, we're done. If they get into the inside,\nthen it's cooked. Dude, this is insane.\nThere's no way they get through this, bro. Look at this, bro. And with their preparations\nfinally complete, there was only one thing left\nfor Sweat to do. Nah I was just kidding, bro. No way you guys actually thought\nI would do my boy like that. Boop. See ya! We got this, bro. We got this, bro. Gentlemen, it's about to be Day 1000. The sun is going down. And as you know on Day 1000,\nyou officially win that $100,000. But an army of creepers are gonna rain\non top of it. No creeper comin’ through\nto that money. We lost one of our guys\nto a creeper. We lost our old home\nto a giant creeper bro. Sunny and Chosen.\nThis is for them. 3, 2, 1… Bring the creepers! They’re coming, bro. It is now the night of Day 999. Will they survive? I see em, I see em, I see em.\nI'm going for em. Just keep bowing from a distance, bro.\nTell me if you need help. There's another layer following. There's another layer\nfollowing a little bit closer. Layer #2 drop,\nthey’re all on the ground. It is blowing up like crazy! Alright. They're getting close\nto the obsidian. I just took out so many, bro.\nI just took out so many. Alright now this is where it gets fun.\nNow they're starting to land on the roof. Go roof, Sweat. They're breaking holes in the roof! I'm not sure what I can-- You should come up with me\nif they're not released, if you're not stressed down there,\nyou should come up too. Ok. Ok. Alright. Another wave is hitting the roof. Here they come! You are surrounded\nby creepers right now. Oh, they're breaking premature holes.\nNow they're falling down to the bottom. Dude, there's so many creepers\non the roof right now. I can’t even play, bruh.\nI don't know. They're all falling through.\nI'm placing water. The water held it! I’m patching. There's $100,000 on the line. Two minutes left\nin the night, gentlemen. They're falling, they're falling… I'm just [unintelligible] from here. Oh, they're converging. This is where having 4 people\nwould have been nice. They're getting in. Can you patch? Oh, they are blowing holes. I’m patching. I’m patching. It's gotta be so close\nto 10 minutes. Last wave,\nthe final wave is the biggest wave! No, place water everywhere.\nSpread the water if you can. Oh, they are going layer by layer. This is your do or die, man. They're almost gone. Nice, good hit!\nThis is it! Is that it? I don't see any. It's Day 1000! Let's go! [cheering] You guys did it! [Laughs] Guys, I hate to break the news though,\nbut you did lose $400. Who cares! And if you guys wanna win something\nlike they did, just subscribe. You can win a brand new laptop. Let's go!",
    "start_time": 0.017,
    "end_time": 2896.183
}