{
    "video_id": "YWeEE9vchDo",
    "channel_url": "@mrbeastgaming",
    "transcript": "I hired the best builders in Minecraft\nto create the deadliest traps ever made. And my friends are going to attempt\nto survive them, starting with this $1 trap\nthat a literal baby could survive. Only $1? Do not press. I bet you a baby wouldn't do this. Oh no. Hey! Get outta here! No, I died! Oh Majd, dude. Is this the trap? Time to rate the build. And whichever build\ngets the highest rating by the end of this video, will get an extra $10,000. Ok, I mean, it’s only $1. Like, these traps are gonna\nget expensive. For only $1, this is a pretty simple\nand fun trap, so I'm gonna give it a 4. I'm gonna have to give this trap a 4.5. I'm gonna give it a five. I liked that it got Majd out,\nso I'm gonna give it a 6. Wow! Up next we have this $100 castle containing some of\nthe deadliest lava traps ever made. Alright guys, let's do this. Let's figure it out. Guys. Parkour! I'm going on the side for sure. I got it, I got it. Jump! Let's go! Oh, what is that? I don't like the pressure plates,\nbut I'mma go for it. Ok, nothing happened. Karl, no! Oh my God! Come to me! Oh my gosh. Go, go! Chand! Alright, we're through\nthe flaming balls of fire. Let's move on. I see pressure plates. Ok, I'm just gonna go. Karl! Oh, no. Oh, it wasn't me. Ok. No one push each other. I'm going left. I'm taking a right here, Karl. Oh, no! I'm burning! Dude, it's so sensitive. You just touch the lava and\nyou start dying. If I die right now,\nI'm about to freak out. Oh my gosh! Ok, ok. Alright. I'm gonna get it. Ok, you can't go through the lava.\nThat is not the move. Wait, Karl I’m right behind you. Come on! Oh, we made it! I literally one shot that. Difficulty 10, boys.\nI'll say that. Should we go rescue Majd or just like,\nleave him out there to rot. No, no, no, I got this. Well, we'll just hang out\nhere until then. I'm almost there. Dude ok, I don't have any more\ngolden apples. It's gonna be a minute. Do not try to just go through the wall.\nIt's not gonna work. Oh my gosh. Let's go, Majd. Let's go! Alright Majd, you made it. Alright guys, let's keep going. We've been in here for a while. Dude this castle just keeps going. I don't know if this is ever gonna end. Wait guys, there's a book. You've come so far, and all you need to do is pass\nthe very last challenge. Alright, let's get it. What do we do? No! Oh! Purp, which one is it? It’s gotta be right. Let's go. Oh, it was right. Wait, what just happened? Bro, there's no way you fell for that. Chandler, we’re almost here. Oh my gosh. No way! I made it. I made it too! We won! Let's go! Thank goodness for the golden apples, bro.\nI don't know if we would’ve made that. For $100, that was really good. It's time to rate this. This build blew me out of the water. Into the lava, more like it. I have to give it an 8.5 out of 10. There were tons of traps and\nthe build itself is awesome. I'll give it a 7.5. If you told me this was the $1,000 trap,\nI would've believed you. I'm gonna give this\na 9 out of 10. Wow! 9? I rate this trap a 7.\nI give it a solid 7. Liv, you got a 32 out of a potential\n40 points on this. - Oh my goodness. Thank you!\n- Thank you, Liv. Boys, welcome to the $500 Island. $500 trap. Let's do this. Alrighty guys, let's go. There's a book! A king resides somewhere\non this island. I hear TNT! Watch out! Uh, oh. I think we do have to\ncome down here, boys. Alright, let's go. What am I dying to, bro? Bro, what is this on the ground? Guys, it looks like\nthey're gonna keep spawning. Yo, we gotta go. Run, run! Go up the ladders!\nOh, this looks like a lot of TNT. Are we, do have to blast\nthrough this door? Oh, wait. Dude, there's literally just\nflint and steel inside this barrel. Alright, I'm gonna light it. Light it up. I'm backing off! Watch out! And there is his tomb. Full steam ahead, boys. Guys, there's a trip wire right there. Oh, I do see that tripwire. Let’s read this book. The king has hidden his treasure\nbehind his throne. You may need to make use of\ncreepers to get in. Oh, I heard a creeper.\nI don't know where from. Oh, I see him, I see him. Oh, they’re coming up\nthe stairs. Oh my God,\nthey're all coming out. Oh my God. They're all down low. Oh my God! Guys, listen. The book said we may need\nto use the creepers to get the treasure. We have to lead creepers\nto behind the throne and blow it up. Guys, bring creepers up here. Ok, ok. Oh, guys. I'm backing up. Oh, I see, I see. The real prize. Feastables is the real treasure.\nGo buy yourself some now. Go, go, go. Oh, that was the whole trap? That was literally it.\nThis is $500? After the $100 build,\nI was expecting something great. I have some choice ratings\nfor this one… I'm giving this a 3. I'm gonna go ahead and\ngive this a 3.5 out of 10. That's pretty harsh… I'm gonna give a 3. Well I'mma give it a 4. This is definitely not in the lead,\nso let's just move on to the next one. This next trap might be the hardest one\nin the entire video. Welcome to the $1,000 spike trap. Yo, what's up man? Yo, yo. Listen! Hold on. If we take no damage, I will personally\ngive each one of us $100. Alright, deal. Ok. Starting now. Well, there goes the $100. We can skip the maze. Go, go! I'm going, I'm going. Ok. It lowkey is not working for me\nsometimes! Dude, I just finessed.\nI just finessed. Do you think that knocks off points\n'cause we can outsmart the trap? No. I think it's cool that they gave us\ntwo options for that trap. - Right this way.\n- Ok, this way. Let's take this left. Majd, we got parkour again bro,\nso be careful. No! Oh, I made it. There's 2 buttons. I don't know if\nI wanna press them. Alright, I'm gonna try this button. What just happened? - Oh, what the--\n- Oh my God! No! Purp killed us, bro. Alright, let's just focus, guys.\nLet's just focus. Let's just like stop dying. Silverfish. Run, run! Oh, some of them are following us. Oh, no. Some of them are following us! Parkour. Parkour! Run, run! Oh, no. Right this way. I'm going, I'm going. Oh my God, bro. Bro! Just run past them. Yeah, let’s just run past them! I got, I got it. Purpled, why are you still standing\nin the same spot? What am I doing wrong? He’s flaming whoever's\nnearest to him, bro. You like that?\nUh, huh! Alright, we made it.\nUp the stairs we go. Congratulations.\nYou have beaten the map. No way. Yahoo! Wait, this one was good. This one was really good, but I don't--\nMan, I don't know where I rate this. TheGimmicky. Oh, hello. We just did your build and\nwe thought it was epic. I'm glad to hear that. Boys, I'm going first. I'm gonna give this trap a 8. Ooh, an 8. Well, I'm gonna follow that up,\nand I thought that was kinda harsh, but I'm gonna give it an 8. It was a long trap and I loved it,\nso I'm gonna give it an 8. I'm gonna give it an honest rating. I loved the silverfish.\nI loved the map design. I loved the traps. And I loved dying! We can tell, dude. I'm gonna give this a 7! Which puts this one point\nbehind the $100 build. So the $100 build still\nin the lead. Majd seems to be dying the most\non these traps. Let's see if this looks any different\non the $5,000 glass bridge trap. Hi, Nova! What's up? So, $5,000 for this? Guys, we're getting towards\ncar territory, ok? Wait look, we were inside of that!\nThat's a skeleton! Whoa! Oh, that's cool. Glass bridge. Oh… Should I go first? Purp has the least amount of deaths,\nso you should go first. Ok, ok. It's gotta be right. Right! What? Well, we all knew it was left. Yeah. You're bad. I have no idea where to go. I think this one's right.\nThat's my guess. It's gotta be right again.\nIt's gotta be right. You think? Alright, right. No! Wait Chandler, do you remember\nwhich way it was? Well it wasn't that way. Oh, Karl! Alright Purp, it’s your turn, dude. Why is it my--\nWhy is it always my turn? Fine, I'll go. It's this one, guys.\nIt's this one… Alright. Alright. We all made it. Oh, what is that? Oh wait, you get one shot. Karl, this all depends on you. - We did it!\n- Let’s go! Yay! Oh, wait behind us.\nWait what’s happened? That's lighting up. Oh, look! It’s showing the pattern!\nIt’s showing the path! - Wait, left?\n- Left! Left, left. Left, left? Ok.\nLeft then right, right. I think that’s it. Wait, is a right. We did it. Is this it? Nah, there's no way. Is there like an ending? $5,000? I'm gonna need a little bit more content\nfor 5,000, you know? And Majd didn't even die. What's up, Nova? Hey! Nova, this build is pretty sick.\nThe skeleton is awesome. Yeah, how long did it take you\nto make that skeleton? At least, like, two days. Well done. The build is easily the coolest looking\nthing that we've seen yet. Aesthetically, it is very pleasing. That being said, well, you could buy\na used car for the price of this track. I'm gonna give it a 6,\nonly because the skeleton's awesome. I'm gonna give it a 5. I'm gonna give it a 4. I'm gonna have to give it a 4.5. That leaves us with a score of 19.5\nand definitely doesn't win. Let's move on to the next one. I paid this builder $10,000 to make one of the deadliest\ndrowning traps ever made. Alright guys, for the $10,000 trap,\nwhen we press this button, it starts. Escape the water trap! I'm just gonna go. Alright, let's go. I don’t see anything. I pressed it. Oh! Oh! TNT’s falling from the sky! It's like blowing up the whole place.\nOh my gosh. Wait, what do we do? I see water! Wait Purp, follow me. I don't see, like,\nany means of escape. Like, I don't even know\nwhat I'm looking for. Oh wait, is that it? There's no way\nthat’s just it right? This gigantic tunnel\nover here to the side. Chandler, come here. Like I don't know\nwhat to do over here. Oh, we just break\nthrough the wall, Purp. Oh, we're supposed to\nbreak through? Oh. Whoa! I didn't even know\nthis whole build existed! For $10,000 though… Like, I’d expect this to be hard,\nas a $10,000 trap. Alright boys, we're going\nall the way down. I'm blown away. This is like a whole video game. Dude, this maze is crazy. I think one of these holes has to\nlead somewhere. This is gonna be kind of hard, bro.\nI have no idea where to go. There's no direction,\nno arrows, no nothing. What the heck are we supposed to do here? I’m searching around\nfor any openings in the water, guys. You see anything? Wait guys, check out\nthis gigantic tunnel I just found. Ooh! No way.\nThat's pretty cool. Oh my gosh, dude. Alright boys, what next? Wait, this is the end? Buiids! Yo! We're gonna have to rate it\nbased on the trap that we did. I'm cooked. I don’t think this is a $10,000 trap.\nI'm gonna give it like a 4. I'm just gonna give it\na solid 4 just 'cause the outside\nand everything was cool, but the trap did not work. Chandler, that feels\npretty aggressive, dude. I'm gonna give this a 2. Holy cow! I'm gonna rate it a 5.5! That gives it a total score of 15.5. Buiids it was a close call,\nbut unfortunately, you didn't win. Let's move on to the next one! We have this $25,000 sky base\nfilled with the deadliest traps so far. Good luck gentlemen.\nYou're gonna need it. This is what we've been waiting for guys! Dude, look at this place! Come on! Parkour! Guys, $25,000 is what it took\nto build this! Go ahead. I made it. I made it! Here we go! Speedrun! Oh! Don't push me!\nYou pushed me! I'm gonna be the first one\nto the end! Let's do this thing. Alright, clutch up. Oh… no! Where's Majd, bro? No! Alright, no more pushing on.\nI'm being serious now. Bro, alright. Bro! He’s so mad. Yes! I'm up here! On we go! Bounce on the slime block! Wee! Boing! Go! No! No! Alright, guys.\nI'm going. Purp, go right.\nI'll go left. Alright, I'll go left. Come on, guys.\nWe really gotta go! Alright, let's go. I hate parkour!! Purpled, can you just show me\nhow it's done? You have to jump right as you're like\nabout to be over the edge. Sprint, though.\nMake sure you're sprinting. Yes! Nice! Wait you're almost there. Careful on the ladders, careful. No! No! Oh my God! Ok. This will be the last jump!\nLast jump! Let's go! Yeah, Chan.\nWhere you at? Huh? Hey, where you at, Chan? Why am I like,\nstruggling so hard? Yeah Majd, we're not done yet. Oh. What do we do now, huh? We really gotta lock in, ok dude? I'm locked in, bro. Alright, let's do it, guys.\nCome on. Ok, ok. Let's go, Majd!\n$25,000 trap. I'm done. I'm locked in.\nI'm not stopping. Don't fall or die! I'm locked. I did it first, I won! We did it, guys! We won! Woo! I won! Where's Majd? Oh! It is literally the $100 build against\nthe $25,000 build. Seb and Liv, it all comes down to this! Oh my God. I'm so nervous. Sebas! The map itself is beautiful. This was the hardest one for me,\nand I actually really enjoyed it. I'm gonna give this build a 9. Big 9. This map, I believe, gave me\nmajority of my deaths throughout every single traps map\nwe’ve played. I'm gonna have to give this\na 9 as well. I think that I probably had the most fun\nwith this one out of all of them. But! I could buy a Tesla for\nthe same price as this build. I think it's only fair I give this\nan 8.5 instead of a 9. The final decision comes\ndown to Purpled. Why you put it on me? $10,000. Listen, I've thought about\nthis for a while, and I think that\nI'm gonna give this trap… an 8.5. Oh! Congratulations Sebas,\nyou received the most votes and are walking away with $10,000! Honestly, I can't believe this! And Liv your $100 lava trap\nwas loved so much, we're gonna give you $5,000\nfor second place.",
    "start_time": 0.117,
    "end_time": 860.533
}