{
    "video_id": "KRr0i2akDlk",
    "channel_url": "@mrbeastgaming",
    "transcript": "I challenged the biggest creators\non YouTube to try to beat this game\nfor $250,000. [cheering] Let's go! Run, run, run! I separated these 8 teams\ninto their own lobbies, and the first 4 teams to make it\nto the end together will move on. Just lock in. Lock in. We got this. Make sure you're sprinting. Alright. Trampoline. Jump! Good. Alright, here we gotta break it. We gotta break this wall\nto open it. Yup, yup. Nice, nice.\nKeep going. You need everyone on the platform! Stop, stop, stop. Keep going.\nLet’s go, let’s go. Alright, there we go.\nNow you can move on. - Karl, come on!\n- Karl, we're on the platform! So far, no teams have finished. I really hope you guys\nenjoy this video. This is a phenomenal set,\nand we literally have 32 creators here. There’s fire.\nJust go around. Oh my God,\nthat was clutch. Oh I'm so sorry guys,\nI fell in the lava. Keep going. Oh, there’s lasers! Just don’t stop.\nJust keep on going. Don’t get knocked off. Switch, switch, switch. It's off. Yeah, I'm-- I’m towards the end. We're here, we're here. I'm coming. Take your time on the hammers. [screams] Guys! - Come on, come on!\n- Go, go, go! [screams] Oh, we got our first finish! [cheering] Let's go team! We gotta be the winners.\nCome on. I'm at the end. You’re so close.\nOne more, one more. Get on the button! [cheering] We got our second finish. Only two teams remain! We can't get eliminated.\nCome on. We made it, I made it.\nGet over here. No! The Mr Beast team's about to lose. Guys, it's our channel! We're waiting on Karl and Tareq! [screams] I’m almost there. Jump and you got it! Let's go! [cheering] One spot remains!\nWho are we waiting on? You’re right there, Jeza. Ok, ok. Only one spot. One spot! No! Gotta go over, dash over. Come on. Yes! [cheering] And we have our final spot! No! That was so close. Unfortunately,\nif you're standing in front of an X, you have been eliminated. I need you to exit the set. And to those of you that are still here, you're one step closer\nto winning your fans $250,000. Everyone head up\nto the 2nd layer. - How we feeling grey team?\n- Confident. Yellow team, only one team's\ngetting eliminated this round. Is it gonna be you guys? It's gonna be them. Oh, it's gonna be orange? I thought we were friends. I like this.\nLet's get this game going. For this dungeon, you will not be able\nto move on in each section until you kill every single enemy. Everyone ready? Yeah! Yeah! Go! Alright, go, go, go. Let's go, let's go. Go, go, go. Spam your abilities. A bomb! Bomb!\nWatch out for the bomb. Alright, there's enemies right here.\nEasy, easy. Use your arrows as well. There we go. I'll go on top.\nTop, top. I got one. Oh my god. Nice, go team.\nGo, go, go. Keep goin'! We're going up. Purple team's in the lead. I think we're good. We're through. Spam, spam, spam. Last one, last one. Last one. Go, go, go. Onto the next, onto the next. We got this, guys. Guys, enemy on me.\nBig enemy on me. There's big enemies. We need to, like,\ngroup up on them guys. Push him in, push him in. Yeah. Yes, yes, yes. Oh, this is easy, boys. Easy. Alright, these two teams are winning. Oh, my God. We're cruising. But it’s not how are you start,\nit's how you finish. Alright. Here we go. Yo watch out for the bombers!\nThey're bombers here! There's so many bombs. Oh, I'm slamming this guy\nwith my guitar. And in case you forgot,\nthe winning team gets $250,000 that they get to give\nto their subscribers. Fans. I'm doing this for y'all, man. I’m here. Yep. Got 'em. Wait, doors open. Go, go, go. If you're wondering\nwhat game all of them are playing, it's called King of Meat. King of Meat gave us skins in game,\nthese custom dungeons, and even made a secret dungeon\nfor you to play at home. Just click the link in description\nor scan this QR code. Available on PlayStation, Xbox, or PC. I see an arch over here.\nI'm taking 'em out. We did it!\nCome on guys, Thank you King of Meat\nfor sponsoring this video. Alright, let's focus. I don't see anymore. Go, go, go. Let's go. Let's go! Final round. Alright, time to kill the boss.\nLet's go. Oh! He’s massive. What's up, big guy? Focus the boss.\nGuys, we need to work together on him. You guys are on track to be eliminated. Stop, no, that's not true. That sucks. Everyone's already in the boss room\nbut you guys. Gotta get ahead. Let's go. Blow them all up.\nUse the explosive barrels. Yeah, it's getting stuck in my ability. He’s so low. Guys, we gotta lock it on the boss. We got this. Everyone's on the same level. Who's gonna finish first? He's low, he’s low. Ok. We got it, we got it. Yeah, he's dead. Nice, nice. Go, go, go! That's the end! Go, go, go! Come on. [cheering] We got our first finish! Oh my God, they made it. Get on the button. Come on, everyone! Yes! Woo! Either Grey or Orange\nis about to be eliminated! Go, go, go! It's gonna be us.\nCome on! I died! Ok, come on.\nJust a couple more. We're good. Go, go! - Where do I go?\n- Run in! Let’s go! Let’s go! Go, go, go!\nRun the door! I'm running! Hurry, hurry, hurry! We did it! No! No! Sorry, it didn't work out, Grey team. It's ok. It happens. And with that,\nyou three teams are moving on! [cheering] This next round is going to require you\nto work as a team. For this round,\nyou don't have to kill everything you see, what you have to do is protect\nthe most precious cargo on the planet. This Meat Baby. Each section in this round, a player will have to pick up\nthe meat baby. If they drop the meat baby, you'll have to go back\nand retrieve it. He'll be on the rest of your team\nto protect that player and usher them through\nwhile they carry the meat baby. Alright, any questions? Wait, is this-- Three, two, one… Go! Go, go, go, go! And they're off. Oh, the sausage. Wait, grab it. There is the meat baby. - Socks. Get it, get it.\n- I got it, I got it. Alright, we'll stay in front.\nYou stay in the back. Ok. Wait. What is this? Watch out. Watch out for that white.\nDon't touch those. Oh! Don't press those platforms. That slows you down?\nOh my God. Move up, move up. Oh wait, guys. It died! Alright, you guys\nalready broke your sausage! Go back\nand get a new one. Oh, ok. If you take a single hit,\nyou drop. Purple team is making it through,\nthey’re escorting the sausage. Go, go, go! Put the sausage on the grill! Put it down.\nNice. Let's go. There's a platform. In the middle! Ready?\nThree, two, one, go! Ok, watch out! Don’t get hit! Yeah, yeah! You got it. Nice! Let's go. Yellow, you seem to be in last. I got it, don’t worry-- Team! Come on, team! Get your act together, yellow. Uh, more meat. Where's the meat at? Oh, it's in there.\nSomeone has to go above. Here's the 4th one. I’m on one! Got it! Alright, grab the sausage. I’ll grab it. Stay on the platform. Alright, I'm standing on it. Wait, wait.\nLet me get on it. There you go. Now, get ready to switch when I say “go.” Ok, go, go, go! Switch, switch! What are you guys doing?\nWhy do you always crush? We're the best team ever! Since you're so far\nin the lead, I wanna tell you about\nour brand-new Feastables bag that just dropped\nin Costco's nationwide. Here, do you mind giving it a try? Guys, I’m getting hit! Oh! Ok, I'm gonna stop talking. You still got it!\nFry it! Fry that meat! Throw it in the fire. Nice! Ok, next one.\nSame thing, same thing. We have to wait for the platform\nto get back. Do you wanna try Feastables\nout of our new Costco bag? It's gonna wrap\nin front of you, BT! - BT, it’s gonna wrap in front of you--\n- No! Don't die, don’t-- No! Ok, go, go, go. Yeah, yeah. Careful.\nJust stay on it. Nice, nice. Keep goin’. Nice! Alright, purple’s in the lead again. Yes, yes!\nWe're good, we're good. Throw it on, throw it on! - Ok. Perfect.\n- We're good. Just go. I'm on the next one. The platform’s coming from the side.\nPlatform coming from the side. Get ready to get on it. Yeah. Nice, nice, nice. Now you have you have to cross\nto the other side. Nice, yeah. She made it! Keep going, go, go, go! Let's go. Let's go, guys.\nLet's go. Once again,\npurple is very much in the lead. Blue sending now. Alright, Hyper, send it back! Let’s go, Hyper! Yes! I’m through! Oh my God, you did it! All three teams are on the same course. This one's the hardest one.\nGood luck. Ok, we need two people on the thing.\nI'm going onto the platform. This looks easy, right? Oh my God, it's zombies. Oh, except for the never-ending army\nof mobs coming at you. There's enemies everywhere! Fight 'em off, guys. I’m fighting. I see enemies at the end. No, he's good, he's good. Alright, will purple get it? I got, I got, I got it! Alright. Now you gotta get\nthe whole team across. We got this, we got this! Alright, let’s go, go, go!\nGuys, let’s go! First finish! It’s either orange or yellow.\nWho's it gonna be? Ok, I got it, I got it. Get on the platform! Wait, there’s skeletons here. Ed there's--\nYou can't let those touch you, Ed! Ed, jump! Hold E, hold E! - No, I died!\n- No! We gotta go back. Oh, no. We're so close.\nIt's right there. I'll attack the enemies.\nYou guys just stand! Don't let go.\nYou can jump over, probably. Yellow’s about to do it! You guys gotta stay on those platforms!\nStay on those platforms. Jump over. Yes! Yes! - Go, go, go! Run!\n- Come across! Everyone come across. Get on the button! We’re about to do it. Come on, come on! [cheering] - Let's go!\n- King of Meat! Orange team,\nyou have been eliminated. No! We're gonna steal the moon! Get the money! Hey, grab as much as you want, but I literally have\n5 police officers over there, 'cause this is real money,\nand they'll just get it back And with that… one final challenge stands\nbetween your team and $250,000 for your fans. And this final round is simple: the first team where all 4 players make it\nto the top of that hill will win. You are literally only as good\nas your weakest link. We got no weak links here. Tens of millions of people watching, money for your fans on the line,\nyour team counting on you-- I'm just trying to make you nervous. I don't get nervous. Go! Go, go, go! Ok, guys, this is it. We know what to do. Do not hit the yellow thing. Oh, I'm dodging, I'm dodging. Careful of the launch pad here. Yeah, yeah, yeah. And for the fire,\nI'm using the launch to get across. Let’s go. Ok. Watch out.\nIt's gonna launch us forward. But we live for that. Bombs are getting launched\nfrom the side, guys. Watch out! Big balls!\nOh! Oh my God. Bro, your team is so far behind. Dude, are they really? - Yeah, you're crushing.\n- Don't tell me that! Your team's not even\non the same floor as you. Oh my God.\nNow, I'm not. Well, never mind. Oh my God! Dude, I'm so lost.\nI'm not gonna lie. I'm so lost. I hit it, I hit it. Oh, we're good. Keep going-- No! I got launched off. There's, like rolling, uh-- Oh my God, there's big bombs and\nthey launch you off the map. Oh, the hammer hit me, bro. Guys, I don't know where I am. If you're ahead of us,\njust stay there. It's ok. Go to the trampoline right here, though. - Ali, right here. The trampolines.\n- Yes, yes, I see them. The stakes are high.\nEverything's on the line. You can tell people are starting\nto get a little nervous. No one wants to be the person\nthat lets their team down. Everything is on the line. Wait, oh, wait.\nI'm supposed to be going the other way. Guys, I'm all turned around!\nWhere am I? No, a trampoline right here!\nBehind you Once you make it far enough,\ntrampolines unlock. And when you fall,\nyou can skip right back up. Am I supposed to go this way? Oh, wait. Am I going the wrong way? Are we going the wrong way? Wait, I just hit a thing.\nWait, come to me, guys. Yeah, I'm ahead. Yeah, get on that.\nI’ll press it for you. Ok. Oh, no… Open!\nI got it, I got it. It's open now. You're both at the same spot.\nIt's neck and neck. I think I hit a checkpoint. Here guys, I have a trampoline. Ok, ok. Can I help you guys when I'm through?\nLike what-- Oh, maybe I do.\nHold on… Devonte jumped off! I'm gonna go ahead.\nI see where a trampoline is. Wait, I think I messed up. I hit another trampoline. Oh, guys, I'm at the top,\nso I activated all the shortcuts. - I'm at the top waiting.\n- Ok. I’m coming. Ok, I'm almost there. Alright, purple has someone\nat the finish line. Ok. That's fine, that's fine. I did it. I'm at the end! Wait, trampoline right here! Guys, behind you! Behind, behind us! Lana, over here. This way. I’m good. Ok, I'm up! Ok. I'm making my way through. I'm so confused right now. Oh my God. Ok, now go forward.\nGo forward right here. Juke this way. Right here.\nWait, where are you? We’re here, we’re here! I’m here, Purpled. I'm here! Let's go! Oh my gosh! [celebrating] Let's go! Purple is the winner! Don’t worry, yellow team, your subscribers\naren't going home empty handed. We're giving each of you $10,000\nto give to your subs however you want. If you wanna play King of Meat, just scan this QR code\nor click the link in the description. Hope you enjoyed.",
    "start_time": 0.05,
    "end_time": 726.3670000000001
}