{
    "video_id": "usGPK2hHomI",
    "channel_url": "@mrbeastgaming",
    "transcript": "Every minute these\ncontestants survive, I will add $1,000\nto the prize pool. Whoa! What? But they're about to face\nsome of the hardest Minecraft challenges\never created, and whoever’s left at the end of the\nvideo will win the entire prize pool— that could be hundreds of\nthousands of dollars. Ok, I'm ready. If you touch the laser,\nyou will be eliminated. It’s destroying the ground! It’s chasing me,\nit’s right behind me! It has been one minute and\nthe prize pool is now $1,000. This might be an expensive\nvideo, Jimmy. Guys, we're stuck here. The platforms are broken.\nWe can't cross. I don't know if I can parkour this. You’ve got this! By the way, there's\n2 laser beams now. Oh my God! Oh my God,\nit’s right next to me! I'm so chill. I am very normal. Oh my God,\nit's coming to me. Oh my God! Stay alive! I'm getting nervous. Which way is it coming? I say we ramp it up. Now we have five lasers. Guys, do not die! Oh my God! SpacDog has been eliminated. She was a wonderful friend. We're wastin’ no time. Welcome to\ndeath trap #2. You're each in a cage,\ndangling from the ceiling. And starting now, your cages are\nlowering into lava, and the only way\nto slow it down is to shoot the target\nin front of you. Please, please… Oh, I got it.\nWait, first try. Wait, do I gotta\nkeep on hitting? Wait, what? Whenever that turns red,\nyou're goin’ down. Ok, I got this. How do I\nshoot faster? Wait! Ok, I'm going!\nI'm not stopping! Steak, stop screaming\nand hit the target! Fire faster! I’m doing it, I'm firing\nas hard as I can! Rain Dynasty is\ncrushing everyone. I think I'm doing well? Rain, are you good at\nshooting bows? Oh, you're actually\nhitting it every time. Rain, why are you\nso chill? Bro, I'm just\na chill dude, bro. MouthFul, you gotta\nshoot faster! I'm trying! The farther you\ngo down, the harder it is\nto hit the target, too. I got this.\nI'm not stressed. You better start shooting\nfaster, there. You're looking lower than\neveryone else. I know, dude.\nI can see it with my eyes. Yeah Rose, at the rate you're going,\nyou're gonna lose. I'm hitting it, but I feel like\nI'm still sinking. Who’s in last!? Wait, am I in\nlast place? No! The prize pool\nis about hit $5,000, and you might not be going home\nwith anything. Stay alive, guys. Chandler, I'm very, very scared.\nPlease reassure me. Do you like my new skin?\nWhile you're shooting? Chandler, you’re in\nthe way, man! You gotta beat Rose! It’s you against Rose,\nright now. I'm trying! No, no, no! Rose, if you miss just one…\nyou're probably cooked. Dude, I'm trying!\nI'm too far down. Milk! You're about to\nhit the lava! I’m meeting my bitter end. You gotta outlast Rose. Dude, I can't miss it.\nDude, I can't hit it. I'm too far down. I can't! Milk! You're blocks away from\nthe lava right now. I hear it below me! No! Looks like she got\na mouthful of lava. The prize pool is now\nat $6,261. Let's go to\nthe next challenge. And 5 of you remain. Currently, you are adding $3,000\nto the prize pool for every out, which puts you on a trajectory\nto have roughly a $20,000 prize pool\nfor the winner. That's not bad. It's horrible! You could get this prize pool up to\n100 grand if the 5 of you lock in! Ok. Geez. I mean, unless you don't\nwant my money. No, lock in! Lock in! For this next game,\nif you touch a block… it will then disappear. First one to fall in the void\nis eliminated. Oh, no! Server, start the game. Oh, no! Oh, Virgo is eliminating\nthe next platform. It's ok. Just go nice and slow. You guys are incentivized\nto get each other out, but you're also incentivized not to,\nto run up that money counter. Gotta use the strats. Guys, jump technique! I don't know what that means.\nOh, I fell. There goes Rose.\nEverybody's fallin’. Yo, Dynasty is crushing! You hop on one block\nat a time. Steak is eliminating\nas much ground as he can. What else are you supposed to do? Just jump, dude.\nJump! Steak, like this. Oh, like this? How are you hitting\n4 blocks at once? That’s so bad. While you guys are\nplaying this game, Do you know why this video\nis going up in August? Why? Because in the month\nof August, we are doing Team Water,\nand we're trying to raise $40 million to give 2 million people\naround the world clean water. W Team Water! Oh. I'm cooked. Oh, here goes Virgo. Do you remember Team Trees from\nback in the day and Team Seas? Well, this time around,\nit's Team Water. $1 we fundraise, that is one year of\nclean water to someone in need. That's awesome. Oh, Steak fell. Steak with a mistake. Ok. And to make this video\neven more special, whatever the prize pool\nends up going up to, I will match that amount with\na donation to Team Water. That's so great! Oh my God. So, Steak, when you mess things up,\nthink about that. Rain, your technique\nis impeccable. Thank you, bro. Dude, you're getting\nso many kids water. Oh, wait. I see what\nyou're doing. Guys, I'm trying,\nbut it's scary! I know,\nI'm so scared. The purple layer\nis massive. Everyone is\nsuper locked. With the power of teamwork,\nwe got this. The prize pool is now\nover $10,000. How much do you think all the people\nwatching should donate to Team Water? Everybody, at least\nthrow in like $5 bro. If you guys donate $5, that's 5 years\nof clean water for someone in need. All we have to do is jump on\none at a time. Oh no… Oh no! I fell. TheHashAq, you gotta be\nvery careful. One mistake,\nand you lose. He's sprinting! Steak is panicking! Lock back in! Steak, quit sprinting!\nWhat are you doing, dude? You can do this! I'm sorry guys,\nI'm too scared. I'm too scared! Stop freaking out. You got it.\nOne jump— Oh, Rose! Oh no,\nshe died! Yo! No! Steak! What did you do, man? Whoa, whoa!\nI did not do this! This manipulator! The prize pool has now doubled\nto $13,249. Rose, who would you like\nto see win? I just don't want Steak to win,\nthat's all I care about. Dude, what have I\ndone to you? To the next challenge! There's only 4 of you left. You are all now in boats\nsurrounded by pirate ships. Oh, God. Those pirate ships are going to rain\ncannonballs down on you. But first, you have what might be\nthe biggest decision of your life. See those Shopify sidekicks\nhovering around you? They can do 1 of\n2 things for you. A, double your health, or\nB, leave your health as is, and every minute\nduring this challenge, you personally win\n$1,000. Yo, I'm going with\nthe money, highkey. - Going with the money.\n- Can we all do the money? Don't know why you guys\nchose money, bro. I'm gambling on myself.\nI believe in myself. Ok? Three of you chose money and\nonly Steak chose double health. I'm in it to win it. Fire the cannonballs. That’s a big cannonball! And they're coming from\nall directions. Oh, they're huge! As you can see, all 3 of them\nare racking up money. Whereas Steak is not. Steak, if you're the one\nthat dies… That's gonna be\nreally embarrassing. Yo MrBeast, this is getting\nkinda scary… Oh, I just hit Steak! Oh, no he didn't. So far, the only person\nto take damage is Steak. The crazy part is we're making\nmoney too, at the same time. To the 3 of you\nwith money, you're all sitting on $4,000 plus\na $17,000 prize pool. This is getting up there. W, Shopify. Hey, ramp up the TNT.\nLet's get a little crazy. Dude, there's\nso many bombs! Yo, there is TNT\neverywhere! And while these contestants are\ngetting a little help from Shopify— Oh, the bombs\nare flying! All I hear is explosions. Let me tell you guys at home\nhow you can do the same. The Shopify Sidekicks in\nthis challenge are giving some of them extra money\nand Steak extra health. Hey Rain, would you say\nShopify Sidekick is helping you? It's helping me absurdly,\nI’m having a great time. In the real life, you can use\nShopify Sidekick to level the playing field\nbetween you and multi-billion dollar\ncompanies. Ay, don't stop moving. Everyone lock in! Lock in! Rain got hit! This is getting intense. Sidekick can put together\na promotional plan for you. The cannons are\nspeeding up. It's gonna start getting\nhard to dodge. It can also help you create\nstunning social media content and take care of all the boring,\nrepetitive stuff when it comes to growing\na business. So you can focus on\nwhat you're good at and what will actually\nadd value. Oh, the bombs are going\ncrazy now. Oh, Virgo just took\nsome damage. Oh! Oh no, no… No, no! No, I was doing so well! Virgo’s almost dead! Virgo, you got 1 hit left. I literally use Shopify\nto power our MrBeast.store, and even Feastables to give access\nto our chocolate to millions of people\nall around the world. Scan the QR code to\nShopify.com/MrBeast. Thank you Shopify for\nsponsoring the video. Can Virgo survive long enough? Oh, God.\nI might be cooked. The prize pool’s at almost 20 grand! Dude, this is actually insane. Oh, Virgo! No! Virgo! Dude! No, Virgo! You were eliminated, Virgo… Yes. …but you also won $5,857! So did Dynasty and Hash. No matter what,\nyou each are getting $6,000. Let's head to\nthe next round. For this next challenge,\nI have plopped you in the middle of\na ginormous city. Oh, boy. This challenge is\nhide and seek. In exactly one minute, I will be releasing 11 subscribers\nplus Chandler and Nolan, and whoever they find first\nwill be eliminated. And then we will be down\nto our final 2. There are countless buildings\nto hide in. There's a port,\nthere's mountain ranges, there's a different city,\nthere's woods, there are infinite\nhiding spots. You guys could run the prize pool\nup to $100,000 right here. Oh, I’m nervous. Start the one-minute timer! Oh, man. Guys, this is your chance. In exactly a minute,\nthe seekers will be seeking. I'm just hiding in\na house. If I see somebody,\nI’m gonna run. Lock in, bro.\nI'm telling you, I got this. Welcome. There are 3 people hidden on\nthis massive map. Dude, it's huge. Whichever one of you\nfinds one of them first, I will give 1,000\nFeastable bars to you. Can I count on you? Yes! Oh my God… Louder! Can I count on you? Yes! Alright! Go hunt\nthem down! Yes, yes!\nI love you, Jimmy! Let's go in\ngroups of 2. I go with you. Ok, let's go.\nLet’s go in the back. Alright, boys. I wish you\nthe best of luck, I really do. Listen man, 1 of us\nis gonna get eliminated, 2 of us are gonna win\nmoney, alright? Inside that building, BeTikou. I’ll check this one. Nothing here. I'm shaking right now. Come on, let's go! Let's scope out\nthe area. I found a crazy spot! Where's your spot? I'm in a hole, basically. I can't get out of here.\nI'm stuck in here. So if they catch me,\nI'm screwed. Ok, follow me. Ok, I think I have\na pretty decent spot. Yeah, wait this is a low-key\nreally good spot. I'ma stay here. Gentlemen, I just set loose\nan obscene amount of seekers. Oh no. Good luck guys. Very scared. Your money counter just hit $20,000,\nand the seekers are out. That is huge, man. Yes sir!\nIt's huge. Well, I see Jimmy over there\non top of that mountain. And if I were to pick up\non context clues, that means that somebody\nmight be over there. You're right. Let's head towards\nthe mountain, shall we? I see a lot of people.\nThis is kind of scary. Oh no, bro! I don't see anyone yet. The prize pool is now\nat 23 grand. Oh my God! Two of you are about to walk away\nwith $30,000 if you win. Steak on the other hand…. 23 grand. You know what, Nolan?\nI'm hungry for some steak. Oh, yeah. I need to find them.\nI need to find someone. Oh, my God. I need those Feastables. Yes, sir.\nWe are prepared. I don't think I've ever been\nthis nervous in my whole life. I'm locked in, dude. I wonder, I'm honestly not surrounded\nanymore, so they split up. They're going to wherever\nin the map now. They're not by you\nanymore? Nah, I haven't seen\nanybody in a bit, bro. They're just lurking. Is anyone deep in\nthis tunnel cave? Oh, people are\ncoming in. That's that.\nI'm stuck. Dude, I'm screwed.\nI'm freaking screwed. Where is he? That's not good. Wait, they found you? No! Oh! Hassan is dead? They found Hash? That was quick. - I couldn't get out.\n- Wow. Good luck, Rain.\nGood luck, Steak. Dude, GG’s man. Mathor is the hero.\nHe has slain an enemy! I will be sending you\n1,000 Feastable bars. You could be in\nthis video right now. Just make sure you subscribe\nso you don't miss out. - And now, Rain!\n- Yes. - Steakwad.\n- Yes. One of you is going to be winning\nthis $26,000 above our heads. Oh, man. Let's go to the final game! Gentlemen, everything has\nled us to this moment, right here,\nright now. Look at that giant pile of\nmoney behind you. Wow. It's so large. But, it's not done\ngrowing. You guys will have 10 minutes to\nencase yourselves with obsidian. And at the end of the 10 minutes,\nI will drop a nuclear bomb. Oh no. If you are not fully encased,\nyou will die, and the other person will\nwin the prize money. If you both survive,\nyou will split the prize money. And to make this game\neven more fun, PvP is enabled. Oh no! And you can just kill each other and\nend it at any moment No. I'll never hurt you. Notice how he didn't say back? Why did you not shake\nyour head? No, I'm just scared. Oh, no. Yo, let's work together, bro. Ok, let's run down\nthe timer, bro. Guys, time is ticking. Oh, man. We gotta build\nthis obsidian together. Oh my God! Steak you almost died! Rain, you literally almost won\n30 grand right there. Should we go to the village and\nstock up, or what should we do? Yo, are we going to work together\non this or what, bro? I'm sorry. Dude. There's gotta be a villain.\nI'm the villain. I'm sorry. That was diabolical. The second time I've lost\nso much money! Rain, you have officially\nwon $28,000 plus the $6,000 from\nthe Shopify challenge. That's a lot of\nmoney, man. MrBeast, I’m grateful, bro. We're matching\nthe $28,000 you just won with a $28,000\nTeam Water donation, which is literally 28,000 years of\nclean water for people in need. Guys at home,\nif you haven't already, go install Shopify, start the\nbusiness you've always dreamed of and donate to Team Water\nif you haven't already.",
    "start_time": 0.017,
    "end_time": 853.367
}