{
    "video_id": "hbRQ59R6-b8",
    "channel_url": "@mrbeastgaming",
    "transcript": "These four teams are competing in\nFortnite Reload for $250,000. Let's go! I got him.\nWait, let me get him. We got a team out.\nDead! Yeah! We are split into different lobbies\nwith a random subscriber each. And whichever team gets\nthe least amount of eliminations is going home\nentirely empty-handed. We're gonna win\nthis money, brother. Alright, where the people at? Aw, we're in. Ay, two elims over\nhere already! Already?! Oh, I got someone. We’re beating Chandler. They’re lying.\nThey’re not poppin' off. There’s nobody here. Bro, this is not\ngood at all! There's one, baby! Got him. He's down! We got one! Oh, I got two! I'm gettin’ carried, bro! Oh, I got one\nmore down. Oh my gosh! We need to pick up the kills.\nJimmy's at 3. Chandler’s still at 0, though. Got ‘em.\nLet’s go! Oh, there's a dude\nright in front of us. Oh, let’s go. Nice, we got him. Here we go. He's in the bush! He's camo’ed! I got him! Bro— No, this is good.\nThere's a lot of people here. I got one with me.\nI got one on me. Knocked. Hey, we're poppin' off! - We're goin’ crazy!\n- We’re in the lead! Hey boys, we're in\nthe lead, baby. Oh my gosh!\nTareq’s team has 6 elims. Bro, you gotta help out. I do, bro.\nI gotta get some kills. If you're wondering\nhow I got a $250,000, it’s because Fortnite heard\nwe were doing a video like this and wanted to step up\nand make it bigger. Thank you, Epic.\nI really appreciate it. I got one. I got another!\nWe got 4! Oh my God,\nwe're on fire! Hold up! Ayo—\nWe got 4! Guys, we’re on 4! Oh, there’s 2 on\nme over here. You're gonna die.\nRun away! I love the faith. Oh, I’m gettin'\nshot at. I'm going,\nI'm going at ‘em. He’s lit! Hit him for 100.\nOh my God. Oh! Another one. You're dead! Oh, this guy's nuts.\nWait. Hold on. What is that? No! Ok— hide! Do not die. I will not die. Do not die. Oh my God… Oh! No! Oh! Tareq’s dead! Tareq’s eliminated, so if we beat 7,\nwe're good. We gotta get 3?\nWe can do it. You gotta take part in this fighting\nbecause this is how we seal the deal. Focus. We're still better\nthan 2 teams. I’ma smack ‘em.\nI’m smackin' ‘em. I did it,\nI got ’em! Alright, we should just—\nNolan! Stop distracting me! Sabotage! Leave my teammate\nalone! You're gonna\nbreak my setup. They’re distracting. Watch out for\nthe flying water bottles. I'm gettin' shot at. Oh my God,\nI got 4 health. Got another.\nWe got another. At what point do we just\ngive her all the money? Chandler! Oh, we won! It doesn’t matter!\nIt's skills that matters. So there’s, like,\na bunch of people. Oh, one’s on me. Right beside you,\none's on me. Alright, they’re\ndown there. Oh, wait— Jimmy’s knocked. Jimmy’s done. No! Silent Wings!\nThrow the game! - No no!\n- Don't go down. Don't go down. No! No! Let’s go! We’re in! Oh, no. Team Jimmy's out! Oh. I'm gettin' shot.\nI’m dead. I got second! Alright, we are\nofficially eliminated. Let's go! Hey! That was crazy. You wanna feel\nthe money you lost? I'll just touch it.\nI'll just— Yeah, go for it. Alright, let's start\nthe next round. Three teams now remain. Are you guys ready for\nthe next round? Yeah. My adrenaline's\ngoing again. Begin round two! $250,000 on the line. Let’s go to Dusty. Sounds good. Are we riskin’\nTilted? You wanna do it? I'm scared. Scared money don't make no money.\nLet's go. Oh, she's goin’ Tilted! That's ok.\nYeah, you go Tilted. That'll work out for you. This is the kind of money we usually\ngive away in main channel videos. Let's see who's gonna\nget eliminated. He’s sitting on my money. What are you gonna do with\nthat money when you win it? I'm gonna sit on it. Where are you? I need help. No, I don’t. Aw, there's somebody\nright there. There’s somebody right\nthere behind the tree. Got him down. We just started. So far, Tareq’s team is\nthe only one with kills. I didn’t know that.\nThat makes me feel good. I see some shootin’. Alright, here. I got this. I knocked one! Nolan, are you nervous? I'm terrified. Focus! Stop—\ndon't look at me. You got $250,000\non the line. Well you see,\nwe've got a strategy. Don't tell him\nthe strat. I hide…\nand she gets the kills. Oh, I'm gettin' attacked. Nolan…\nrun, please. Ok, I'm just tryin' to get away. What's this guy doing? Oh my.\nWe're farming. No, we're farming\nright now. Team Chandler has 0 kills,\nwhere Team Tareq has 5. Oh, they are\nfalling behind. Don't say that. I got this.\nCome on… Come on!\nI'm missin' my shots! I'm nervous. I got him. Over here in\nfront of us. Team Chandler is 3 kills behind\nTeam Nolan. If someone eliminates them now,\nthey're out. We gotta catch up! What are you doing? I was tryin' to help— You don't want money.\nYou just threw me in the storm. I'm dead. And for the love of God,\ndo not die. Thankfully,\nwe're playing Reload, so as long as she doesn't die,\nhe comes back. Do not get in there!\nGet out of the storm! Nah, I got you,\nI got— This is what makes\nReload fun. I'm rebooting. Alright, Nolan’s back alive. Two guys here.\nHoly guacamole. One. - Got ‘em! Let's go!\n- Yeah! You're doing\ngreat, bro. No, you're doing\ngreat, bro. Hey. Are we fallin' in\nlove right now? The two of you\nhave 9 kills. How many of your kills are\nfrom Tareq? Two of them. Tareq’s getting carried to\nfree money. Shooting at me. Careful.\nRight here. One more time. Yeah, yeah—\nNice! Cover. Cover. It is tied between\nChandler and Nolan! I don't see anyone. I don't see\nanybody either. Where is everybody? All of you have 16 people\nleft in your lobby. Respawn’s cuttin' off soon. In Fortnite Reload, after a certain\nperiod of time, you stop respawning. So they're all coming up\non that period, and Chandler and Nolan have\nthe exact same amount of kills. I’m full sending. Oh, he's healing up. Oh, there’s a guy right here! Run! 3, 2, 1… No! Oh, Chandler’s dead. I got a kill!\nI got a kill at the end. They have 5 kills. If Team Nolan gets one more kill,\nit's over for Team Chandler. Behind you. No, no!\nI’m rebooting. Stay alive! If someone's snipes Nolan,\nthey're done. You got 10 seconds! I got it!\nI'm not gonna die. Die, Nolan. Throw money at him. No!\nNo, no— We gotta get one more kill\nand we beat 'em. Got him! Finish ‘em! Yes! Oh, he did it! You suck, bro! You guys are eliminated.\nWelcome to the group. Ah, I’m just sad. You know what, Tareq, just don’t let\nNolan get the money. She literally is doin'\nall the work. I don't wanna hear it\nover there. He got 3 of the 15 kills. Yeah, we'll get outta here. Goodbye. And then there was 2!\nLet's do this. We got this. For this last game,\nwe have a special guest. Oh, man. Bring him in. How we doing? - We brought out Clix.\n- What!? Oh! How we doin'? Good to see you I got a little\nsurprise for you, though. Oh, really?\nOh. Thank you. Clix is actually our\nfirst-ever Feastables partner. Let's do it. This is the biggest moment\nof their lives. I'm like a diamond, Jimmy.\nI was made in pressure. You’re gonna lose to that? No. Absolutely not. $250,000. Let's see who clutches up. If you want some tips and tricks,\nlemme know. I'm gonna hot drop. I need to get as many as I can,\nso I'm gonna just go for it. Alright, I found\na little hidey hole. I got one. Ok, we need to start\ngetting kills. People here. There's 2. Got ‘em… - No!\n- Tareq’s down. Wait, if he dies here,\nit's over. God! I've never been\nso nervous. That was insanely clutch. He could've lost\n$250,000 there. Milo is the goat, bro. Yep, I got this. Let’s go. We got two on the board. Wait, why are you\nlowkey a pro? Nah, I’m, like, just\nfreaking out right now. I can't believe you're\nnext to me, dude. Alright, it's tied. Two kills on\nTeam Tareq. Two kills on\nTeam Nolan. Uh, if I help you, will you\ngive me a cut of this? You know,\nI'll think about it. Now we got 4. Nice. Let's go.\nLet's go, Nolan. There's two.\nCareful. Nice. Let's go, Nolan. Team Nolan's on 4. They just passed you! Hey, Tareq.\nWe're coming for you, buddy. Oh, he's right\nabove me. - Get him.\n- I’m sprayin' him. Tareq, how did you miss\nevery one of those shots? I don't know.\nI'm nervous, Jimmy. You're making me nervous. Tareq— Are you throwing\nright now, Tareq!? Nice, nice, nice. Let's go. We're tied. 5 - 5 $250,000 on the line! This is insane. Uh, Nolan, I’m gonna need you\nin the action over here. Dude, I gotta do something. Here he is.\nHe's down. - Got him!\n- Oh! Finish him off.\nFinish him off for me. Ok. Oh-ho-ho!\nLet's go. Tareq got his\nfirst kill. They're back up.\nTeam Nolan's behind. Over here. Come on.\nThere are people shootin' over here. Let's go. Two, two—\nLet's go. We’re at seven. Hey, we're doin' this\ntogether. Together?\nCome on, Nolan. You guys are now\ndown a kill! Here he is. Your guns weren't\nreloaded, Tareq! I thought my gun reloaded. Come on! Let's go! Oh, she's on fire\nright now! He's down. Alright, it's tied 8 - 8. One of the largest prizes in Fortnite\nthis year, and it is neck-and-neck. This is not good for\nmy nerves. I'm back here\nhelpin'. You gotta help Tareq out, bro.\nHe needs it. Well, he's already—\nHe's actually about to— Nah, I got it. We gotta go in\nthe middle, dude. Like, there's\nno one here. I'm gonna full send this,\nso just stay alive, ok? My only goal is\nto not die. Tareq, you gotta come to me,\nlike, now though. We gotta go to\nthe next spot. Dude, I'm so nervous. They're ahead by 2.\nYou need kills. I knocked her! Oh, she's got 2 people\non her. I'm outta there.\nI'm out. I got the full on\nthat one, though. Is somebody right here? Yeah, there's a bunch\nof people. Nolan…\nclutch up! Got one! Let's go! Alright, it’s a tied game! So— Nope.\nPeople here. Easy. Nice! Oh, easy knock. C’mon! Knock this guy—\nTareq, help me out, bro. What is this bloom? We're actually up one. Right here,\non me. Yeah, there's a bunch\nright there. Their lobby only has 6 people left.\nYour lobby has 8. - No! No! No!\n- Oh! She's down! If Nolan dies,\nit's over! They lose! Stay alive. Run, run! Stay alive. Nolan’s gettin’ shot at! One more second! Oh my God! Ok, she's back! - I'm back, Nolan!\n- That was close. They almost lost the money. Oh my God! Yo, don't peek, there's a good team\non the other side, there. There's a really good team\nover there. And he's right here.\nHe's right here! Oh my God! Tareq, run!\nTareq! Don't die, Tareq. Just don't die.\nDon't die! It's up to Tareq! No, no, Tareq! Tareq! Run, Tareq, run! Oh my God,\nit's only Tareq? Alight, Tareq’s gotta stay alive\nfor 8 seconds! I'm running! Run! If someone headshots him,\nit’s over! Run! Two seconds.\nYou’re good. It's ok.\nWe're good. Oh my God! You did the thing.\nYou didn't die. Oh my God, I'm so scared, bro,\nDude, I'm so bad at this game. Oh, he's right behind me! You're the best! Let's go!\nThat was my second kill. I'm dead. Oh! She's down! I'm getting shot! No! Run!\nPlease. I'm gonna die! I might die! You got 10 seconds. Wait, Nolan's about to die! Nolan, don't die! - 5, 4, 3… Please!\n- Nolan! 2, 1… - Yes!\n- Alright, she's back! Oh my God!\nThat was so close! Wow, this is getting intense! He died a second after\nshe respawned! Dude, I saw my life flash! On me! I got him! Be careful. That guy just\nlanded with you. Yup, full send that. That one? Yes! Kill them before the reboots.\nThey respawn. More kills. Behind us! He’s landing on\nyou again. - Got him!\n- Yes! Let's go! I'm gonna tell\ny'all something: You guys need to kill everyone\nto win this. They have more players! Tareq is up by one.\nReboots are off on both sides. As in, you die,\nyou die! You stay alive,\nTareq. Alright, we gotta\nstay alive, Nolan. You're gonna remember\nthis day forever. Oh! Oh, she clutched! - Oh, she's whip— oh, she got it!\n- He died! Yes! Yes, yes.\nYeah! Tie game! Oh, behind me!\nSomeone’s on me! He's on top of the rock.\nI'm dead. He's right there.\nHe's on top of the rock. I hate him and\nI want him to die. Oh! No! She’s dead!\nYou need one kill! It’s tied! If they get a kill,\nit’s over. You need one kill\nto win. Tareq! One kill, Milo!\nC’mon! Comin' up. We just need one, Tareq.\nWe just need one. We just need one. You guys win $250,000\nif you get one kill. One kill! - Lock in, Milo!\n- Where’s the— Win! - You won!\n- I did? Let's go! Let’s go! Let's go-ho-ho! Let's go! You did great. Thank you! Thanks to Fortnite! I told them we were\ndoing this video. They stepped up so we could give away\na large prize pool. Also… Fortnite didn't want you going home\nempty-handed, so here's $10,000! Dude, I’m cool with that! Subscribe!",
    "start_time": 0.0,
    "end_time": 759.05
}