{
    "video_id": "uPKu_eFG0Rw",
    "channel_url": "@sesamestreet",
    "transcript": "(gentle music) ♪ Do you like food ♪ ♪ I doobee, doo doo, dooba ♪ ♪ Like me like food ♪ ♪ Adeebee, deeba, deeba, deeba ♪ ♪ Place your order if you lucky ♪ ♪ We make food in our foodie truck ♪ ♪ Yeah ♪ (tablet beeping) - Oh, me got it, me got it.\n- No, I get it, I get it. - Hello, Cookie Monster and Gonger. I'm Nora and I need your help. My sister and I like opposite things. I like sweet and she likes tangy. - We went on a family trip to\nMorocco and we had meskouta. It's an orange cake that's sweet. - And tangy. We'd like one. Could you help us, please? - Of course we can help you because we are ♪ Monster foodies ♪\n♪ Monster foodies ♪ - So how do we make me\nmeskouta, Chef Gonger? - [Gonger] Well for meskouta\nwe need eggs, sugar, flour, canola oil, vanilla extract,\nbaking powder, salt, and oranges to make orange juice. - Okay, me got all the\ningredients right here. And, look at this, orange. - Oh, Cookie, we need the fruit orange, not orange colored things. - Oh, okay me see. So me got the orange cat,\nme got orange flip-flop, orange friend. - Hi.\n- Hi, Rudy. - Oh yeah, me no have orange. - Oh, yeah, it's okay. We can get oranges from the orange grove. - Ooh, orange grove? What that? - You are going to love it. Follow me. (lively music) - To the orange grove.\n- To the orange grove. ♪ Orange grove, orange grove ♪ ♪ We're going to an orange grove ♪ - Boy, oh boy, oh boy, oh boy. Here we are at the... - [Cookie Monster And\nGonger] Orange grove. - [Cookie Monster] Hello, Farmer Dadda. We need oranges to make meskouta. Can you help us please? - Hello, Cookie Monster. Hello, Gonger. Welcome to the orange grove. Of course I can help you. Orange is our fruit that grow on trees. When an orange tree blooms,\nit grows white flowers. And once oranges are ready to pick, we twist and pull them\noff the branch by hand. Some farms use a special tractor\nto shake them off the tree. You can eat them as a snack, in salads, or you can squeeze oranges\nand get orange juice to add to recipes like\nblazes and the meskouta cake. Here are some oranges\nfor you to make meskouta, Cookie and Gonger. - Thank you farmer, Dadda.\n- Thank you farmer, Dadda. ♪ Oranges, oranges ♪ ♪ Going home with oranges ♪ ♪ Yeah ♪ - We've got the oranges.\n- Yeah. - Me wonder how we make meskouta. - Well, let's take a lookie,\nCookie, and check the recipe. First we need to separate the eggs. - Okay, here the bottle. Me going to squeeze out\nthe air and get the yolks. One yolk, two yolks, three yolks. - Now pour half a cup of\nsugar over three egg yolks and mix 'em! - [Cookie Monster] Pour\nhalf a cup of sugar and mix. - Now add two and a half cups of flour and a half cup of canola oil. - [Cookie Monster] Two\nand a half cups of flour and a half cup of oil. - And now I will add one\nteaspoon of vanilla extract and baking powder. (giggles) Now pour one cup of juice\nmade from the oranges. - And me going to wear me orange things. Hey, me look good. - You do look good. - And we have juicer. (orange squishing) Okay, oranges are juice. In we go. - And now I'll mix the egg\nwhite with a pinch of salt until that's fluffy. (giggles) - [Cookie monster[ Pinch of salt. Ooh, so fluffy. - [Gonger] Yeah, then gently\nmix it all together to make... - Cake batter!\n- Cake batter! - Okay, it's in the pan and\nready to go into the oven. - Into the oven. And now take it out of the pan. - Oh, meskouta smell delicious. - Yeah. Oh! (gong ringing) It's ready! (Gonger giggling) - Order up. - Bye bye, cake! - See ya. - Me-scoot on outta here. - Oh, Cookie Monster, my googly eyed chum? - Yes, Chef Gonger? - I got this nice just for you-who. - Nice for me? Oh, thank you, Chef Gonger. (Cookie Monster munching) Oh, yummy. - Oh, Cookie, Cookie, Cookie!\n- Oh yeah, yeah, yeah, yeah. - Thank you so much,\nCookie Monster and Gonger, for this sweet and tangy dessert. - You're welcome, Nora and Nora's sister. (lively music) Yeah!\n- Hey! ♪ Happy healthy monsters to the rescue ♪ ♪ We make yummy food just for you ♪ ♪ Do you like food ♪ ♪ I\ndoobee, doo doo, dooba ♪ ♪ Like me like food ♪ ♪ Adeebee, deeba, deeba, deeba ♪ ♪ Place your order if you lucky ♪ ♪ We make food in our foodie truck ♪ ♪ Yeah ♪ (tablet ringing) ♪\n- Oh me got it, me got it. - No, I get it, I get it. - Hello, Cookie Monster and\nGonger. My name is Terrence. I'm visiting my brother at the hospital and I'd like to take him\nsome soup to cheer him up. We love pumpkin soup! It's our favorite. Can you help me, please? - Of course we can help you, because we are monster foodies! Okay, what we need to make\npumpkin soup, Chef Gonger? - [Gonger] Well, I got the\nrecipe right here actually. For pumpkin soup we need\nvegetable stock, salt, pepper, coconut milk, onions and pumpkin. - Oh yeah pumpkin, um, we\nno have any more pumpkins. But, we do have this snazzy hat. - Oh, that is a snazzy hat! No, Cookie, where's the\nrest of the pumpkin? - Uh, me ate it. - Oh! We need to get more\npumpkins for the pumpkin soup. - Okay, but can me wear snazzy hat? - No. Come on, let's drive. (upbeat music) ♪ To the pumpkin farm ♪ ♪ Pumpkin farm, pumpkin farm ♪ ♪ We're going to the pumpkin farm ♪ - Boy oh boy oh boy oh boy. Here we are at the pumpkin farm. We need pumpkins to make\nsoup. Can you help us? - Hello, Cookie Monster and Gonger. Welcome to the pumpkin farm. You probably have seen pumpkins get carved into Jack-o-lanterns at Halloween, but did you know that inside\nthe pumpkin are pumpkin seeds? To grow pumpkins, all you have to do is plant the seeds in the ground. The pumpkin starts out as a little sprout, then becomes a vine. At first the pumpkins are green. When they get bigger they turn orange. When the pumpkins are done growing, they're cut off the vines\nwith special shears. Some of the pumpkins are grown in a field where you can pick out your very own. It's called a pumpkin patch. I hope you had fun at our pumpkin farm, Cookie Monster and Gonger. Here's a pumpkin for your\npumpkin soup. Enjoy it. - [Cookie] Oh boy, thank you, Mr. Farmer. - [Gonger] Thank you! ♪ Pumpkin, pumpkin, going\nhome with a pumpkin, yeah ♪ - Bring it on in. Here we go. (Gonger groaning) Oh boy, that's a cute pumpkin. - [Gonger] Okay, let's check the recipe. Okay Cookie, we need to break this pumpkin into little pieces. - You got it, stand back. Hi-yah! (Cookie Monster groaning) - Um, Cookie, leave it to me. Hi-yah! Thank you (Cookie Monster groaning) Now we have to scoop the\npumpkin out the skin. Oh yeah, there we go. Now mash em. - [Cookie] Oh boy, me want to do mashing. Like this?\n- Yeah. - Mashy mashy. Mashy mashy! Oh, this fun. - Oh, oh, Cookie!\n- Yeah? - Now pour the mash pumpkin into the pot. - [Cookie] Oh, Okay. - [Gonger] There, that's it.\nNow, some vegetable stock. - [Cookie] Okay, you do that one. - [Gonger] There we go. - What next?\n- A pinch of salt. A dash of pepper. Some coconut milk. - [Cookie] Right. Here we go. - [Gonger] And some onions. - [Cookie] Top it off\nwith a little onions. - Now we, we stir and wait for it to cook. - Okay. - Yeah. Stir, stir, stir. - Oh boy. Soup smell delicious. - Yeah. Oh oh. (gong rings) It's ready. - Order up. - Peace out, pumpkins. - Bye bye, pumpkin soup. - Oh, Cookie Monster?\n- Yeah? - I got this nice for you.\n- Oh, Gonger, thank you. Oh boy. (Cookie Monster munching)\n(Gonger laughing) (tablet chiming)\n- Ooh, oh, oh yeah. - Thank you so much for\ncheering up my brother, Cookie Monster and Gonger. - Yes, thank you. I love pumpkin soup. It's healthy and delicious too. - You welcome, Terrance. (upbeat music) Yeah.\n- Yay! ♪ Happy healthy monsters to the rescue ♪ ♪ We make yummy food just for you ♪ ♪ Do you like food ♪ ♪ I doobee, doo doo, dooba ♪ ♪ Like me like food ♪ ♪ Adeebee, deeba, deeba, deeba ♪ ♪ Place your order if you lucky ♪ ♪ We make food in our foodie truck ♪ ♪ Yeah ♪ (tablet beeping) ♪\n- Oh, me got it, me got it! - No, I get it, I get it, I get it. - Hi, Cookie Monster and Gonger, my name's Grace and we need your help. Today we're having a family dinner, and my cousin only likes\nfood that is bright colors. She thinks French fries are boring. - Too beige. - Maybe we can make French fries that have bright colors. Can you help me, please? - Of course we can help\nyou because we are, monster foodies!\n- Monster foodies! - Okay, Chef Gonger, how\nwe make colorful fries? - Let's make baked sweet potato fries. Okay, let's take a little\nlookie lookie at the recipe. To make sweet potato fries,\nwe need vegetable oil, salt, pepper, and sweet potato. - Here you go. Uh, vegetable\noil, uh, salt and pepper. Yeah.\n- Yeah, yeah. Where the sweet potato? - Uh, is sweet potato long, orange potato that you can hollow out\nand play like flute? - Cookie Monster, did you make a flute out of the sweet potato? - Mm-hmm. Yeah, yeah, yeah, me did that. Then me ate it.\n(Gonger groans) It delicious and, musical. Excuse me. - (groans) Cookie Monster, we\ncan't make sweet potato fries without the sweet potatoes. - You're right, this is a big problem. Yeah, what, what we gonna do? - Ooh, I know, we can\nget more sweet potatoes from the sweet potato farm. Come on. - Oh, okay. Wait. (Cookie Monster burps) Excuse me, sorry. Wait for me. (burps) Oh, excuse me again. (upbeat music) (seatbelt clicks) (seatbelt clicks) - [Cookie and Gonger] To\nthe sweet potato farm. ♪ Sweet potato farm, sweet potato farm ♪ ♪ We're going to the sweet potato farm ♪ - Boy oh boy oh boy oh boy. Here we are at the. - [Cookie and Gonger] Sweet potato farm. - [Cookie] Hello there, Mr. Farmer, we need sweet potatoes to\nmake sweet potato friends. Can you help us, please? - Hey, Cookie Monster and Gonger, welcome to the sweet potato farm. Of course I can help you. Sweet potatoes are a root vegetable that grows in the ground. They grow in warm weather,\nand when they're ready, they're moved to a different field, and planted in rows by big\nmachines called transplanters. When the sweet potatoes are ready, farmers harvest them by hand,\nplacing them in buckets, and then dumping them\ninto large wooden bins. After the potatoes have been\nharvested they're cleaned, sorted based on size, and shipped to restaurants\nand super markets. Sweet potatoes come in\nlots of different colors. Orange, purple, white. They can be mashed, made into a casserole. - [Gonger] Or used to make\nsweet potato pancakes. - They're sweeter than regular potatoes, and full of healthy vitamins. Here are your sweet potatoes\nfor your sweet potato fries, Cookie Monster and Gonger. - [Cookie] Thank you, Mr. Farmer. ♪ Sweet potatoes, sweet potato ♪ ♪ Going home with sweet potatoes ♪ - Okay, Chef Gonger,\nwe got sweet potatoes, now me wonder how we\nmake sweet potato fries. ♪ What if we check the recipe ♪ ♪ Let's try ♪ - [Gonger] Okay, to make\nbaked sweet potato fries, first we gotta chop up the\nsweet potato into long pieces. - [Cookie] Okay. Choppy, choppy, chop. - Yeah, now pour two\ntablespoons of vegetable oil into the bowl, and then toss\nthe potatoes with the oil. Next, add a pinch of salt and pepper. - [Cookie] A pinch, pinch of\nsalt, a pinch, pinch of pepper. - Oh yeah. Now spread\nthem on the baking sheet. ♪ Oh spready, spready, spready ♪ - Now put them into the oven to bake. Fries done baking. - Wow, they so colorful. Look at that, they so orange. - Oh. Oh. (gong clangs)\nIt's ready! - Bye bye sweet potato fries. - Bye sweetie. Cookie Monster, (clears throat)\nI got this nice for you. - (gasps) Sweet potato fries. Oh, thank you, Chef Gonger. (Cookie Monster munching) Oh, you know they sweet and delicious. (tablet ringing) - [Gonger] Oh, oh, oh. - Thank you, Cookie Monster and Gonger, for the healthy and delicious\nbaked sweet potato fries. My cousin loves how colorful they are. - Yummy. - You welcome, Grace. Yeah.\n- Yay! ♪ Happy healthy monsters to the rescue ♪ ♪ We make yummy food just for you ♪ ♪ Do you like food ♪ ♪ I doobee, doo doo, dooba ♪ ♪ Like me like food ♪ ♪ Adeebee, deeba, deeba, deeba ♪ ♪ Place your order if you lucky ♪ ♪ We make food in our foodie truck ♪ ♪ Yeah ♪ (tablet beeping)\n- Oh, me got it, me got it! - [Gonger] No, I get\nit, I get it, I get it. - Hello, Cookie Monster and\nGonger. My name's Marissa. It's Teacher Appreciation Day at school, and I wanna give my teacher, Mr. Brooks, his favorite snack to say thank you. I have the tortilla chips but I need mango salsa to go with them. Can you help me, please? - Of course we can help\nyou, because we are, monster foodies!\n- Monster foodies! Okay, Chef Gonger, what we\nneed to make mango salsa? - [Gonger] Well, we need\nmango, red pepper, red onion, cilantro, lime, and salt. - Okay, we have red pepper, red onion, cilantro, lime and salt. But oh wait, me no see mango. - Oh no! Cookie Monster,\nwhat are we gonna do? Without a mango, we're\nfailures! Failures, I tell you! - Whoa, whoa, whoa.\n- We can't make a salsa! - Settle down. Gonger, Gonger, shh, shh. Gonger, shh. Breathe, breathe. No worries. Me got good idea.\n- Oh? (energetic music)\n- Salsa! - Huh? Whoa, whoa, whoa, Wait, wait, wait, wait. No, we're not supposed\nto be dancing salsa. We're supposed to be making salsa. - Too bad. Me was just\ngetting into the rhythm. Oh, okay. Now what we do? - We'll go get more mangoes\nfrom the mango orchard. Let's go. (lively music) (hat whooshing)\nWhoa! (upbeat music) To the mango orchard!\n- To the mango orchard! ♪ Mango orchard ♪ ♪ Mango orchard ♪ ♪ We're going to the mango orchard ♪ ♪ Hey ♪ Boy, oh boy, oh boy, oh boy. Here we are the mango orchard.\n- Mango orchard. - Hello, Mrs. Farmer.\n- Yoo-hoo. - [Cookie Monster] We need\nmangoes to make mango salsa. Can you help us, please? - Hello, Cookie Monster and Gonger. Welcome to the mango orchard. Sure, I can help you. Mangoes are a type of healthy sweet fruit that grow on trees. As our mangoes get ripe and ready to eat, they feel softer when you touch them, and the skin turns from all\ngreen to a little yellow. Some mangoes turn orange. The mangoes are picked either by hand or with the fruit picker that keeps the fruit from\nfalling to the ground. The people who pick the mangoes wear long sleeves to protect\ntheir skin from the sun and the mangoes sticky sap. Then the mangoes are placed into boxes and brought to the shed to be stored before they're taken to the market. Here's a mango that I cut open. See, it's a golden yellow on the inside. It's delicious to eat on\nits own as a healthy snack, or used in foods like\nsalads and smoothies. Here's some mangoes to\nmake your mango salsa, Cookie Monster and Gonger. - Thank you, Mrs. Farmer.\n- Thanks, Mrs. Farmer! ♪ Mangoes, mangoes ♪ ♪ We're going home with mangoes ♪ - Okay, Chef Gonger. We got mangoes. Uh, how we make salsa? - Well, let's take a little\nlook at the old recipe. First, we cut the mango\ninto pieces and dice it up. - Got it. Hiya, wa-ha! Dicey,\ndicey, dicey, dicey, dice. Uh, the fruit dicey dicey,\nbut it didn't come out. What, what do we do now? - What if we use this big\nspoon and scoop the mango out? - Now, that a good idea. Me try it. Look at that, it worked. - Next, add one chopped red pepper. Oh, and now, one half cup of red onion, and a half cup chopped cilantro. Oh, next, lime juice. - Squeezing the lime. There we go. Oh, look at that. - And finally, add a\nsprinkle of salt and stir. Mango salsa look delicious. - Oh! (gong ringing)\nIt's ready! - Adios, salsa. - Cookie, Cookie. And now, Cookie, I got the snacks for you. - (gasps) Oh, thank you. (Cookie Monster munching) Yummy, yummy. (tablet beeping)\nOh, oh, oh! The thing, the noise, the thing. - Thank you so much,\nCookie Monster and Gonger, for my teacher's favorite\nhealthy snack, mango salsa. - It's delicious. - You welcome, Marissa and Mr. Brooks. Yeah! - Yay! ♪ Happy healthy monsters to the rescue ♪ ♪ We make yummy food just for you ♪ ♪ Do you like food ♪ ♪ I\ndoobee, doo doo, dooba ♪ ♪ Like me like food ♪ ♪ Adeebee, deeba, deeba, deeba ♪ ♪ Place your order if you lucky ♪ ♪ We make food in our foodie truck ♪ ♪ Yeah ♪ (tablet beeping) - Oh, me got it, me got it.\n- No, I get it, I get it. - Hi, Cooking Monster and Gonger. I'm Mikey and this is my parrot, Petey. We need your help. Parrots are animals that love\neating papaya, just like me, but Petey just ate my last piece. I wanted to make myself\na tasty papaya dessert. Can you help me, please? - Of course we can help\nyou, because we are monster foodies!\n- Monster foodies! - It must be so hard to cook when someone eats your ingredients. - We are going to make a special treat, a baked papaya with ice cream and lime. - That sounds so yummy. Oh boy. Oh boy. Oh boy. How we make that? - Well, let's take a\nlittle look, shall we? - [Cookie] Okay. - [Gonger] For baked papaya\nwith ice cream and lime, we need cinnamon, ice\ncream, lime, and papaya. - Okay, we got it right here. All the ingredients. Yeah, we got the cinnamon.\nWe got ice cream. Ooh, that cold. We got lime and we, no got papaya. - Oh, Cookie! - Oh, wait a minute. What this? (gasps) Parrot. (gasps) Did you eat papaya? (squawks) Yeah, me ate papaya. - You think I was born\nyesterday, Cookie Monster? Oh my goodness! Oh, every time. Ugh, come on, we gotta\ngo to the papaya farm. - Oh, come on, parrot.\n- Leave the parrot here. (seat belts clicking) - To the papaya farm!\n- To the papaya farm! ♪ Papaya farm, papaya farm ♪ ♪ We're going to the papaya farm ♪ Boy, oh boy, oh boy, oh boy. Here we are at the, papaya farm.\n- Papaya farm! - Hello, Cookie Monster and Gonger. Welcome to the papaya farm. - [Cookie] Hello, Farmer Jaillel. We need papayas to make big\npapaya with ice cream and lime. Can you help us, please? - You've come to the right place. Of course I can help you. Papayas are a type of\nfruit that grows in trees. Papayas start as little\nseeds that grow and grow into big trees. Papayas grow in bunches\nat the top of the tree. When they ripe, we pick\nthe papayas by hand. The papayas are then washed, wrapped, and packaged to go to the store. You can make papaya salsa, smoothies, and even add it to a yummy fruit salad. Our animals love it too. Here are papayas to make baked papayas with ice cream and lime,\nCookie Monster and Gonger. - Thanks, Farmer Jaillel\n♪ Papaya, papaya ♪ ♪ Going home with papaya ♪ - We've got papaya, now me wonder how we make baked papaya\nwith ice cream and lime? - Well, let's take a little\nlookie lookie at the recipe. - Yeah, let's try! - [Gonger] First we\nneed to cut thee papaya. - Okay. And chop! - Whoa! Look at those seed! Scoop 'em out. Now I got a sprinkle them\nwith a little bit of cinnamon. Now they're ready to put into the oven. Okay, in you go, little papayas. Oh yeah, papaya done baking. - Yeah. - Looks like they nice and cool. - Now we're gonna give each\nof these a scoop of ice cream. - [Cookie] You know, we love ice cream - Yeah, and a little\nsqueezy squeeze of lime. (cheerful music) - They look delicious. Mm! Oh, this means that- - Whoa, whoa, whoa, wait a minute. - What? - This for little Petey\nParrot, and this for me, Percy. Yeah. Eat up, Percy. (Cookie Monster munching) - Oh, Cookie, you're a sweetie. (gong rings)\nIt's ready! - Order up! - Peace out, papaya!\n- Bye-bye. - Oh, and Cookie Monster,\nI this snack for you for being sweet to Pete. - Oh, thank you, Gonger. Wow, nummy nummy. (Cookie Monster munching) - Ooh, goes down well! Oh, Cookie. Cookie, Cookie!\n- Yeah, yeah, yeah. - Thank you, Cookie Monster and Gonger, for the special papaya dessert. It's delicious. And Petey loves his treat too. You're welcome, Mikey. (upbeat music) - Yeah!\n- Yay! ♪ Happy healthy monsters to the rescue ♪ ♪ We make yummy food just for you ♪ - [Cookie Monster] It's \"Snack Chat.\" - Snackety chat. ♪ Doo-ba doo-ba-dee doo. ♪ ♪ The show where you\nsnack more than you chat ♪ It's \"Snack Chat!\"\n- \"Snack Chat!\" - Hi-ya, me your host, Cookie Monster. Joining me is me foodie\nfriend, Chef Gonger. - Oh, Cookie, Cookie, how do I look? Oh, I'm so nervous to\nmeet our special guest. Oh, I'm such a big fan, Cookie Monster! - Yeah, you look good, Gonger. Yeah, don't be nervous. Settle down. Yeah, me introduce her. Please welcome \"Snack\nChat\"'s special guest, Chef Carla Hall. (cheerful music) - Hi, Cookie Monster. Hi, Chef Gonger. Hey, where's Chef Gonger? I'm a big fan of his. - You're a big fan of me? - Of course! (spoon thuds)\nIt ready! (spoon thuds)\nIt ready! This night's for you. (Gonger groans) - Gonger. Chef Gonger, hello? Today, Chef Carla brought\nus special sometimes treat for \"Snack Chat.\" - Yes, today we'll be\nhaving a sweet potato cake with ginger milk glaze. - Cake? Carla, is it you birthday? - Oh no, I didn't realize! I didn't get you anything. Oh, I'm so embarrassed\nwith my little self. - No, no, it's not my birthday. ♪ Happy birthday to you ♪ ♪ Happy birthday to you ♪ (party horns honk) - This cake is great for\nbirthdays, not my birthday, holidays, parties, or for a\nspecial treat with friends. - Let's eat! - Wait, Cookie Monster. (record scratches) That's not how you eat cake. - It not? - I'll show you the Chef\nCarla way to eat cake. First, you have to admire your cake. - Oh, yeah. This really looks yummy,\nChef Carla. (sniffs) It's sublime. - Yeah, yeah, yeah, yeah, yeah. Yeah, look delicious. Let's eat! - Not yet, Cookie Monster. (Cookie Monster sighs) Now we sniff the cake. - Okay. (sniffs) Oh, yeah. - (sniffs) Oh, it smell great. Let's eat! - Wait, Cookie Monster! - It good thing this not ice cream cake. It be melted by now and game over. - Next, we use our fork to\nget a nice piece of cake. Next, we- - Yeah, yeah, yeah, me know, me know. Have lots more stabs\nand no eat yummy cake. - We eat! (Cookie Monster gasps) How is it? - Oh, it's yummy. - That terrific way to eat cake, Carla, but me prefer me method. Cake! (Cookie Monster munching) - I'll have to try that next time, but we're not done yet. - We're not?\n- We're not? - You can enjoy your cake\nwith a nice glass of milk. Cheers! - Cheers!\n- Cheers! - Clink. (monsters gulping) - Share your healthy\nand delicious snackies with snack #withme. (chuckles) - Happy snacking! - [Cookie Monster] It's \"Snack Chat.\" - Snackety chat. ♪ Doo-ba doo-ba-dee doo ♪ ♪ Doo-ba doodly doo ♪ ♪ It's Snack Chat ♪ ♪ Snackity Chat ♪ ♪ The show where you\nsnack more than you chat ♪ ♪ It's Snack Chat ♪ Hiya! Welcome back to \"Snack Chat.\" As usual, before snacking, make sure that you hands nice\nand clean, like me hands. See? Okay, today we have a very uh, exciting snack. (gulps) Uh, me can do this. Today's snack is... Hummus. Ugh. Okay, me no like hummus. Well actually, me never try hummus. But me know me no like it. It's so mushy, and creamy, and hummusy. Blah. But me so hungry. Maybe me give it try, yeah. Ugh. Yeah, this not gonna happen. Okay, maybe me try this. Hummus, cowabunga! Ah, nope. Well, uh, hummus is same color as cookie. And me hungry. And this \"Snack Chat\" after all. So me need to snack. So maybe, uh, no, me no can do this. Me no can do this. Maybe me just have a\nlittle nibbley of hummus. Yeah, yeah, yeah, yeah. Okay, here goes nothing. (Cookie Monster munching) Hey! (Cookie Monster munching) Wow! Oh yeah, hummus, oh nummy, hummus. (slurps) Oh, hummus delicious. Ah. Me love it. And it pretty yummy with carrot sticks. Share your healthy and delicious\nsnacks at snack#withme. Yeah, and maybe try a snack\nthat you've never tried before. Happy snacking. Wait, where me sign. Oh, here it is. ♪ It's Snack Chat ♪ ♪ Snackity Chat ♪",
    "start_time": 0.189,
    "end_time": 1840.827
}