{
    "video_id": "vBEqaUtyqA0",
    "channel_url": "@jesser",
    "transcript": "He came on the show. We had to play Madden together. He's talking trash the entire time. >> I'm so nervous. And at halftime, he's beating me 50 nothing, right? Talking trash the whole time. This is my own show. I'm hosting it. So he's like, \"All right, let's switch controllers.\" We switch controllers. >> I lose the game 60 to 50. >> So I have trauma from that experience. So please teach me how to beat. >> Do we beat you 110 to nothing? >> Pretty much. It was the worst Madden beatdown of all time. So that is going to change today. But chat, we got a bunch of giveaways coming all powered by Lowe's. And when we're talking about earn your Sunday, what does that mean? Right. So Monday to Saturday, you're grinding. You're always working, doing different projects throughout. And you got to earn the Sunday to relax. Family time, football time. >> I feel Yeah, we're out here. I'm living like it's a Sunday even though it's not a Sunday right now. But >> I know >> I'm having that experience. And we got a bunch of giveaways. So, the way the giveaways are going to work, we're giving away a ton of Madden codes. So, all you guys got to do is scan the QR code that's going to be on the screen to enter the giveaway, and you can get yourself your own copy of Madden with Saquon on the cover. This is perfect. Who will be here later in the stream? So, all right. Which team should I play as? >> I mean, I you got to go with the running quarterback. Uh I mean, the Eagles are good. Um >> I feel like Saquon is gonna be them. Well, like you know the Ravens, the Bills, >> Cardinals. >> Ravens or Bills. Oh, the Ravens are in 93. Also, chat, we got to shout out people in here. Shout out to Colts. Shout out to Jack, Sir Martin, JD Edits. You guys are spamming the 67 bucket squad's in here. Okay, they're saying go to the Panthers. I'm not going to play with the Panthers. Why are they saying the Panthers of all the teams? >> Okay, let's go. I'm ready. >> I'm ready. >> And then guys, yeah, when Squan comes, if you want me to ask him anything particular, just let me know in the chat. It's going to be it's going to be awesome. >> Oh, this is you. Scroll to three. >> All right, we're playing arcade. >> Oh, three minute. >> Yeah. >> Okay, let's go. All right, so give me the breakdown. What do I need to do to be successful? >> So, you're the Ravens. You got Lamar Jackson. He's >> incredible at running. He's strong armed. They have Derrick Henry. They have a good offensive line. They can run the ball really well. >> Um, >> I think you have to >> use Derrick Henry a lot. And your defense is really good. So, you'll be able to get stops if you can tackle. >> Okay. >> Um, but do you think mainly run like should I ask Madden for everything or No, >> you can ask Madden. >> Okay. >> Asking Madden's not a bad idea. I I mean until you get a until you get a sense of like, oh, I like doing that play because you know I Oh, so kicking. You got to do the kick. You got the kick. >> I thought you were kicking. >> I thought you were kicking. Redo it. Release. >> Uh, so I'm on offense. >> All right, chat. What's your favorite NFL team? Let me know right now. >> All right. For defense though, I feel like I have to ask Maddie. Yeah. Yeah, I think so. Look at these great uniforms. >> Not bad. I I feel like I got to play off ball defense. Is that the strategy? >> Uh you usually if if you if you're not really good, you'll play with the D line. If you're good, you'll play with linebackers and safeties. >> Oh my goodness. I try to jump over you. You're not Sequ. >> No. How do you switch players, man? >> Um B >> chat, I am a noob. I'm seeing a lot of Giants, Lions, Eagles, >> and then >> Patriots. 67 is not a team. Stop spamming that in the chat. >> RT is sprint. >> Okay. Okay. >> And then this is like the hit stick and truck stick. And then tackle is is A. Dive is X. Jump is Y. I understand it now. That was a nice move. That was a nice move. Only two yards. Not bad. >> See, that's what I'm worried about. I'm worried about when I play on the ball and switch to the person nearest that I'm just going to get out. >> Yeah. >> Tackling is the hardest part of Madden because the other person you're the other person's going to make a move on you for sure. Come on. Come on. All right, stop on the goal line. >> Yeah, bean chat. This trailer though is actually insane. We got the dude in the back watching over us. I might need to ask him for plays, honestly. He's dialed. He's locked in with the >> person in there. >> He's watching. I feel like there's no way I stopped this >> maybe. >> And chat, if you're just joining us, good touchdown. I I don't think I was going to stop it. >> Well, I'm just showing you how to do it. >> I feel like you just like destroyed me. Like, I feel like I didn't learn anything. >> Well, it's like osmosis. You'll get it. >> Osmosis? What does that even mean? >> It's science. like like you'll just learn from from being around it, you know. >> All right, I'm down 7 nothing. And chat, if you guys want to get your own copy of Madden, we're teaming up with Lowe's. They're doing a bunch of giveaways on the stream and all you guys got to do is just scan the QR code that's on the screen and that's how you enter the giveaway. But there is a ton of codes today. So this if you if you enter there's a good chance you get it. So good luck with that. Big shout out to Lowe's for doing the giveaway. Now watch me return this for a touchdown. >> Okay. You know what? I'll take it. I'll take it. >> All right, let's go. Lamar >> defense is is the hardest part of Madden. So, and offense, you know, that's where you score the points anyway. So, who cares if you can't stop him? It's about scoring. >> Facts. >> About putting the ball in the end zone, >> dude. So, Lamar Jackson, I'm I'm high on Lamar. Okay. I have 2,000 rookie cards of Lamar Jackson. 2,000 of the Sports Illustrated like Lamar Jackson cards. So, I'm waiting on those. >> Oh yeah. >> Oh my god. Oh my god. >> Oh my goodness. He's the best ever. >> No way. >> Let's go. >> He's the best ever. >> I learned to do that every play. >> I mean, it's not a bad strategy. >> Yo, that was crazy. There's >> so much room for activities in here. >> Talk to me, Chad. I He was tackled. What the heck? >> I I feel like that was me earning my Sunday right there. >> Yeah. Oh god. Oh my god. >> So it the it >> I haven't played Madden in a long time. Jaylen Ramsey, like I told you earlier, he traumatized me. >> The meter is the side to side meter and then the vertical meter. Kicking is hard, but hopefully you know you don't have to kick. >> I I know. I'm gonna just go for two. I'm gonna go for two every time. >> Look, you didn't do it again. You have to press it. >> It's a double tap. >> No, it's a press and hold. >> Oh, >> lag. >> You didn't kick it far enough. >> Chad, if you're just joining us, Saquon is coming on later in the stream. So, I'm trying to learn the skills right now to take him down. 67. Lots of 67s. >> What about 41 chat? >> Uh think is probably >> RB. >> I'm talking about the >> you are in in the worst defense you could possibly be. So, press X. >> Time out. >> Oh, okay. You call timeout. So, the way you audible is you're going to press X and then plays will come up. >> Okay. >> So, you don't want So, you're you're in recent. So, yeah. >> The defenses be overwhelmingly. >> All right. Here. Big sack right here. Come on. That's fine. [Applause] >> So, did you used to like sweat? How much Madden did you play back in the day? >> Uh, growing up, I played Madden uh all the time, like almost every day probably. But in college, you don't get to play it as much cuz you're Well, at least cuz I was >> damn >> playing college football. So, I I didn't get a lot of video game action, but it's it's I mean, know it's just the football knowledge. You see what the defense is giving you. You take what they're giving you right there. I know I had single coverage, but >> that was a crazy catch. >> Yeah, Drake is awesome. >> Do you feel like playing Madden makes you a better football player? Uh, I wouldn't say it makes you a better football player, but it's always like good like mental like just getting like mental reps and like thinking about football and thinking about like, oh, like this is going to be open versus this or just getting to like for you like getting to know like football players just in general. >> It's like, you know, like 2K, you know, >> maybe you won't be the best basketball player from watching it, but you know more about it. >> That's Yeah, that's actually facts. If I never played 2K, my NBA knowledge would be so bad. I've definitely played more like 2K than watched NBA games. >> I'm just not stopping BJ. >> Not him gritting on you. >> Come on. >> What up, chat? All right, so Squan is coming on later, so we have to destroy him in Madden. That's my number one goal. If I can beat him, I'll be so proud of myself. >> I'm going for two, Jesse. This is what you need to do as well. >> Oh, yeah. 100%. I'm going to go for two literally every time. >> Dang, not Landon saying you suck at Madden. >> Yes. >> Let's go. >> I thought I I didn't know he was that. >> Guys, if you want to play as Saquon later, you can do that in Madden. And the way to do that, you can win with the QR code. Just scan it. We're giving away copies of Madden. >> You could play a Saquon himself. >> He's definitely the best player in the >> best. Yeah. What's his overall? >> Is he 99? >> I would assume so. Yeah. >> Oh my gosh. Do you know how much aura you have being a 99? >> 99 aura. >> Facts. >> Aggressive. Relax. >> Got to got to hit you. It's the only way I know how to tackle. >> All right. >> First of all, don't screen look. I'm like >> screen picking you. >> I mean, I can't tell you're looking at the screen. Look at the screen. All right, let's go. I don't have to screen feature. I know you're just going to run with Lamar. >> No. >> Let's go. >> Oh man. >> Oh my goodness. >> Oh my gosh. Let's go. >> No way. >> Wait, I'm actually goated at offense, >> guys. I'm not >> I'm not. I have not reached UNK status. Let me ask Madden. That's my That's my guy. Or it's coach suggestions now. They changed it. >> Maybe I am. I'm calling it I'm calling it Ask Madden. >> Just a suggestion. >> Oh, Dererick Henry's a 98. >> Yeah, >> he's also huge. >> He's also ginormous. Yeah, a 98 overall is kind of crazy. Come on, Henry. >> A run. >> That was not a 98 overall run though. >> Just run straight into people. >> Remember my favorite type of run? I feel like they don't run it enough in the NFL when I watch the pitch. >> A sweep. Yeah, pitch. I mean, >> cuz everyone's fast in the NFL, so it's hard to get the get the edge. You got to set it up with some inside stuff. Come on. >> Oh my goodness. Space. Let's go. First down. Got a minute and a half. [Applause] >> Chat, why are we I'm not running straight into the lineman. Not the best strat. Here we go. Come on. Touchdown right here. >> Let's go. Beat him. >> Oh yeah. Like if he beat him, that would have been a touchdown. >> I'm also trying to waste clock. I don't want to give Johnny any time going into the second half. >> You're not doing too bad yet. >> Yet throwing. >> Oh, good run. >> Let's go, Henry. Let's go. That's what I'm talking about. >> So big, it's hard to tackle him. >> Sarah said, \"What football team do you support?\" So last year I was a Cowboys fan because of my video that I did where I went to the NFL draft and I became a Cowboys fan from that video and I fully supported them for the whole year. It was a terrible experience. So I'm now a free agent. >> I'm undecisive on what team. >> Oh, >> we're in. Let's go. >> I was a little aggressive. So I don't know which team to support. Like I'm I'm debating right now. You're a 49ers fan. >> I'm a 49er fan. I grew up uh in Santa Clara, which is like I don't know 45 minutes from where they played in San Francisco, but now their stadium is >> 10 minutes from where my parents live. So >> got to be >> Oh my damn. >> All right, I'll call I'll call a timeout for you cuz only two seconds left in the >> That is a real friend right there. Let's go. Thank you. Thank you. And on stream, the rules are you have to go for it on fourth down every time. And I'm not taking a field goal cuz I will miss it without a doubt. >> All right. Don't look at my screen, dude. >> I'm not looking at the screen. Well, I'm looking at the screen, not your play. >> Where is quick slam? That's my play. >> Oh, man. Wait. >> Oh, you're running. >> Ah, time out. >> Let me rethink about that. There you go. >> All right, chat. Which team should I be a fan of >> strategy? Run into the defense. >> Hey, I'm not down that much. >> Yeah, you might you might be in the lead after this. >> I might have to be an Eagles fan after today. If I beat Saquon, I won't be >> Not a Not a bad team to be a fan of. They're really good. >> Yeah, they did just win the Super Bowl. >> Oh, yeah. Tutti. >> Oh, yeah. >> Oh, no. Go, go, go, go, go, go, go. >> No. >> Did I just throw it too late? Was that the problem? >> Yeah, he threw it. >> He threw it to late. But I also had eight people in coverage. You only have like four or five people in a route, so >> hard to find openings there. >> But I mean, it's the end of the half anyways. You got to go to the end of the score. >> All right, boys. It is halftime and right now, this amazing spot we're in, the cool background, everything. This is the Lowe's Earn Your Sunday trailer. We're talking about earning your Sunday. Monday to Saturday, you're working. You're doing different house projects. What house projects have you done recently? >> Uh, I recently put together um a dresser in my room. >> Okay. >> Because I have too many Bucket Squad clothes and I needed more storage. >> Unlimited. >> Yeah, it's all the different things you got to do throughout a week. And then Sunday, I mean, it's a day for football. It's a day for family. You got to earn your Sunday, though. And you got to enjoy it. Oh my god. Wait. I'm off. I'm off to the races. Double check him. Let's go. >> So, yeah, Sunday literally to me is the best day of the week. Always chilling, especially during football season. >> Oh, for sure. >> I feel like football season comes and goes so fast. So, it's like you really got to enjoy those Sundays, especially. >> And with Lowe's, they are the real MVP. They're also giving away a ton of copies of Madden, and all you got to do is just scan that QR code popping up on stream and you get your own copy of Madden. Play as Saquon, play as whoever. Hopefully, you're better than me. All right, let's go. Let's lock in right now. >> I'm going to run it. >> I don't know if I should trust you. >> Go. Oh, it's not a run. >> It's a back run. >> That was a run. I wasn't capping. >> How do I feel that the Niners are 3 and 0? Um, glad that they're 3 and 0, but a lot of injuries, so I don't think they'll be 3 and 0 for long. >> All right, please let me get a touchdown. That is the opposite of what I'm trying to do. >> I'm talking to myself. Talking to Madden right now. Come on, >> bro. Relax. >> Yeah. >> Oh, he dropped that. No, I saw you manually playing him and I was like, \"All right, let me target him.\" >> Why? Why would you throw it at who I'm covering? >> I didn't think you would get it. >> Yeah, that's DBU. No fly zone. >> Oh my god. Run. Wait. >> Get him. >> Where's everyone's passing? Where did they go? >> Oh no. I'm coach, Jack. >> Third and 25. Sorry. You only needed to get 10 yards here and then it'll be fourth and 15. Way more manageable. >> You don't have to get everything at once. >> This is cooked. >> Oh, I'm saying be a Chiefs fan. Be a Bills fan. I don't know. >> Oh, yeah. Get in the eye. Why not? You probably should be in shotgun right now, but go ahead. >> I'll take it. Oh my >> gosh, dude. Everyone was covered. Well, it's cuz >> what do I do? >> You're in the eye formation. >> What is the eye? >> Go. Hey, you need to get in like these passing these passing uh >> formations cuz right now you have three or one or two over there. So, you probably going to have four people in in the route right now, >> bro. Nobody is open. Nobody. >> Oh, f. No, >> that is tra. That was the most tragic possession of all time. >> So like look at my off. I got single back which is under center eye formation. You want to be in the gun. >> I'm going back to asking Madden. I think then I started calling my own blaze. Everything went downhill. >> Yeah. Why were you doing that? >> I had a little confidence after my Lamar Jackson touchdown. >> Just for funsies. Go for it. >> Oh my goodness. >> Damn. Sit down. >> What's the hardest playing college football? What was the hardest like hit you ever took? >> Um, it was in my second to last game ever. I was in and I was running and I got like I I wasn't tackled yet but like I was wrapped up from behind and I they were like taking me down >> and I had the ball and the safety was coming like straight at me paused and he hit me like square like right in the face and my visor popped off my face mask and like cut my the like ridge of my nose open and it was like on like the second or third to last play of the game. Oh, the timing is crazy. >> Did you stay in? >> Yeah, I stayed in. There's only a couple more places, >> but Whoa. Why is he so >> It like It like happened in slow motion cuz I'm like running and I can't go anywhere cuz they have me wrapped up and I'm just like slowly falling forward and this dude is just like >> That sounds terrifying. >> But lucky for me, I didn't take too many big hits like in my whole like my whole life. My whole thing was if I don't get hit, that means I'm scoring a touchdown. So, how could I not get hit >> like that? Great touchdown. >> Like that. Doesn't get touched. Touchdown. >> Oh, he's hooping on you. >> I don't know if I'm ready to play Saquon. >> No, we got we got to teach you some offense coming up here. This next possession. >> We No, this next thing is going to be a big learning. And Chad, if you're just joining us, Saquon will be joining us a bit later in the stream and I have to take him down. So, typically, if you want to run the ball, you want to be under center. If you want to pass, you want to be in the shotgun. So, we'll I'll show you some of those formations that you want to be in. >> I just kind of do what I did with Lamar that first time when I went 80 like yards for the touchdown. That was a great time. >> Yeah. So, the quarterback, it's easier to run out of shotgun as well cuz he if you're under center, you have to go backwards to go forward. >> Oh my god. Oh my gosh. Why is this guy untackable? >> Why is this guy so hard to tackle? He's getting hit by everyone. >> No, I just went crazy. So, let's go. >> Go to formation >> inside of coach. >> Yeah. Go to formation and then scroll down to gun. >> Okay. >> And then to the right and then to the right again. To the right again. You want to be in like those type of formations. There's two player two of those receivers on either side. >> Okay. I think I'm going to mainly run it. >> It's not a bad idea. Derrick Hannon, Lamar Jackson. >> Facts. >> Big offensive line. >> Run. No. Lamar. Lamar. Why? Why Lamar? So R RB is how you strip the ball. >> Oh face. >> I just got to test it out. Now you know. Now you know. A >> Lamar man. He is actually so fast though. >> Hey, that was tragic. That was actually tragic. >> Four plays. >> Oh, knock pits. [Applause] >> Let's go. >> Yeah. four versus good with Lamar. And then you could just if someone's open, you throw it to him. If not, you just run. >> That's a That's a good uh good strategy. >> Uh I would hit. >> I'm not sure on that. >> Chat, talk to me. >> All right, guys. Since you're in the chat, we'll give you some inside scoop on some future videos we got going on. So, we do have some more NFL related videos coming. We have a We got five NFL players and one fake NFL player. So, we did like a reverse guess the secret player >> defense. No way. >> Dude, this guy's amazing. >> Distracting me. >> We should do a video with that guy. >> Van. Speaking of that, we do have a video with him coming up as well. Another guest, a secret NFL player with Vjon. Um, so those videos are both coming. What else do we got? What do we got cooking? We got um >> they got NBA player 101 video. >> Oh, that is true. We got eight NBA players did a 1v one tournament that is on the docket as long as well as the college one. So I was like we do Oh, I'm here. I'm here. Yeah, sit down. I was like, we do the NBA oneonone tournament. We got to do college, too. James in the chat. Shout out James. >> What's Jameselle? Brother James >> Jadil, >> let's go. Oh, good blocking, Johnny. Look at your line. >> I know, but nobody was open, so >> sit down. Okay, that was such a hard dag. Lee also sat down. >> It's audible. Let's uh >> I like this play. >> Oh, he's open. >> Did a quick little cheeky first down. Nice >> twoinut warning, >> guys. That QR code on screen is a giveaway with Lowe's. You can get potentially have a chance to win a copy of Madden. >> Get a code for that. Seaquan's on the cover. You know what time it is. Let's get a stop. 2 minutes left. This was the warm-up game. We'll play one more after this and that's going to be the real game. >> I'm going to score probably on this play. >> So confident. Oh yeah, the opposite of the score. >> Let's go. >> Oh my god. Oh, >> we're going to run this way. I'm going to run away. >> Are you kidding me? Are you kidding me? That's actually insane. >> Why were you running that way? >> I was going to go all the way around and then get score a touchdown. >> No, that's that's >> How do I fumble twice? >> That's unfortunate. >> A house swing. That's tough. Honestly, that's tough. >> Did you like hit me in a That was a computer. >> No, that was a computer. I didn't even tackle you. [Applause] >> Wow. Dive. Oh my goodness. >> So, the key is get the ball to your best players. The good thing for you, your best player is your quarterback. That's true. >> He gets it every play. >> That's true. I mean, he also fumbled it. >> Yeah. Yeah, it's true. >> Edington 2, shout out to you. I see you in the chat. >> The Lewis, >> you have to select a play. >> They're saying for you to be >> You know what? I should actually, you know what actually might help me win? >> Scoring. >> I noticed when we're in the matchup choosing our teams and everything, I switch his difficulty to Hall of Fame. Switch mine to rookie. that >> without I got to make sure he doesn't notice though. I'll distract him while I do that. >> What are you going to grab his >> I'll be like, \"Oh, what shoes are you wearing?\" And then I'll quickly >> I'll have it preloaded >> like, \"Oh, I just I figured you'd want to be the Eagles Hall of Fame.\" >> This is my specialty right here. >> This is You are good at this. >> Nope. Not that time. diabolical. >> No, this is diabolical right now. >> Okay, >> come on, Lamar. >> Well, you don't want to run into the computer defenders, >> dude. I just get so overwhelmed. I'm not going to lie. >> You want to run to where there's no people. >> No, I know. I just got very overwhelmed. Well, there's no one open. >> Yes, dehop. >> All right, let's go. Let's go. Let's go. Let's go. Let's go. Let's go. On delay. So, if you want to go no huddle, you double tap Y after the play or just spam Y. That's what I do. >> Oh no. >> Let's go, Henry. Let's go. >> 36. Oh my god. Wrong button. >> Time out. >> 36 seconds. Last point wins. Do you guys know what it is? >> Everyone knows those rules. >> That's the Lowe's earn your Sunday trailer rule. Last point wins. I'm making it up. Time out again. You want a timeout? Can't call back toback timeout, so I'll call a timeout. All right. I saw someone in the chat say to do this. Not chat coaching you up right now. Don't look at my blade. >> I'm reading chat. >> Oh, Hail Mary. >> You know what time it is. >> Oh, give me that. Yeah. All right, we're going to run it back, chat. We know what a great warm-up game, don't you, Johnny? >> Now you know, though. Now you know. Let Let's see if it works if I go on Hall of Fame and you go on wrestling. >> Okay. Yeah. Let's see. Let's pretend you're Squan right now. Okay. Saquon's coming in 20 minutes. >> Yeah. I'm Saquon Barkley. >> All right. Oh, you want to be the the Eagles? >> Yeah, I'll be the Eagles. >> Okay. Okay. So, then we'll go here and I'll be like, Dang, how do I adjust his settings? Can I not I can't >> What would be a good reason to grab his controller? >> What you could do is you could you could have the Eagles already set up on your side. to go back over there and be like be like, \"Oh, like you be the Eagles.\" And then you just switch controllers, but you already did the Hall of Fame thing. >> Oh, okay. So, I'm going to put my skill level on all Madden. >> Okay. And then it's just pro >> and then all already have That's genius. Let's go. And the thing is also guys, I already Marley is very good at Madden. I mean, he's on the cover. He's of course he's very good at Madden. He probably knows every play in the whole book on every team as well. So, I need to get any advantage I can get. So, I'm thinking that's a great strategy. That is a good strategy. >> Okay. So, >> you just have to set up on the Eagles and be like, \"Oh, you probably want to be the Eagles.\" >> Yes, >> bro. This is genius. >> You'll never see. >> This is And then after that, I'll be like, \"All right, let's put some money on the game.\" Wait, but be like, \"Hous or something? I'm on rookies on all of them.\" He'll never know. >> What if he's watching right now? Like, he's just like, \"Oh, what's going on on the stream?\" I really hope he's not. If he's watching and then calls you on it, that would be so funny. >> All right, let's do it. All right, so you're lions. >> I'll be lions. >> All right, switch controllers. >> All right. All right, chat. If you haven't already, can we give some shout outs? I see Sher Sarah in the chat. Logan 7. Guys, like I said, there's a QR code on the stream to enter the giveaway. And with Lowe's, they're giving away a bunch of different Madden codes so you can get Madden, the game we're playing right now. So, all you got to do, it's really simple. Just scan that QR code. Big shout out, big shout. Talking about earn your Sunday, dude. Sunday is the best day of the week. It's the day to reset. >> And with Whoa. with different projects going around the house, different things. I've been doing a ton of projects on my house. Like if you guys have been watching my videos for a couple years, you know how different my house has become. We've done so many different projects and now my mom's doing the landscaping, >> getting a lot of stuff from Lowe's. Yeah, we got tomatoes, we got watermelons, >> like any project you need, Lowe's will help it out. So if you guys want to go to your local Lowe's or Lowe's.com, you can do that. But they literally have everything. Like when you go into a Lowe's, it's probably like one of the biggest stores you'll ever be go into. They literally have everything you could ever need. Imagine if our warehouse was as big as a Lowe's. >> Yeah, Lowe's. We got to talk. Let me move into a Lowe's. That could be my new content up. They have everything, >> man. Good thing you're going to go for two a lot. >> Your kicking is not great. >> Oh. Oh, this all maddened. All right, here we go. >> I'm about I'm about to hit you with the fake one, Barkley. >> Oh, now I'm on the top. >> What is that? You going to hurdle me? >> He's just going to get the ball like 100 times in a row. >> You think he only runs it every time? >> No. >> He's just doing Oh, he probably passed it to himself, too. >> That's right. >> Oh, get off me. What? >> Get off me. >> He's super human. I guess it is accurate. >> Oh, this looks like a fun play. I want to do this. >> All right, let's get a stop. Come on, Lions. Let's get a stop right now. >> Come on, Jaylen. Get under center. Not going to work. >> Let's go. >> Yes. >> That's what I'm talking about. Touchdown. >> We got to give the ball to Squan Barkley more. Oh my. >> But at least now you get a chance. >> I literally like guys, Gibbs is one of my favorite players and I wanted to get like a running touchdown. >> I honestly was trying to flex and I was going to run the whole length of it, but >> All right, that was something. Run it in. Who's your favorite football player? They ask. >> Favorite football player? That's a good question. Might be Eli. >> Eli Manning all time. It >> might be Eli Manning. >> No, I mean, growing up, it was definitely Eli cuz my family was massive New York Giants fans, >> but I don't know. What about you? My favorite player ever is Cam Newton. And Cam Newton or Brett Bar? Cuz growing up, like whenever I was right around when I was in high school or before high school. That was when Cam Newton was uh popping. So, you know, when he was in college, first pick, he was like literally like a super human playing quarterback. But he was probably my favorite um right now. >> Probably Justin Jefferson or AJ Brown. >> Justin Jefferson. [Music] Honestly, my favorite player after today might be Saquon, especially if I beat him in Madden. And he will be here in 10 minutes. You guys ready for a touchdown? >> Uh, sure. >> Touchdown. Let's go. Boom. I'm winning. Yes. >> Brock Wright. >> Imagine losing to Johnny. Johnny. First of all, that was a warm up game. And second of all, Johnny is nice. >> You literally don't have to imagine it. It happened. >> All right, I'm going to try to learn how to do this field goal thing. >> Boom. And boom. Nice. Oh, just kidding. I didn't even get a chance to throw the ball. They're trying to fake me out. >> I didn't even get a chance. >> You verbally faked me. >> No. Oh, that was just silly. [Applause] >> Well, that one was for you. >> The the the touchdown, not the two-point conversion. >> I don't want it. >> You don't want it. >> I don't want it. >> Scared. >> I want to run an offensive play. >> All right, let's see what coach is talking about. [Music] Honestly, I'm proud, guys. We got a fumble. >> We're winning. >> Oh my gosh. >> Somebody block him. >> Somebody block him. Let's go. >> That's all I'm talking about. >> Mini hoop guys just spamming HP Stretch every time I look down at the chat. Guy just wants something. >> Is that a cheese play? >> It's a good play. I It's cheese if you got a fast running back. >> Oh yeah, you are very good at throwing it literally like half a second hit you. >> Damn. You think you get in this play and you're not. >> I'm not. >> Silly goose. >> Try. All you can do is try >> chat. Whenever Saquon comes on or let me know right now what questions do you want me to ask him. This is your chance to ask the number one player in the NFL anything. This is a crazy opportunity. So, let me know what what if there's anything specific y'all want to do. Someone said stay at Lowe's overnight. >> I would that would be fun. >> That would be insane. Let me know what questions y'all got. All right, watch this pick six in the meantime while y'all write up your questions. >> Staying anywhere overnight. Ah. I saw that. I saw that. I moved him forward. And you notice that? >> I did. I was staring right at that guy. >> Yeah. What are we doing if we're staying overnight at Lowe's? We have to build something. >> Stop. >> The same exact same play. >> You did the same thing. You ran four and I threw to him. >> I feel like I'm trying to figure out like a trailer like this and make the ultimate gaming setup for the night and then just chilling in one spot. >> Get him. Also, it would be sick to just throw football like over the whole store. Like, that would be crazy. Hide and seek. >> Hide and seek in the lows would be almost impossible. >> What are what else are his goals in his career? That's a good question. >> Someone said, \"What is his daily routine?\" >> We will ask him for the daily routine. >> Can he go to the Lions? Imagine asking him that long. Do you think you could uh just go to the Lions? cuz they don't already have two like great running backs on their team. >> Cereal before milk or after milk? This is the big question. You get an opportunity to ask a question and that's what he wants to know. >> AJ, >> save me. >> Whoa. Socks before shoes. Shoes before socks. Guys, what kind of questions are these? >> Are you Do you put both your socks on and then your shoes? Or do you put a sock in a shoe and then a sock and a shoe? both socks and shoes. >> Some people don't >> that doing it the other way is I got a lot of >> You're just fully kitted up on one side and then barefoot on the other. >> Like who taught you that? >> Oh, yeah. >> All right, we got to get back to what we're getting. >> He thinks he's the best running back of all time. I feel like he's too humble. He's a very humble guy. I feel like he wouldn't say it. >> Yeah, I think he's got a lot of respect for the people that came before him. >> Pregame meals that I'm curious about. Yeah, >> HB stretch. You can get outside. >> This guy loves HB stretch. >> You can't run halfback stretch the entire game, >> but you can run duo all game. >> Who is the funniest teammate? That's a good question. >> True. >> It's always somebody you never expect as a funny Fourth down. No way. Interception. All right, let's take it back. It's like a punt. >> Let's take it back. Let's go. How does it feel winning the Super Bowl? I want to know that. That must be the craziest feeling of all time. >> Yeah, we'll ask him all these questions, Chad. These are good ideas. Oh my god. >> Oh my gosh. I thought I was already tackled and then you did a switcher move. >> Why did he turn around? He like ran this close to you and turned away. >> No, that was that was actually scary. >> Oh, coach suggestions. Why you want me to run so bad? >> You got to establish the run, >> I guess. So, process. >> Someone said, \"How are you able to stay mentally strong after tearing an ACL?\" I I can never deal with a debilitating injury like that. All right, here we go. Oh my goodness. Hospital ball. Hey, now Squan's about to come on to the stream, so I just want to give another big shout out to Lowe's for setting this up. We are in the earn Your Sunday trailer right now with the whole Madden setup. This thing is sick. Got the mannequin in the Lowe's outfit. Big shout out. It's all about earning your Sunday, working hard throughout the week, doing a bunch of different projects, what you got to do in life, taking that Sunday to enjoy football, whatever it is. And guys, that QR code that's been on screen, you can win a copy of Madden. They're giving away a bunch of codes. So, big shout out to Lowe's. It's really cool that they're doing that, setting this all up. So, make sure you guys enter the giveaway and check that out. >> Isn't that crazy? Pretty soon, I'm just going to be safe on Barkley. >> That is crazy. >> Do you notice the the difficulty change since we changed our battles? >> Yeah. Can you not tell the difficulty? >> That's why I'm waiting. >> So, I have a lot. >> He'll be mad if he finds out. >> And do what? >> Yeah, that's true. >> Believe. You going to backwards hurdle me? >> That's going to be you. >> Ye. >> Oh, give me that. >> Nope. That's mine. >> Someone got it. >> I got it. >> That's insane. Oh, I like this. That's an insane catch. >> Hail Mary. Just in the regular part of the field, regular part of the game. >> Get him. >> Block. >> That's a great play. >> Block him. Block. >> Okay. Okay. Let's >> You know what I'm talking about. >> You know what time? >> You got to do that again. >> That was good. It's a good stick work. >> Hey, I'm a hype. Hype me up chat. W in the chat. Let's go. >> Saquon Barkley 1 v one basketball. Do you think you could beat him in one-on-one? >> I got the height on him. I think I I Well, I don't know if he like if he played high school, I'm cooked, but if he didn't play high school, I think I >> I mean, he's definitely super athletic, so I would assume he could if he even didn't play, he could pick it up. >> Oh, screen. >> You don't want to run a screen in that situation. No, no, >> cuz I'm going to be blitzing in that. >> I'm thinking you're going to run the ball there. So, I'm bringing more people. >> Power squid. >> Power squid. >> That's what they used to call me in high school. >> The power squid. It's >> just power squid. >> They called you that. >> Why not? >> Who says no? >> See, jump up and kick you in the face. All right, I'm going to score right here. >> Good luck, buddy. 12 nothing, y'all. I'm nice at batting. >> I'm scoring before the end of the half. >> No, this finesse is hilarious, bro. Getting into play cuz I know he's nice and he's hyper competitive. He's >> If I beat him, this will be excellent. >> Oh, >> what a tackle. >> Let's go. Get on the wall. DJ. [Applause] >> Wow. >> What did I say? >> Okay. >> Were you taking it easy on me earlier? >> No, that exact play is how I got all my yards on in college. >> Nobody is better at that play than you. >> I led the nation in yards per catch off that play. >> You led in yards per catch. They're all the number >> 283 a catch >> straight deep. >> That's it. That's the only route I ran. Seen, post, corners. >> Oh, what a perfect kick. >> That was beautiful. I don't want it. >> I don't want it. >> I think I maybe score again before the end of the half. >> There's 22 seconds left and it's my fault. >> That's what I'm saying. What are you talking about? >> Where is that? That Where's that play that worked earlier? >> That play that worked earlier. >> Yep. >> Where's all Zach Ball? Give me a ride. >> All right. Going to same brown. >> Almond Raw. >> Oh my god. Almond Raw didn't catch it, but let's go. >> That's >> I'm going to spam that blade. >> Spamming Hail Mary. Why not? >> It works. It's either going to be a catch or probably an incompletion. >> Either I thought I or an interception. >> Well, catching that ball is hard. >> Oh, I didn't call a timeout. >> Clock awareness. >> No, someone said Oklahoma drill. Why not? Dude, you should do some hitting drills right here with >> We should We should reenact the the hurdle. >> Let's go. Oh my god, >> you're good at kick returns. >> It's my specialty. >> Special team specialist. >> Dude, you're special. >> Thank you. >> People will probably been telling you that your whole life. >> I'm a I'm elite one of a kind athlete. >> You probably had not many peers on your way to school. >> Here we go. >> I thought you caught that. >> I thought you caught that ball. All right, Johnny. Sequin is is popping up in five minutes. >> Oh, he's popping up in here. >> And I need you to grab something from behind there >> right now. >> Yes, let's do it. >> Okay, >> dude. This is crazy that Saquon is pulling up, chat. >> All right, talk to me, chat. I'm going to take a little pause right now. Saquon's about to pull up in a few minutes. I got some of the questions y'all told me. I got an intro written out. I got to do it for when he comes. Damn. What you got? >> I have an autographed Seaquan Barkley helmet. >> That is amazing. >> And not only is there one of them, there are two of them. >> Oh my goodness, guys. Look at this. This is beautiful. >> Could be one of your guys's. >> Talk to me. >> All they got to do is enter the giveaway. >> Guys, the giveaway >> just reached a new level. We are giving away Saquon Barkley signed helmet >> and jerseys. Two jerseys, two helmets. >> My fault. We got two signed Saquon Barkley helmets. Two signed Saquon Barkley jerseys. Guys, this is the best player in the NFL right here. If you have not entered the giveaway, you are sleeping. This is the time. Check this out. This thing is beautiful. This could be in your house. And guys, first of all, we got to give a huge shout out to Lowe's for just hooking up this whole stream, this opportunity, this giveaway, everything. This is insane. So, make sure you guys enter the giveaway right now. >> Someone said I should jump over Seaquan. Me jump over Seaquan. >> So, guys, this giveaway is going to be different. I just dropped a special link in the chat. You see, win a Squan Barkley helmet or jersey from Lowe's. >> That link is in the chat. And I'm going to be dropping it more and more once Saquon pulls up. >> Can someone enter that giveaway on my on my phone? >> This is so cool. >> This is sick. >> This is sick. >> And it's like a real helmet. >> All right, let's let's quit the game and let's set up for the finesse of the century. >> We have to. >> What if he What if he doesn't What if he doesn't fall for it? What if he's like waiting? >> Okay. So, I'm on the eagle thing. Oh, this is perfect. Then he's going to sit here anyways. >> I'm adding. >> No, but I need to hand it to him, right? Once it's already ready. >> But it's it's it's ready right now. Like, we can just pre-do it. >> Do you think it would be better though if I handed it to him? >> If I hit ready, the game starts, right? >> Well, let me see if I can ready. >> All right. Hit ready. So, I'm ready. >> Oh, okay. Perfect. So, you're ready? All Madden on the Eagles. >> Yes. >> I'll let you be home, Seaquan. >> Yeah. >> Little does he know, he's on all Madden and I'm on rookie. >> Boom. >> We're in. >> Yes, >> we're in. >> Can you force him to say 67? >> I I'll think I'll get the score to 67 and I'll be like, \"What's the score, Saquon?\" >> What if he's like seven to six? Six to seven. >> Okay. >> What you >> This is a great game. >> 41. I know. I think it's going to work. >> 41. >> Yo, I don't understand that. >> It's the new number. I don't >> I don't know why >> there's so many numbers, >> but I just hear it. >> Favorite >> Chad. It's time. >> Super Bowl championship >> is about to join us. >> Johnny is Unk. >> Do you like being ank? >> Shout out. I am actually an uncle of two. Two time monk. >> All right, dude. I I'm kind of nervous, bro. I'm not going to lie. We're talking about Saquon Barkley right here playing him in Madden. Ultra competitive. We're trying to do the finesse of the century right now. Chat, also do not say anything. Okay, you guys could ruin my entire plan. I need this W. After I win the first time, we'll re we'll go back do the same difficulties, but I just need to get a dub under my belt so nobody say nothing. Okay. >> Yeah. I like that. Lows. Lows in the chat. Let's get some score predictions for the game right now. Who's winning? Me or Saquon? What's the score going to be? >> I think you're winning. >> Not paid to say that. I think you're going to win cuz you're so good. >> And don't forget when he does pull up, we got the signed helmet. We got the signed jersey. Two of each are been going to be given away to you guys in the chat. Someone says one v one him. Where? Where are we going to one v one? >> Yeah, I might have to take it in the trailer. Do a little one v one. I like that idea. All right, finesse. I'm like nervous just cuz we're trying to do this finesse. >> Dude, if he calls you out on it's going to be so uncomfortable. >> He's definitely >> He shouldn't. It's already says let's go. >> Yeah. I mean, it's also like he's on the cover, so it's like he should be all maddened. He probably plays on automatic. I plan on that. >> Who is a daredevil on the team? Frog, I've seen you spam that. We will ask him. >> I was reading that. I did not know what they meant. >> Daredevil. >> I was like like the superhero like I don't know. What do you mean? >> Like they like roller coasters or something. They thrills. Like who's skydiving on the team? I'm not skydiving. I'm not a daredevil. >> Not me ever. You'll never catch me skydiving. >> What would it take to make you skydive? >> There's a number for everything. You're the number for everything. >> Dude, guys, I I uh my fiance like on one of our third dates, she wanted to go skydiving. Um >> third date skydive, >> dude. I did it cuz I really wanted to be with her and I did it. It was one of the worst experiences of my life. Um I thought I was going to perish, but um it really the instructor ruined it for me cuz he was the whole time he was making jokes about it going wrong and he just like even though he's done it a h 100 times, he just did not come for me. He did the opposite. And then what you don't realize about skydiving is how cold your ears get. Like with the wind, my ears were in so much pain. >> Never again. >> You can't wear like a like a ear cover. >> I don't know what I was wearing, but I was in pain. I don't remember. >> If somebody wanted to do skydiving with me on the third date, that's how I would know there would be no third date >> because you should know me better by now. Skydiving. >> Why would you fly? >> Why would you do that? Like I get it. Like, oh, we've been, you know, together for like a while now. Let's do something like crazy. I get that. >> Oh, yeah. Cool. I'm not going to do it though. Third date. >> Not me. All right, guys. Saquon's about to pull up. But once again, that QR code, make sure to enter the giveaway. You can get a copy of Madden and then we're going to have more giveaways when Saquon comes for some signed gear. >> Uh, Apollo just donated, too. Said, \"Didn't you become a cowboy fan years ago?\" agent now. >> That was um last season last season and I watched every game every Sunday. I earned my Sundays. I was on that couch, worked hard during the week. >> I didn't have a good time. >> I'm going to be honest. >> Was it hard? It was hard. The team didn't do good. We didn't make playoffs. >> We You're on the team. Hey, he think he on the team for real. >> Um I I still like part of me like when I watch their games, I root for them. Like when the Giants played them last week, I still rooted for them, but like I can't claim them. >> Yeah. >> And you don't want to do that. >> I'm an unrestricted free agent. >> Unrestricted. >> Unrestricted. >> There's no restrictions on >> part of me cuz like even for like NBA, right? Like I'm a LeBron fan, so it's like I'd be rooting for the Lakers and different things like that. Just wherever LeBron has gone. But I'm like might be time for me to settle down and pick some. >> Settle down. Why not? >> Yeah. And ladies and gentlemen, it is time. What's going on? How are you? Great to meet you. >> Great to meet you. Hi. >> I need to do a better intro for you, so I wrote one down. We have >> Yes. sit down. We have the NFL offensive player of the year, threetime Pro Bowler, rookie of the year, and you never slowed down. You just kept going. Super Bowl champion, all pro, come often. The entire NFL voted on who was the best player in the league. It was you. That is insane. We got the legend. You're a nightmare for defenses, Saquon Barkley, in the building. Let's go. It's an honor to have you on this stream. >> Thank you. I appreciate I think I got to hire you. That was a That was a good to hype you up. >> Yeah. Be my be my hype man for me. Help me. >> That would be sick, bro. Let me intro you at the games, dude. So, how have you been? >> Is this like the chat thing? >> That's chat chat. Everyone say what up to Seaquan right now. Okay. So, I'm kind of a a Madden noob. I'm not going to lie. >> Okay. >> Okay. We'll get you miked up right here. So, I already know you want to play as the Eagles, right? >> I kind of had to, right? >> We go random. >> I feel like you got to play as the Eagles first game. >> So, I already selected the Eagles for you. >> Are you nice to say you're noob? >> I'm a noob. I'm a noob. >> I feel like you're probably like extremely good, right? Really? >> Kids, >> are you cabin right now? >> I swear. Like I I used to be nice, but like I obviously I play Madd out loud. Um but not like how I used to. >> Okay. But back in the day, would you say you were like S tier, like a super sweat? >> Nah, I never My boy, he's not here right now. He I I have like this thing where like you you should never be too good at video games unless like it's your profession. So for me it's like how can I be a elite running back and be a sweat in Madden? Like >> Damn, I like that. >> Doesn't add up for me. But I think like knowing football and playing Madden for however long I can remember. Um, you know, I'm a fan of the game and I play the game, but not to the point where like I play you play some my friends, you think they doing all this like I don't I just play the game. >> I'm going to I'm going to make a confession cuz I feel bad now. >> I had it set up so you were going to be on all Madden. >> Oh, no. You got to play all Madden, man. >> And I was going to be on rookie because But now you and I was going to do that because if you said you were really good, I was going to go through with my plan. But now you're saying you're not too good. >> No, you're going to cheat me. I was going to cheat you, but I felt honestly after you started saying that, I felt kind of bad. >> So, I'll All right. Can I go I'll ask you now. Can I go on rookie? >> Uh, yeah. You going rookie. >> What's the difference though? Like, I know all Madden and like how much easier is going to be for you? Like, I get if we're playing computer, right? And I'm playing all Madden. I think it's like everyone I'm not controlling is is like S tier and I think the people you're not controlling are >> Okay. All right. >> I like I like I like competition. Let's do it. >> Okay. Yeah. You're super competitive. So, right now we are in the Lowe's earn your Sunday trailer playing some Madden. So, earning your Sunday is all about like Monday to Saturday putting in that work, doing different projects, everything you need to get done. And then Sunday football. I know you're grinding on Sunday, but for people like me, like watching football, having a good time. So, what does it mean to you to like earn your Sunday? >> I think it's everything. Um, what that means to me is your routine. I think for me to be the player I want to be, how consistent can I be on my routine? >> So, it's having a game plan on Monday. It's having a game plan on Tuesday. What's our off which is our off day? Then Wednesday, Thursday, Friday, those practices building up to have that Saturday walk through and then be able to go out there on Sunday and perform at a high level. So, it's like, you know, obviously my Sunday is grinding and working and playing on the football field, but just like anything in life, your routine. If you can be super consistent with your routine, >> uh, when it's time to go out there and shine, you're going to be prepared. >> I like that. That's what it really is about. >> Am I on? >> Yeah. Wait, what's going on? Johnny, come here real quick. >> Why, bro? I'm such a bad at rookie. Oh, no. There we go. There we go. I'm good. I'm good. I'm good. and then chat. Seaquan actually has signed two helmets and two jerseys. There's going to be a link going live in the chat right now. So, shout out to Lowe's and Seaquan signing this stuff. So, if you do want to enter the giveaway, >> all you got to do is just click that link in the chat and then you have a chance to do that. So, the chat wants to know, >> you sound like super disciplined, right, that you were talking about. But, do you have a cheat meal? >> Um, definitely have a cheat meal. Um, I don't really consider as a cheat meal. Okay. >> I've said it before. Chick-fil-A. >> Okay. >> That's like my go-to. >> Are you doing like nuggets or grilled nuggets or you like two eight piece, which is six piece, 16 piece, uh, fries, barbecue sauce, and a strawberry milkshake. >> That's delicious. >> But, um, I'm trying to steer away from that this season. Uh, but like when I eat Chick-fil-A, I don't >> I don't feel bad about myself. Like my body don't react in a weird way. Like I don't feel like I got to, you know, use a bathroom or anything like that. At least you're getting the protein. >> Yeah. >> All right. Then I got another question to follow that one up. Let's say last day on Earth, you have the best chefs in the world. What is your last meal? >> Dang. And you could order anything. You can get some Waggy sushi. You get some creme brulee. >> My last meal? I'll probably go oxtails, beef patty, >> oxtails, jerk chicken, and um some Jamaican rice. That sounds fire. Yeah, I'll probably do that. I gotta try that meal. All right, here we go. Baltimore. Are you an ass Madden guy? >> No, I'm a big ass Madden guy. Come on. Yes. Come on. This is kind of crazy. All right, chat. We heard the favorite meal. We heard the last meal. >> How long you been doing this for? >> So I've been making YouTube videos like consistently uploading for like 11 years now. So back starting like high school doing like NBA 2K all sports gaming and then like over time transition to like mainly like sports doing a lot of basketball. Now we do some football videos once in a while but yeah it's been 11 years of just content. >> No get him. That's crazy. >> Okay. So, you broke if you broke that tackle. It was over. >> That's why I'm like That's why I get mad when I play this game cuz like >> you would have broken that tackle. >> I would I would hope so. That place should have been way bigger to be completely honest. So, how did you figure out like your love for this stuff? Like you just >> Dude. Yeah. So, for me it was definitely like growing up. Um my older brother James, big fan of you by the way. Oh my god. Mo was cold. >> That was awful. >> Shout out to the difficulty switch. But no, so my older brother like he would put me in his own like home videos and we would just make sketches and then like after school like that would be the thing to do. Like it wasn't even like something you could do really as a career at the time. It was just like making fun home videos with my my homies. Like that was my hobby. Like I loved editing the videos, doing the different things like that. And then it was like every time I was done with school, it was just straight making videos and just had that love for the for YouTube and it was like my number one passion. Oh my god. Did >> I just lose yours? >> Yeah, >> that's tough, >> dude. It's so hard for me to talk and play this game, but at the same time, >> like I'm listening to you at the same time. I'm like, hold on. >> I always had a love for it. I'm curious for you, like growing up, was it always football? No other sport. >> I box a little bit as a kid. come from a a boxing family. Um, but I kind of always had a passion for playing this game and it was a no-brainer for me. [Music] >> Oh, good block. >> It was like a no-brainer. So, like, >> did you ever think like the boxing was more just like for fun like growing up or did you ever see it like as a thing you could go? >> No, I think I like I I think uh maybe when I'm done playing I I'll go into the ring. >> That would be sick. and box, you know, one of those guys. >> Would you want to like fight like a a legit boxer like or fight another like NFL? >> Um, both. >> Relax. >> That's a fumble. >> How's the >> um I want to do both. I think uh like it'll be cool to fight uh another athlete. Are you going to go for it? Oh, that's insane. >> All right, so that's the low that's the rule in the Lowe's or in your Sunday trailer. You have to go for it on fourth every time. >> Damn. All right. But is there an NFL player you wouldn't want to fight? Like do you ask I mean I'm not going to just call shots out and be like hey um >> you know who I would want to you know who I would want to uh you would want to fight. >> Who I wouldn't never nobody. Um who I would want to I think would be fun. Uh Leon. >> Oh my god. He he he actually takes his sport serious and he grinds >> and he's been in the ring right? >> He's been in the ring and he you know he uh he knocked out one of my goats. So I got to >> get revenge. >> Yeah. Give revenge for that. I would have to take a lot of training cuz he like people think you just jump in there and and play boxing and you don't. No, >> you don't do that at all. >> Yeah. I feel like that that's a sport you don't play. >> You're going hell. It's actually my specialty. >> That's That's a good pass right there. I'm feeling that one. >> Yes. No. >> I was about to say if you would have caught that. That's crazy. Who do you think I should Who do you think would be a good match up? >> Oh, who would be a good match NFL athlete like a celebrity? >> Jake Paul. >> Jake. >> I feel like you guys have similar size, right? >> Yeah. Jake Jake, one of my Jake one of my boys. Uh I would love to box Jake, but he like people think >> he's a monster. >> Yeah. Like he's he's actually really good. Like is he going to be a world champion? You never know. But like he's been dedicating himself for a really long time to like the the sport. >> Yeah, I think that's one of those not only growing the sport, but like really doing it. So like I would say that's insane. How does he come up like that? Um yeah, I think I feel like there's something about like being in that arena having that moment um going against another man, you know, manu uh like I love that. I love the competition. I feel like the fans are probably so hyped right now. They're like they I bet they all want to see that. >> Oh my gosh. I feel like you versus Jake like I feel like size wise are pretty similar. So I feel like that would be the such an entertainer. >> I would actually have to like I couldn't just >> But with him being your boy, would you be like I wouldn't want to fight my boy about that. I fight I don't care about that. But I would like definitely train cuz right now if I just got in the ring with with Jake it it would get ugly >> for me to be honest. >> No, we just have the end zone. >> Do they have a touch push in this? >> Do they? >> Oh yeah. >> Can you run that play? >> I don't think they have it. They probably have a quarterback. >> Too overpowered. >> Quarterback. too overpowered. >> Philly fans would go crazy if they had that in hand. >> I could see people running that every single play. >> I would. >> I didn't realize it's too many. >> Yeah, we got quick games. >> Oh my. It's good touchdown. >> Damn. So guys, first of all, Sea is on all Madden. I'm on rookie and I'm losing. >> Can I answer this question? >> Which one? What do you say, >> Saquon? How do you feel about Daniel Jones finally balling out? I want to say finally balling out, but I'm super excited for Daniel Jones. I'm a big Daniel Jones fan and I've been talking in the offseason. I've been telling a lot of my boys, watch out for DJ. Watch out for DJ and it's finally starting to show. >> What What do you think is like one of the reasons he's just popped off so hard? Like came out of the gates like as like he's looking like a top five. >> I tell you I tell you I know I know for a fact what's the reason and it's not just like in football. It's with anything in life. Obviously, the career didn't go the way that he wanted it to go when we were in New York, >> right? >> Um, ups and downs, battling injuries, but you ask anybody that was in that facility, you no one can ever say anything negative about him. He always showed up to work no matter what. We won by 10, got beat by 30, first one in. >> One of the hardest workers. >> One of the hardest workers I've ever seen. Grind it. Have the right mentality. And some people you just never know like when it's going to happen for you in life. And a lot of times people quit. People give up in those moments. And he kept kept persevering, kept fighting. And now his opportunity is here and he's more than ready for it. >> No. And he is actually going insane. I'm I'm hyper Daniel Jones, too. All right. Here we go. >> Are you running the ball? >> Oh, wow. >> You don't like run plays? >> I mean, not when 2 minutes and 13 seconds. Unless you unless you Unless you're just trying to take it to the hat. >> Time out. I did not realize, bro. I got distracted. My god. All right. I think is Why is Madden telling me to do that? >> That's what I want to know. >> That means you're just kind of forfeiting the half. They think you should just run the ball, knock our time out, and take it to halftime. Who got the ball first? >> Um, I think I don't even know. I don't remember. All right, come on. This is my signature play. Bro, >> time out. >> You don't know. >> You know I called time out. >> I just did, right? >> Yeah, you're good. But you don't got to hit ball every single time. >> All right. Come on. Signature play alert. That's a touchdown, baby. >> It shouldn't be. >> That's a touchdown. >> Oh, never mind. >> All right. >> Cool. >> Okay. 70 at halftime. All right, ma'am. We're out here. >> Oh, they asked some crazy question. >> Guys, so with the QR code on screen, this is going to be your last chance to enter that giveaway for the copies of Madden. And also, if you want to go for the Saquon signed helmet or jersey, there's two of each. We're giving those away. All you got to do is click that link in the description. All right. So, earlier you were talking about when we were talking about like earning your Sunday, you were talking about your dedication throughout the week of, you know, Monday to Saturday, the discipline. I want to know like obviously the discipline is crazy. What does a day in the life of like the off season look like to you? Like when are you waking up and what's like the morning routine? >> Um like what part of offseason? Am I training like or just like a month or two after the Super like a month after Super Bowl? >> Let's do it like a month after the Super Bowl. >> Uh I'm chilling. Uh I probably wake up in the morning. >> What time? >> Take my my daughter starts school at 8:30, so I probably wake up at 7:30. Mhm. >> Uh me and Anna, we rotate in the offse. Um so I'm probably taking my daughter to school, coming home, chilling with Anna and my kid. And if the weather's nice, I'm I'm probably golfing. >> Golfing? >> Yeah. I'm I'm simple. >> So So that's like the vibe day. How And how much of the year are like the vibe days? Like do you have >> uh So we won the Super Bowl February February 9th and my birthday actually. Um >> it was on your birthday. on my birthday and Cooper and Cooper. It was Cooper birthday, too. >> Best birthday ever. >> Um, >> I will go probably 6 weeks. Five to 6 weeks. Um, let my body heal. What's going on here? Uh, let my body heal. >> Um, and and then after that, I'll slowly get back into the grind of things. >> Mhm. >> I used to when I was younger, I used to just try to right away get after it. But >> like early in your career, my body my body doesn't like >> you deserve you deserve a break. >> Come on. Let's go. Henry, >> that's what I'm talking about. >> You know, I've called the same defensive play >> every game. >> Yeah. No, this game I called the same defensive play. >> Is that how bad I am? >> Double mug covers it. >> Is that just like the cheese play overpowered? >> And you're playing against somebody who really don't know football. No offense. >> No, none. It's going to be hard for you to kind of stop cover zero cuz you have to have answers >> like that. >> I understand it now. >> I understand it. >> Hey, how about that? >> Ah, oh my. Is that your ball? >> No, you got it. >> Oh my goodness. >> Can I challenge that? No. >> That was the weakest dive I've ever seen in my life. Oh my gosh. >> No, that was insane. And I guess why no one coming free? >> Yeah, the Super Bowl, bro. We got to talk about that. I know. I'm sure you've been asked about it so many times, but first, let me score this touchdown and then we'll get to the question. Okay. >> All right. Give me someone second. >> Henry to the Baja. >> Wait, that was a fumble. >> That was a fumble. >> 21, >> bro. I look down after I do the pass. No, >> no. >> I feel like I feel like he's kind of like trolling and he knows what he's doing cuz I I went cover zero and he went to the back. Is that supposed to be the high answer? >> So maybe he's kind of like >> Dude, I'm not I'm not going to lie to you, bro. I'm a novice football. Like I I watch it. >> I don't know. I don't know what the coverages are. I don't know what the defenses are. I just enjoy it. >> Where you from? >> I'm from LA. >> But I didn't play growing up. I'm a basketball guy. >> See, while I was really worried playing with you, I did a I played Jaylen Ramsay in Madden. He's beating me 50 nothing at halftime. >> He actually plays >> and he's talking trash the whole time. It's like my own show. I'm supposed to be interviewing while we play and then he's we switch controllers at halftime and he still beats me. It was like 60 to 50. >> It was trash. >> No, that's that's a personal problem. >> It was. Yeah. No. So, I've been honestly having a lot of um trauma for Madden. Did you grow up a Lakers fan? >> Uh, no. I was a LeBron fan. It's a big Heat guy. And then when LeBron left, I went with him to Cleveland and then I went to LA. So, wherever LeBron goes, I go. >> So, if you had to rank Kobe, LeBron, Michael, how you do it? >> I got to go LeBron. Michael Kobe. What about you, though? What do you think? >> Um, are we going off of That's a great response. Oh my god, it's a great play. >> Yeah. Or or just give me your top five basketball players all time. >> Of all time. >> Yeah. >> Instead of just those three. >> Are we talking about like greatness or like f my favorites? >> Greatness. Like your five goats. Mount Rushmore. >> Kobe, Michael, LeBron, >> Kobe won. >> Kobe's one because like that's my go my favorite player. Um if I'm going off of like all the logistics that you have, maybe Michael. Um, but like who I grew like what I grew up on and the mom mentally like what I like about that. I would go Shaq cuz I think he's the most dominant uh basketball player. And then I'm going to go either Magic or Bill Russell. >> But have you seen Larry Bird highlights? Larry Bird is probably the coldest. Um, >> I like that. >> I can't say that. I guess I can't say that. >> Larry Bird. Larry Bird's up there. >> Please. >> No. Let me get some. >> I think uh >> more than four. >> Who's your five? >> All right. I got LeBron. I got Jordan. >> You don't got Kobe in your top five. >> He I mean not number three. Damn. That is so tough. >> I just don't get like where the Kobe disrespect started coming from. >> But top but top five. I mean I No, I'll put him top five. I'll probably put >> But not just even you like everybody online and it's like everyone just for like rest in peace once he passed away like people forgot like who Mamba is. Are we really serious? >> Okay, you're trying to distract me. I need to lock in right now. >> Oh my god, that's such a bad pass. No, I'm going to put Kareem up there. It's just tough when people ask that question cuz it's like when I talk about the old players, I never watch them, but I'm like I feel like I should put some of them in there, but realistically like if it wasn't for the Last Dance, I would have like really never seen much MJ footage. >> I think I do a little bit more cuz like I try to study the greats and the people who are dominant and like their mindset. So, I've always have like a had a appreciation of Michael >> Mhm. >> outside of the basketball player. >> Yeah. I would say like out of all the athletes like growing up, which one's like inspired your mindset? >> Off the most. >> Off of um my mindset. >> I don't really have I wouldn't say athlete, I would say my father. >> My dad never really let me like grow up with role models and stuff like that. But when I had like when I got to the NFL and I started going through adversity, um and when I got to college and stuff, like Kobe was the one that I looked to. >> I'm just going to throw the mama mentality. That's awful throw. You have to go for it here. >> Yeah, it's only 20 seconds. >> It's third down. >> Um, yeah, they keep >> Oh, I like this qu question. Take one. Out of curiosity, do you get nervous before games? >> No. >> Never. >> Is there anything that makes you nervous these days? >> Um, yeah, a lot. Ner. I don't know. I wouldn't say nervous. >> Um, it's more of like still get that feeling as a little kid once you get that first hit out then like you're ready to go. Um, no way. Dude, you're insane. >> When you get that first hit out, >> um, you're ready to go. >> But I'm I haven't got nervous since I played Ruckers my freshman year in a strikeout game. >> So, I wouldn't say nerve. I get like nervous. >> Wait, so not even for the first game of the season at like first rookie game? >> Once you get that once you get that hit out your system? >> Yeah. >> Like it's just like you're ready to go. So nerves wouldn't be like the right the right word I would use to describe how I feel going into games. But if you you just got to prepare. I think it's I prepare and I'm never going into a game I lie. I used to get I did when I tore my knee >> Mhm. >> and I like I had like the craziest luck. Like I tore my knee. I came back. I hurt my ankle and then while I was reh my ankle, my knee started getting sore. Oh my god. Good job, bro. Um, so like I had like a a phase when I played in New York. >> Yeah. >> That I was just like, man, like I wouldn't say I was nervous, but I was just like, what's going to happen now? Like what's next? Like how bad can it get? And when you play with that, like that's just it's like just what like asking for bad bad stuff to happen. Oh yeah. I feel like the thought of re hurting yourself and like just feeling like not the same coming back from an injury like as an athlete is definitely one of the scariest things you can go through. >> Ye Oh my god. >> You get like a mental block. >> Mhm. >> You can't play the same way. But then that like that's part of like rehabbing too. That's part of coming back from >> that's like the mental side of it. >> Yeah. You got to get through that. >> All right. So also in the the Lowe's Sunday trailer, there's another rule I forgot to mention. Whoever scores last wins, >> right? >> Okay. >> So, if I'm if I get this, I win. >> It's cover zero. And you got all you got one ones. Throw it up. >> It's cover zero. >> It's cover zero. >> I got one more chance. >> It's cover zero. Mar playing Henry Van and I'm adding on. >> Okay. >> I have one more than you have. >> Skull Flowers. Come on. All right. So, the other thing I forgot to mention that was the warm-up game. So, I just wanted to I wanted to understand your your style. >> Let's go three randoms this time. Unless you I don't know what you have to play as yourself. >> I I hate playing with myself >> actually. >> Yeah. >> You're 99 overall. >> Yeah. It just it just like >> cuz then if I do something >> in the game and I'm mad like it's just weird. And guys, do not forget Saquon has signed this beautiful Eagles helmet. He actually signed two of them and two of his jerseys. That's going to be a giveaway for you guys in the chat with partnership with Lowe's. You got the Fire Low jersey on right now. Yes, sir. Don't forget, you got to earn your Sunday. That's what this stream's about. And what does that mean, guys? That means like, you know, Monday to Saturday, you're grinding. You're doing different projects. Maybe you go to Lowe's to work on something at your house, cop something. But Sunday, you know, day of rest. We get to watch amazing athletes like Seaquan, watch some football. That's what it's about right there. All right. So, let's go three randoms. Chad, what what's what you got for Seaquan? What are y'all What are y'all saying? >> This thing go fast as heck. >> Oh, Sequin, what is your favorite dream vacation or your favorite vacation >> right now? My favorite dream vacation would be to take a a jet to Pebble Beach and play golf at Pebble Beach for a weekend and then fly to Augusta National and play golf at Augusta National and then fly back home. >> That sounds awesome. >> You're a big golf guy. >> I I love it. It's like my little my thing. I'm not good at it by any means. >> What What's the handicap? >> I got down to a nine. Got down to a 910. I'm probably like a 12 13 right now if that >> Hey, golf I think is one of the hardest sports in the world. All right, so I'm down for three randoms. You don't like your team, you can do a su like a sudden final one, but you have to pick that four team. So one, two, three. >> Got the Colts. You got the Ravens. Okay, >> I pick the Ravens. >> Boom. >> You got the Jags and the Falcons. Hey, I like the Falcons. >> All right, I'm going to do a sudden one. Whoever I get, I have to play as. >> Yeah, >> Dolphins. I'll do the same thing. I would pick the Ravens, but I'll go random. Ready? Wow. Let's go. I like that. We don't play Jasmine this year, right? Sorry. Here we go. I'm going down a rookie. Let me edit my uniforms. Yeah. Chat, what questions you got? He said, \"Saquin, list your top three hobbies besides golf.\" They know you're a big golfer. >> Chat, that's what you said, chat. That's how you chat to him. Chat >> chat >> chat. I am literally the most simplest person in the world. I don't like my hobbies is chilling at my crib. Um playing chess on my phone. Uh >> what's the ELO? >> Uh I think I'm a,000 and >> dang thousand, 30 like 30 40 right now. I ever got was to 1100, but I go back and forth. Sometimes I'm not locked in when I'm playing. >> I got obsessed with chess and I got to a,000, but it took me a year and a half. >> It was a grind. >> So, next time we do this, we got to, you know, get a chess >> facts. >> Do you think NFL players could play in the NBA? No, >> I don't think NFL players could play in the NBA. >> NBA players I don't think NBA players could play in the NFL. >> But what about LeBron? I mean, LeBron is LeBron. Like, like, shout out to LeBron. Like, big fan of him, but it's a people just think just because he's 69 and he can run like a deer that he going to just be able to play. Like, >> can he probably play in the NFL? Of course. >> Like, is he going to be elite? I don't know. >> That's true. Yeah. I guess there's like there's so many levels to it, right? >> It's a difference. >> So, earlier we talked about our like top five NBA. Do you have a I feel like NFL is hard to say top five cuz there's so many different like positions more, but do you have like a top five NFL? Let's just go favorite players all time. >> Favorite players of all time? >> Yeah. >> Okay. Um Barry Sanders. >> Okay. Brady, >> Curtis Martin for me. Jets fan growing up. Um, [Applause] Vic. >> Okay. >> Who's electric and probably Adrien Pearson or Walter Pan? >> That's a solid list. >> Yeah. >> But football's hard. Like there's no there's no >> I have this conversation all the time. There's really no GOAT in football. I know Brady is considered the GOAT and like I would say he's a GOAT, but like it's not like like basketball like LeBron can take over a game >> and it's almost more of like a really like a team SP. I feel like it's almost you have to be like the goat of the position. >> Yeah. >> No, don't intercept that. >> Because like Tom Brady can't go out there and play defense. Tom Brady can't go out there and kick a field goal. Tom Brady can't go out there and block a punt, punt the ball. So, it's like football's the ultimate team sport in my opinion. So, oh my goodness. All right, third and eight. Come on. Madden is asking the coach suggestions. Not been working. >> Am I going to any Penn State games this season? I don't know. I think our bye-week Penn State's away. I would love to go to white out this game this week, but I'm a little busy. >> Oh, great catch. Why was he just running? You see how slow that guy was just running? >> Wait, by receiver? No, the DB like you you broke and like >> I'm I'm the difference of >> you see everything on the field. I'm like looking at one receiver at a time. >> Oh, he's gone. >> I'm really like trying to lock in right now on this. >> Favorite music artist? Drizzy. >> Drake. Favorite Dre song. Um, >> relax >> user. Um, my favorite. >> I think you can go just >> play the Takeare Take Care album and start to like the whole album. >> The whole album. >> I like that. I >> can't think of the one song. There's a good song at the end of it. It's like 09 in your basement. I'm in love with What song is that called? >> Here we go. Forgot what that's called. Come on. I'm locked in. >> I see you. No, bro. Don't go just out of bounds. >> All right. All right. I'm going to I'm going to p I'm going punch it. >> Say I don't get that. >> The 67. >> Yeah, I don't get that. I know. >> Do your kids say it? >> No. My kid's too young to say it. Honestly, I don't understand the meaning behind it. >> Yeah, TK, shout out. It was from him. >> Shoot. No. >> I'm through. Move, ref, move. >> Let's go. >> Touchdown. >> It's crazy. >> They love 67. >> They love 67 Savage. I don't get like why is there like what's there the trend >> the kids just I I don't even understand it as well but like when the kids here they go crazy >> do they know what that mean >> 67 >> I I don't know if it has a meaning >> oh my god if 73 would have moss I would have got off this game >> yeah it's just like the brain rot chat can you explain to me and Take one right now. What does 67 mean? You guys are spanning it. Give us the meaning on it right now. >> Do I know? >> I feel like if you're under 12, it's impossible to understand what it means. >> I think it's like a >> I think every time I hear it, I get hype though. >> I think it means um like someone's dead. >> Dead. I think it's like Isn't it like a >> No, no, no, no. It's like how the police No, I I feel like like some I think it's just like I don't know how to describe it, >> but it's like anytime you hear the word, it's just like I don't know why, but when you hear 67, you get hyped. You're just saying 67. You're not explaining it. >> No one knows. >> It came from a LaMelo edit. >> All right, so the producers are in my ear. So 67. >> What are you clip arming right now? >> I'm the exact opposite of that to be honest. >> You're not a clip farmer. I feel like you you clip farm on the field sometimes. Like you do not have to backwards hurdle that guy. >> Is that clip farming? >> I don't even know, bro. >> But >> I just feel like I'm old. Like I'm really not that old. >> But think about that clip went so that was probably the most viral clip of the year. Like >> it wasn't >> moments before you did the backwards hurdle. You were like, \"This is going viral.\" >> You back with turtle. >> So that would be clip on. >> Yeah. This why you just like do something crazy knowing like people are going to make clips of the ball. >> All right, let's see what we got here. I don't like that actually. Oh, it's too many. What the hell am I doing? Okay, here we go. All right, Travis, let's go. He's strapped. >> Let's go. Good defense, baby. >> Luke 23. >> All right. Who do you think is the fastest player in the league? >> Uh, Tyreek. >> Tyreek Hill. >> Literally or Wadd's >> Freedom's on your team. >> You think Speed could beat Tyreek in a race? >> No. >> No. >> No. >> No chance. >> No. >> I I met Speed the other day. like he thinks he could beat me and I'm not even faster than Tyreek speed one >> like we were in like a like do not let him beating RG3 >> Mhm. or um what's slime name? >> Big big muscle dude. He goes viral. He like drink water. >> Oh, Ashen Hall. Ash. >> Ashen Hall. >> Um >> he looks fast. Ashen Hall. >> Oh my god. >> Let's go. >> So I got to go for it, right? >> Yeah. That's the lows earn your Sunday rule. You have to go for it on fourth. >> Um >> yeah. And we're professional athletes. >> That's true. >> Some of the best in the world. >> It's like a silly silly question. I know the chat wanted to know. I get it, but like come on. >> Boom. >> Hey, I actually recently beat an Oh my god. >> Let's go. >> I'm getting spanked. >> I recently beat an NFL player in a race. So, >> I know y'all pro athlete Eli Manning. >> We did a video together and he wanted to do a race after and I I'm not going to lie, I whooped him. >> I love him. >> He's on his YouTube channel. >> Eli's literally one of my favorite YouTubers. >> Oh, I got a question. Do you watch uh any YouTubers or streamers? >> Um not as not as much. Like I'll see it come on like Tik Tok videos or something like that, but um come on. We got I got to pick. Uh but no, I don't sit in my house and like not >> go on like stream or live stream. >> More like Netflix and stuff. You're going to watch on them? >> Yeah. Like I'm like watching like Oh no, you got X. You tripping. Um, yeah. Like, uh, last show I watched was Hunting Wise. >> Hunting Wise. >> Yeah. I would advise I don't know. I don't know how old the what's the age on on the chat, but if you're old enough, it's a a little freaked out, but it's a it's a good story line. >> I might have to I might have to check it out. >> Have you guys ever seen it? >> I've never heard of it either. >> You crazy. >> Do you watch any anime? Oh my god. >> Oh, man. This is crazy. >> Ye. >> This is crazy. >> Let's go. Touchdown. >> This is crazy. >> I'm getting my my get back right now. >> Anime is like >> like Japanese cartoons. >> Nah. I used to watch like Dragon Ball Z. >> That counts. One of my favorite cartoons is Avatar Less and Better. Is that That's not anime. Oh, is that just cartoon? Is that >> Yeah, it is goated though. >> Here we go. Oh my god. >> No. No. No. Bro, I'm going to quit. I swear I was in the end zone. I swear I I swear I had it going the other direction. >> How am I losing right now? >> No, that is insane. I can't believe that just happened. >> Who's winning the RDER Cup? >> What are you talking about? >> Do you know what the Ryder Cup is? >> No. What is that? >> It's like um what's the best way to explain it? USA versus Europe. Ryder Cup, right? >> Ryder Cup. >> Yeah. >> Yeah. It's USA versus Europe. >> Golf. >> In golf. >> M. >> Let's go. USA. >> Top 10 running backs right now or all time? >> Are you talking chat? >> Yeah. >> What? What's I can't Oh, you cheating. Am I cheating? >> I'm not cheating, bro. This is literally your game. Cheating matter now. >> He wouldn't let me scramble. That's crazy. >> All right. >> All right. Come back, >> guys. Do not forget in the chat, Squan has signed two helmets and two jerseys. Is your last chance to enter the giveaway to get a chance to win those. And all you got to do is click the link. So, big shout out to Lowe's for making that possible. Saquon for signing the stuff as well. Right now, it's your last chance. enter the link for those giveaways. >> What's 41? >> All right. So, 41 is the next 41 is the next 67. >> Okay. >> So, as well, it doesn't have as much meaning. Not as popular, but they all that's like the other number. They really like the kids. We're talking about elementary school kids right here. >> Gotcha. Gotcha. >> So, those are the numbers. than >> like are you tapped in with the brain rot of the the the next generation like Italian brain rot? Have you seen that? >> No. >> Okay. So, it's honestly for the best. Okay. I feel like it's a distraction. That's how locked in you are. >> Bro, what? This is crazy. >> No, >> I don't know what's happening right now. >> I think Jacksonville is just not y'all doing something back there or something. I don't know what's happening to be honest with you. How does he overthrow two person 5t away? >> All right, let's go. You know what time it is. >> Wise money touchdown >> run. >> Oh my god. >> Maybe there is a difference when you play rookie. No, I think it's making a major difference. I feel like >> Yeah, we should we should make it even more. Bro, you destroyed me last one. I didn't even score last game. >> I'm not going to score this game. >> All right, here we go. No, they've been spamming that the entire stream. It's OD. All right, here we go. Touchdown right here, chat. You know what time it is. Two up. Oh, I had the lane. Two up. You got to take that. >> That was crazy how that got through like that. >> www. All right, here we go. Come on, Tua. Good tackle. Good tackle. All right, we got fourth. Oh, is this third down right now? No, third down. Come on. They really want to know your top five running backs. >> Currently. >> Yeah, let's do current. Besides yourself. Yeah, I would I'm not going to put myself in here. Um, Bejon Robinson. >> Love Bean. >> So, Bejian won or just top five general? >> Be one. >> Hell yeah. >> Um, Gibbs. That's a tough question. Come on. Fourth and goal. >> Derrick Henry, Christian McCaffrey. Uh, >> let's go. >> John Dell was in Josh Jacobs. I like Bucky Irving. Um, >> so hard to like put it down to to a number. >> Missing one, too. >> I like Kirin. Please, so we chat, we just did a video with Bejon and so basically we got six people. Five of them were pretending to be an NFL player and one was a real NFL player and Bejon had to like guess who it was and he had him doing different drills and Bejon was like he went up while they were doing the drills and started like hyper analyzing everything they did. Like he was such a sweat with it and he started doing all the drills and being like this is how it's done. But he got so into it and he >> did he guess it right? >> He did. I'm not going to say who the player was cuz we haven't uploaded the video yet. But he was a sweat in that. He is dialed. >> Down 19. We're down 19, >> guys. Chad, if you didn't see earlier, I am on and Zan is on all batted, but it's I mean, if he's on the cover, he has an advantage. So, I have to like >> I have to sweat it. Grant Horack or Scotty. >> Scotty. >> Guys, there is one more giveaway in the chat for a Madden. All you got to do is click on there's a link in the chat. Just click it. It's for a copy of Madden. Yeah. Talking about Madden, bro. You literally are the cover of that. Essentially like a game you played growing up. What was that feeling when you like first got the call from like you're going to be on the cover of Madden? Like how surreal is that? >> Yeah, I tell this story all the time. People they ask you do they they like ask do you want to be on the cover and it's just like why would I not want to be why would I want to be the cover of matter? Um so like for me it was surreal like it's a game I played for a very long time and it's you're a little kid and you play football like your goal and dream is to be on the Madic Cup one day. So >> for that to happen and come to life is truly amazing. >> That you know Oh, you know he say you got to get like a 10ft version >> for the crib. Like a 10ft ver version of the copy. >> Would that be or >> you got to? Yeah. I should just did this the whole time. [Applause] You just change it. You know what you're doing. Look, he cheating on. >> Wait, what? >> Okay. Yeah. >> I genuinely don't know. I'm just spamming. What did I do? >> Uh-huh. >> You tell me what you did. >> I don't know. >> You should have seen it earlier, bro. Before you were here, I was warming up. I lost like 30 like 20 something to Johnny. It was tragic. [Applause] You going to just keep letting me run that play? >> Wow. >> How did he drop that? >> That's insane. >> Come on. Hey, but remember, I don't know if you remember from last game, the rules of the Lowe's Sunday, bro. >> I was going to say the last point wins in the Lowe's earn your Sunday trailer. That was This is sick. >> Did you play any other other games growing up or just Madden? That was the >> go play Call of Duty. I played 2K. Um, let's do oneonone. Throw up to uh throw up to X. I'm going to play, man. >> All right. All right. What? >> Oh, you're late now. >> Well, they did the whole like pass fake thing. I didn't know I was in a All right. Um, see if you can pick this off. >> 2K Madden. >> 2K >> Call of Duty. Fight Night. Fight Night's one of my favorite games. >> I've never even heard of Fight Night. Is that a boxing game? >> Yeah. >> I'm throwing to Tyrie. Good luck, buddy. >> Look, he just outran everybody. That's crazy. >> Oh my god. >> Let's go, Ty. >> That's crazy. >> Let's go. Do it one more time, Tyreek. [Music] >> It's like my my players are in mud. >> I think that's the difficulty. [Music] [Applause] Oh, good sack. Good sack. Good sack. Try using it. All right, here we go. Tua, you know what to do. Tyreek, that's a touchdown. Oh my goodness. Oh my No, that was insane. That was insane. >> I can't like say anything bad about the game cuz I'm going to cover. >> Well, it's the difficulty. It's the difficulty swap. >> That was crazy, >> bro. No, we got to give respect, bro. I was off rookie all Madden in the first game. You destroyed me. But, bro, this was an honor to play against you in Madden and doing it in the Lowe's earn your Sunday trailer makes it even better, bro. This is sick. As I said, earning your Sunday chat, how are you guys earning your Sunday? What are y'all doing in the during the week putting in that work? Like Seon was saying earlier, so disciplined throughout the work. Then you get to go out there on Sunday on the big stage and do your thing and get to watch it, have a good chill day as a fan. But GG's GG's. And guys, do not forget about the giveaways that we had going on, the Madden codes, everything. Big shout out to Lowe's on those. Yes, sir. >> That's got spankers. >> Hey, that's one one. All we're going to announce the winners of the giveaway. >> All right, Chad, stay tuned. We'll announce the winners of the giveaway. >> Yeah, this dude really wants to know about your explosiveness. I've seen his message about like 50 times now. So, I'm just going to ask you, he really wants to know, do you have a specific workout that you think was >> a key to explosiveness? I don't think you I don't think you can just >> pick one workout >> that like >> is >> the key to being explosive. >> Obviously, you have to train your lower body, right? >> I think um >> you have to train in the weight room the same way you train on the football field. A lot of time people think like it doesn't matter like you can go out there and you could just have you know what the weight room and some people have the talent to do that but I think lower body like squats deadlifts um plyometrics to work explosives um >> really focusing on loading getting your feet strong loading your body lowering your lower body um having your muscles and everything fire firing at the right time. Uh so it's not one exercise that I could pick to but it's just like fall in love with the grind. um in your routine in the weight room and all that together just makes you become a more explosive athlete. >> I feel like that also reminds me when we're talking about with Lowe's like earn your Sunday. It's like during those training sessions during the week, you got to put in 100%. Because think about it, especially my audience, we have a ton of sports fans as a sports content creator. A lot of these people have aspirations to play college and different things like that. And you got to remember like >> so many other people have that dream. So the real the biggest difference is the work you're putting in. And Sea was talking about earlier how much work he puts in the discipline behind that. So it all like brings it back to you got to really earn everything. You got to really put in that work. Try to be the hardest worker in the room. You talking about Daniel Jones earlier going off this season. You said he was the first one in, last one out. That's really what it is about chat. >> All right, we got the giveaway winners. >> Andrew and Hunter. >> Andrew and Hunter. Congratulations. You two have won the signed helmet right here. Congratulations. Thank you for entering the giveaway. And guys, we also have the jersey. Talk to me and TJ. >> One more time. >> Aster 23 and TJ. >> So for the jersey, a manster 23 and TJ, congratulations on winning your signed Squan Barkley jersey. That is insane. And thank you everyone for even like entering the giveaways. Big shout out to Lowe's for putting it all together, having that opportunity for everyone in the chat. Hell yeah. That's awesome. TJ, yeah, letting it know in the chat. Yeah. So, what you got the rest of the week? So, I wrapped. >> Pilates? >> Yep. >> Let's go. I wanted to clear my mind a little bit. So, I played like nine holes of golf. But tomorrow, we go in and start breaking down. We got the Bucks who undefeated and they're a really good team. So, it's going to be a hard match up for us. So, uh we going next. We going tomorrow and get ready for the Bucks on Sunday. >> Let's go. Hey, best of luck with the rest of the season. Hey, big shout out once again, Lowe's, for putting on the stream, sponsoring it. >> Oh, wait. So, >> my fault. We're actually we're move we're going to keep going. >> We're going to do one more quarter, >> but even difficulty. >> Even Okay, let's do it. >> So, you want to do randoms? >> Let's do randoms. >> All right. I'm going to be All right. One. You got the Bucks. I got the 49ers. >> Two. I got the Dolphins. You got the 49ers. Three. >> I got the Eagles. I'm going Eagles. >> I'm do random. >> Got the Bucks. >> All right. You know what? instead doing one quarter will be first to score. >> Okay. >> Wins. All right. What difficulty do you want to do? >> All Madden. >> All Madden. You don't want to do like rookie. All pro. >> All right. We'll go all Madden. >> Okay. I am cooked, bro. All Madden. >> He's cap. He know how I play the game. Put on competitive, I think. >> Yeah. >> All right. We're doing first score. >> So, score or touchdown? >> Touchdown. Or what do you want to do? No breather. >> And then I'm winning. This is >> Let's do touchdown. >> It's your Yeah. >> Let's do touchdown. >> Guys, we're back. All right. So, the score is tied up one to one. So, winner takes all right here. It's going down. It's all about who gets the ball first here. >> Dude, I'm I'm I genuinely like I don't know what I'm doing. Cap. You think I'm capping? You think I'm a sweat? I feel you have to be good at just games in general. >> I feel like sports games are very specific though. Like you ever play a sports game you never played before, like NHL or something? You're cooked. 2K. I'm nice though. Don't sleep. Am I starting with them all? >> Yeah, you are. Let's go. It's not letting me press. Is it glitching? >> No, it was >> when I was trying to pick the play. It was running. I don't want it. I want it. All right. Here we go. Running it down the field. You know what time it is. This is for you, chat. Come on. It's kind of crazy that you have it. Something set up here. I don't know. >> It ain't no setup. I did. I see. I even came clean about my setup that I wanted to do at the beginning. I was honorable and you allowed it. You allowed the difficulty. Hey, no screen watching. Okay. >> All right, let's go. >> You going to try to run the ball with me and score me? Insane, >> bro. I got I got a 99 overall. How do I not spam the 99 overall? >> Chad, how do I run the tush push? [Applause] See, that's just unrealistic, bro. You know, you would have gone farther. >> I mean, my the jump cut was kind of nice. I can't >> third and eight. Wait, wait, wait. Oh, snap. >> Oh my goodness. I ain't punting it, bro. You know who this is. >> All right, now we're getting sweaty. >> That's how you know you're sweating, though. Come on. Give it to Saquon. No. It's still a touchdown though, right? It's not like over time. >> See, all matter is Yeah, I I just I did run it every time. I don't know what that play was at the end. >> Genty started running back. >> Should be. Yeah. Okay. Don't have numbers there. Oh, they got him standing like that for real. Damn, you're so close to the end zone, too. Let's go. Good stop. Come on. Three more. Three more right now. Let's go. >> Oh yeah, that's good coverage. Pick. Oh my god. >> This game is so What are you doing? Like what are you doing? >> Let's go. >> I just want to No, I'm not going to be that guy. >> I'm going to be that guy. Let's just Let's just look at this real quick. Let's just look at this real quick. >> Replay. I love my guy code. I love the Kobe D. That's my That's my dog. Come on. >> Was it the throw? >> This is it. I know. >> Wait, low key. Look at that user. >> Yeah, but like who what we talking about here? >> This got to be put to the back of the pile. >> That's a gross. >> That's why that's why >> this why I can't be a coach either. Feel >> like I'm screen watching. >> Yeah, close your eyes. Crazy, man. >> Come on. I need this. Oh my god. Oh, what? This guy's running Hail Mary. I I only need one. This guy's running Hail Mary, dude. I know how crazy that is, dude. Sometimes you got to do what you got to do. This is insane. If he touches this, I'm about to say it's all matter. That's I'm about to say this is at some point. If y'all saw when I was with Johnny, my hail Marys were working every time. >> All right, Son, let's just play smart football here. >> No, not the right button. Oh my god. Yep. Let's go, [Music] >> Matt. I need I need you to talk to him about that one. That should have been a pick. Come on, lock in right now. Bro, I love how they got him standing like that. Damn, this line is Oh, yeah. Oh, yeah. That should be illegal. >> That's literally supposed to do. >> Like to not get a sack, you're supposed to throw the ball. I feel like they should change that rule in football low key. >> And and do what? Just as sacked. >> It's an offensive league. They would never do that. >> If I can meet any celebrity, who would it be? If Tupac core came back in the day, Tup Michael Jackson, that's a good answer. Boom. Third and 14. You know what time it is. All right. If you had to make one rule change in the NFL, if it could be wild, five downs, what would >> I got? No, actually, I'm appealing that. So, let me not hurt my case there. >> Okay. >> Um, one rule change. >> Just the entire sport. [Applause] >> Touchdowns are worth 10. What we doing? Um, if I could change one rule, it would be doesn't have to be NFL. It would be the general sport. No 18 game. They're trying to go to 18. I was even 17 games. We go back to 16. Less games. >> Less games. Got to be ready for playoffs. Damn. 18. It don't make no sense. Oh yeah. Oh, you got to hit him harder, >> guys. It the score is tied one to one. It all comes down to this. know anybody in this league? >> It's got to stop right here. Come on. Don't score against your own team. [Applause] Get him. >> Good throw. What button is that? >> He clipped down. You gota So you got to make sure you're out the pocket because if you do it inside the pocket that's dependent. Okay. >> Good looks. >> All right. So you're going to drop play zone. A should be wide open as man. Oh, >> come on. Guys are playing first touchdown wins. >> Come on. Dang. I need to get a fumble. That's what I need to see right now. That's why like when I play and I fumble in a game with myself, it gets me gets me so upset. >> Okay. If you don't score here, you want to go tire, you want to finish it. >> Oh, job's got to be finished >> cuz you're not scoring right here. >> You sure? All right, that is GG. Damn, bro. The way you said that. He's aura farming right now. GG's. All right, Squan takes it two to one. I even tried to cheat with the difficulties and I still lost. Makes sense. Mr. Matt. Hey guys, we're going to wrap it here, but big thank you to Lowe's again for powering the stream, making this all possible. Make sure y'all earn your Sunday this week. Spend some good family time, watch some football. It's been going down. Squan, do you have any last words for the chat? >> Chat, thank you guys for having me. Thank you guys for tuning in, asking these great questions. Apparently, you guys really want to know Joe Burrow or Josh Allen. Um, but I appreciate all the love for sure. >> The world may never know. All right, we'll see you guys in a bit. Subscribe if you haven't subscribed. Got to subscribe. Make sure to follow Saquon on socials. Also, go check out low social so you always know what's in stock, what new products are coming out. We'll see you guys in the next one. Peace.",
    "start_time": 0.08,
    "end_time": 7083.8
}