{
    "video_id": "IAZx4ZWYi10",
    "channel_url": "@jesser",
    "transcript": "Today we're touring Nike's $1 billion \nheadquarters. There's a lot of crazy stuff   in this building that the public has never seen. \nHome of the biggest sports brand in the world.   And we'll be one of the first people ever allowed \nto film a tour here. And we are at the front of   the Nike World Headquarters. Let's go inside. \nAnd we're starting off in Pre Fontaine Hall,   which showcases the origins of Nike. So Nike \nwas founded in 1972 by Phil Knight and Bill   Bowererman. And this has all of their first \never inventions. I would say this was one of   the first ever Nike shoes. And the bottom of \nit was literally made with a waffle maker. The   innovation back in the '7s was crazy. This campus \nis so big that we have to take a golf cart to get   around. Bro, look at this architecture. This is \ncrazy looking. I'd say almost everything here,   especially from like a architectural standpoint, \nis intentional. So there's little Easter eggs,   story behind the story. What's your favorite \nbuilding? LeBron. LeBron. The tour started in   the past, but our next stop will be entering the \nfuture. Inside the LeBron James Innovation Center,   where Nike's next 10 years of innovations \nare being designed in secret. At the front,   they got his logo. Fun fact about this right here. \nThis is LeBron James's height. There's more to the   crown than what the front sees. These are people \nthat had a big impact on his career. So, we've   got Gloria James's mom on there. And behind us is \nthe LeBron James ramp. I bet I could beat you up   there. You ain't beating me up there. 10 push-ups. \n20. 20. You're going down. Yeah, you're going down   for push-ups. Damn. Do you see that bird? 3, two, \none, go. Oh my god, Johnny. Relax. Oh, I might go   one try. No way. You're going backwards, bro. \nIt's I swear it's the stairs that are slowing   me down. Oh god, dude. This is some goat stuff \nright here. Johnny can have it being like boom   boom boom boom. Why'd you make it 20 push-ups? Cuz \nI knew I was going to win. Hell yeah. I'm going   to do like a 100 push-ups today. LeBron, we have \nfound our beautiful sunshine. My reason to live,   LeBron James. I've never gotten a pick with LeBron \nbefore. Posting that to the gram 100%. Okay,   we checked out the statue. Now it's time to walk \ninto the LeBron James Innovation Center. And these   door handles are insane. I want this door for my \nhouse. Look how sick this is. Damn, guys. This is   the King's Secret collection. They got a bunch of \nthe rare LeBron shoes right here. Like, I've never   seen this one. It's called Buried Treasure. These \nare insane. And these aren't the only exclusives   we'll see today. The Michael Jordan building has \neven more hidden gems and exclusive shoes waiting   for us later in the tour. Wo! Walking in, they \ngot a basketball hoop straight in front of us.   They got a shot chart of LeBron's first 30,000 \npoints. So, on the floor, the open circles are   misses. These are the makes and it's literally \nevery shot counted and some of the most important   shots like right here 20,000 point are marked. \nLeBron James signed the backboard and also the   gold hoop is just so sick. And before we try to \nrecreate some of LeBron's most legendary shots,   we're going to hear from Nike Vice President John \nJawers in the building. Yes, sir. And I heard you   one of the tallest executives. That may may or may \nnot be true. Okay, so tell me about this spot. I   mean, this is like the pinnacle of all of the best \nthinking that happens at Nike. Do the basketball   shoes get made here? Think about this as the \nconcepts that have yet to be developed in the   future. Yeah. 5, 10, even more years out. Wait, so \nyou're telling me the LeBron like 2029s might be   in this building right now? There's a lot of crazy \nstuff in this building that the public has never   seen. The public has never seen and public will \nprobably never see for many, many years. Yeah. I   feel like I've never really seen video clips in \nhere. So, we're getting some exclusive access.   Can we take a shot on this board? Let's do it. \nWhere you want to shoot from? Where can you make   a shot from? I mean, I could probably make it from \nanywhere in here, but right here is where LeBron   James broke the NBA alltime scoring record. What \ndid he hit like a size fade away? I think he went   in, did the pullback. Bang. LeBron. All right, \nthis is it. [Music] No. How about one of the crazy   ones? One of the crazy ones. I'm the ones that he \nmissed from way out there. And if you can make it,   then you're better than LeBron. Hey, say less. So, \nLeBron didn't make it here, but I will. LeBron.   There we go. There we go. Let's go. LeBron James. \nDo we want to go upstairs? Yeah. Let's go check   upstairs. This is a really insane piece of art of \nthe founder of Nike. And it is made entirely with   sho strings. So, one of a kind artwork. Never \nbeen done before, but that is very impressive.   8,000 Nike shoelaces. How are people so talented? \nAnd right here, there's even more artwork. If you   stand perfectly right here, look at the swoosh. \nThat is sick. It's like a little bit of an optical   illusion. Hey, so this is the photo of his shot to \nbreak the record. Everyone's on his phone. We got   Phil sitting right there next to Bronnie. Hang \nup and hang out, guys. Am I right? LeBron even   filmed an episode of the shop right here. It was \nliterally in this spot. They left up the barber   chairs. We're basically on the shop right now. All \nright, we're walking into Glow's Cafe. Do you eat   here a lot? I do. The bagels are great. Obviously, \neverybody knows how special the relationship is   between LeBron and his mom. So, this place is \nkind of an homage to that. There was a mural that   was placed in this building that LeBron didn't \neven know about when they were opening it. So,   as he was getting the tour for him and his \nfamily, it was quite a nice treat for them to   be able to see that. This is such a cool mural. \nLeBron and his mom. Is that a childhood trophy?   Yeah. Damn. First place. I always knew he was the \nbest. And this is like legit from his childhood,   from his crib. The Batman. That's so cool. I \ncan feel the energy coming from it. No glaze,   guys. This is sick. And that was just one of \nmore than 75 buildings on the Nike campus that   hosts over 11,000 employees. We have so many more \nnever-beforeseen places to check out. And for our   next stop, we are at the Coach K building, which \nis a fitness center. And dude, this is insane.   And that tree is so majestic. Dude, this is a \nmeditation spot, bro. This is so beautiful. And   look at this little touch. It's got a one in \nthe cave because he has over a thousand wins.   Let's go inside. [Music] Want to introduce my boy \nQuincy who is a Nike storyteller. He's going to be   giving us the tour today. Excited to show you guys \naround. We are here at Coach K Fitness Center. You   got some Sabrina 3s as well. So, we hooping. \nWe're hooping. Okay. Got the heat. I love the   gold. Let's try these on. All right, good to go. \nSo, what was the reason for making this building?   Yeah, it's really just to push our employees to \nbe active and sports a really big part of campus.   Inside this building, it has everything an athlete \nwould need, like a full recovery station for   employees to use. Who knew Nike had lounge chairs \nlike this? Oh, this is so comfy. If a cloud was   a chair, this is what it would be. It also has \na full gym with all of the best equipment. Oh,   you can get a full workout in here. This place \nis awesome. And finally, the best part of the   building is the state-of-the-art basketball gym. \nOh my goodness. This is beautiful. And they got   a prodigy hooping in here right now. Yo, what? I \nknow this guy. Yo, Travis, what are you doing in   here? What are you guys doing here? We're here for \nthe tour. Yeah, bro. This is my supposed to be my   day off. What? What the What the heck, bro? This \nis where you be hooping. Dude, I've never been in   a more glossy basketball court. This is nice. \nLike, the reflection is crazy. Wait, listen.   That was nice. Imagine the go-to shot on \nthis court. Travis, me. At each location,   we have to do a challenge before we can \ngo to the next one. And for this one,   it's the first to make a half court shot. Loser \ndoes 10 push-ups. I'm making this first try. No,   I'm making it first try. You're not making \nit first try. Oh. Hey, this one's for you,   Coach K. Oh, yeah. Why did you shoot it like \nthat? All right. Hey, that was straight. Guys, there are Nike employees watching. \nThis is super important for me to make   it to showcase my skills and one day get the \nshoe deal. Base drop. Get in. Yes. Oh my god,   the voice crack. I made him and I just had \nthe worst voice crack of all time. I feel   like I just lost. Yes, that's 10 push-ups. \nYou know what? He's getting off the ground.   That's pretty impressive. All right, now \nwe can continue the tour. They have the   world's first basketball in here and basketball. \nStarted with a basket for the hoop. That is old,   bro. My boy Zach used to hoop on that. Shout \nout. This is just one of many gyms here at   the Nike headquarters. But now we're heading \nto the Bo Jackson Field, which is named after   the only athlete to ever be an all-star in \ntwo different major sports. And right now,   it's set up with all the different soccer goals. \nIt's a multi-use field. And a really fun fact,   the turf is actually made out of recycled \nswooshes. For this challenge, we got two Nike   college athletes right here. We got Re and Megan. \nSo, the challenge is a crossbar challenge. We're   going to take turns. Whoever hits the crossbar \ncan pick someone to eliminate. Last one standing   wins. And if you get eliminated, 10 push-ups. R \nhas been warming up for over an hour. I'm just   going to say it right now. Self-proclaimed trick \nshot specialist. Yeah. Millions are watching this   moment. A little bit of pressure. Okay. Oh, we're \ngood. That was a strike, though. All right, I'm   going. I'm going. First shot of the day. See, now \nthis is the type of thing that Jesse would just   make first try. I'm using massa precision with \nthis shot. All right, here we go. Oh my god. Oh, first try. Let's go. What' I say? You \nknow what that is, bro? This tour got   me feeling different. So, I get to eliminate \nsomeone. There's a foreign superstar here. So,   you're too much of a threat. I have to eliminate \nyou and give you the 10 push-ups right here. Right   now. Right now. Push-ups right now. 8 9 10. GG. \nAll right. Round two. You can follow that up.   There's no way. Got to save myself from these \npush-ups. She is a midfielder. I feel like this   is in her bag. Mid. She's mid. No. Look what you \ndid. You started talking trash and then she hit   it. I'm going to eliminate the biggest threat \nhere. Hey. Okay. All right. 10 shots. Johnny,   you got to win this. You got to win \nthis. Okay. Okay. The finals. Yeah,   we made it to the finals. GG. All right. If Johnny \nhits this, you have to subscribe. Oh, he's taking   the shoes off. That's another game. That's a good \nmove, Johnny. Oh, boom. Kept it in the field. Oh, crossbar. It's over. Hey, good game. \nGood game. He knows what time it is. Damn,   you stay doing push-ups. We completed the \nchallenge. Me and Johnny took an L. But let's   continue the tour. Wait, wait. I got to hit \nthe crossbar to outro it. But if I hit this,   y'all got to subscribe. Oh. Oh, let's go. \nSubscribe. Hey, after that crossbar challenge,   they might put me up there. And to my right, we \nhave the Ronaldo field. Not that Ronaldo. It is   the OG Ronaldo, but it is literally absolutely \nmassive. You could definitely fit multiple   soccer fields on there. and everything is just \nbeautiful here. We're now walking into the Nike   Sports Center. This thing has a rock climbing \nwall. It's got a pool. It's got another gym. So,   we're going to do a couple challenges in here. And \nto the right of the building, they got a putting   green. If you want to work on your golf game, \nmay as well do a little golf competition. Whoever   can get it in less shots. All right, we'll go to \nthat hole right there. You go first. Hole in one. Wait, once it gets down the hill, it's going \nto get the momentum. It's going left. I did   not think it would go left, but that wasn't \nbad. See, going first has a disadvantage.   Now you know. Hit it to the right. Oh, \nI know. Hit a little to the right. Oh,   that might to the right. Oh, now we're going \nI'm going to the other hole. I still think I   beat you. You think I'm going to hit it right \nhere? I don't think you're going to make that   at all. I have no faith you're going to make that. \nThis one's for Tiger. [Music] No way. That was in,   bro. That was in. Come on. Skill issue. You're \nall the way over there. Wait. That was nice.   That was nice, Shnie. Wow. All right. GG. How \ndid you make that? I'm like that. Behind me is   a 33 ft rock climbing wall. And we got Wyatt \nand Emily here. They're going to show us how   it's done. And then me and Johnny are going to go \nheadtohead. See, you can reach the top first. And   then you're going to do 10 push-ups. Probably. \nGuys, last time I was on a date with my fiance.   We went rock climbing. I got like halfway up and \nmy heart was like I'm basically trying to conquer   a fear today. You got any advice? Stay close to \nthe wall and walk up with your feet. Going down,   dude. You already know we got to chalk up. \nShout out to LeBron. Boom. Boom. Boom. Boom. 3 2 1 go. Oh yeah. Yep. Yep. Man, Donny's moving, \nbro. Slow down. Dang, you're way down there. Keep   going. Keep going. Nice. So high up. Oh my \ngod, man. This one don't got good grip. Oh,   I'm so high. I don't like this. You You know what? \nMaybe you could have it, bro. I might stop here.   You got this. You got him. You got it. You got \nit. Just move your feet. Move those feet. Move   your feet. Yep. Yep. He's there. You're there, \nTom. Yes. But don't you need both hands up here?   No. No. Johnny just went on a technical. Oh my \ngod. I'm so wild. That is so scary. Oh my god. No,   that was scary as [ __ ] Oh my god. Oh my god. \nIt's got you. I conquered a fear. Thank you. Yeah.   How's that feel? Two in a row. No, I I should have \nwon. You should have won. See how you're using two   hands doing push-ups right now? Yeah. Could have \nbeen you up there. On the outside of the sports   complex, they have a bunch of different outdoor \nactivities. They got three full sand volleyball   courts, two full concrete basketball courts. I \nfeel like I'm playing 2K right now at the park.   This is sweet. They got a full outdoor workout \narea. Got the tires. Try lifting that black one,   bro. It's so light. Oh my god. Oh my god. Watch \nout. 220 220 lb. And upstairs they have a full   gym with treadmills, bikes, everything you \nneed. They got the weightlifting over there.   This is where I would be doing my lunch breaks, \nbro. This is how I have the thunder calves. And   when you're riding the bike, you can either \nwatch a screen or you can watch people swim,   work up a sweat so you get in the pool later, \nwhich is actually where our next challenge is   at. We made it down to the pool. And there's \na really fun fact about the pool. So, it's   actually a couple inches shorter than Olympic \nsize because if it is an Olympic size pool,   you are required to host events. So, it's a little \nbit smaller just for Nike employees. And we got   Mia and Malachi right here who are both college \nswimmers to go headto-head in a competition. I   want to do a race, but we need an advantage. So, \nwhat do you think we should do? I'm thinking you   guys go down one length and we'll do two. And you \nthink you could beat us? It gives you a chance. It   gives us a chance. Let's go. And we have legendary \nNike announcer Travis Fukamoto in the building. I   took a swimming class in college once. All right, \nready? 3 2 1 go. All right, here we go. Oh my god.   Oh my god. Wait. Wait. Why is his head above \nthe water? He's not even What are you doing?   Go go go go. Oh my god. Wait. It's actually \nclose. Wait, it's actually close. Jazzy, go. Oh. Oh my god. Oh my god. You freaking Did we \nwin? You won. You guys won. After dominating in   the swimming challenge, it was time to check out \nthe building dedicated to the greatest women's   tennis player of all time. But don't forget, we \nstill need to check out the secrets of the Michael   Jordan building at the end of the tour. This crazy \nlooking building behind us is the Serena Williams   building, and it's actually over 1 million square \nft big, which is absolutely absurd. But dude,   that bridge is like the future is. Yeah, that's \na futuristic bridge. Over here, it says Serena.   That's so sick, bro. Imagine having your \nown building. Let's go inside. Walking in,   it's basically like a little museum. This was the \nmost comprehensive collection of artifacts from   Serena's career. It was pretty amazing to be in \nthe same room as so many of Serena's old uniforms,   trophies, and handwritten notes. All these \ntrophies are motivating me to play some   tennis. But before that, let's check out \nthe food hall inside the building. What's   the best thing in here? Best food out of \nthis whole place. Talk to me. Every day we   got a custom carving station where they have \nsalmon, they got chicken, they got ham. Damn,   that looks delicious. I would love to try that, \nplease. Thank you. I don't know where a fork is,   so we're going finger. Yep. That is delicious, \nbro. That looks so good. I'm getting so hungry.   Look at this pizza. Damn. Burritos on deck. \nCooking up some cheeseburgers over there. Dude,   they got some poke bowls. I love pokey. We need \nthis at the bug squad office, bro. We need a   full-time cafe. Now, it's time to go down to the \ntennis court to challenge a professional tennis   player. We got Karolina here. So, me and Johnny \ndon't really know anything about tennis. So,   our challenge is just first to return one of \nyour serves. Does 10 push-ups. You know what   it is? Do you think you're we're not going to \nbe able to return one? Maybe one for sure. How   many attempts do you think it'll take? Probably \nlike 20. 20 attempts. I don't think I'm going to   even hit the ball. We'll let you go first cuz \nonce I go the challenge is over, Johnny. Okay. Damn, bro. You literally have to have \nthe reaction speed of like an F1 driver. Bro, that was insane. It's like \na baseball. Johnny, good shot. I   I thought she didn't hit it further out, so \nI already started moving. Ready? I'm ready. Bro, that thing is going like 100 miles per hour.   You said where do you want \nit? At the racket, please. Oh, close. She is very accurate. I literally did \nnot move my feet at all. I'm out. Oh my gosh,   bro. Dennis is crazy, dude. I don't know if \nyou're going to get it in 20 tries. Damn.   My hand. Oh. Oh, it's out. Okay. Okay. This \nis my moment. I could win it all here. Oh,   yeah. Oh, yeah. Get in. Let's game. Let's \ngo. You know what time it is? Oh, I'll do   it in the shade. I feel like it's hot. 7 8 9 10. \nThose serves were insane. GG. That was so hard,   bro. I have a new found respect for the sport \nof tennis. Let's continue the tour. As we were   walking to our next location, we had to \ntake a stop. They have a slide. Look at   this. This is what we need at our office. \nHere we go. Yo, that was actually sick. That's a good slide. So, we're at Joony's. We're \ngoing to be having our lunch here. They have all   different types of food. And I have to say, this \nis one of the most beautiful spots on campus. Cut   to the epic drone footage of this lake. It is so \nbeautiful. I feel like this has to be the best   place to enjoy your lunch. And this is the same \nlake where Drake and Little Dirt rode jet skis in   the Laugh Now Cry Later music video. All right, \nI'm hungry. I'm going inside. Everybody knows if   you want to find the good food, you got to get \na local. So, we got Brit here. Tell me, what's   the best thing? Oh, man. You got a lot of options \nhere. You've got Asian cuisine over here, chili   fuego. But you can't you can't miss. Everything \nlooks so good, bro. You know when you're like   walking into a new restaurant, you like are just \nlooking at everyone's plates to see what they're   eating? That's what I'm doing right now. Let's go. \nI went for the tacos. Got one of each flavor. We   got our foods. And they have that massive TV to \nwatch different sports games. That is next level   right there. It's time for a food review. Very \nexcited. You go first. Tell me how it is. This is   incredible that this is at a work facility. I feel \nlike Johnny might go and work for Nike after this.   I'm not going to I'm a little scared we I'm going \nto lose him. All right, here we go. [Music] That's   delicious. I'm giving it a 9 out of 10. You guys \ndon't have ball knowledge like me. What you know   about Anthony Davis from the 1950s? What y'all \nknow about Mike Connley from the 1960s? That's   his dad. Our parents had this Anthony Davis. We \ngot our Anthony Davis. This is crazy. What are   you working on? Damn, that's some heat. Guys, \nI would show you, but these are the next LeBron   she's cooking up right now. Well, I'll leave \nyou to it. And on our way to the next location,   we stumbled across a Japanese garden. This place \nreally has everything. This is where I would   be having my business meetings. You'd be like, \n\"Hello.\" They're like, \"What's going on behind   you?\" You're like, \"I'm vibing.\" And we made it to \nthe Michael Jordan building. I am so excited for   this. This is going to be one of the sickest parts \nof the tour. Get a freeze frame right now. Hey,   that was clean. But before we go inside, they got \na Jordan branded cafe we're going to check out.   And a random boba truck just posted up. Imagine \nhaving a Boba Truck at work. And we got my guy   Vernon from Jordan Brand to show us around. How \nyou doing? What's going on, man? How are you?   Wanted to show you guys the Wings Cafe before \nwe go inside. So, this highlights uh the Wings   initiative, which has four programs that focus \non education. So, we got our Beyond Basketball   program. We focus on introducing kids to the sport \nof basketball, but also teaching them life skills   through sport. Um, we also have our design program \nwhere kids get the opportunity to design footwear   as well as wrappings for um NASCAR. Tyler Riddick \nbeing one of our athletes. Our designers get the   opportunity to design. And those are kids that \nget to design his NASCAR. That is so cool. Fire.   And with the 10 year anniversary, we actually \ndesigned these fives. Damn, those are clean. So,   the Wings AJ 5 just came out last week, July \n16th. Um, so super dope that we can celebrate   10 years of impact with the Jordan brand. This is \nthe Jordan building. Welcome. We happy to have you   here. A couple things that we want to highlight. \nFirst, the six rings, right? We wouldn't be here   if it wasn't for the greatness of Michael Jordan, \nright? So, we want to highlight the six years that   he won his championship. The double three Pete is \ncrazy. The double three Pete is insane. And the   most icon I feel like this is probably the most \niconic shoe of all time. The Jordan one. Like,   is there a more iconic shoe? You know the origin \nstory of this shoe for the NBA. You had to wear   shoes that were primarily white. So, Michael \nJordan actually wore the breads, which are   primarily black shoe. And this shoe was actually \nbanned from the NBA. So, they the team was getting   fined every time he wore the band one. And then we \nobviously got our shattered back boys as well. So   giving you a sneak peek to something that's coming \nout later this year. Sneak peek August 23rd. You   can look forward to the Shattered Back Boy ones. \nPleasure to meet you. My pleasure. Welcome to the   Jordan brand. Do you have a favorite MJ story? Oh \nman, I got so many MJ stories. I I working with   him, I tried to never ask him for anything just \nbecause of the relationship, right? But my mother,   who couldn't care less about basketball, was a \nbig time Jordan fan. So one year I got my courage   up to ask him to call her on her birthday and he \ndid it. But every year after that he would ask,   \"Your mother's birthday is coming up, right?\" \"All \nright, send me the number and I'll call her.\" She   didn't care if I called her. What? He called \nher every year. Every year, bro, that is so   wholesome. Until she passed away, he called her \nevery year on a Oh my goodness. You know, he's   he's an amazing guy. I want to put on some Jordan \nones right now. That is awesome, bro. Shout out   to Jordan. But with that, we'll take a look cuz \nwe have our AJ1 gallery in the back of the lobby.   We talked a little bit about uh the bread ones, \nright? That shoe that was primarily black was a   shoe that was banned. So something that we talk \nabout at Jordan Brand is you cannot ban greatness,   right? We are unbanable. Unbanable, baby. I like \nthat. That should be the new tagline. Unbanable.   It actually is. So if you take a look here. Oh, \nit is. What the heck? Unbanable. You can't stop   them. So, we had our unbannable campaign and \nthese are six of our athletes and catalysts that   we highlighted. Bro, there's so much greatness \nhere. Yes, I feel elevated. So, this is the full   collection of one 39, bro. 39 signature shoes. \nOnly Jordan could do that. And then to finish up,   we got a surprise for you guys. So, I'll give \nit to you guys to crack these open. Damn,   these are the 40s. I don't know. Let's take \na look. I see Air Jordan 40 on the sides. Oh,   I like how satisfying that box open was. Damn, \nthese are fire, bro. These are clean. So,   this is the classic colorway of the AJ40. Dude, I \ngot to take off the LeBron, dude. I'm not in the   LeBron building anymore. These got to come off. \nThis is Thank you so much. I really appreciate   that. Absolutely. For real. How we feeling, \nJohnny? I like the These are nice. So far so   good. These are nice. They're actually like really \ncomfortable. Hey, Michael Jordan building. I mean,   they're working on shoe design in here, marketing. \nLike a lot of the stuff is like top secret. Nike's   never even really done that many tours. So, this \nis sick that we even get to see this bottom floor.   So, thank you so much. My boy Brady out here. What \ndo you got to tell him? Like and subscribe. Yes,   sir. You know what time it is. Let's go. And our \nfinal location is the Michael Johnson track, which   has to be the most beautiful track I have ever \nseen in my life for our final challenge. This is   Michael himself right here. Fun fact, these gold \nNike shoes, he set three different world records   in them, which is crazy. Now we got Alexa here \nfrom Nike and it's time for our final challenge, a   race. Alexa, so you participate in the Nike Mile, \nwhich is a competition between all the employees   every year. What was your Nike mile time? My Nike \nMile time was 5:22. I I will say I did not win.   So, we've got a lot of really speedy employees \nhere. The winning time for women was 450. You were   close. We're We're there. We're close. 5 minutes \nis crazy. So, we're going to do a race. Johnny   is very fast. I'm a little worried, but he's out \nof his prime. I'm washed now. the loser. Whoever   gets last place does 10 push-ups. All right, let's \ndo it. Let's do it. Here we go, y'all. 100 meter.   Johnny, after you're destroying me in the LeBron \nramp, you got to back up a couple feet. We needed   an advantage. Yeah, that's good. That's good. I'm \nready now. 3 2 1 go. No. Oh, he's already catching   them. Damn, Johnny. Damn. No, you almost got me. \nYou almost got me. Oh god. Oh my god. I'm seeing   stars. You almost got me, Jess. Bro, genuinely, \nI've never moved at those types of speeds before.   It's the shoes. It might be the shoes. And that's \ngoing to wrap up our tour, guys. I hope you did   enjoy it. Major, major shout out to Nike for \nhooking this up. Thank you so much. If you   want to see $1 vers100 million basketball courts \ntour video, it's popping up. Or this other video I   know you will love. Subscribe if you haven't. \nWe'll see you in the next one. Peace. Yes.",
    "start_time": 0.16,
    "end_time": 1590.0
}