{
    "video_id": "REE0Px949mE",
    "channel_url": "@jesser",
    "transcript": "Today, every time we score, the basketball \nchanges. From an NBA basketball to a square   basketball to an airless ball to even a Mr. \nBeast basketball. There is 15 different levels,   and the first one to get through all \nof them gets to hold on to the trophy,   which is currently mine. It's going to be mine. \nI'm getting my revenge, man. And we're starting   off with an NBA basketball. No look. So, it only \nmakes sense we have to score on an NBA player.   We got Jabari Walker in the building. What's \ngoodies? What's going on? What's going on? All   right. What are your thoughts on the NBA ball? \nPretty sure you're not too familiar with this,   so that's an advantage for me. I played in the G- \nLeague for a little bit. Don't sleep on me. It's   Oh my god. Slippery ball. Oh my god. It's slip. \nThat ball is mad slippery. It's going to be a long   day. I'm not going to lie. Javari is intimidating \non the court. Oh my god. Yeah. Lock up. Oh yeah,   that's good defense. Hey, bro. Is that I feel like \nhe makes you look small on the court. He makes you   look small. Oh, you don't think I can go left? \nOh, no. No, no, no. Oh, that's a good shot. Bring   out the next basketball. No, no. Get out. Move. \nNo. Oh my god, bro. Yeah, his movement's crazy,   bro. Well, that's in. Oh my god. Yes. Oh no. Oh \nno. Oh my god. Take it out on Zach. We want to   block. No. No. No. No. No. No. Yes. I made it to \nthe next round. It is the WNBA basketball. So,   it only makes sense. We got Angela, who plays on \none of the best college teams in the world. What   do you think about this ball? I think you're \ngoing to have to use less power on it. So,   definitely has more air. You're going to have \nto have really good handles for it. But now I   can palm it. So, I might I might go crazy. \nI might dunk it. You're not dunking on her,   bro. I'm going to let you know I've been \nDang. I've been working on a new move. Jesus. Good move. Oh my god. Let's go. Definitely didn't go \nas expected. I for sure need my revenge.   You don't know my signature move. [Music] Oh, defense. Don't make her mad now. Ah, it don't matter. And one. Wait, was it before \nthe shot? Loki. No. Come on, bro. We're not doing   that. We're not doing that. All right. All right. \nRespect. Respect. Respect. I'm about to join you. No. This next basketball is a cube. This has to \nbe the dumbest basketball of all time. I don't   like it. I hate it. And when this product got \nreleased, LeBron James even made a tweet about   how dumb it is. So, we're going to try to play \nwith it today. Yeah. Who would our defender be   for something like this? Chicken jockey. Okay. \nChicken jockey. Yeah. Hey, look what he brought.   He has brought the briefcase. So, every couple \nof rounds there will be a briefcase and the first   person to pass the level will get to open it and \nthere'll be a twist inside. You got to get a stop,   chicken jockey. A let's go, chicken jockey. Bro, \nI know the six-year-olds watching are hype right   now. I don't even know how I'm supposed to \nscore without laughing. I ain't clucking   around. You ain't scoring. Oh, yeah. Yeah. \nPress up. Press up. No way. No way. Not here. Please. Yes. GG. Oh, man. If Zach misses, I'm \ngetting the briefcase. Oh, that's genius. I   understand it now. Let's go, chicken. No, he's \ndefinitely scoring. Bro, you messed up. I I   understand it now. I get it. Nope. Dang. Why \nis this chicken so strong? [Music] Yes. Let's   go. That means I get the briefcase. Dude, I would \nnot have scored without you giving me the sauce. What do I get for the next round? You \nget two attempts per turn. Let's go,   bro. What? I need that. Ouch. Ouch. If \nI didn't see him do that, I would have   missed so many shots. Oh, he's on like half \na heart. He got multiple hits. Oh my god.   top of the key with a cube. We're both on the next \nlevel. It is the Wilson EVO NXT. It's the official   college basketball. So, it was only right. We \ngot my boy Gabe who just transferred to USC.   And you said you led the nation in blocks. I \ndid. How many blocks a game? Uh 3.2 I think.   3.1. 3.2 blocks a game. Let's see what happens. \nGood thing for me is I get two attempts. Got me.   this. No. It's okay. It's okay. I get \na second try. Oh my god. Yic. What? Oh my god. Oh, I should have shot that. \nAh. Squeeze. Squeeze. Squeeze.   Squeeze. I'm getting tired of this. \nI've never been blocked like this. You almost hit the ceiling, [Music] bro. Come on. I know. I was like, that's it's not going to work. Oh, no. Let's go. No. No. No. The bank. \n[Laughter] That was check. That was check. [Music] We did it. Oh my god. You are insane. I understand \nwhy you lead the nation in blocks. Don't forget   this was only level four. The basketballs will \nonly get crazier as we get farther into the video.   This level is the world's first ever velcro \nbasketball. We also have a Velcro backboard   so it will get stuck. And even a Velcro \ndefender. I'm sticking everything. Facts,   bro. Is mad sticky. This is what happens \nwhen you break it. All right. So,   I'm about to stick this ball in the hoop. Hey, \nstick it onto yourself, Johnny. Stick them.   Hey, he literally just has to touch the ball \nand it's stuck. Come on, stick him. No way. I   know you feel that scratchiness on your body, \ndude. Yeah, don't let him get close to you.   It's very uncomfortable. All right, check up. \nIt's on me. It's part of me now. Step back. Oh my god. Oh my god. Oh, \nbro. That actually hurts. Oh yeah. Yeah. Going to be a lot harder \nthan you thought. Perfect Swiss time. No, wait, wait, wait, wait, \nwait, wait, wait, wait. Oh, that's it. You got to swoosh it. Yes. Lucky I \ndon't throw him up there on the backboard. Yeah,   right. You wish. Oh yes. Let's go TG to the next \nlevel. This round is the Spalding Precision 1000.   It used to be one of the official high school \nbasketballs. I don't like it. It feels kind   of nasty. It's like plasticky. And it only makes \nsense for our defender to be a high school player.   We have my boy Brenton from Bucket Squad Elite. \nVery high level player. What do you got there?   got a suitcase with a special surprise in it. \nFirst one to score on him gets the suitcase. Oh,   that's mine, man. Let's go. Lock up, \nBrenton. Focus. Annihilate him. Is he   Brenton? How do you fall for that? Bro, you \ngot to lock in. You know why I'm not worried   about you? Last time I saw you play, \nyou lost by 40 to RWE. Wouldn't be me. No. No. [Applause] I'm nice. You can't guard me. \nHe let him do that, bro. He let coach do that,   bro. Bro, it's this gym, bro. It's this gym, bro. \nSo, this briefcase is mine. I told you. ASMR. Move   opponent a level back card you can use whenever. \nNo, I'm going to hold on to this. Are you serious?   That's fire. I've been getting buckets all day. \nAnd that reminds me, today is actually one of the   biggest days in Bucket Squad history. And that's \nbecause the Bucket Squad X NFL drop has just come   out. My brand Bucket Squad did a collaboration \nwith the NFL. And we're talking about a full   NFL X Bugget Squad collaboration featuring some \nof the league's biggest teams like the 49ers,   Bills, Chiefs, Cowboys, Eagles, Giants, Lions, \nand the Raiders. This collection features a mesh   team tea that is so fire. It's actually insane. \nA multiolor team hoodie, a t-shirt, two different   mesh shorts for each team. This collection has \nme so excited. I can't wait to see y'all repping   it. Don't miss out. Go get your favorites on \nbucketsquad.com or scan the QR code here before   it sells out. Let's go. This is a dream come true \nthat the NFL collab has happened. Get one of your   favorite teams at bucketsquad.com. You got to cop \nbefore it's too late and they sell out. All right,   now let me keep getting buckets and dominating \nin this video. No way. That's so contested. Oh my   god. Now we fried you, bro. To the next level. We \nboth made it to the next round, which is the mini   hoop round. We got the Jester mini hoop ball that \ngoes to the mini hoop. If you didn't know, this   is the new one. This is the Jester Mini Hoop 2.0. \nGot the new design, new logo, and our defender is   none other than Jeffrey Buoy. Monster Zinc, baby, \nif you guys want to take this hoop home, you're   going to have to get through me. Okay, I'll go \nfirst. Carrie Gary. Oh my god, Jeff. I was trying   to saw on him. Hey, he can't shoot. Oh my god. Oh \nmy god. Oh, he missed. That would have been sick. Oh. Oh. Oh, that was not even. [Applause] Come \non. Come on, Jeff. Bro, I'm feeling different   today. Bro, you got to top that somehow. I'm \nlowkey rooting for you to Disney related. Oh   my god. I had to give him a body bump. I hit him \nin midair. Refs. What are we calling there? We're   just not calling fouls, bro. I made it to the \nnext level. It is the Wilson Airless Gen. This   is the most futuristic basketball in the world. \nAnd it's also the most expensive basketball in   the world. It's reselling for like $20,000 cuz \nthey only made so many. Our defender is my boy   Ben. And the reason Ben is the defender for \nthe futuristic ball is cuz you are the future.   Humanity is relying on you. I am the future. You \nare. And next round, we're going to the past.   I have news from the future. You don't score. \nOh, okay. You ever heard of Yic somber shuffle?   Oh, I lowkey got the somber shuffle in my bag. \nI'm still over here on the mini hoop. I got to   score on Jeff and catch up. You're going \nto be here for a minute, bro. Oh. Oh. Oh. No. That's out of bounds, right? No. He gave me \nmy dump. I'm out of here. Welcome to the airless   basketball. I'm going to take two dribbles \nand I'm going to hit a fadeaway three. Start   back here. Damn. All right. It don't matter. The \nfuture ain't changed. God damn. I give up. Yeah,   that was a lot. No, Ben's a Ben is actually I play \nwith this dude a lot. He's a lead. It's not you,   it's the ball. Bro, you have to shoot it so hard. \nEvery time you see an NBA player try this ball,   they always airball their \nfirst shot. You know what? [Music] You need me in the nuts. My my \nbro, you were in my landing phase. Oh, yes, Ben. No. Oh, wow. It's actually the most \nunfunctional ball travel. No cap. Awesome. Yes. Come on, bro. Just let me score \nso he doesn't get a lead. I can't do that,   sir. Damn, bro. Back up. I'm at half \ncourt, dog. Yeah. Light him up, man. I hate this ball. Let's go, D. Best defender yet. That level was \ncrazy, but not as crazy as the final level,   which will be the Mr. Beast basketball, but with \na twist. We both just finished the future. Now,   it is time to go to the past. Wa! We got Greg here \nwith the first ever basketball made and Ben's dad,   who was the last defender. How does it feel \nto have the first ever basketball? Feels just   like yesterday. Have you hooped with that one? \nThis is old school. Hell yeah. All right. So,   this was made in 1876. They literally had like \nthe laces on the top. This is so bizarre for a   basketball. I'm going to be playing on a peach \nbasket, which was the first ever basketball   hoop. You scored first. So, you're up. I actually \nplayed this dude in high school, so I think he   might know all my moves. A little too close. You \nwant me back up? Hey, it's like back in the day,   they didn't have the three-point line back then. \nYou got to hoop like Yeah. Hit him with the cane. Oh, but you know who you remind \nme of? Jared McCain. I was going   to tell you before the hand was part of \nthe ball. The old days, last century,   your balls were part of the ball. Be a \nlittle bit careful. Hell no. Bob Koozie. [Music] Oh my god. Post him up, dude. \nHe's just as strong as Ben, too. I got the old man strength. Yes. And one. Hit   you with the cane. That might \nbe the toughest defender yet. No. Yic. Oh, the cane is pissing me \noff. Zach's made it to the next level,   which is a heavy basketball. Literally \nlike five times the weight of a regular   basketball. And it's only right \nthat the defender is a bodybuilder. I am glad I'm not going first. Now, this round \ndoes have a mystery case. The first one of us   to score on the powerliffter is going to get the \nmystery case. What's going on, man? How are you?   Good, man. How are you? Good. What's your name? My \nname's Quan. Quan, you're big. Do you also hoop?   Sometimes like on Saturdays. Okay. He's a weekend \nwarrior just like me. I feel that. The problem   with this round is you're forced to take a layup \nbecause the ball's so heavy. You're not getting a   jumper off. Yeah, you can't you can't shoot this. \nThere's no point. You got to take a layup. That's   the only way. How am I supposed to get to the \npaint, bro? Slow and steady. I don't think that's   going to work either. Yep. No. Do you understand \nit now? I do not. I'm taking enough abuse. Hey, GG. I I had to. Next time. \nNext time, Justin. Hey guys,   remember I still have the paper that can set \nZach back a level. Maybe I should use it now. So,   if he doesn't score here, I really \nwant to get this next briefcase. Got to go to the post. Hell no. It takes so \nlong to shoot, bro. He's Are you ready? 100%   locked in. 100% always. This is yours, \nsir. What is that? Did you drop that?   Oh. Oh my god, bro. The ball. It was so much \nheavier. I had it. It was wide open. Oh. Oh,   I'm starting to understand it. You \nbetter score here or it's over. [Music] Oh. You're good. Are you okay? No, I'm good, man. Good move. \nThank you. So, I still have the move opponent   a level back card can use whenever. I'm saving \nthis for later because the hardest rounds are   yet to come. But let's see what's in here. Only \nshoot with your left hand for the next level. Bro,   this doesn't help me. This makes it harder. Oh, \nthat's for you. For me? Oh, let's go. I thought   only good things were in here. Oh, behind. Nice \nmove. Wa. But it's so heavy. For this next level,   we have one of the world's largest basketballs. \nIt is like a triple XL. So, it was only right to   get a professional big man. We got Riley right \nhere. And I have to use my left hand the entire   round. How many sauce do you think you'll get? \nA lot. A lot. Yeah. I'm nervous. What about on   Zack? How many sauce on him? a lot on both \nof you guys. On both of us. Yeah, bro. The   left hand is screwed. Have you What do you think \nabout Do you train with a big shot or I haven't,   but I know people that do and it's it's not a good \ntime, man. Should I bust out my unguardable move? I don't think that has to be good. I just \nI don't know what just happened. All right,   you got me this time. Yeah, I think so. I think \nso. That was in scoring position. Good block. Ah, bro. That's an agile big. Oh, come on. Just hit   a layup. I can't get in the paint. \nThis is as far as it'll let me go. Come on, man. Let's go. Come on, bro. Oh, \nwelcome to the big ball. I'm not going to   lie. after I scored and he yelled. I didn't \nknow he was cheering for me. I thought he   was mad. I got a little scared. Oh \nmy god. Hey, this left hand. Queen   with the big ball is crazy. Oh yeah. Lock \nup. Lock up. Dribble it. I can't lock up. Oh, good shot. Yes. Yes. No. Bro, I hate \nthis ball. Was wide open. That's nice. Come on. Zach has made it to the next level, which \nis the Dude Perfect basketball. So, the challenge,   we have one from Dude Perfect. See what they \nsay. Jesser, what up, dude? Here's the challenge.   Backwards halfcourt shot with the Dude Perfect \nbasketball. No. You got it, dude. Good luck. Damn.   The winner of the do perfect round gets the case. \nThis might help me catch up. All right. Do perfect   trick shot ball first try. Ain't no way. Oh my \ngod, he hit the ceiling. That's a miss. A little   bit harder than it looks. The do perfect ball \nlooks impossible. This is my chance to catch up. Boom. Yes. It's my time to catch up. Let's go. \nHey, don't go anywhere. Don't go anywhere.   Okay. Stay right. Stay right here. Stay right \nhere. All right, Zach. How horrible news. I   am officially using move opponent a level back \ncard. So, you are going back up against Oh my   bro. I hope I pissed him off by scoring \ntwo. Don't let him get it in the paint. It's going to be impossible. First \ntry. Here we go. Dude, perfect. Did that go in? No. Regular ball that goes in \nevery time. All right, middle. Wait, bro. That was a pass \nto sell. That's tough. Okay,   top of the key. That's in. Nice. You got a \npiece of GG's. Welcome to Dude Perfect Ball. Ah,   the card is eliminated. He's done now. \nAnd I'm getting this case. Here we go. Oh. Oh my god. That was It doesn't get \ncloser to that. I get to open the case. That's karma again. You know what? Karma \nhas been on my side. If it's something bad,   I'm going to be pissed. Come on. Your \nnext round will have two defenders. Yes. So dumb. I hit the abcourt shot. Had so much aura \nand then I lost all of it. I'm going to catch up   just like that. If he makes this, I'm going to be \npissed. No way. Oh, that was way too close. I've   made it to the next level, which is the bucket \nsquad ball, aka the best basketball in the entire   world. What makes them so special is they got the \nbest designs. We got the brick, slime, ice cream,   galaxy, we got it all. And it only makes sense \nto go against the bucket squad mascot, Bucky.   He doesn't say much, but he is a vibe. Okay, \nBucky. All right, and I get two defenders. So,   we are bringing out bucket squad Travis. \nOh, yeah. Up, Tra. Oh, damn. Bucky. Can't   see behind him. Come on, Bucky. Oh, Buckyy's \nlike a screen. Let's go. Thank you. And one,   you can't guard me, Bucky. That's all right. I \ndidn't even see the second defender if I'm being   honest. Neither did I. I couldn't see behind him. \nIt's about to diminish right now. Good luck, dude. Yeah. Let's go. Right when I get him, what did I \ntell you? Good shot. Good shot. I'm still up. I'm   still up. I'm not worried. I'm just happy to \nbe out of that round. This card is gone. I'm   good. I feel great right now. We are almost at \nthe end. The next level is the ice basketball.   I don't know if anyone's ever made one of \nthese before, but this one you just have to   make a free throw. This thing super heavy. \nNever shot a ice ball before. [Music] Oh,   does that count? You only made \nhalf, bro. I only made half of it,   bro. Come on. Lock in Bucky. Oh, yo, Buckyy's \ntrying to clamp up. He's not doing a bad job. Damn. Don't disrespect him like that. You made him \nsad. Back up. I made half, so it shouldn't be too   hard. The ice James. Oh my god. It's harder than \nit looks. Is it? Yeah. If I survive the ice age,   I can survive this round. It's Sid. See? \nLet's wrap it up. Let's go to the final   level. Eli Manning. Damn. Front rim. Wait, it \ncame back to me. I get to trick shot. Okay. I made half of it. I need this. Come on. Yes. \nDamn. You're on the final level. I'll let you   use my ball. Thank you. I'm joining \nZach for the final level right here. My god. All right, let's go to the final level. \nThe final level is the Mr. Beast basketball. Now,   Zach, you're on this level. Mr. Beast does \nthe biggest challenges in the world. So,   it was only right. We have the thousandpoint shot. \nSo, we have 43 rims stacked on top of each other,   it weighs over 800 lb. So, theoretically, \nright, if you were to make a three-pointer,   it would be worth 129 points. Times \nthat by eight Mr. Beast basketballs,   it is 1,032 points. Quick maths. That's \ncrazy. LeBron's basically done that 40   times in the NBA. Crazy. Shout out the goat. If \nyou make it, you the trophy is yours. I still   got to make the ice ball. It's uh harder \nthan it looks. Yeah. Not going to lie,   throwing long things like this is my specialty. \nAin't no way. Oh, he don't understand it. We   almost murdered the camera. Let's go hit the ice \nshot. I need this. This time I'm making 100%. Yes. That was perfect. That was nice. Final \nlevel. Let's go. I'm next. If he misses this,   it's over. I'm about to make it, so don't \neven worry. Oh my god. Damn. It's over,   ladies and gentlemen. Bro, \nthis thing is very heavy. Oh, that was close, bro. If \nit got a little more air,   it was straight. I'm there. \nOh my god. Please. Oh my god. This thing, the trophy stinks right now \ncuz it's been at Jesse's house for way   too long. I'm going to take it home. I'm \ngoing to get all polished up. Hell no. Oh,   rim. Oh, wait. That was close. Mr. Beast, \nI'm calling you out. One v one. If I lose,   I'll put feastables on my whole wall. And now I'm \nhitting this cuz I'm like that. Oh, that's good. No way. No way. No chance. Are you kidding me? Hey, that was like that was like That \nwas in and out, bro. I get it now. Yes. Let's go. Come on. Give me that trophy. \nGive it to me. Yes. Oh my god. I'm putting   this right back where it belongs in the crib. \nShout out to my boy Zach. I got inspiration for   this video from his channel. We did a video \nsimilar to it. I'mma pop it up right here.   Go check it out. Sub up if you haven't. \nI'll see you guys in the next one. Peace.",
    "start_time": 0.16,
    "end_time": 1699.6
}