{
    "video_id": "hZmwcwm0qNo",
    "channel_url": "@jesser",
    "transcript": "These six people are all claiming to be NBA \nplayers, but only one of them is telling   the truth. And we got special guests in the \nbuilding, NBA Hall of Famer Dwight Howard,   to help us out. What's up? What's up? All right, \nlet's bring out the NBA players. All right,   I already know who's not. Wait, who's not? Number \nthree is obviously not. Yeah. Like, bro, come on,   bro. Over the next five rounds of voting, \nthe judges will have to collectively decide   who the secret NBA player is. If the players \ncan successfully trick the judges on who the   secret NBA player is, they will split a cash \nprize. But if the judges can successfully find   out who the secret NBA player is, you guys \nwin. And before we get into the questioning,   we're going to start off by seeing everyone's \njump shot. Number three, go first. You want   number three to go first? Hell yeah. Let three \ngo first. How much does a jump shot tell you?   If he can play or not, he probably going to throw \nit over the goal. Ooh, good to hand eye. He might   break the backboard with this shot, bro. That \nwas a strong dribble. Hey, but it's a bucket.   Okay. Okay. Okay. Okay. So, he has hoop. He s \nlike a football player. Boom. Boom. Roar. Dude,   he didn't even jump. I don't even went on \nhis toes. All right. Let's see a number one. He's capping. See, that's the thing. The NBA \nplayers, they're going to cap on their jumper   to hide. Number two. Oh, that was good. That was \ndecent. That was clean. That was a shot. That was   pretty clean. Oh, three's back up. The three. \nWait, he not. He hasn't missed a shot. Hey,   he might be like a Grant Williams or something \nlike [Music] that might be NBA player. He shoot   like he played a little bit before. Oh, number \nfive. Number five is just here for the vibes.   No, that's fake. He's not a lefty. \nNo, that did not look natural. Bro, his shoes are comp, bro. Those Katies \nare tough. Yeah, I've never seen those. Those   might be sent only to NBA players. Okay, now \nthat we've seen their jump shot, we can start   asking them questions. But first, let's go down \nthe line. Starting with number one. What team do   you play on right now? I'm currently overseas. \nWhat was the last team? I was playing for for   the Rockets. Before that, I was with OKC. Before \nthat, I was with Minnesota. Stop the cap. That's   a lot of teams. And now he oversees in Spain. Who \nyour favorite head coach of all time? Brock Brown   for sure. I 76ers. Brown. That's a old That's old. \nThat's an older player. Okay, let me see. Oh, hey,   he just believed in me. You feel me? Number \ntwo, what team are you on? Utah Jazz. No, no,   dog on Utah Jazz. He lying right here. What? What? \nWhat? What year? Second year. Second year. Okay.   Okay. Okay. Number three. I'm overseas right \nnow. He in the military. He That's why I All   right. Overseas right now, but what NBA team did \nyou play on? I played with the Suns. What year?   Two years ago. What's the best game you had with \nthe Suns? Against the Clippers. I dropped 20. Who   was Yeah. Who was Guardians? PG. PG. That's a good \ndefender. No, no, no. I was just saying that out   loud. But he is a good defender. That was a joke, \nman. I was trolling. Number four. Who do you play   for? I'm currently a free agent. Who did you \nplay for? The Knicks and the Memphis Grizzlies.   Who was your teammate at Memphis? I had a lot of \nteammates. Name one. I had uh a lot of teammates   to play with. Jesus Christ. He don't know nobody \non the team. I got I was in and out. I mean, you   still would have known something. Were you even in \nthe stadium when the games were playing? Wait, but   when did he when did you play on Memphis? When I \nplayed for Memphis, 2017. 2017. Okay, that checks   out. Okay. Number five. What team do you play on? \nAtlanta Hawks currently? No, I retired. Retired?   Retired? Man, you 17. Retired? So, what year \nwere you drafted? 2022. And you're retired. Damn,   that sounds like my career. Why did you retire? \nI gave my life to the Lord. I knew that was him.   I knew it. That was the one. I know how to see \nif it's really him. I'mma ask him a scripture.   I'mma test him right now. Philippians 4:13. I \ncan do all things through God who strengthens   me. That's not what it's close, but you're right. \nThat checks out. I had to look. I didn't know. I   had to look. I didn't know. All right. Number six. \nWhat team do you play on? The Pacers. The Pacers.   What year? 2015. 2016. 2016. So, you've played \nagainst Dwight? Yeah. Have you ever guarded him?   No. He li You think he has guarded you? No. He \nHe not one of the basketball players. He out of   here. Excellent. Bro, why does number six have the \nArthur fist going? Right. He's mad. Why is he so   mad? Number six. Are you trying to crash out right \nnow? What's good? You all right? No, I'm chilling.   What's your favorite teammate? Paul George. Okay. \nDid you go fishing with Paul George? I did not.   But that was your favorite teammate. That's kind \nof weird. Who was your coach? Uh, was it um Nate   McMillan? He wanted his team to be a what type of \nminded team? A great team. Defensive minded team.   He doesn't know the coach. I don't know. That's \na That's us. Is there anyone else you guys want   to question right now? I want to see number six do \na a rip through step back going right fade. Okay.   Number six, are you cool making that move? You \nsaid rip through, step back. Yeah, step back fade. Was that NBA? It looked kind of nice to me. That \nwas some 2K. There was no step back. He playing   on PS5. Is anyone in particular sticking out where \nyou're like, \"This dude is 100% not the secret NBA   player.\" Number four, for sure. It's definitely \nnot. Why? Why? I don't know, man. He can't even   name a teammate. Not a single teammate. Can you \nname one teammate? Marcus. Marus. Marus. Okay,   that's how Hold up. Hold up. Hold up. Let's go \nback to that team. 2017. Go like this. Show your   hands. You had to have been in a lot of fights \non that team. No, he ain't got no His knuckles   is not ass. He ain't been in no fights. Well, I I \ngot a question for you. Number four. What was it   like playing against White? He ain't playing \nagainst me. Me, real physical guy. You know,   dunks the ball. I'm telling you, he I don't know. \nI feel like he could just be straight lying,   though, bro. He ain't never played against me. You \ndidn't play that much. You know what, boys? It is   time for a vote. Starting with Sean. Who do you \nthink is not the secret NBA player? Number four.   You got to You got to get out of here, man. I'm \nsorry. You don't. You just don't hoop like that.   One vote for number four is Zach. Six. Dwight. \nMan, three. He can't be. Okay. One vote for three,   one for football player, bro. One for six. Hey, \nhe didn't miss a shot, though. I got to go six.   It's just like just the body language. Like, \nif you're an NBA player, bro, like you're an   actor. I got to give you that. Mitchell, who do \nyou think? Yeah, I'm voting number four. Okay,   so we have two votes for number four. Two for \nsix, one for three. So, that's a tie. Dwight,   you had number three. You're going to have to pick \nbetween four and six to break the tie. Played with   Marcus Saul. He ain't played with Marus. He \nplayed with Paul George. He ain't played with   Paul George. I'm going to go with six. Okay, \nthat is three votes for number six. The judges   think you are not the secret NBA player who's \neliminated. He's literally an NPC. I swear those   were fake KDs, too. I've never seen No, that's \nwhat I'm saying. Like to start off round two,   we're going to have each of them do their \nsignature move. I want to see number one guard   number three. Oh, so you want number three to do \nhis signature move against number one? Yo. Oh,   he's going to the post. He can't play. No, he is \noutside. He is outside. No, the post is crazy. Oh, that's a crazy signature move though. The \npost tween fade. Number one. Let's see your   signature. [Applause] Number three. Oh my god. Oh \nmy god. Oh my god. Oh, got step through. I didn't   like the way he was moving his body, though. Oh, \nthis is this is getting tricky cuz number three   does not play defense like a basketball. Yeah. \nNo. Number two, let's see your signature move. Oh,   nobody. He don't need nobody. He going to mess up. \nWatch. That's his signature. Okay. Oh, he got a uh   generic 2K. Yeah, that was a 2K floater. That's a \nnonchalant NBA. That's nonchalant. And he did it   smooth with the left. Can you do your drop shot \none time? Is he lefty or righty? That's a fake   left hand. That's fake lefty. That's a lefty. We \ncaught it. We caught it. He's top on the list of   NBA number two is at the top right now. We going \nto keep number two on there. Number four. Let's   see your signature. I don't know. Oh my god. Oh \nmy god. Okay. Oh my god. Wait. Uh, number four. I   have a special task for you. Can you jump as high \nas you can to touch the top of the backboard for   me? He did not play for Memphis. Was he faking \nhis jump though? That's a good point though.   Okay. Number four should do should play defense. \nLast player to go. Let's see your signature move.   If four if you could guard him. Okay. Okay. \nTween tween. Step back with the lefty. What a   fake left. He's not left-handed, bro. Can we see a \nright-handed shot from five? A come on, bro. Maybe   he is a lefty. I don't know. That sold me low \nkey. All right, we'll go down the line starting   with number one. Tell us your favorite NBA memory \nor moment. Could be on the court, off the court,   whichever. Honestly, it's just the road trips, \neating eating with the fellas. You know, I've   actually heard this answer a lot. Do you have any \nspecific like times going out? Nah, not really.   Favorite city? Houston. Who are the boys to you? \nuh with Sixers. Hung out with Be a little bit and   B don't go out. He capping. He cap right here. \nI mean, I just went out to eat with him. I mean,   hang out like we didn't go out. He did say he \ngoes out with him. He said hung out with the boys.   What's Embiid's favorite video game? Fortnite. He \ncapping, bro. He lied like he played FIFA, man.   I'm telling you. I was do your homework. Number \none. Hey, this was 2017. That was peak Fortnite.   I'm just saying. True. That's peak. That was T49. \nAll right. Number two favorite NBA moment. First   point preseason against the Washington Wizards. \nWhat was the move? Aliu. Who you score on? It was   nobody. Was on the break. That's your favorite \nmoment. Number three. Favorite moment. Down   payment on mom's house. Ooh, that's a good one. \nThat's not a moment, bro. What about on on the   court? On the court? No. Family coming to see me \nplay out in LA. What's your favorite like bucket   you've ever had? KOC favorite bucket was coming \noff the fade screen against Clippers. Y'all do   know he played for OKC. Played for the Clippers. \nReggie Jackson. He got the Reggie Jackson bill   like that. Yes, he was. I don't remember Reggie. \nYou even see number three. What years would were   you active? Uh two years ago. I was in the league \nfor two years for the Suns. Well, he he had that   weird um signature move, right? How often you uh \nyou pulling that out in practice? Always. Never   in game. What was your role in game? Like as a \nplayer, what was your role? Shooter. Three and   D. You look like Desmond Bane. That's what I'm \nsaying. That's what I'm saying. His arms is too   long. Desmond Bane arms coming to his three. Okay. \nNumber four. Playing 101 versus D Rose practice.   You don't like that moment? That's a moment. D \nRose, that's my favorite player. Wait a minute.   Dro his favorite player, but he couldn't name \nhim. No players when we was talking about Memphis.   Thank you. All right, Dwight. What was your \nfavorite NBA moment? How would you answer that?   My favorite NBA moment was winning a championship. \nNot saying I'm going to buy my mom a house. Any   memorable preseason games, Dwight? No, it don't \ncount. Five. What's your favorite NBA moment?   Either when we made the plan or my career high \nagainst the Wizards last year. How many? I had 25.   Who was guarding you? Cool. What was your typical \npregame routine? Start with one. Mine was we,   you know, the morning breakfast. I did yoga. \nPersonally, I did lots of stretch and prep   stuff. There's, you know, practices, there's the \nfilm, um, and there's, you know, the pregame meal.   What's your favorite pregame meal? Uh, I keep it \nlight, so I usually do like a like a steak salad,   chicken salad. This is what I think about that. \nCap cap cap. Yes. His morning routine. He capping,   man. How you going to do all that and go to \npractice with the team? That's not what the   team do. I'll just tell you what I personally \ndo throughout the day. All right. Five. What's   your pregame routine? Shoot around with the team. \npregame meal, prayer session, head to the arena.   I don't know, man. This is getting tough. I don't \nknow, bro. What about for what's his pregame? Wake   up in the morning, stretch, watch film with \nmy opponent, and go to walk through and then   go get ready for the pregame. Let's get four out \nof here, guys. You want to get Oh, no. I've been   saying that. Let's go to a vote. Mitchell, who do \nyou think is not the secret NBA player? Locking   in number four. I'm going for four. That's three \nvotes for number four. Four. Yeah, easily number   four. I said that last time. Last time. So, that \nis five votes for number four. They do not think   you are the secret NBA player number four. You \nhave been eliminated. Thank you for playing.   And we are now down to our top four. Is there \nany particular thing on the court you want to   see? I want to see all of them do a three. A deep \nthree. Yeah, we going to start with number three.   We going to start with number three. You want \none more? No, I'm good. I seen it. I seen enough. I think he faking, bro. He capping. He capping. \nHe ain't even shooting right. Did he shoot that   with the right or left? He shot that with \nthe right. [Music] Y'all think he's a lefty   or y'all think he's capping the left? I have no \nidea. He hasn't made a shot with either hand. He don't He don't shoot the ball at all. \nI need him to shoot it again. Let me see. He wanted us to think he can shoot. Number one, \nwhat position do you play? Five. All right,   let's sit bad down. Let's sit bad down. Let's \nask a question to all of them for this round.   Who's been the hardest player to guard in \nthe NBA for you? My personal teammate was   Embiid. Like I I had to go day in day out in \npractice with him. And besides, I didn't get   a lot of tick on the court. So, what's what's \nEmbiid's favorite drink? He drinks milk. Milk.   Wrong answer. It's Shirley Temples, bro. We all \nknow it's Shirley. Who is MB's personal trainer   for basketball? That's crazy, bro. He's got \na book. What team did you play for in Spain? [Applause] He got his [Applause] That's why \nyou don't even look at it when you say it,   huh? All right. Well, number one, what's your \nrebuttal to that? I'm going to leave it with   y'all. Okay. Okay. Okay. He didn't know. \nHe ain't know the feeling, man. Got it. So,   number two, who's the hardest NBA player to guard? \nKevin Durant. How do you stop him? There's no   stopping him. We figured it out. I know what to \ndo to him. What do you do? You got to brush his   hair. He don't brush his hair. Mess him up. He All \nright. Number three. Hardest player to guard. KD   in practice. KD in practice. What? Why are you in \npractice? Well, he's on his team. He never had to   guard him. All right. Number five. Tatum. Tatum. \nTatum. Why Why is Tatum so hard to guard? Just   versatile. He does a little bit of everything. \nWhat about Jaylen Brown? Nah, he one way. Send   him one way. That's crazy. No left, man. Okay, I \nthink it is time for a vote. Before we vote on the   next round, I got to show you guys something we've \nbeen working on for the past year. Check this out.   Boom. It's the greatest basketball bag ever made. \nThe Bucket Squad iso backpack has everything you   need as a hooper. It has a shoe compartment \nthat can fit up to size 15 shoes. It has a   hidden pocket that makes a basketball holder so \nyou can hold your basketball shoes. You can hold a   ball and you still have so much space in the main \npocket. It can even hold your laptop. You could   use it for going to school. It has enough space \nfor travel. Literally everything you need. This   is the greatest basketball bag ever made. It's \nout right now in two different colorways. So,   if you're a hooper or going back to school, make \nsure you guys get one of these before they sell   out at buggetsquad.com. All right, let's vote. \nDwight, do you want to start us off on this one?   One is out. One vote for number one. One. One. \nTwo votes for number one. Three votes for number   one. One. One. One. Okay, that is five votes for \nnumber one. They do not think you are the secret   NBA player. We are down to three. All right, \nnumber one. We'll see you in Spain, my boy.   And all right, we are now down to three players. \nAnd remember, boys, we've already voted off three.   One of them could have been the secret NBA player \nfor this challenge. What are you thinking, Dwight?   I want to see how they ones looking against who? \nAgainst me. Okay. I ain't going to even lace them   up though. I ain't going to even lace them up \nthough. Defensive player of the year. Shoot.   Get my LeBron shoulder struck. Number three. \nOkay. Oh, let's go. Oh, I like this. Here we   go. I don't know how we let three last. Yeah. \nCome on. Let me see that jump shot. Okay. Yep.   He out. Put the X on there. Football is He is not \na hooper. I'm telling y'all who it is, too. Let's   go. Let's go. Two. So, you think the secret NBA \nplayer is two right now? I know two ain't going   to do [ __ ] Yeah. Let's see. Come on. Come on. \nCome on. Yeah. Yeah. Okay. Okay. Okay. Okay. I mean, it is Dwight Howard. Let's go. Five. Okay. \nHey, hey, look. NBA right there. Look, it's him.   That was all you needed. That's all I needed. It's \nhim. Let me see a jump shot again. Okay. Yeah,   he got the NBA bill. No, five actually. Mike, \nlet me ask guys going down. We'll start with   five this time. What was your like welcome \nto the league, welcome to the NBA moment? Um,   I want to say probably when we played the Celtics. \nI said that was my first one. Like this I'm here.   Is that your first game? Yes sir. We got blown \nout. He didn't play in a blowout. Is crazy. Yeah.   How's that? Welcome to the league. Wait a minute. \nWait a minute. Why didn't you play opening game?   So he played two years in the league. His first \nyear he didn't play at all in the blowout and   his second year he scored 25 and then he's not on \nthe team anymore. Well, he did say the personal   reasons. He wasn't forced out of the league. I \ngave my life to the Lord. That was a really good   story. But I got a good one for number three. \nY'all ready? I'm ready. Number three. Get ready   to catch his ball. Here we go. Did he just spawn \na football? Where did he get that? Freddy saying   who? Football. He caught it one hand. Kawhi \nLe brother. One hand, bro. Say goodbye. All   right. No. Did you play football growing up? I \nplayed both at Baylor. Oh, starting tight end   and starting in basketball. I came off the bench \nin basketball. Anybody else from Baylor in the NBA   right now? DaVon Mitchell. My boy Rico got picked \nup by the Cowboys. He went basketball to football.   Went football to basketball. Could you have gone \nNFL or only NBA? I got went undrafted in both. So,   I went undrafted. I was on the Bills for a bit \nand then got waved. And then I was on Phoenix   for a little bit. Now, I'm playing in Tel Aviv. \nHe's got his story locked. All right. I just got   hit with a curveball. I didn't think three was it \nat all, but now I'm starting to All right. Well,   what was your welcome to the league moment in \nthe NBA? Two. I got baited by Tobias Harris on   three different times and got subbed out real \nquick for fouling. Pump. Dude, I feel like he's   just studied his answer. Yeah, it's almost too \nperfect. I feel like How long you been acting for?   How long have I been acting? Yeah, \nabout 30 minutes. I know. Number two,   where'd you go to college? I didn't go to college. \nOh my god. You went straight to the league from   high school. I took two years off and then went \nto the league. Hey, he's capping. Either that's   the homie or he's pretending to be the homie. \nYou didn't go to secondary school at all. No. Boys, are you ready to make a vote? We learned \na lot of new information this round. We'll start   with Sean. I got to go number three. You just \ndon't look the part, man. One vote for number   three, Zach. I'm going number three cuz the story \nis just way too good. Two votes for number three.   He's too swole to play basketball. Okay, that's \nthree votes. Number three, Chris. Yeah, I think   number three is a trainer. Number three. Okay, \nthat's five votes for number three. Thank you for   playing. They do not think you are the secret NBA \nplayer. All right, number three. We'll see you on   the grid. All right, here's the football. Okay, \nand we are down to our final two. Are you guys   confident the secret NBA player is still here or \nyou think potentially voted him out? I feel like   he's still here, but I I just I'm not confident \nhe's here. It got to be one of the whoever it   was did the little one-on-one with the left. His \nfirst to the left was was efficient. Five wanted   you to feel like he was the NBA player, so he went \nhard. But number two was nonchalant. Every player   I'm metagaming here. Every NBA player has been \nnonchalant. We can have him do one more challenge   before the final vote. Is there anything you want \nto see on the court, you guys? Yeah, we need to   see a tween tween behind the back step back three. \nTween tween tween behind the back step back three. He playing with us. Yeah, that's what I'm saying. \nIs that NBA, bro? I feel like I've seen that   jumper literally like my like next door or some \nlike my neighbor literally shot like that. I swear   to God. Number two, what car you drive in high \nschool? Um, Charger. I seen the Charger outside,   too. I seen the Charger outside, too. That's \nNumber five. Let's see the tween tween behind.   Step back. Tween behind the back. Oh, hey. \nHey, hold up now. [Applause] He is a neighbor,   bro. All right, Dwight. Which one do you think is \nthe secret NBA player? By the way, they standing   five. Right now, Dwight thinks NBA player is \nnumber five. Can you guys demonstrate either   a tough layup or a dunk? Your choice. [Music] Got \na nice spin on the ball. Yeah. Nice touch. You're like, bro, like what are we doing? Two is him. \nHe's the player. Two is the player. All right,   guys. So, you guys are now going to vote who you \nthink is not the secret NBA player. Mitchell,   starting with you. We're going with number five. \nChris. Number five. Number five, Dwight. Reoli,   Noli, Pepsi, Coli, Lakers, and five. I'm going \nwith number five. That is three votes for number   five. Zach, I got five on it. Dang. I just \nwant to be different. I'm going number two.   They think number five is not the secret \nNBA player. You have been eliminated. Now,   we are going to bring out all of the \nplayers and see if the contestants won   or the judges won. All right. So, you guys \nhave collectively agreed that you think the   secret NBA player is number two. Now, will \nthe real NBA player please step forward? No way. No way. No. Number two was the \nreal NBA player. Before you reveal,   I got to make sure you are my \nold neighbor, Kenya Martin Jr. You got it early. You got it early. \nI knew that jumper. I told you. Big   shout out KJ coming through. Big shout \nout to Dwight. Everyone in this video,   if you want to see some other guess the secret \nNBA players, they are popping up right here.   Subscribe if you haven't. We'll see you \nguys in the next one. Peace. Peace. is.",
    "start_time": 0.16,
    "end_time": 1429.1999999999998
}