{
    "video_id": "zotQuz9P4pA",
    "channel_url": "@likenastya_show",
    "transcript": "[Music] like Nasha here. [Music] >> Who's there? >> Girls, come on. It's camping day. Okay, girls. Come on. Let's get ready. >> Yeah. [Music] [Applause] Oh my god. So preppy. Sophie Dossy. [Music] Mhm. [Music] [Applause] [Music] >> What a beautiful day for camping. >> We're ready. >> What are you girls wearing? >> All camp stuff. Duh. >> Yeah. >> Come on, girls. Let's load the car. Let's go right now. [Music] Okay, girls, make sure to buckle up. [Music] [Applause] [Music] Come on, girls. Ah, so beautiful out. [Music] >> Oh no, I broke my heel. [Applause] >> I hate mosquitoes. Mr. Tree, how's it going? >> Come on, girls. Hurry up. [Music] >> Seth, we're tired. When are we going to get here? >> Yeah. Oh, come on. >> Okay, fine. You know what? Let's set up camp right here. Finally, [Music] perfect. [Music] Finally, I can change my outfit. I'm not a Disney princess anymore, but at least I'm free. [Applause] So, girls, what are you going to eat? >> I don't know. Just like I'm going to order pizza or something. I don't know. Done. Now I want to relax. Pizza delivery. See, set. I told you it worked. And none of it's for you because you didn't believe in us. I'm starting to like camping. >> What just happened? Maybe I can use this. Oh no, poison ivy. That was not a good idea. [Music] I found a whole plate of blueberries. Maybe I can make a juice out of it. [Music] This isn't blueberries. [Music] Oh no. Do not eat unknown berries in the forest, guys. Where are we supposed to sleep? >> So yummy. [Music] Pizza. What? [Laughter] Hey, you still have your pizza? [Applause] >> Guys, Steph, help. Help, help. We don't have a tent and we don't have any food. Help. >> I have an idea. Um, Aubrey, how about you rebuild a new tent? Mandy, you find water and Nastia, you find something to eat. >> Okay, let's go. >> Yeah, you can do it. [Music] [Music] Tada! [Music] Now is perfect. Oh yeah. H I think I got an idea. So, let's see if this idea works. Now we have a new tent. >> It's time to eat. Give me back my snacks. >> Yes. Give me back them. >> Huh? I'm scared. [Music] >> Here. I brought you your water. >> All right. Let's give it a taste. A quick taste of what? Gross. [Music] >> There's water right here. [Music] >> Yay. Okay, girls. Challenge is complete. So, now it's time for a scary story. Once upon a time in the dark, huge, scary, creepy forest, there were three friends just like you guys. We decided to go camping and go on a >> bear or something. >> We're so scared. >> It turns out they will never see ever again because a hairy scary monster fell from the treetops. [Laughter] [Applause] Bye. >> Great job. >> Oh, this is an old friend of mine. I love camping. >> Give me my play button back. [Music] It's a magic portal. Maybe we shouldn't go inside. No, I don't care. I need to get my play button back. [Music] >> Wait, what? This is so small. We can't fit through the door. It's way too small. >> Drink me. You know what? Maybe don't do the black one. Maybe you can do the red one. No, it's okay. Evelyn, what is this? I told you not to grab the black one. Here, I'll try. I'll try with the red. >> Why are my ears so big? It's okay. Now you hear better. I'm going to try another one. That's not a good idea. The mystery is okay. See, nothing happened. My nose wasn't done. Okay, fast, fast, fast. I don't need this nose. >> Oh, just glasses. Just glasses. >> Um, look at this nose. >> You know what? Maybe we should try it on the bear. >> Yes. Here. >> A lot. A lot. >> I told you not to do the black one. Look what happened to my teddy bear. Okay. Okay. Okay. Let's Let's grab I did a purple. Purple didn't work. We did purple. Do the green. It worked. Yes. Then we have to use this on us. Okay. Are you sure it's going to work? >> Yes. >> Okay. Am I pranking? Do we look any smaller yet? Come on. [Music] >> It's all upside down. Oh, hello my dear. >> Have you seen the rabbit? >> He just passed by. >> How do we get up there? I mean down there. I mean wherever you are. Yeah. >> You need to find the key for this car. >> Please, please, please. Come on. Come on. Come on. Be the ball. Think like the ball. It's your last shot. Don't overthink it. >> Hooray. Well done. >> Come right here. >> How do we like this? Wait. Maybe this key. >> Now you can go. >> Okay. Come on. >> Wow. Where are we? >> It's so pretty. >> It's the rabbit. >> Evelyn, it's a cat. It's a giant cat. >> Rabbits have long ears. >> Oh, okay. Mr. Cat, do you know how we get out of here? >> I lost my crystals. Help me find them. >> Okay. Where are they? Where they Where could they be? I'm not here. I found it. >> No. No. If I was a crystal, where would I hide? Maybe, you know, in the bushes. How didn't I find this earlier? >> Evelyn, I found two crystals. Come over here. H. Where are all the crystals? No. The crystal. I found it. We need to find the last crystal. Yeah. H maybe over there. What's in there? Is that a crystal? I think. Let's get it. We got it. >> Yay. Good job. >> Finally, we did it, Mr. Cow. We found the crystals. [Music] >> The key. Finally. >> Come on. >> Okay. >> Yes. >> Yes. >> Oh no. Are we stuck here forever now? >> H I don't think so. Here's Ty. It's right there. Oopsies. [Applause] [Music] Oh, it's in the middle. How come? Kitty kitty. Come on. >> Come on. Come on. Come on. >> Where are we? I don't know. >> Look, there's the rabbit. No, no, no. Not so fast. First, let's play with me. >> Okay. [Applause] [Music] Yay! Yes! [Music] Yes! [Music] I win. I got this. [Music] >> Oh no. [Music] >> Yes, we win. >> Nonsense. You can go. Yay. Wa! What is that? [Music] >> Whoa! It's fine. We're good. Yeah. Come on. Quick. Hey, wait. My leg is You have my play button. >> It's not a play button. It's a cake. >> You can look for yourself. It's a cake. >> Have tea with us, girls. >> Sure, why not? [Music] Next video. [Music] [Music] Huh? Hi Who wants to be a fashion model? [Music] Okay, let's start. You just follow me. [Music] Girls, this going to be your first task. >> What is What is that? What? [Music] You have only one minute to create your own look. Oh, yeah. >> But the light's going to be turned off. >> Who is this? Who is this? >> I don't even know what that is. >> This uh No. >> Why are the shoes? >> Whose hair is this? >> It's my hair. I'm sorry. >> Why is this fuzzy? I can't see anything. >> Oh, [Music] >> girls, time is up. >> No. >> Now, girls, it's time for a photo shoot. [Music] Okay, girls, you're all well done. Let's go to the next task. Okay. Okay. And now we're gonna do Z challenge. So, girls, choose your items. Uh, >> I'll take this. >> Uh, I will. [Music] >> Girls, it's a freeze task. You have to jump as high as you can and freeze in your best pose. >> Okay. Okay. Okay. I got >> I'm going to win. >> I'm so excited. No. No. I'm going to win. >> Let's jump around. [Music] [Music] Okay, girls. You all looked good. Now, I have a next task for you. Girls, it's time for high fashion runway. But before that, you have to create your own costume. >> Wo! >> Wo! What? There's so much stuff. [Music] Heat [Music] up [Music] here. [Music] [Music] girls, you all were really creative and did a great job, so you're all accepted. >> Yay! >> Woo! >> Hi guys. Today I'm working as a pet sitter. >> Hi. Okay, that was my first client. Got to go. [Music] Almost forgot. H. >> This is the place. >> Oh, cool. >> Here. >> First time. Found the alligator. Okay. Mhm. [Music] [Applause] It's time to trim his nails. >> Fantastic. >> All done. Bye, crocodile. >> Bye-bye. >> I'm hungry. >> What should I do? >> Okay, snow. So yummy. >> Oh, you're so cute. [Music] Leave. >> Bye-bye, Snowy. >> Let's go, T. Next time. >> Mhm. Let's go. >> What about these guys? >> No, not in our list. Mm-m. >> Sorry, guys. Next time. >> Go. Go. Go. >> Who else wants some? Baby goats. Come on, hurry, hurry. >> Hi, beauty rock. Goodbye, baby. I don't know the words. La. [Music] No. Mm-m. >> Oh, you sleepy head. [Music] >> Oh, no. Not today. It's not for me. No, no, no, no, no, no. >> Okay. [Music] >> Yeah. [Music] >> Hello. Hello. Hello. Hello. >> H. [Music] >> Don't spoil the hair. >> Mhm. H. He's so cute. >> We clear here. Mhm. Mhm. >> Hi. >> Hi. >> Thomas. Okay. [Music] >> Next test. [Music] Ow. Hello. Hello. Hello. If you want our If you want our service, you can make an appointment. >> Yes. Oh, no. Not in our list. No. >> Let's go to the next climb. >> Next video. [Music] Yay. [Music] [Music] M. So sweet. [Music] [Applause] [Music] A to-do list from dad. Banana, tomato, grape, and carrot. >> What happened? There's slime in my hair. Oh no, I know what to do. [Music] It's working. [Music] Hooray! >> Thank you. You're welcome. Bye. [Music] [Music] >> These are for you. >> Thank you. Hooray! [Music] >> What happened? I lost my dog. >> Let's find her together. [Music] This is her caller. This way. [Music] Thank you so much. Thank you. You're welcome. >> Yay. [Music] Hi. [Music] >> We will wait here. >> Thank you. [Music] Bye >> bye. >> Wow. >> Yay. [Music] >> Hey, >> thank you. Thank you. [Music] >> Thank you so much. >> Thank you. >> Thank you. [Music] >> Thanks again. >> Thank you. [Music] >> Thank you so much for helping me. Wow. Thank you. Always be kind to people and help because when you help people, they will help you. >> Like fast. >> H I want a new bag. >> I want a new toy. [Music] I need new makeup and candies. I ran out of money. I need to make some money. >> Yes. Coming right up. >> Wow. >> Wow. Wow. This job is really easy. >> Okay. Coming right up. [Music] Oops. Here you go. >> Oh, I have to go with you. No problem. Huh? >> Okay. M yummy. Hey, what about the money? [Music] >> Welcome to my own pet cafe. This is my first client. >> Hi. >> Hello. My cat wants a mouse. >> Sorry, but we don't have mice. >> Hm. We are leaving. >> Wait, wait, wait, wait, wait. I'm going to try to find mice. H. How do you get here? [Music] Uh, no. I don't know why this is mouse trap. I can use this. [Music] Aha. >> What? >> Oops. Sorry. This for you. >> Uh-oh. Mouse. [Music] Got it. >> We got a tasty mouse. >> This is too much. We are leaving. >> Oh no. Wait, wait, wait, wait, wait, wait. [Music] It's help needed. I think it would be the best job. >> Sorry, ducks. This is a dream job. Hi, let's start to work. [Music] What? >> You got to start from the very beginning. >> Okay. If I have to. [Music] >> This is not a dream job. [Music] Da, can you wash my car? >> Okay. >> Here is your money. >> Yay. >> I got an idea. [Music] Hooray. [Music] This is the best way to earn money at your age.",
    "start_time": 0.0,
    "end_time": 1991.5189999999998
}