{
    "video_id": "2FEpa1pyvIo",
    "channel_url": "@likenastya_show",
    "transcript": "like Nasha. [Music] >> Um, do you want to play a cardboard maze? >> Mhm. To win, you have to be faster than Mr. Hammy. 3 2 1 go. Mr. Hammy, go. >> Wow, he's so quick. >> Wow, everything is made of cardboard here. Come on, hurry up. [Applause] Have fun, girls. What's Mr. Hammy doing >> now? Let's see the girls. Now what? It's not so dangerous. Come on, >> Mr. Handy. Show your best. [Music] Wow, that was quick. Now, let's see if the girls are going to be quicker. >> Be careful. Okay, Luke. Let's try. [Music] >> It's safe here. Come jump. [Music] It's not so easy. >> Help me. Please help. >> Good job. Good job. Good job. You're almost at the finish. Yay. >> Bring it all. >> Yay. Let's go. >> Yeah. >> Yeah. [Music] Ew. >> Yeah. >> Yeah. >> Same for Mr. Hammy. Come. [Music] Mr. Hammy needs some help. [Music] Wow, he's so quick. And now to the other competitors. And this is my favorite level. Floor is lava. >> Floor is lava. Floor is lava. >> Wow, it's so hot here. >> Girls, figure out what to do. I'm going to check on Mr. Hammy. Oh, there he is. Come on. Wow, Mr. Hammy is so fast. Now, let's check on the girls. >> I will go first. Oh no. [Music] I have an idea. Cat. [Applause] Girls, you're doing so great. Now, let's check on Mr. Hammy. Now, let's see the girls. Yay! You go first. No, we go together. [Music] Yay! [Music] Let's see the next challenge. Oh no. I wonder if Mr. Hammy will do it. [Music] >> Mr. for handing me some motivation. [Music] This always works. >> Hm. It's not so solid. >> Come, come, come. >> Hooray. >> Let's see how Mr. Hammy is doing. H. Oh, there he is. He did it. What about the girls? Wo, we're running out of time. [Applause] Let's see the next task. Figure out what to do. Wait, let's check on Mr. Hammy. [Music] He did it. What about the girls? >> What? I know what to do. Go, go, go, go, go, go, go, go, go. Yes. Go. [Music] Come on. We're so close. Let's go. Okay, the last challenge will be impossible. [Music] Now to the other competitors. What are we going to do? I have an idea. [Music] Let's go. [Music] Looks like we have a winner. >> Congratulation, guys. You won. >> Yay! [Music] >> Mr. Hammy wants to celebrate with us. >> It's so cute. Next video, >> guys. Are you ready? >> Yes. >> Yes. >> Yes. >> Come in. [Music] Does anyone know how to help him? >> I heard the end. >> Okay, you go. [Music] Now open your mouth. [Music] H. [Music] >> Uhhuh. >> It's not healthy. >> Mom, make a healthy burger. Py. >> Okay. Yay. Here you go. Now, let's make it healthy. [Music] It's a healthy patty. It's a healthy tomato. [Music] It's a healthy cheese and healthy onion. [Music] Ketchup is not healthy. [Music] And this is a healthy burger. >> Yay. >> Thanks. >> Good job. [Music] Next, [Music] >> I allergy. >> A h. >> Now your turn. [Music] This will help. [Music] Yummy. Yum. [Music] Ah. H. Let's take a closer look. [Music] Yeah, >> marshmallows are not healthy. >> Mom, give me some strawberries. >> Okay. [Music] Much better. [Music] >> Wow. >> Yay. >> Thank you, Na. >> Yay. That was perfect. Yay. Next. Next. [Music] It feels bad. Okay, guys. Who knows what to do with this cute dog? I guess I'll have to pick. You go. [Music] This will help. [Music] Guys, help. [Music] >> Mom, we need water. >> Hold on. [Music] [Music] Yay! You need to watch what your pet eats because it's really important for his health. [Music] Come on, spit out your gum. It's not good for your health either. Thank you. >> Stay healthy, guys. >> Next video. >> Yay. >> This is our vacation house. Yay. >> Wow. Maybe we should play hide and seek. >> Evelyn. Evelyn. >> Evelyn, where are you? I have an idea. I'm going to hide from Master and she'll never find me. >> No. Uh, maybe in here. Wait. No. That's way too easy. >> Wait a minute. >> No. I have an idea. Okay, now she'll think that that's me. Okay, now I need to hurry up before she finds me. Wait, what's that? >> Hello. >> I just saw Evelyn like 10 seconds ago and now she just like disappeared. Maybe she's an alo. >> Mhm. >> Evelyn, what if something happened to her? What if someone kidnapped her? So crusty, dusty, and musty. If I was Evelyn with a brain of a teen, where should I hide? Definitely not here. Maybe here. I guess she's not in here. Evelyn, I call you. [Music] Evelyn, I'll find you. [Music] I think I hear a sound. [Music] [Applause] [Music] >> Wait, I found you. >> Finally. >> Thank you. >> Good job. Now it's my turn to hide. Okay. >> Three, four, five. Huh? This is a bad spot. [Music] >> I need to find the best spot. Maybe here. >> I'm going to trick Evelyn with this. H. [Music] Evelyn, I'm here. Nasta, I found her. Got you. You're not Master. This is a funny joke. Come on, let's go find her. Bye-bye, Na. We're coming to get you. Wait. [Music] [Applause] [Music] Nope. Found you. >> Finally. This was really fun. Yeah. Come on. [Music] [Music] >> Next video. I want that so bad. Yes. >> Enjoy your meal. >> Huh? [Music] Girls, what about cleanup? [Music] >> We'll do it later. Girls, you really should clean up after yourself. >> Can we do the later? We're too lazy. >> Garbage is nothing but trouble. Huh? >> Wait, what's happening? What's there? [Music] >> Cheese. Cheese. Cheese. Cheese, cheese, cheese, cheese. >> I think he's looking for cheese. >> H Let's give him some cheese. >> I will distract you >> and I will set up a trap. [Music] [Music] H [Music] >> no no no no. [Music] Uh-huh. Yay. [Music] Woo! Yeah! [Music] [Music] Again! some kind of garbage. >> We have to do something. >> Yeah, >> I know what to do. [Music] >> Hey, please [Music] catch him. [Music] Got you. [Music] I like that. [Music] I did it. Go for it. [Music] cash. [Music] [Music] Wait, please recycle. I just want to go home. [Music] A >> we need to help him. [Music] >> Huh? >> Welcome. [Music] [Music] [Music] Wait, what? Wait, it's right there. [Music] We can't catch him. We need help of a professional. >> I know someone. >> Uh-oh. [Music] A [Music] [Music] >> He did it. We have to clean our mess. >> Mhm. >> Yeah. >> Let's go. [Music] >> Remember girls, garbage is nothing but trouble. >> Bye >> bye bye. Next video. [Music] Hi. Who wants to be a fashion model? >> Okay, let's start. Newbies, follow me. Girls, this going to be your first task. What is What is that? What? >> You have only 1 minute to create your own look. >> Oh, that's easy. >> But the light's going to be turned off. >> Who is this? Who is this? >> I don't even know what that is. What >> this? Uh, no. >> Why are the shoes furry? >> Whose hair is this? >> It's my hand and I'm sorry. >> Why is this fuzzy? >> What? >> I can't see anything. >> Oh, [Music] >> girls. Time is up. >> No. Now girls, it's time for a photo shoot. [Music] Okay, girls, you're all well done. Let's go to the next task. >> Okay. Okay. And now we're going to do Z challenge. So, girls, choose your items. Uh, >> I'll take this. Uh, I will first. Oh, she [Music] girls. It's a freeze task. You have to jump as high as you can and freeze in your best pose. >> Okay. Okay. Okay. I got I'm going to win. I'm so excited. No. No. I'm going to win. >> Let's jump around. [Music] [Music] [Music] Okay, girls. You all looked good. Now I have a next task for you. >> Girls, it's time for a high fashion runway. But before that, you have to create your own costume. >> Wo! >> Wo! So much stuff. [Music] Heat. Heat. [Music] [Music] [Music] Girls, you all were really creative and did a great job. So, you're all accepted. Yay. Woo.",
    "start_time": 0.16,
    "end_time": 1851.88
}