{
    "video_id": "AundX-P8Ja0",
    "channel_url": "@likenastya_show",
    "transcript": "[Music] Like Nash Jam. >> I want that so bad. >> Yes. >> Enjoy your meal. Huh? [Music] Girls, what about cleanup? [Music] >> We'll do it later. Girls, you really should clean up after yourself. >> Can we do the later? We're too lazy. >> Garbage is nothing but trouble. Huh? >> What's happening? What's there? [Music] >> Cheese. Cheese. Cheese. Cheese. Cheese. Cheese. Cheese. >> I think he's looking for cheese. H. Let's give him some cheese. >> I will distract you >> and I'll set up a trap. [Music] [Music] H. [Music] All right. [Music] [Music] Uh-huh. Yay. [Music] What a fight [Music] [Music] again. Some kind of garbage. We have to do something. Yeah, >> I know what to do. [Music] >> Hey, please [Music] catch him. [Music] Got you. [Music] Now I have a problem. [Music] I did it. [Music] Catch you. [Music] [Music] Wait, please recycle. >> I just want to go home. [Music] A h we need to help him. [Music] >> Huh? >> Welcome home. [Music] [Music] [Music] Wait, what? What? >> Wait, it's right there. Oh no. [Music] Oh yeah. [Music] >> We can't catch him. We need help of a professional. >> I know someone. >> Uh-oh. [Music] [Music] [Music] He did it. >> We have to clean our mess. >> Um, yeah. Let's go. [Music] >> Remember girls, garbage is nothing but trouble. >> Bye >> bye. >> We're going to play hide and seek in secret room. >> Let's go. [Music] >> Huh? No, too small. Okay. Oh, there's a sofa. Um, let's see. A couch. It sounds hollow. Oh, I have an idea. Handyman. Handyman. Hello. I'm going to build a secret room underneath the sofa, and the handyman will help me. >> Bushes. That's a great idea. Maybe I can make a secret box that looks just like bushes. Handyman, I need your help. >> Okay. Okay, this is perfect. [Music] My plan is to build a secret room behind the fridge. And with the help of this camera, I'm going to be able to see where Nostia is. [Music] Any man, could you build a secret room behind this wall quickly? >> No problem. >> Okay, guys. I'm going to be building a secret room behind this wall right here. It's going to be a super cool spa room. [Music] Aha! [Music] Hey! Hey! Cool. >> This is a super cozy place to hide, but I wish I had some pets here. Handyman rabbits. >> I really hope Nostia won't find me. [Music] >> Okay, now this place is perfect. [Music] Yeah. [Music] Wow. This is perfect. This room is amazing for a secret room, but it does need a table, chairs, and some more supplies. Uh, handyman, can you pass me some furniture and supplies? Okay, boss. [Music] Okay, now my secret room is ready. It's like a restaurant in here. We have snacks, fruit, and drinks. Now I just have to hope Nia doesn't find me. Ready? [Music] >> Okay, let's discover what's inside. >> Wo, there's a lot of space. Nasia will never find me here. Okay, there is plenty of space here. So, I think I'm going to do something like a beauty salon or a spa so I can enjoy my time here. And the best part is I have the secret portrait where I can watch Nasta if she's near. [Music] All right, now the secret room is ready. [Music] I have the best secret room of all. Okay, so now it's ready, I guess. Um, wa! They cut a real hole in the couch. Oh, look down there. I'm going to go. Bye-bye. Wo! I love it. It's so good. [Music] open. Open. [Music] >> I guess nobody's here. What's that sound? >> I caught you. Hey Naelli, I found you. Na, I found you. >> Oh no. Well, look at my secret room. Isn't it so cool? >> It is. Wow. So, can you show me around? So, first of all, I have a PlayStation. So, then I can play like I can play games. Pac-Man. And then I have music. >> That's how I found you. >> No, the music. That's what gave me away. >> Mhm. >> Well, I have to go to find other people. >> Okay. Bye-bye. >> Have fun. >> Okay. >> They can be on the tree. >> Nobody's here. Let's go. Maybe I can track Nosia with this gadget. [Music] H I never thought there was a bush here. >> Mhm. [Music] You got found. So, what do you have here? >> I have a bunch of rabbits. >> A so cute. >> Don't you like rabbits? A baby one, too. >> Hi. >> So cute. >> Hi. So cute. >> I feel like this is the best hiding spot. >> Yeah, it is. Just if that camera wasn't here, everything would have been fine. Maybe in here. Nastia's looking for me in the kitchen. Let's see the footage. Nope, it's not there. Hopefully Nostia doesn't find me. I need some water. So tired. I got you. >> I found you. >> No. How did you find me? >> I don't know. I wanted water. So, what do you have here? >> So, we have a huge plate of fruit, some cereal, some drinks, and some marshmallows. This looks so delicious, but got to go. Bye bye. What have we got here? Wait a minute. H. Let's see. Uh-oh. So, what do you have in there? Well, I got a spot. Want to come in? >> Yeah. Well, how? Uh, one sec. Where is she going? Right here. Oh, hi. I guess I'm going in there. All right. Is this the best secret room? Yes. I love it here. Good. Uh, you weren't supposed to do that, but okay. [Music] I had so much fun here, but we have to go to the others. Come on. >> Uh, okay guys, I'm here. >> Now, see which room I was chill guys, >> calm down. I think the most awesomest room was >> food room. A >> high five. >> Wait, Nia, what's the prize? The prize will be in the next video. Bye. >> Hi guys. Today I'm working as a pet sitter. >> Hi. Okay, that was my first client. Got to go. [Music] >> Almost forgot. >> This is the place. >> Oh, cool. Here. >> First stop. That's the alligator. Okay. Mhm. [Music] No. >> Hooray. It's time to trim his nails. Oh, >> fantastic. >> All done. >> Bye, crocodile. >> Bye-bye. >> I'm hungry. >> What should I do? Okay, >> so yummy. >> Oh, you're so cute. [Music] It's time to brush your teeth. >> Mhm. >> Bye-bye, Snowy. >> Let's go to our next time. >> Mhm. Let's go. What about these guys? No, >> not in our list. Mm- >> Sorry, guys. Next time. >> Little ghost. Thank you. >> Who else wants some baby? Go. >> Come on. Hurry. Hurry. Hi, cutie. Rocky, baby. I don't know the words. La. [Music] No. Mm- >> Oh, you sleepy head. >> Oh, no. Not today. It's not for me. No, no, no, no, no, no. >> Okay. [Music] Yeah. [Music] Hello. Hello. Hello. Hello. H [Music] >> Don't spoil the hand. >> Mhm. >> He's so cute. >> We clear here. Mhm. >> Mhm. >> Hi. >> Hi. Thomas. Okay. [Music] >> Next test. >> Ow. Hello. Hello. Hello. If you want our [Music] service, you can make an appointment. >> Yes. >> Mhm. >> Oh, no. Not in our list. No. >> Let's go to the next crime. Next video. >> I am a detective daddy. >> I'm a detective master. >> Attention. Attention. Panda. Wanted. Panda wanted. Attention. Attention. Bandit wanted. Bandit wanted [Music] H. >> They're there. >> Okay. >> Hey, Marie. >> I did nothing. What are you doing? Huh? Huh? Move [Music] [Music] there. Attention, attention. Panda wanted. [Music] >> Attention. Attention. Commander wanted. [Music] Oh, there. There. Oh, okay. [Music] >> Police. >> Hey, I didn't do nothing. I'm just trying to repair this locker. >> Are you breaking into the house? >> No, I'm trying to repair the house. Uh, >> stand still. I got to do my job. [Music] >> I didn't do nothing. I am not a guilty. >> Stand still. >> Huh? >> Who's that guy over there? >> Stop talking and stand still. >> Get inside and stay in there. >> H. Attention. Attention. And it wanted and it wanted. >> Come on, let's roll. [Music] Hey, stay where you are. >> What are you doing here? >> I can explain. >> Oh, it's terrible. >> Ew. >> We have to collect evidence. [Music] >> E. >> Uh-oh. We're going to solve this mystery. >> I'm going to call my lawyer. >> Wait, hold on. >> One, two, three. Bingo. >> Take your seat. a lifetime. [Music] >> Let us go. >> Let us go. >> Let us go. Let us go. >> Let us go. >> Let us go. >> I make a hook and get the key. [Music] [Music] I think we're going to get to free her. [Music] >> You're not guilty. Wake up, please. Too much. >> All you do is sleep. >> I'm not guilty. It's a me to the tool man. I see. I'm not guilty. I can't show you. >> You see, >> I'm innocent. Look, I was doing my science project. You can't judge a person by how they look. Look. Ah. [Music] [Applause] [Music] Next video. [Music] Nice job. >> Yay. >> Okay. >> Wow. >> Boring. >> Hi everybody. Pull toys. Come here and get it. Cool. Pull toys. >> Hi. >> Hi. [Music] I want to buy this one and that one. >> Okay. >> Thank you. >> Yay. >> Daddy. Daddy. >> Uh-huh. [Music] >> They're too small. Dad. [Applause] [Music] You can't be so aggressive. [Music] >> Excuse me. I think you misunderstood. It's not the same. >> Yes. >> Yo yo yo yo. [Music] Thank you. >> Daddy. Daddy, can you please? [Music] >> Uh-oh. [Music] [Music] You need to use manners. >> Excuse me. This is broken. >> Yes. >> Maybe you want a water house. >> Uhhuh. [Music] What is this? >> Water house. >> Okay. >> You are so kind and polite. This is toys for you for free. >> Hooray. >> Thank you. [Music] Look what I can do. [Music] >> Wow. [Music] Guys, be patient and polite. [Music]",
    "start_time": 0.0,
    "end_time": 1841.05
}