{
    "video_id": "mr52VBug0WM",
    "channel_url": "@wbkids",
    "transcript": "Hi, folks. Daffy and I are searching for the lost temple of the monkey bird. We're going to bring home the treasure, fame, and fortune. And we going to pay off those parking tickets. >> And another. And another. And another. >> Oh, how much further, chum? We just need to follow this trail all the way to the Indian Mark X. Our trail lost. What are we going to do? We'll die in this jungle. Get a hold of yourself. You're hysterical. I don't want to die here. We'll never find the temple. Oh, there it is. There I was minding my own beef wax when he walked in. A real oinker. Curly tail and all. Oh, please. We got to help me, Detective Duck. Someone stole my p I pay the trousers and butt naked. Huh? Nice getaway sticks. I'll take the case. >> Oh, yes. Thank you. >> Sure thing, Buster. We're going to start with the best lead we got. You know, >> watch your inseam. >> I don't remember. >> Are you allergic to cotton twins? Now I want you to give me the straight poop, chubby. When's the last time you saw your pants? >> Oh, I I can't remember. But but this was in my mailbox this morning. >> Give me that. Dearest Porky. The thought of your caress brought your wrong letter. Here you are. >> Hey, it was just getting good. If you ever want to see your sausage casings again, leave 10,000 big ones at the corner of Button and Zipper. They're $10,000. Wait, where am I going to get that kind of dough? Why from the piggy bank, of course. Uh-oh. No. Hey, please be gentle. [Music] You can get me. Wake up. There's a fire. You got to get ring. You got to get a movie. Get trashed. [Music] [Music] [Applause] All right. All right. I'm up. I'm up. [Music] Woohoo! [Music] [Applause] Woo! [Music] Whoops. Too far. Fire's upstairs, boys. [Laughter] >> Ah, here's the problem. We should have hung a Louis at full land. [Music] >> Fire's down there, boys. [Music] Come on, Porky. Quit lounging around. There's fires to be fighted. [Music] Huh? [Music] Oh my goodness. [Music] [Music] [Music] Woo! [Music] If you huh? What? [Music] No. [Music] [Music] What is this? [Music] [Applause] [Music] I think I'm going to use the to set this one out. >> Oh, come on, Porkman. You made it this far. Just one little hop and we'll be back on the ground. >> No way. Quit badgering him. Quit badgering him. I ain't going. Okay. Okay. Suit yourself. Go. [Music] You believe that was a close one? [Music] [Laughter] [Music] Well, what do you know? Pigs can fly. Happy you decided to join me, Pork Chop. >> I even believe they didn't decide to do anything. We're connected to the We're connected. We're attached. Whoops. I forgot all about that silly tandem line. I'm going to freak out. Ah, come on. You'll be all right. Just don't look down. [Music] Pull yourself together. We've got parachutes, remember? And it's time to pull the cord. The rip cord. But right. [Music] Hey, I've been looking all over for this thing. Daffy, don't worry. I've got two more rip cords. Now, let's see here. No dice. It's got to be this one then. [Music] But Dabby, I was saving that for college. College. College. That's rich. College. >> That is so for the earn. >> Only idiots go to college. Now we give it the old eagle eye. [Music] Uh, you're going to reel him in. >> Good idea. Almost got that pan of silvering punk. Almost got him. Ooh. Quick, get the net. We'll be eating catfish for a week. Get it together. He's escaping. Huh? After him. Leave them for now. [Music] Hell. You first, pal. [Music] You know, and no curses yet. The map says to watch out for the booby traps, though. It looks like there might be people pretty clearly. Kind of a bad time for acupuncture. [Music] >> Ooh, a torch. >> Huh? A light switch. You know, I've been wanting to read this. H kind of crooked. Ooh. [Music] Nice to meet you, chum. [Music] Porky, look. It's the treasure of the Monkey Bird Temple. What's with all the banana peels >> and all these monkey bird monthly magazines? >> Whoever lives here is a real pig. No offense, pal. [Music] >> I've been bitten by a snake. You'll have to suck out the poison. >> Is the suck poison? >> Hurry, ch everything's going dark. >> The poison's rushing to my head. Hurry. It's all over. I'll save you, Bobby. Keep Put your back into it. Okay, I got the treasure. Let's go. Uh, whose leg is that? [Applause] fungy bird. Have a good one, Dappy. Yeah, yeah, yeah. Sounds good. My keys. I can't find my the my car keys. I I can't be late for work today. Where did I leave my keys? Hey, Porky. You mind? I'm trying to watch TV. Oh, worry. Don't worry. All right. All right. I'll help you out. You, my friend, are suffering from foggy memory. Maybe you're right. >> Yep. But don't worry. It happens to the best of us. See? So, you'll help me easily find my keys? >> Absolutely. You just need a little mental massage, you know, to joge your memory. You remember where you left your teeth now? >> In it now. >> All righty then. Let's dig a little deeper and get those neurons of firing. Getting anything in it? No. >> Hang on. Let me see this thing. >> All right, Porky Brain. Where's the keys? Come on. Throw the beans. Well, so much for that. We'll have to try a different method. Come on. All righty. What are you doing? >> Retracing your steps. Uh-huh. Mhm. Mhm. Uh-huh. Mhm. Mhm. Uh-huh. Mhm. They seem to be coming from the front door. Well, and now that you mention it, I did walk through that door when I came home from the lodge meeting last night. Then perhaps we should pursue the front door key rack. Okay, let's see here. Let's see. H skeleton key, Florida keys, piano keys, monk keys. What else you got here? What else you got? That's not it. Also not it. Nope. Nope. Nope. [Music] n. It has got to be one of these n no. [Music] [Laughter] No ice. Ah. Nothing like a joy ride. E, Porky. Dang it. You said it. >> Oh, no. It sounds like a flat tire. Well, guess I'll get out and change it. Hold on there, Porky. You've been driving all day. I'll get out and change it for us. Oh. Uh, thanks. Sure thing. And done. [Music] Daffy, come on. Take this seriously. Change it properly. You got it. Got to take this serious. Got to take this serious. Finally a chance for me to eat there. Just relax. [Music] Huh? [Music] Get me down. Right now, [Music] [Music] [Applause] [Music] I'm not a fireman. I'm a monster. [Music] All right. Axim check. Glamour check. Holes check. Dalmation. Dalmation. Ah, there's one. [Music] Good boy. [Music] Can't forget my coffee. All right. Which way is the fire? Take a right. Another right. Take another right. Annie, believe me, [Music] [Music] these little types sure are a doozy. [Music] What's with this thing? [Music] You disgust the unhygienic better shape up. Can you hear me? Sorry about that. [Music] [Music] Huh? [Music] I need a handy. I need a handy that plumber. [Music] Finally, a little will be your relaxation. [Music] >> Well, that was interesting. What do we do now? Well, I suppose we can open these things manually. Well, what do you know? No parachutes. [Music] [Laughter] >> Hey, wait a minute. What are we so worried about? After all, we're cats and cats always land on their feet. Not to mention their nine lives. Ely, we're not cats. Says who? Anthony Dy duck. A porky pig. It's in our names. Oh boy. Well, at least that building down there will break our fall. Thank goodness for that. [Music] [Laughter] Hey, I I made it. I made it. I survived my first skydive. Lee, I told you there was nothing to worry about. [Music] Oh my gosh. What have I done? Pory straight to me. Go uh without me. No, no. I'll never leave you. Oh, there he goes. [Music] Porky's pants. Stop. Fiend. Stop. Stop. Stop. The jig is up. Sweet pants. End of the line. Huh? The lethal leader hosen. Yesesh. Billy bootcut. Cargo shorts. Keller. A skinny jean skinner. [Music] Give me what's going on. Abby, where did you get all those pants? You mean they're not yours? Of course not. I've never worn be able to be your pants. [Music] >> Look at your face. You look like a complete idiot. Before you destroy us, I must say you have the most ravishing eyes I've ever seen. >> Ah, that beak. Your plumage. You're beautiful. You know, we've been going around for a while, and I was wondering, will you wear my Letterman's jacket? [Music] Always a bridesmaid and and never a bride. [Music] [Laughter] >> I always cry at weddings. Ooh, I love it. But you know, I bet it looks better on you with this ring. I wet. We made it. Let's see our treasure. A golden egg. >> We're rich. [Music] Daddy. >> Oh no. [Music] >> I guess this is the the curse they were talking about mentioned earlier. >> So after you came through the front door, what'd you do next? >> Well, I sat on the couch and the watch TV. Then they must be underneath that couch cushion. [Music] The kings probably fell out of your pants. Do you believe I don't wear pants? Then for heaven's sake, put these on. After all, children are watching. Anywh who, where'd you go after you sat and watched TV? I went into the kitchen for the late night snack. What kind of late night snack? Uh, celery sticks. Is that so? Okay. Okay. It was broccoli. Broccoli asparag. It was a pie. What kind of pie? K lime. Key lime. Key lime. Did you say Did you say key lime? That's right. And it all makes sense. Now you eat the keys. Now that's just ridiculous. There's no keys in a a key lime pie. >> Malar keys. Keys are the first ingredient in key lime pie. What are you doing? Just marking off the incision area. They need an incision area. Yeah, you know, so we can cut the teeth out. Even now, will you even stop? Now hang on. Evily. This is insane. >> Don't worry, buddy boy. You won't feel a thing. Well, what do you know? Ran out of gas. Fortunately, I always carry an emergency scalpel. I know it's in here somewhere. Let's see. Yo-yo, horseshoe, fabra, egg, uh, baseball, dice. Rubber chicken. Porky's key. Chompers and all my keys. I know. I know. As soon as I find my scalpel, we'll get to your keys. No. No. I mean, my keys are right here. Well, gee whiz. I forgot I was carrying those silly things. Hey, what are you pretel were you doing with my car keys? >> Relax. I was doing you a favor. I parked the car on the roof so it wouldn't get stolen. Pretty smart, huh? Maybe I should help. Well, first things first. I think it's stuck. >> I got your back. It is. It still won't budge. [Music] [Applause] Hey, is that a penny? [Music] >> Sure, Pork. You take a break. I'll get the spare. [Music] Thanks, chum. No problemmo. I'll take it from here. So, how's the cartoon today? Eh, not our best. Let's check the script. Porky says, \"Dad, Daffy, you didn't get the spare.\" Daffy, you didn't get the spare. Oh, why didn't you say so? Did you see that, Porco? I picked up the spare, but you threw our only other tire away. Now we have to put you patch up the old one, which I'll do by myself. Eye, thank you very much. [Music] See, you believe that's how it's done. This see the baby is ready to roll. [Music]",
    "start_time": 0.88,
    "end_time": 1662.54
}