{
    "video_id": "UMjznB-ZS_g",
    "channel_url": "@wbkids",
    "transcript": "Yeah, there we go. [Music] Uh-uh. It's not time for cake, little guy. Your party guests haven't even arrived yet. Of course, you are the birthday boy. I guess one little taste won't hurt nobody. [Music] That's my boy. Happy birthday, son. This is going to be your best birthday ever. [Music] Who's the loser? It's the cat. Yeah. Yeah. [Applause] [Music] I've been a terrible role model for my boy. >> I just said that, cat. You two are going to help me teach Dyke how to be a good sport, not a sore loser like his pop. Got it. Ah, what a beautiful summer day. The sun is shining, the boys are singing, and my son Pike is crying. Tikeke. Tyke, what happened? A thorn. My son has a thorn in his paw. Oh no. Oh no. Oh no. Somebody call the fire department. Call the police. The Navy. Wait. The first thing you do for a thorn in the paw is run it under cold water. No. That's for points. I know. Stop. Drop and roll. No. No. No. No. That's not good either. Breathe into a paper bag. Now breathe, son. Breathe. Nothing's waking. Somebody help [Music] now. Hold still, son. I'll get it out. You're all right. Now go along and play. But remember, be careful. [Music] This entire yard is a death trap and I can't stand by and watch my little boy get height. Now stay there and don't move an inch. We got to do something about this. [Music] A father can never be too protective. We're not done yet. [Music] I I can't believe this is goodbye. So long, old pal. I'll never forget you. [Music] >> I got to admit, the kids got spunk. Not too bright, though. [Music] Oh, I got a terrible cold here. That means you're watching Tikeke so as I can rest all recuperating like you make sure nothing happens to my boy or you're getting fist tata for lunch. Got it. Good. Okay then. I'm going back to bed. [Music] Come on, boy. You heard the vet. Until your cold is gone, we got to keep you quarantined. You don't want Tikeke to get sick, too. >> Don't worry, Spike. We made the garage all comfy. You and Tikeke will be reunited in no time. [Music] >> Cat, you got to help me. While I'm gone, you got to look after my boy no matter what happens or else. [Music] You got to look after my boy or else. Go ahead, son. You've got this. him. [Music] Yeah, that's my boy. >> Oops. Sorry, fellas. I'll keep my big mouth shut next time. [Music] [Music] Woohoo! Hiky wins! Na! Yeah! [Music] I need help. I'm going to fire up the barbecue. Tom and Jerry here are going to be in charge of the festivities. Have fun, boys. [Music] [Music] The next thing we do is to puppy proof the house. We got to lock the TV in a safe so that your delicate little brain isn't exposed to any violent cartoons. What else? Uh-oh. I almost forgot. [Music] Good. That's better. Come on, son. Oops. You need a little help there. [Music] Hey, Rocco. Look what we got here. >> Oh, he's a cute little guy. Ace, >> I admire your enthusiasm, son. But you ain't going to scare nothing with that, Bark. We could use a little help around this place. How'd you like a shot at being a real junkyard dog? All right, kid. >> Uh-oh. You're in trouble now, cat. >> I told you. Make sure that happens to my boy. [Music] What's that? [Music] A that's so nice at all. You guys are playing mailman like we do. No fist tata for you, cat. Nighty night. Unless my boy gets hurt. [Music] What's up? [Music] Oh yeah, my boy wins again. That's right. That's right. The cat loses. >> Go on. Put me someplace I can't interfere. [Music] >> Food's not going to be ready for a while, boys. What do you say you play some party games? >> Hear that? They want to play some party games. So, what are you two standing around for? [Music] Brother [Music] Ah! [Music] Heat! [Music] There. That should do it. Now you're all safe, little guy. Okay, I'm putting you two in charge of watching my Tikeke. I'm going to go inside and take a nap. [Music] Hello. Happy [Music] You ready for lesson one, Rocco? You know what this is, right? It's the junkyard strut. You got to walk around like you own the place. Show them how it's done, Rocco. Ah, you see now you try, kid. Yeah, that's it. Yeah, keep strutting. Kids got spunk. Not too bright, though. Let's move on to lesson two. You see that lazy cat over there? Let's try out that bark of yours. You got it. [Music] Well, kid, I hate to break it to you, but you got to be tough to live in a junkyard. I'll show you how it's done. >> You see, don't worry, kid. You can still hang around. We need a third for our game of catch. [Music] Hey, give it a rest, you ste. Me and my boy is trying to take a nap here. Got it. >> A What do you know, honey? Tyke's baby collar was in one of these boxes. Are you sure we want to sell it? >> Yes, we're sure. >> No, not the collar. I can't let him sell that collar. [Music] No time to play, boy. I need to rest up for the big sale tomorrow. [Music] >> All finished, honey. That was the first color I ever gave my boy on his first birthday. Happy birthday, son. [Music] [Music] [Music] You're not very good at this, are you? You mean old cat. I bet Uncle Jerry could get the splinter out. [Music] >> Hey, what's going on in there? Ike, you okay? [Music] Hello. Hello. [Music] [Applause] [Music] I did it again, didn't I? >> Hey, great idea. I'll just watch from out here. Better yet. Hello. [Music] Keep up the good work. Sounds bus. You're making some real progress. [Music] All right, open wide, boys. Close your mouth. You'll catch flies. [Music] [Applause] [Music] Heat. Heat. [Music] [Music] [Music] [Music] [Music] Wow, what a catch. I got it. I got it. I had it. >> Don't worry, Rocco. The next one's all yours. >> I got this one. I got it. Nice throw, kid. Is hiding something, cat? What are you up to? Playing cowboys with my boy. Ain't that the sweetest? Forgive me for thinking bad of your cat. It's just mean old cold talking. [Music] Oh, it's getting the best of me. You boys have fun. I need some shy. [Music] >> Look, chair. We did it. Splinter is out. [Music] Pocker purse, you owe us a thank you. [Music] Okay, Spike, the moment of truth. Hey, congrats, boy. You got a clean bill of health. Welcome back to the world. [Music] Watch this. Give me a hug, son. Hey, what gives? [Music] [Applause] [Music] Where do you think you're going? You ain't done yet. [Music] What's taking so long? The birthday boy wants his cake. [Music] Sh. [Music] again. [Music] What? [Music] Hello. [Music] Hello. [Music] [Music] Huh? What kid? [Music] Take hike. Hey, clean up. Stop. Stop. [Music] Come on, you mangy m. >> Oh no, they got Roco. He's a goner for sure. [Music] No, kid. [Music] Wait, the kid's still out there. What? Tikeke, you saved Rocco from the dog catcher. Oh, I was wrong about you. You got the makings of a real junkyard dog. [Music] What is that? [Music] Hey, the boy's never going to lose you two keeping them wet. >> Good gravy. I've created monsters. Those safety suits have made those guys think they're indestructible. [Music] [Applause] >> Well, at least we're okay. But what a dump. H. [Music] >> Go get him, Rocco. >> Not me. There's too many of them. [Music] >> Man, did you see those cats run? >> Son, you all right? Boy oh boy, did you scare those cats? I guess you must have been watching your old man over the years and picked up a few tricks. Thanks, fellas. On account of my appreciation, I'll send you something here. See if this will work. Remember that son? Your foist mail? Your foist stuffed cat. Oh, and look here. Your foist shoe. You better be paid up on all your nine lives, Captain. [Music] >> Great work, fellas. Your boat has my total appreciation. And seeing as I escaped from your high jinks unharmed for once, I'm not even going to beat you up for [Music] >> Oh, I love this game. On your marks, get set, go. [Music] We win. Oh yeah, team dog. We the champs. >> You know what I just realized? We're not sore losers. We're just naturalb born winners. And a Dalmatian don't change its spots. Now, who's up for a game of tag? >> Guess that means we're it, son. Where'd he go? When I find that cat, I'm going to pound him. I'm only going to pound him a little, Tiky Boy. [Music] You done good, Cat. Great to have you back, son. What do you say we go bark at some cars? [Music] Hello. [Music]",
    "start_time": 2.56,
    "end_time": 1806.3690000000001
}