{
    "video_id": "I86-2ZXDHD8",
    "channel_url": "@wbkids",
    "transcript": "Tomorrow's Halloween. >> I sure hope I didn't jinx this. >> Drop sugar. Now there's no rain. [Music] >> Like, wow, Scoob. This is shaping up to be the best Halloween haul ever. >> Yeah, trick or treat. >> Oh, Raggy, it's Ricky. >> Yeah, Tricky and Treaty. Our favorite candy related activities. >> No, I'm stuck. >> Like where, Scoop? >> Here. >> Around here? >> Uhhuh. >> I'll try ringing the bell. We'll just use our foot as leverage. >> Oh, a wagging war. Wait, is this what I think it is? H caramel. This house is made of candy. >> There's no way. And everything's going to be all so sweet. Oh no. I had you all. [Music] Did you? >> I did. You did, too. >> Happy Halloween. >> He's thinking what I'm thinking. >> Let's suit up. [Music] >> Yeah, these will work. [Music] >> Hey, looks like the gang wants to get a head start on trick-or-treating. There's something out there. I could have sworn I saw something big and creepy in the window. It was probably your own reflection. >> And there's another reason this year is special. Come on, Marcy. Don't be shy. Tell them. She's been crowned this year's corn princess. She'll be queen of the masquerade ball. >> Marcy, so exciting. >> Wow, that is so neat, Marcy. >> Neat. How very retro of you, Blondie. I like that. >> Well, I suppose we should all turn in. Got a big day tomorrow. >> Good idea, Dad. I'll show everyone to their rooms. The corn princess needs her sleep. Can you get the bags, Daisy? Thanks. Wow, looks like you can bench 220. Am I right? [Music] I saw some tables over here, Scoob. [Music] >> Relax, Scoob. It's just a prop. >> Oh, [Music] thank you. That's no prop. That's cornfield club. [Music] Uh, this might be one of those disruptions you mentioned. >> Allow us, Fred. >> Netg gun. >> You've done this before, have you? >> Mhm. [Music] [Applause] [Music] Quick scoop in there. [Music] Shoot, Fred. Shoot. >> I'm on it. [Applause] [Music] Like, who's running this runaway hay ride? [Music] Hey. I don't think this wagon comes with airbag school. [Music] [Music] >> I'm not sure what point you're trying to make. If you're going to be uphill on Halloween, then I'm going to have fun for you by dressing as you on Halloween if you decided to have fun by dressing as a zombie. >> Like, I actually followed that. The logic is impeccable. [Music] >> Fred, I get the feeling that there is more going on with you than you're telling us. >> No, Velma, I'm fine. It's just, you know, there's something about masks that just bother me for some reason. >> You know, maybe it's better we stay away from crowded areas until Fred chills out. >> Wait, you want us to go away from Candy? It can't be that house. It's impossible. >> This place looks like it doesn't get much foot traffic, which means >> more candy for us, guys. No. >> Like, you know, it doesn't look like anyone's home. [Music] The delicious smell of children's fright. There's nothing I love more on Halloween night. >> It's her. [Laughter] >> Fred, what's going on? >> Long story. Split up and draw her away from the people. [Music] Next time I say I'm not going out, I'm not going out. >> A hungry witch has trapped you here. Now it's time to taste your fear. >> What? Suddenly we're not good enough victims? >> Seriously, you're chasing them? Do my ears play tricks on me? You younglings dare to challenge me? >> Like maybe we didn't think this through. >> Don't die hard. [Music] [Applause] [Music] >> Pretty cool, huh? Ha! I got it at ye old costume shopppee. >> I can't wait to go trick-or-treating. Think of all the candy we'll get in 8 hours and 47 minutes. >> I just love Halloween. Don't you, Daffhne? I remember our first like it was yesterday. Evan and I didn't have much money, so our jacko'lantern was used. [Music] Then you just gently dip and turn. Oops. You got a little caramel on your cheek. >> Oops. My bad. >> Jinkies. This is incredible, Uncle Evan. I can't believe how crowded Banning Junction is. >> Amazing, isn't it? The legend has made this the best turnout in years. >> Oh, too bad it can't happen every year. >> Mayor Green, Elden Reed. This is my niece, Velma. She and her friends are spending the holiday with us. >> Everyone come quick. It happened again. [Applause] Who would do something like this? >> That's strange. The only tracks here are the ones we just made. >> But that's impossible. Everything leaves tracks in a corn field, even animals. It's like something just dropped down from the sky. >> Kind of freaky out here, huh? Scoo >> like stop you cat burglar. Like where'd he go? [Music] >> Shaggy, what's the matter? [Music] >> I thought you might need a hand with your luggage. [Applause] >> Like, I'm not sure we'll be staying. Right, Scoob? Absolutely. [Applause] Come now, we have a contract, Shaggy. This is your signature, is it not? >> Like, I guess so. >> Sure it is. We even witnessed it, right, Uncle Scooby? >> Uh, right, Bobby? >> Good. Now that's settled. Come, I want you to meet my girls. Ah, here's one of them now. girl. Like, don't be bad. That's no girl. >> What's wrong with Baddy? I'm Sabella, Count Dracula's daughter. Fantastic to meet you, >> Dracula's. >> Wow. A werewolf. Winnie the werewolf, to be exact. Come down and meet your new teacher, Winnie. >> Hello. Right. Goodbye. [Music] >> Hi, I'm Elsa Frankentine and I'm out of here. >> Come on, Rapid. But Uncle Scooby, >> I guess they're just anxious to find their rooms. They must be tired. They don't run like they're tired. >> Yeah. You'd think they'd never met a girl ghoul before. [Music] [Music] >> Now, like just to be clear, the plan is we work the festival during the day and then at sundown we all go out trick-or-treating, right? Of course, Shaggy. Now, why don't you and Scooby go work the crowd a little? See if you can lead some customers over here. >> And who's to say we don't find some succulent snuggage as well? >> Oh, yeah. >> What can I do to help? >> Oh, uh, why don't you put the guest book on the table? >> Fine. I hope I can handle that. Oh, I guess I can. >> Oh, and maybe open it so people are encouraged to sign it. >> Got it, Fred. It's not rocket science. >> Detectives here. Anybody need a detective? >> Hey, look. >> Oh boy. Oh boy. Oh boy. >> You know what? We've been working pretty hard, Scooby-Doo. Like, it couldn't hurt to stop for a healthy snack, right? >> No, sir. Not at all. Why is no one visiting our table? And just how are we supposed to compete with that? [Music] >> Three, two, one. Was [Music] that what I think it was? >> It sure seemed like a ghost. We have to tell the gang. >> Hold on. This could like seriously impede our chances of trick-or-treating. Dude, let's say nothing. [Music] >> Hey fellas, any luck finding new mysteries for us to solve? >> What? Oh, no. Not much going on really. Definitely no ghouls or ghosts lurking about. How things been over here? Like any big mysteries come our way while we were gone. >> Uh, what's wrong with Scooby? >> My good Scooby-Doo here is just so excited about Halloween. He can hardly contain himself. He stay on the O man. The ghost. >> Sorry, Freddy. >> Oh, I get it. You're just trying to keep our hopes up because we're not getting any bites. We'll just have to hunker down. If we stay put, I'm sure a new case will show up before too long. >> I'm here for you. Mystery Inc., [Music] >> are you guys seeing this? Oh, my wish came true. [Applause] >> Uh-oh. Like maybe we can get out this way. I hope so. But Uncle Scooby, why aren't we leaving? Don't you want to meet the rest of the girls? >> Like those weren't girls, Scrappy? They were ghouls. See what I mean? >> Hi, I'm Fantasma. Want to hear me play? >> Not bad, Fantasma. But do you know any rock and roll? >> Like no time for rock and we got to get rolling. >> Don't worry, Miss Grimwood. We'll find them. >> Quick in here. Like this looks like a good place to hide. Mommy, [Music] so so sorry we woke you up. >> Ah, I see you've met the youngest of my girls. This is Tannis, the mommy's daughter. >> Are they the new gym teachers? >> Yes, Tannis. We've been waiting for them a long time. >> Like it wasn't worth it. You don't want to eat us. We're just skin and bone. >> Red and bone. >> They're strange, Elsa. >> But they're in good shape, Fanty. >> Gee, thanks. >> Good shape for what? >> To teach us how to beat those Callaway cadets. Of course. >> Yeah, they win every time. I'll never get a trophy for my mommy case. We need a coach with spirit who can show us all the right moves. >> Well, uh, that's my uncle Scobby. He and Shaggy have more moves than a Russian chess player. >> Yeah, great. >> Don't worry, Tannis. We'll help you get a trophy or my name isn't Scrappy Doo. I'm so happy I can howl. In fact, I will. It's fantastic having you here, guys. >> The poor Johnson's. >> We could do something to help them, even if they don't want us to. Yeah, maybe you're right. We could like, who's that? It's the ghost. Like, run for it. [Music] I think we lost it. >> Come in. Ghost, [Music] >> ghost. Where? Where? >> Like we're talking about you. >> Who? Little lonely. Don't worry. I'm afraid of ghosts, too. You are? >> Oh, please, everybody. There are no such things as ghosts. >> That's right. You can't fool us, Red Herring. Now, take off that fakey mask. >> Huh? >> Is that really necessary? Chinkies, a visible free floating full torso ectopplasmic manifestation. >> Gee, and all this time I thought I was a ghost. [Music] >> Well, it's official. We're missing Halloween. >> Oh, come on. We can still have fun out here. Shall I tell a ghost story? >> No. >> No way. What's that? [Music] >> Is it the ghost? Is it [Music] >> Scooby? You scared poor Shaggy to death. [Music] >> Scooby, that's enough. We get it. And [Music] the scarecrow, it's alive. [Music] They're all alive. [Applause] >> Run. Head for that old barn. >> The doors. They're locked. [Applause] [Music] [Applause] >> The boys, look, [Music] >> they're robots. Someone must be controlling them with a remote. [Music] >> Like Scoob, maybe we didn't miss out on Halloween after all. [Music] >> Uh-uh. No way. >> Like, come on, Scoo. It's the only costume left. [Music] Come on, Scoop. You're ruining for everyone. [Music] >> Give it to me, you little bananister spider. >> Hey, you didn't say trick or treat. >> Too easy. >> Mommy. Okay gang, let's split up and nab us some convicts. Hey, there's one now. >> Hope you miss prison food because you're going right back to >> Oh, apologies. You have a very convincing costume. Have a great night and stay safe. >> Grownups. Go figure. Come on, gang. Let's get to work. Oh, hello children. Not much exercise in jail. That candy you're holding looks quite valuable to me. I'll appraise it and offer you a competitive price for it. >> What are you talking about, mister? >> It's called stealing, kid. >> Wait, what's your >> Now, if I were an escaped convict, where would I hide? No. >> Hey, Mr. Wickles. What a night for a night, huh? >> Is this that karma everybody's always talking about? >> Huh? Welcome. >> It can be. >> Sorry, Captain Cutler. Didn't mean to dampen your Halloween spirit. [Music] Oh, Henry Baskam, you were always such a scream. >> You want to give me all your candy. >> We want to give you all our candy. >> Wouldn't you rather teach this evil doer a lesson? >> Yes. My work here is done. [Music] >> Hand over all of that there candy or else kitty. Oh, such a sweet little smoochy woochie. Yes, you are. Forgot I'm allergic. Dagn. [Music] Scooby-Doo. [Music]",
    "start_time": 0.32,
    "end_time": 1462.919
}