{
    "video_id": "JKoc6HeyBPc",
    "channel_url": "@daddyyankee",
    "transcript": "When will this pain end?\nI feel like fear has stolen my courage. It strikes me with its power,\nBut I must overcome, I must overcome, I have to overcome. The battle without my thoughts, I don't lie to you \nI don’t have the strength to go on, but I won’t give up! In the desert I am growing Despite what I’m living through, I keep learning What it means to have patience.\nI’m building my endurance. In the desert, I’ll leave my footprints.\nI’ll leave my footprints, I’ll leave my footprints. In the desert, I’ll leave my footprints.\nI’ll leave my footprints, I’ll leave my footprints, In the desert  I have to win the war against anxiety I’ve got one life, and I’m going to fight for it.\nLike a lion roaring in the darkness, I will overcome! I will overcome!\nFree me from panic and insomnia. Renew my mind, rebuke guilt and my demons.\nIt’s one day at a time, without losing faith. What I don’t understand now, I’ll understand later. I’m creating new habits with sacrifice,\nLeaving behind vices, And giving hard to exercise\nThe vultures will not eat my leftovers. The enemy is stunned because I’m a warrior in the shadows. The wind whispers words of fear to me,\nBut I resist; I’ll win the battle within. No child of God loses the war against depression—I won’t! In the desert, I keep growing.\nDespite what I’m living through, I keep learning What it means to have patience.\nI’m building my endurance. In the desert, I will leave my footprints I will leave my footprints, I will leave my footprints In the desert, I will leave my footprints I will leave my footprints footprints, I will leave my footprints, In the desert \nLonely place A place of change,\nA place of affliction, of transformation. A place of thirst,\nA place of faith, A place of experience, of resilience.\nA place for the weak, A place for the strong,\nA place of life, A place of death.\nWhen I faced what I feared, I realized I wasn’t as weak as I thought.\nLord! Make me see that You’re always there. Clear up my confusion and bring me back to You.\nHelp me believe in Your Word, not in my emotions. You gave me power to trample serpents and scorpions. Self-control governs my feelings.\nI keep renewing myself through suffering. I feel like You’re making me new—yes!\nIn the desert I am growing Despite what I’m living through, I keep learning\nWhat it means to have patience. I’m building my endurance.\nIn the desert, I’ll leave my footprints. I’ll leave my footprints, I’ll leave my footprints.\nIn the desert, I’ll leave my footprints. I’ll leave my footprints, I’ll leave my footprints,\nIn the desert.",
    "start_time": 20.68,
    "end_time": 249.68
}