{
    "video_id": "4IMlyc7HGYg",
    "channel_url": "@vladandniki",
    "transcript": "family. >> Good morning class. Today we have a new student. [Music] >> Hi, my name is Chris. >> Please take your seat. >> Okay. >> Ew. [Music] >> Wow. Your notebook is so black and shiny. I know. >> Look at this. A >> science. >> Please present a science project. >> Oh, hello. >> H what's that? >> It's a project of the human body. I will show you what it consists of. >> Show us. Intestine. >> No problem. Oh, what is this stomach then? >> Ah, right here. >> Uh-oh. >> H. >> I'm done. Everything is correct. >> H. Well, Mike, you were totally wrong. >> Oh, >> who's next? >> Me. >> Wow. What is it, Arena? >> I'm going to show you volcano eruption. >> Okay, Arena. Impressive. [Music] >> Let a little bit more. [Music] >> Maybe a little bit less lava at next time. >> Okay. >> Okay, Chris, it's your turn. >> Okay, teacher. >> Wow. >> It's my water cycle project. >> How it works? >> Cycle starts from the preparation. It goes to condensation and then precipitation. >> Uh, what happened with the clouds? >> Then collection to the ocean. >> Great. Chris, this is an amazing work. Thank you so much. >> You're welcome. >> Well, kids, thank you for your projects. It's all for today. >> Guys, you want to play with me after the lesson? You know, Chris, I'm busy. Mike, let's go play together. Okay, let's go play basketball. Okay, let's go, Mike. I'm Michael. >> Oh, Chris. Hi. How was your school day? >> Can we buy in the new school? Have fancy notebooks. Can I have one, please? >> Sorry, Chris, but we don't have enough money and I have to work. >> It's okay, Uncle >> English. >> Hi, teacher. >> Hello. >> Good morning. >> Good morning, Chris. Hello. >> Hello. Chris, check it out. Wow. >> And this. Wow. Chris, look at my bricks and brass land. >> May I take a look at them? >> No. [Music] >> Okay, kids. Let's begin an English lesson. Michael, let's start with you. Hold. >> Take a marker. Mike and your word, Mike. Paper. H. >> Okay. [Music] [Applause] No, >> it's not correct. >> Okay, teacher. >> Arena. >> Huh? >> Is now you. >> Okay. >> Okay, Arena, your word is a doctor. >> Okay. [Music] >> Done. >> Well, Arena, it's not correct. >> Okay, teacher. >> Okay, Chris, you are next. >> Okay, >> your word is puzzle. Okay. >> Excellent, Chris. That's correct. >> Thank you, teacher. Whatever. >> The English lesson is over. See you tomorrow. Bye. >> I don't want to go. I got an A+ for my test. >> Wow, Chris, >> my class. Have a cool back. I want two books. >> I have no money for it, Chris. Sorry. And I have to work. for you [Music] >> mathematics. >> Okay, kids. >> You put your mind, >> it's easy. >> Time is on. [Applause] >> Oh, kids, time is over. >> I'm done. >> Let's see. Chris, you deserve a pass. >> Let's see a test. >> Oh, Mark, it's empty. >> I would like to see your parents tomorrow. >> No. >> Okay, Arena, it's your turn. >> I didn't have enough time. >> But you have enough time with your phone. >> Oh no. >> See you tomorrow. >> Bye. >> With your parents. >> Oh no. >> Yes, Dad. Take a seat, Michael. >> I just talked to your teacher >> about your bad behavior, >> bad grades, >> so you will be punished. >> Give me all your gadgets and all your stuff. >> Okay. >> Okay. >> Sorry, Dad. >> Uh-oh. >> Uncle. >> Oh, hi. >> I got A+ for final test. >> Good job, Chris. I was working hard and I have a present for you. >> Thank you, Uncle. >> And one more. This is for you too. >> Thank you. >> Yeah. >> Thank you, uncle. Bye. Bye. >> Testing. >> Wow. Wow. [Music] So cool. Wow. Can you share with me? Of course. >> Thank you, Chris, for sharing. [Music] Can I have a notebook? Of course, Mike. Thank you. You're welcome. >> Okay, kids. Hello, everyone. >> Hi. >> We have a final test. >> Let's go. >> Yay! >> Time is over. You did a great job. Good job, quiz. Great. >> This fancy stop kept us from studying. Now, we're going to pay all our attention to school. [Applause] [Music] [Applause] [Music] [Music] Hello kids. Let me introduce your new teacher. >> Hello kids. >> Hi. >> Be polite, kind, and respectful. Okay. Good luck. >> So, I guess we're going to start. I'm going to put my picture here. My name is Claudia and I'm [Music] [Applause] >> Today we're doing some multiplication. Leah, can you stop that? >> Can you please put away your phone? Give it to me. >> Let's play a game. Take it. Take it. Take it. >> Give me that phone now. >> Uh-oh. [Music] We're going to continue. Okay. 6 * 3. I have an idea. Look, let's >> practice this. Have you practiced this? 6 * 4 24. So like remember this. >> Yeah. [Music] >> Let's go. Who did this? Who would dare to do this? [Music] >> Class is over. >> Yay. [Applause] >> Listen. [Music] >> Oh no. What is this? >> Wait. >> I know another. >> Oh, hi kids. Come in. Come in, please. >> Don't forget to wash your hands. >> Oh, yeah. >> Oh, yeah. [Music] >> Yay. >> Hey, >> what would you like to eat? >> I want pasta, carrot, and broccoli. >> Okay. >> Carrots. Here you go, Chris. Okay, Alice. >> I want pasta. Carrots. >> Here you go. Next. >> Can I have some? >> Here you go. >> Thank you. May I sit here? >> Oh, sure. [Music] >> Jesus. He's going to be spicy here. Do it. Do it. Do it. [Music] [Music] Spicy. >> Huh? I didn't meant to make it spicy. >> I don't know. Interesting. [Music] >> Don't you think the spicy sauce was too spicy? It was too much. Come on, guys. It was fun. H. No, I think it's too much. >> No, it wasn't. It was really cool. It's actually on the science pack. W Cool. [Music] >> I don't know. But I like I like what we did yesterday. >> Yeah. >> Where's this teacher? She's awake. I was maybe she's lost. [Music] >> Classroom. He's coming. >> Hello. >> I'm back. Today we're dissecting animals. Yay! >> Make a cut right in the middle. Good job. Yes. Good. Good. Thank you. Good job, Leah. >> Guys, look. I caught a fish. >> Don't play with the classwork. >> Oh, nice. Now you have opened up the insect. We're going to draw. Thanks. Where's the book? Here. >> Main organs. Lungs. Stomach intestine. >> Go. >> Silence. [Music] >> Yay. Easy. >> Now, let's look at the textbook. Okay. We're going to Is it Is it venomous? There it is. Who did this? >> Yes. >> Alex, attention now. >> Okay, kids. Next experiment. You'll need glasses, gloves, and two tubes. Then carefully grab the dryer. [Music] >> Wow. Last ingredient. See how it changes color? [Applause] He's crazy. He's crazy. Guys down here interacts with the liquid and it creates CO2 with solutions and it creates carbon dioxide. Time for the next experiment. Here we have oxygenated water and the citrate of sodium. Strange color. I can't deal with this anymore. [Music] Yay! >> Come in. [Music] >> I'm done. Those kids are monsters. >> Take a seat, please. >> Take a nap. Please. >> They don't listen. They prank me. They're rude. >> H Every child has their own talent. Your job is to help to find it, believe in themselves, and not to be afraid to make mistakes. When they feel that you understand and support them, they will trust you and learning becomes more fun and exciting. >> Yay! >> The next day, >> wow. >> Okay, kids, let's show your talent. >> Wo! Beautiful. >> We don't know how to play it. >> That's no problem at all. We're going to learn. >> Yay. >> First, we have the saxophone for Leah. >> Thank you. >> Electric guitar. >> Wow, it's so cool. >> This one is for Misha. >> Yay. >> We're sorry for joking and behaving badly. We didn't mean to hurt you. Now we understand we were wrong. We again sent you as our teacher. Forgive us please. >> Go ahead. >> Yay. [Music] Oh, kids. Stop. Stop. Follow me. La. [Music] >> Oh, that looks great. La more Chris. I like it. [Music] >> Bravo. How did you do that? >> It's to our teacher. She opened our talent >> level. It was amazing. >> Always respect your teachers. They are here to always help you and help you always to discover your talent. >> Yay! [Music] >> Guys, keep our new student. [Music] >> That's it. Everything is made of cardboard. >> Let's start the lesson. >> Okay. [Music] Okay, kids. Pretty good lesson. A A B C D E S >> What's going on, >> Chris? What's wrong? Don't you have a book? Take it. Right. >> A B C G. [Music] Ow. [Music] >> Huh? Please. >> It's not me. It's all of them. >> It's not good. >> Uh-huh. [Music] >> Yeah. Yeah. Yeah. Yeah. Keep patient during the lesson. [Music] >> A kid. lesson is over. >> Yay. >> Let's try. [Music] >> I'm going to eat broccoli. >> I'm going to eat all day. >> Yeah. [Music] [Applause] Spaghetti. >> I'm going to eat spaghetti. >> Let's try lunch stuff. >> What would you like? >> I would like mac and cheese. Me, too. You told me too. >> Thank you for mac and cheese. >> It's delicious and healthy. >> Thank you. >> Your name is Chris, right? >> Yeah. >> What would you like? >> What? >> You know what? I have my lunchbox with me. >> Okay. Yummy. Yummy. Yummy. Yummy. What? >> Wow. Guys, do you have an extra food? >> Sure, you can have it. Thank you, guys. >> What? Let's go. [Music] It was really good. Let go. >> Yeah. [Music] >> Let's go. Okay. Now it's lighter. [Music] Haha. I have a little ball. It's round. Huh? I show you. I saw you guys. Huh? Huh? There was a girl going on. >> Hello teacher. Hi teacher. >> Okay, kids. Let's start biology lesson. >> Yay. >> Yay. >> Let's water the flowers. >> Yay. Yay. Oh, idea. Do you need help? >> No. Yeah. Yeah. My flower. Open my >> Oh, no. My flower. >> You need help? And it's >> Oh, no. Chris, >> Chris, go to the principal office. >> Huh? I just want to help them. >> 2. Everything need of cardboard. >> Why did you miss all the flowers? >> I just want to help them. >> For help? I know that you will be a good student. >> Yes. >> But you can go home now, please. >> Okay, principal. See you. [Music] >> How was the Thursday in your school? Everything made of cardboard is so weird. Don't worry. Tomorrow will be better. I'll help you. [Music] >> Thank you. >> Thank you. [Music] >> Good morning, kids. >> Good morning, teacher. [Music] >> What? What? What? What? Where's all the cardboards going? [Applause] >> Stop. Stop. Stop. Where is but cardboard pain was yesterday. >> Oh no. >> Hi. [Music] >> Oh, it would be nice to eat something. [Music] Let's check it out. H interesting. [Music] [Applause] [Music] >> Well, sir, >> please wake up. Wake up. What happened? >> Go, go, go, go. >> Welcome to our carbon restaurant. >> Oh, thank you. I would like to order this salad, uh, pasta, and um, a pizza, please. >> Any drinks, sir? >> The orange juice. >> Okay. >> Oh, well, thank you. >> Okay, sir. >> Gordon, we have a problem. >> Michael, we'll figure it out. Okay, here's your drink. Thank you. Okay. Yay. Here you go. Orange juice. Oh, Pepper sauce. >> Ready again. >> Oh, silly. >> Thank you. [Music] >> Uhoh. >> What is it? >> Best cardboard in town, sir. What? The cup. >> Done. Sir, it's going to happen again, sir. [Music] [Applause] [Music] >> H pizza. H. Okay. >> H I need milk, vegetables, eggs. [Music] >> Yay. >> Okay. [Music] [Applause] [Music] [Music] I'm going to go over be careful next door. Okay. [Music] Uh-oh. [Music] Thank you, Chris. >> Oh, finally my pizza. What is this? But there is mushrooms in my pizza. >> Okay, no problem. Your pizza with mushrooms. It's actually impossible. Here you go, Mommy. [Music] [Applause] That's enough. Yeah, [Music] >> yummy. [Music] H I need some cheese. Oh jeez. Yay. >> M yummy. Almost ready. [Music] Yum. Yum. Yeah. Sticking somewhere. I can't do my best. What? [Music] Delicious. Never mind. Help me. [Music] Yes. Catch. Yay. Where is she? In here. In here. [Music] This is not a restaurant. This is a total mess. [Music] >> No, no, no, no, no, no, no. [Music] Let's play. >> Yeah, sure. [Applause] >> My coffee. >> Wow. Wow. >> So cool. >> Gummy. Yummy. >> I'm going to pick this one. >> So cool. [Music] Somewhere in the living room. Okay. Go. Come on. Wo! It's a big gr. He's a big predator and he lives 150 million years ago. Mike, he's so big. How are we going to make him small? The magic stick is right over there. Let's go sneak. >> Okay. [Music] >> Run. Oh no. Yay. It's like a super script. It's like a huge crocodile but bigger. It's like a super slip and the roof is in length. [Applause] [Music] [Music] [Applause] I think you're a doctor. >> In fact, he wasn't a dinosaur. He was a flying reptile. It could grow up to 2 meters, guys. He had big wings almost as eagles once. Tedu eats many fishies and insects. Come on. It's a triceratops. He's so huge. He eat only plants. He has two horns above his eyes and he has one little horn in his nose. Yay! Wow! This is Masaurus. He looks like a giant swimming lizard. Mosasaurus can grow up to 70 m long. It's like two big cool buses. Okay, let's bring you home. Oh, hi little. Come on home, little Mastoasaurus. [Music] >> Wow, guys, this is Tinosaurus. He have long claws. Super sharp. Almost 1 m long. He used them to get the plants from the trees. Maybe he a feather like a like a giant chicken. >> Wo! It's not scary. Y >> wa look dropped her bunny. >> He was one of the most dangerous animal on earth and his head was huge. He had powerful teeth. All the dinosaurs. He had small arms and strongest legs. >> Come on, Chris. Wait, I will get the magic white. >> What? I think we have to be right. [Music] No, no, no, no, no, no. [Music] She's not even that scary. Look at him. Yay. [Applause] So funny. Huh? [Music] >> Wow. Is it alive? Guys, he lived 75 million years ago. And he's a plant eater. >> Look, he's going to scream. >> Let's go. Let's put you here. Wow, he's so little. This is Melissa. His teeth are super sharp like a knife and he eats meat and he's a predator. He was like a big turkey. He can run really fast like a fast cheater. >> Wo! He's so cool. >> Let's go, Chris. >> This is Stegosaurus. Stegosaurus had a small brain but a big body like a whole boss. He walked on four legs and eat only plants like me. Wow. Time to bring you back home. Look, I got Stegosaurus. Yay. [Music] real dinosaurs. Lady carrot [Music] dinosaurs. Dinosaur. >> Yeah. Can help me. It's right here. Wa! Guys, you know Rocky Olives lived 150 million years ago. He was so huge that he was super kind because he only eat grass. [Music] Mommy, look. But I thought it was bigger. Mom, let me show you more. Wow, you have amazing park with all type of dinosaurs. >> Yes, we have T-Rex. Wonder is my favorite one. >> Wow. Kids, learning about dinosaur always >> fun and interesting >> and educating. >> Yay.",
    "start_time": 4.4,
    "end_time": 2061.879
}