{
    "video_id": "JPxmTWDy-sk",
    "channel_url": "@vladandniki",
    "transcript": "brother family. Woohoo! [Applause] What? [Applause] [Applause] Oo, that was so close. [Music] [Applause] [Music] H Okay. [Music] Guys are back. [Applause] [Music] He's close. [Music] >> Huh? >> He's gone. >> Yay. I'm in the middle of the wall. I need to get fast and almost coming. >> Wow. >> Dad, this is the strongest wall ever. Here it comes. [Music] >> Oh no. >> I was right. This is the strongest wall ever. [Music] There's two dinosaurs now. I need to run. >> Oh no. [Music] >> Nobody can break this wall. >> Wow. >> They're coming. They're gone. [Music] >> Oh no. Oh no. What should I do? [Music] H I need to distract them somehow. >> H idea. >> Here's a snack for them. >> Awesome. >> The dinos follow me. You want some snack? Let's go. >> Come on. >> Let's go. >> Yes. Finally, they're gone. I did it. 2 3 4 [Music] >> Hi, where are you? >> Huh? [Music] >> Wow. >> Let's check what inside. >> Come on. >> Okay. >> Wow. [Applause] Wow. Uh-oh. >> Let's clean up here. Yeah, let's do it. Yay. [Music] Wow. [Applause] [Music] [Applause] [Music] [Applause] Yay! >> Grace! Hi! >> What is it? >> G, where are you? >> Done. Come on. >> I want to Lego house. >> Oh, let's order some. Okay, I won 1,000 Lego. Okay. >> Wow, huge coins. >> How can I bring it here? Well, here. >> No, I've got a better idea. >> Yeah. Wow. Cool. [Music] [Music] Let's go, Chris. Yay. >> Let's go. >> Wow. So many Legos. >> Wow. >> Let's go. [Music] >> Oh, we can put the wheels. >> Yeah. Ready. [Music] Let's go. Wow. >> Yay. >> I think we need to finish our [Music] [Applause] We're going fast. Yay! Yay! Yay! Yay! Yay! Yay! Yay! Yay! Yay! [Music] That's another treehouse. >> Yes. Ready? [Music] Yeah. [Music] Yay. This is the last one. Yeah. Let's go. Let's go. [Music] Yay. Wo. Wow. A lot of Legos left. >> I always wonder about my farm. >> Let's build it. >> Yeah, let's go. >> Yay. R is ready. This is for chicken. Goat will live here. For bunny. Big will live here. Not eggs. The gate is rolling. Only animals left. Come on. Yay. Gr. Chris, come here. Here. Here. I want you. I want you. Yay. I'm going to bring some more animals again. run. [Music] Come inside. Open it. Hello guy. Hi little guy. Ready? Here's to you. Hello. Hello. Oink. Oink. Oink. Let's open the big [Music] [Applause] [Music] We're going to make a house for you. [Music] So cool to make a Lego farm. Yay. Let's go. Let's go. I need more water. [Music] [Applause] [Music] All right, boys. Are you ready? >> Nice job. >> It's a real firefighter. >> I see you like the fire truck and I see you like the water. >> Yes. How about I show you a real fire truck? What do you think? >> All right, let's go. [Music] >> Let's go. >> Let's go check it out. All right, boys. Come on over. This is a real fire hose. Over here we have our fire axe. For an emergency, we use our axe to break down the door. Over here we have our hose hookups. Come on over. I'll show you the back. Let's go. Over here, we have our emergency lights. So when we're in an emergency, we turn them on so you know to get out the lane. >> So cool. >> All right, come on over. Over here we have our huge fire truck tire. >> Wow, Mike. The same is mine. The same is mine, too. >> Huh? What is this? >> That's for our fire hose. So in here we have our huge fire hose hookup. Now we're ready to spray. >> Sir, what is this for? >> That's our fire truck siren. So when we're in an emergency, we turn it on so everybody knows to get out the way. >> That's so cool. >> And if they don't move, we use our fire truck horn and we go, >> let's go inside and check it out. >> Yeah, let's do it. Wow. >> So inside we have some fire equipment for you, >> guys. It's so cool inside. [Music] >> Awesome. >> Can you turn on my siren? What do you want to say? >> I like it. >> What about you? >> I've never been in a fire. >> Let's go check it out. Over here we have our fire jackets. Are you ready? >> Yeah. Yeah. >> Let's do this, Chris. >> Yeah, let's do it. >> Boys, you look awesome. >> You guys ready to go do some training? >> Yeah. >> Yeah. What do firefighters do? >> Firefighters save lives and they put out fires. There's a pen there. >> Come on over. Let's go save them. >> What should we do? Okay. >> Oh no. >> I think we could try something else. What do you think? >> Ladder. >> Where do you think we have a ladder? >> Yeah. >> Come on over. Let's go get it. Nice job. Let's go put it up. [Music] >> The kitty's safe, guys. Can you grab him? Nice job, >> Kitty. >> Nice job. >> Okay, what's next? >> The Lego house is on fire. >> All right, are you ready to go save some lives? >> Let's go. Let's go to our emergency. [Music] >> I'm ready. I'm all set. >> Let's go. >> Yay. [Music] So cool. >> Yeah. [Music] >> Let's get him. Let's go. >> You see that big treehouse over there? Let's go grab it. Come on over. Go, go, go. Awesome job. >> They're on the holes. >> Wow. [Music] [Music] >> Hey, did you know that if you have a fire that's electric, you can't use water to put it out? Instead, we have to use a special kind of firefighter phone. >> Yeah, let's do it. >> All right. Awesome. >> You guys ready? >> Yeah. >> Awesome. Let's do it. [Music] Awesome job. Come on over. lost all your touch. >> Yeah, we did it. >> You know, remember, make sure to stay safe and stay away from those fires. Stop, drop, and roll. And remember, >> don't play with fire. >> Nice job. Let's do it. [Applause] [Music] >> So much fun. Yay. Huh? >> What? What's wrong? [Music] That's my imagination. >> Hey, kids. I'm eating my burger. >> Sorry. [Music] >> Where's my sandwich? [Applause] [Music] It's got to be a shot. >> It's a cracker. You got a timeout. >> Let's go. [Music] [Music] >> What you doing over there? I just raged my legs. Okay. Okay. Just sit back down when you're done. >> Okay. All right. Let's play. Yay. [Music] [Applause] What do we do now? Huh? >> Hand over. [Music] Oh no. [Music] >> Without the control of the shark, this shark is just a shark. Toy shark, of course, but it's still a shark. What are we going to do? >> There's a shark in the pool. >> Oh, I know what to do. >> We've got a problem. There's shark in the pool. >> Mhm. I'm on my way. >> No worries. I got a plan. Yay. [Music] >> Perfect. >> Wow. ain't going to catch you. He needs a bite for it. >> Yes. >> Me? >> We need your brother. >> Oh no. [Music] >> You're going to catch it. >> We need your help. [Music] Oh no, it didn't work. >> Yeah, >> guys, I have another plan. H, you come here. >> Where are they going? >> Perfect. Really? Yes. Let's go. >> Are you ready for lunch? >> Now we are both. No, no, no, no, no, no, no. >> No, you didn't. Do I look like a shark? >> Now it's time for Ry after all. >> What? [Music] He's wrestling the shark. [Music] [Applause] >> Yay. [Music]",
    "start_time": 3.12,
    "end_time": 1179.849
}