{
    "video_id": "4-0Ab_VH8k0",
    "channel_url": "@vladandniki",
    "transcript": "brother family. H [Music] [Applause] >> Chris, did you see the ball anywhere? >> No. Oh no. >> Hurry up. I'm going first. >> I'm going down here. No. No. No. No. No. Go. >> That was hard. Chris, it was so hard. Wait. [Music] >> Chris, they're not eatable. What are we going to do now? Idea. We can wash them. Okay. Come on, Chris. Okay, >> he's almost here. What? [Music] [Applause] [Music] >> What? What happened with my candies? >> I need to wash my hands. >> Okay. >> Well, Chris, we ruined the candy now. H. So, let's make new candy. Let's go. Come on, Chris. [Music] >> Chris, we should check out something like candy. Let's go find it. Come on. H. Maybe grapes. Yeah, that must be a great idea. >> That's the perfect size. Now we need to color them. Come on. [Music] >> Yay. Let's go. [Music] >> I think it's going to be yummy, Chris. It's going to be so yummy. [Music] Yay! [Music] >> Uh-oh. [Music] [Applause] [Music] >> Uncle, what's wrong with your face? >> I don't know. Look, [Music] it's because of grape Chris. Maybe because of taint. Oh, yeah. >> Sorry, Anicole. We did it. We colored the grease with the paint because we ruined them. Monaco, [Music] >> I have idea. Let's make homemade candies. >> Yay. Go to the kitchen. My favorite candies are blue. >> These candies consist of chocolate, peanuts, and colorful waste. The first step is >> peanuts. >> This is for me. This is for you. >> Look, it's so small. >> Okay, we have colorful chocolate here. >> Now, we need to melt the chocolate. >> Yay. Awesome. >> Now mix it. [Music] >> Got to get it ready. >> Perfect. >> Uncle, let's make dairy candies. >> Oh, [Music] >> let's feed them. >> Let's go. >> Come on. >> No. Scissors. Shoot. Oh, kitties are ready. >> Yes. >> Yum, yum, yum. >> So delicious. Look at that. >> Lollipop time. Okay. Mum, yum, yum. Wow. >> So cool. Look. >> Marshmallow. >> Yay. [Music] Yay! Cool. >> Making stuff with your hands is so fun. >> Mommy [Music] H. Oh. H. Alice Bricks, Chris Walker, Miss Teacher. Hm. This school is so weird. My class math class. Yes. Huh? >> Oh, Mike. What are you doing there? Come in the classroom. >> Huh? Lego box. Lego teacher. Okay, I'm coming. >> What? >> This is Mike, our new student. >> Hi. >> Hi, Mike. Okay. Hi. Yeah. Let's prank him. Okay. [Music] [Applause] [Music] >> What's up, [Music] >> Z? What happened with your chair? >> I'm almost done. I'm building it. It was just a jar. >> You're missing this. Oh, thank you, Liam. Okay, done. >> Today, we going to do a test. Open your notebooks. This is for you. >> Oh, no. Yes, I like that. >> Oh, no. No, no, Mike. Instead, use this. >> I'm going to do the steps. Huh? 6 + 5 = 11. What should I do with this thingy? Yay. [Music] How are you doing this? Hurry up. Time is running. I'm going to help him. >> Yay. You can use this. Oh, thank you, Chris. Time is over. Okay, Chris. >> Good job. >> Thank you, teacher. Yay. >> You're welcome, Chris. >> Here's my test, teacher. >> Let's see. Okay, it's going to be B. >> Almost a [Applause] [Music] >> Oh, well, impressive. This is A. Thank you. Oh, no. My Oh, sorry. I didn't have so much time. >> Sorry, Mike. This is F. >> H lesson is over. >> Yay. >> Bye, teacher. Bye, teacher. >> Bye, teacher. >> Bye, teacher. >> Bye, teacher. >> My favorite veggie is broccoli. >> Yeah. I wonder what to eat today. I think it's going to be a lot. Me, too. It's time for lunch. Yummy, yummy, yummy. >> I want to eat pasta. >> What do you want to eat? >> Can I have pasta and broccoli? >> No problem. >> Thank you. Hi. Can I have tomatoes and broccoli? >> Okay. Yay. >> You're welcome. >> Want to be cute, Chris? I would like a little bit of peach. >> Thank you. >> You're welcome. >> Hello. >> What would you like to eat? >> Huh? >> H. That looks not tasty. Do you have something else? >> We've got a special menu. >> I want burger and fries. >> That's not yummy. >> Can I sit with you, please? >> Yeah, sure. Thank you. >> You want the ketchup? >> Here we go. [Music] >> Huh? >> Guys, how are you eating this? >> It tastes taste so yummy and good. I'm going to get my own food then. >> What? What is that? This is what I call food. Burgers. >> Is it booger? Oh, hey there. Real booger is not allowed. No more real food in my cafeteria. >> Running is not allowed in the school. >> Sorry, teacher. >> Okay, Mike. Let's go to the arts class. >> Okay, teacher. Oh, I did. Hello, teacher. >> Hi. >> I don't know what we're going to draw today. >> Probably a flower or something. Where's the paint? How do you draw with this? >> You don't know how to draw? >> No. >> Welcome to the art class. >> Today we're going to draw few flowers. >> What? >> I got it. >> Okay. I'm going to take away put it in the middle. H. Fortunately, I've got an idea. >> Wow, I love it. >> Oh my. What is it? >> I'm not done yet, teacher. >> Wow. [Music] The last piece. Teacher, I'm done. >> Wow. Nice. Kids, look. Look at this beauty. Good job. >> Yeah. Yeah. Wow. >> Lesson is over. >> Bye, teacher. Bye, teacher. Bye, teacher. >> Bye-bye. My locker is blue. >> My locker is red. >> Which of the lesson? >> Science class. >> Oh, hello kids. Welcome to the science class. Awesome. >> I hope you have good experience. >> What do we do with this? This teacher's lesson is always fun. >> Okay kids, today we're going to mix this. But remember kids, test it first. >> Done. Done. >> Oh, look at that color. Now it's your turn, kids. >> Okay. >> Wow. >> Great job, girls. Look at the color. >> Now it's your turn. >> Wow. So cool. >> Chris, you did a great job. >> Mine, check it out. Mine is the biggest cool. >> Go, go, go, go. What? Nothing. >> Okay, now it's my turn. Everybody hide. Uh-oh. >> Is it done? >> Oh, yeah. It's gone. >> Mike, to the principal right now. >> For what? >> Okay. [Music] >> Sorry, Mike. Sorry. >> May I come in? >> Take a seat, please. >> Okay. What's going on with your face and what happened in the classroom? >> I didn't mean to do that. That was by accident. I'm really sorry about that, Principal. >> I know that you will be good, students. Now you can go help. >> Thank you, principal. Bye. >> You're welcome. >> Bye-bye. >> Bye, Mike. [Music] [Applause] [Music] I messed up. [Music] H everybody was weird on school, but tomorrow I'll be ready for sure. Yay. [Applause] >> The next day. >> Good morning, kids. >> Good morning, teacher. Hi. >> What? I think you messed up days. >> Why are you not wearing Legos? >> But Mike, Lego day was yesterday. I messed up again. [Music] >> H. Okay. Hey, you [Music] 77 drive. [Music] Uh-oh. You cannot drive here. You only can drive in the bike lane. Sorry, officer. I didn't know that. And the hatch will give you a turkey. What? 20 bucks. A just like that, sis. >> Yes. Bye. >> Awesome. >> Yay. [Music] [Applause] [Music] >> Lemonade. Who wants fresh lemonade? >> There. [Music] It's only for 10 minutes. >> Hey there. Do you want a fish flade? >> Um, can I have one, please? >> Okay, I can go. Yay. >> What? I think I have to throw it. [Music] Uh-oh. >> This is my car with me. Parking is not allowed. >> Uh-oh. Here's your ticket, miss. >> Bye. >> Wait, wait, wait, wait. It was only 10 minutes. I don't care. Look at the sign. No, no, no, no, no. Yay. [Music] La [Music] [Music] [Applause] H. [Applause] Hey ma'am, you can only cross the street. How is going to get a green light? >> I have to write you a ticket. >> $100. >> And next time you have to follow the rules. >> Why aren't you buckle up, sir? You have a ticket. I should have been buckle up. >> Bye bye. I said you >> what? >> Wow. Really? [Music] >> You can't use your phone because of driving. I didn't know about that. >> Okay, MB. I need to write you a ticket, >> man. Drive it. Bye. >> Uh-oh. [Music] >> Kids, always remember to follow your happy rules. Yay. [Music]",
    "start_time": 3.12,
    "end_time": 1095.1899999999998
}