{
    "video_id": "N5wgQ_7vDjs",
    "channel_url": "@vladandniki",
    "transcript": "What will save me for this video? >> 3 2 1 go. Yay! Class smash. My team is better. Well, my team is better. Diamonds are better than sharks. Sharks are better than dinos. My team is team shark, tiger shark, gangster, grape vine, and my team is Diamond, Mega, Bone Shaker, Raazaur, and Victor. Bone shake fire alarm go. [Music] >> Are you ready? Come on. >> This is gangster. >> Yay. >> 3 2 1 go. [Music] [Music] Hey, Chris. I think it's a truck. [Music] >> Wow. >> Let's do another battle. Okay, Chris, what's going on in the living room? I don't know. Let's check. Come on, let's go. Wow, it's a Hot Wheels dragon demolition playset. Then what do we need to finish our battle, Uncle? >> Okay, let's find out who will defeat the dragon. >> Team shark team. Yay! 3 2 1 go! Big foot! Gunster! 3 2 1 go! Great fight. Rage. >> 3 2 1 go. >> What? >> We need to double our powers so we can defeat the dragon. Great idea, Mike. Let's unite our powers. I'm going to beat me tiger shark. Three 2 one go. Yeah, >> we defeated the dragon. Let's go rest. Come on, Chris. Go. [Music] >> Okay. So, >> don't worry. I'll save the day. I'm doing it. I'm not doing it. [Music] Hey kids. >> Are you watching TV again? >> No. >> Nope. >> I've got a surprises for you. >> Wow. It's a shark attack with a remote control. >> So, what are you waiting for? Let's check them. Let's test them. Let's crash and smash them. [Music] >> Wow. >> Wow. >> Cool. >> Wait, Michael. It have a tail. I'm going to try. >> No way, Mike. They can climb. I'm going to try, too. [Music] [Applause] [Music] >> Awesome. >> Let's take a cool track. Come on, let's get it. Yay. Let's set them out. Okay. Go. [Music] Wow. [Music] Wow. >> Hey, Chris. I think we should bring the trampoline outside. Let's go. Come on. [Music] >> Mike, what do you shoot? Okay, let's go. >> Wow, Chris, you got cool shoes. >> Awesome. >> Come on, let's go. 3 2 1 go. [Music] [Applause] [Music] Mike, look. It can stretch the tail and it's going to glide now. Yay. Yay. Almost. Go, go. Yay. >> Go, go, go. Yay. I think we need to build a track for them. Great idea. Let's get some stuff. Come on. >> Yay. [Applause] [Music] This is going to be epic. Chris, come on. Let's go. [Music] Are you ready, Chris? I'm ready. [Music] [Applause] [Music] So cool. [Applause] [Music] Yay. [Music] I think it's time to cl [Music] [Applause] >> Yay. That was cool. That was so fun. Go big. Go Hot Wheels. Yay. >> Thank you Hot Wheels for paying me and helping me create this video.",
    "start_time": 2.639,
    "end_time": 434.47900000000004
}