{
    "video_id": "reN8rEqAKbg",
    "channel_url": "@vladandniki",
    "transcript": "family. Yay. [Music] Let's learn the box. >> Okay. >> This is a P. This is a grasshopper. [Music] [Applause] >> Oh no, all the bugs came. We have to bring them back. >> Let's go. Yes. La [Applause] [Music] [Applause] [Music] catch all the bees. Let's go. [Music] It doesn't work, kids. >> Yeah. Not our plan, >> guys. Look who they have. Honey, >> great idea. Bees love honey. >> Uh-huh. [Music] >> Now you can collect them. Cool. >> Let's go. >> One. Hey. 2 3 4 5 Done. >> Thank you so much for saving me. One more there. Someone take it away. Let's go. >> We did it. Yay. [Music] What's going on? >> So heavy. >> Hello. [Music] >> What happened, uncle? >> I just saw a grasshopper. Uncle, don't worry. We're going to catch it. >> Yeah. H Let's go. [Music] >> Uncle, help me. >> Okay. Okay, I will help you. [Music] Let's put it in a jar. >> Yes. >> Thank you for helping me. >> Bye. La. [Music] Wow. I don't remember this beautiful dress. So many wonderful butterflies. >> Wow. >> Wow. There. Let's get the butterfly. Hi idea. >> Wow. Butterflies love color. >> Yeah. Uhhuh. Yay. >> Wo. [Music] Blue. It's purple. Yay. Green. Yellow. And the last one. >> Yay. Thank you so much. >> You're welcome, Auntie. >> A. Bye-bye. >> Bye. [Music] Oh no. [Music] What's going on? >> What? [Music] >> Kids, help me. My head is flying away. >> Let's do it. Okay, >> there [Music] you go. Yes, you did it. >> Look, Ladybug. Hello. Hello. Hello. >> Okay, be careful. Gently. Yay. High five. High five. >> Now we collect all the bugs. Let's bring them home. Okay, [Music] time to bring the box home. [Music] >> Yay! [Music] >> Yeah, we did it. [Applause] >> My coffee. >> Wow. Wow. >> So cool. >> My gummy. Yummy. Yay! >> I'm going to pick this one. >> So cool. [Music] >> Did you see that? Somewhere in the living room. Okay, go. Come on. Wo! >> It's a big gr. He's a big predator and he lives 150 million years ago. Mike, he's so big. How are we going to make him small? The magic stick is right over there. Let's go sneak. Okay, [Music] >> run. Oh no. Yay. It's like a super script. It's like a huge crocodile but bigger. Looks like a sug. [Music] [Applause] [Music] [Music] [Applause] [Music] In fact, he wasn't a dinosaur. He was a flying reptile. It could grow up to 2 m, guys. He had big wings almost as eagle's ones. Jaku eats many fishies and insects. Come on. It's a triceratops. He's so huge. He eat only plants. He has two hearts above his eyes and he has one little horn in his nose. Yay. [Music] Wow. This is Masaurus. He looks like a giant swimming lizard. Mosaurus can grow up to 70 m long. It's like two big boxes. Okay, let's bring you home. Oh, hi little. Come on home, little Mastoasaurus. [Music] Wow, guys. This is Tinosaurus. He have long claws. Super shop almost 1 m long. He used them to get the plants from the trees. Baby, he feeds like a like a giant chicken. Wa! It's not scary. Yay! Bye. Wa! Look at our bunny. He was one of the most dangerous animal on Earth. And his head was huge. He had powerful teeth to eat all the dinosaurs. He had small arms and strong his legs. >> Yeah. >> Come on. Wait. I will get the magic one. >> What? >> I think we have to be ready. [Music] [Music] He's not even that scary. Look at him. Yay. [Applause] So funny. Huh? [Music] >> Wow. Why is it bar guys? He lived 75 million years ago and he's a plant eater. >> Look, he's going to scream. >> Let's go. Let's put you here. >> Wow, he's so little. This is the raptor. His teeth are super sharp like a knife and he eats meat and he's a predator. He was like a big turkey. He can run really fast like a fast cheater. >> Wa! He's so cool. >> Let's go. Come on, Chris. >> Guys, this is Stegosaurus. Steosaurus had a small brain but a big body like a whole boss. He walked on four legs and eat only plants like me. Wa! >> Time to bring you back home, Stegosaurus. Look, I got Stegosaurus. Yay! [Music] Will you die? Maybe carrots [Music] [Applause] dinosaur lived 150 million years ago. He was so huge that he was super kind because he only eat grass. [Music] Mommy, look. I thought it was bigger. Mom, let me show you more. >> Wow, you have amazing park with all type of dinosaurs. >> Yes, we have stick T-Rex. Wonder >> Wow. Kids, learning about dinosaur always >> fun and interesting >> and educating. Yay! >> Hey kids, stop. >> What? >> No running on the escalator. It's dangerous. >> Sorry. [Applause] >> Awesome. >> We have one on the top. >> Not be afraid. You just need to jump. [Applause] [Music] >> Kids, where are you? Kids, where are you? >> Yay! Hello. Hello. Look who I found. >> No, it's me. >> Run. Here you are, kids. Remember, running is not allowed. Let's go. >> Wow. Look at that because I like it so much. >> Of course, why not? [Applause] >> Wow. >> Uncle. Uncle. >> Yes. >> Can you have one? >> I love that color. Yes, you can have it. >> Yes. Thank you. [Music] [Applause] Look at this funny eyes. >> Oh, let's see. [Music] >> You can't ride a scooter with the headphones on. >> It's not safe. >> Sorry, guys. >> Let's go. >> Hey, kids. Stop. >> For safety, give your stuff. Now we can go. >> Okay. >> Don't forget about assistant. >> Yay. [Applause] [Music] >> Yummy. Yummy. Yummy. >> I want this. >> Mango, please. >> Okay. Yay. >> Here you go. [Music] I like this. [Music] >> Chris, your laces. >> What? Uncle, >> you can't go to the escalator with your laces loose. >> Okay, uncle. >> Done. Now it's safe. >> Now we can go. [Music] Kids, wait. No, no, no. Running. Stop. >> You should always watch your step. [Music] [Applause] [Music] >> Yay. [Applause] [Music] Yay. High five. Let's go. >> Wow. [Applause] [Music] Let's go. [Music] Yay. Last try by ourselves now. >> Uhhuh. >> Awesome. >> Well done, kids. >> H. Okay. Hey. H. [Applause] [Music] 77 on the drive. [Music] Uh-oh. >> You cannot drive here. You only can drive in the bike lane. >> Sorry, officer. I didn't know that. And I had to give you a ticket. >> What? 20 bucks. >> A just like that, sir. >> Yes. Bye. >> Bye. Awesome. Yay. La [Applause] [Music] >> lemonade. Who wants fresh lemonade? [Music] >> It's only for 10 minutes. Nothing will happen. Hey there. Do you want a fish flade? >> Um, can I have one, please? >> Okay. >> I can go. Yay. >> What? >> I think I have to do it. [Music] Uh-oh. >> This is my car with this money. Parking is not allowed. >> Uh-oh. >> Here's your ticket, miss. >> Bye. >> Wait, wait, wait, wait. It was only 10 minutes. I don't care. Look at the silence part. No, no, no, no, no. Yay. [Music] H. [Music] [Applause] H. >> What can I do? >> Hey, ma'am. >> You can only cross the street. How is going to get a green light? I have to write you a ticket. >> $100. >> And next time you have to follow the rules. >> Why aren't you buckle up, sir? You have a ticket. I should have been buffalo. >> Bye bye. I said you. >> What? Wow. Really? [Music] >> You can't use your phone because of driving. I didn't know about that. >> Okay, ma'am. But I need to write you a ticket, >> man. Drive it. Bye. [Music] Kids, always remember to follow your traffic rules. Yay. [Music] Red car. Red car. Red car. Red car. I think you need a win. Lego car for everyone. Hi. Can I get a new car, please? >> Yes, sir. We have a lot of cars. [Music] >> I want to look like all of the cars. You have a Jeep car, sports car, medium car, car. So, which one do you like, sir? H I want your car. Here's your Thank you. Yay. Wow. So cool. >> Hi. Hiom. >> Oh no. >> Huh? [Music] I need new car. Okay. >> Oh, here you go. Thank you, >> sir. This is your new car. >> Yeah, it's yours. Thank you. [Music] Bye. >> Bye. So fun. [Applause] Yay! H I think I need some girlfriend. [Music] >> Let's go. Yay. >> Oh no, it's rain. Oh no. >> Oh no. [Music] Oh no, my car. It's ruining. >> What? >> This is your car. >> And your car is like this now. Okay. Okay. Okay. We're figuring out something. Oh, orange. >> Let's go. a brand new sports car. >> This spoiler is so cool. And it's called Flame. I'm going to take it. Okay. [Applause] Oh, that means stop. [Applause] >> Huh? >> What? They dropped my car. [Music] What again? What happened this time? Well, it was a huge police chase. I need a new car. Please, I have one. >> I recommend you this car. >> Big wheels, lights in the back. It's all made from the cardboard. Wow. I want to fit in it. >> Yay. [Music] What? I need to wash my car. >> Hello. Hello. Hello. >> Car wash. Let's go. >> My car. No, it's melting. [Music] Is anybody here? >> Uh, no one's home. >> Actually, I see you. >> Oh, hi. Look what happened to your car after the car wash. >> I'm so sorry. It's not waterproof. But I still need a car. >> I don't have any more keys, sir. >> Better rating for you. >> But I have a special car there. >> Oh, good rating. Let's go. [Music] Rain is coming. Good luck. [Music] Let's go. Let's go. Need more water. [Music] [Applause] [Music] All right, boys. Are you ready? >> Nice job. >> It's a real firefighter. >> I see you like the fire truck and I see you like the water. >> Yes. >> How about I show you a real fire truck? What do you think? >> Wow, let's go. [Music] >> Let's go. Let's go check it out. All right, boys. Come on over. This is a real fire hose. Over here, we have our fire axe. For an emergency, we use our axe to break down the door. Over here, we have our hose hookups. Come on over. I'll show you the back. Let's go. Over here, we have our emergency lights. So, when we're in an emergency, we turn them on so you know to get out the load. >> So cool. >> All right, come on over. Over here, we have our huge fire truck tire. Wow, Mike. The same as mine. >> The same as mine, too. >> Huh? What is this? >> That's for our fire hose. So, in here, we have our huge fire hose hookup. Now, we're ready to spray. >> Sir, what is this for? >> That's our fire truck siren. So, when we're in an emergency, we turn it on so everybody knows to get out the way. >> That's so cool. >> And if they don't move, we use our fire truck horn and we go b. Let's go inside and check it out. >> Yeah, let's do it. >> Wow. >> So, inside we have some fire equipment for you, >> guys. It's so cool inside. [Music] >> Awesome. >> Can you turn on my siren? >> What do you want to say? >> I like it. >> What about you? >> I never been in a fire. >> Let's go check it out. Over here we have our fire jackets. Are you ready? >> Yes. Yeah. >> Let's do this, Chris. >> Yeah, let's do it. >> All right, boys. You look awesome. >> You guys ready to go do some training? >> Yeah. >> Yeah. What do firefighters do? >> Firefighters save lives and they put out fires. >> There's a cat there. >> Come on over. Let's go save them. >> What should we do? >> Oh no. I think we could try something else. What do you think? >> Ladder. >> Where do you think we have a ladder? >> Here. >> Come on over. Let's go get it. Nice job. Let's go put it up. [Music] >> The kitty's safe, guys. Can you grab them? >> Nice job, >> Kitty. >> Nice job. >> Okay, what's next? >> The Lego house is on fire. >> All right, are you ready to go save some lives? >> Let's go. Let's go to our emergency. [Music] >> I'm ready. I'm all set. >> Let's go. >> Yay. [Music] >> So cool. Yeah. So cool. [Music] Let's get him. >> Let's go. >> You see that big treehouse over there? Let's go grab it. Come on over. >> Go, go, go. Awesome job. >> Put on the hose. Go. [Music] Hey, did you know that if you have a fire that's electric, you can't use water to put it out? Instead, we have to use a special kind of firefighter foam. >> Yeah, let's do it. >> All right. Awesome. >> You guys ready? >> Yeah. Awesome. Let's do it. [Music] >> Awesome job. Come on over. It cost all your touch. >> Yeah, we did it. >> Yep. Remember, make sure to stay safe and stay away from those fires. Stop, drop, and roll. And remember, >> don't play with. >> Nice job. >> Hey, mommy. [Music] H. Oh. H. Alice bricks, Chris Walker, Miss Teacher. H. This school is so weird. I want to find my class. Math class. Yes. >> Huh? >> Oh, Mike, what are you doing there? Come in the classroom. >> Huh? Lego blocks. Lego teacher. Okay, I'm coming. >> What? >> This is Mike, our new student. >> Hi. >> Hi, Mike. >> Okay. Hi. Let's prank him. Okay. [Music] Going [Music] 2. [Music] What happened with your chair? >> I'm almost done. I'm building it. It was just a jar. You're missing this. Oh, thank you, Liam. Okay, done. Today we're going to do a test. Open your notebooks. This is for you. >> Oh, no. >> Yes. I like that. >> Oh, no. No, no, Mike. Instead, use this. I'm going to do the steps. >> Huh? 6 + 5 = 11. What should I do with this thingy? Yay. [Music] >> How are they doing this? Hurry up. Time is running. >> I'm going to help him. >> Yay. >> You can use this. Oh, thank you, Chris. Time is over. Okay, Chris. >> Good job. Thank you, teacher. Yay. >> You're welcome, Chris. >> Here's my test, teacher. >> Let's see. Okay, it's got to be B. >> Almost a high. [Music] >> Oh, well, impressive. This is A. Thank you. Oh, no. Mike. Oh, >> sorry. Didn't have so much time. >> Sorry, Mike. This is F. H >> kids lesson is over. >> Yay. >> Bye teacher. Bye teacher. >> Bye teacher. >> Bye teacher. Bye teacher. >> My favorite veggie is broccoli. >> Yeah. I wonder what to eat today. I think it's going to be a lot. >> Me too. >> It's time for lunch. >> Yummy. Yummy. Yummy. Broccoli. >> I want to eat pasta. >> What do you want to eat? >> Can I have pasta and broccoli? >> No problem. >> Thank you. Hi. Can I have tomatoes and broccoli? >> Okay. Yay. >> You're welcome. >> Want to be cute, Chris? >> I would like a little bit of peach. >> Thank you. >> You're welcome. Hello. >> What would you like to eat? >> Huh? >> H, that looks not tasty. Do you have something else? >> We've got a special menu. >> I want burger and fries. >> That's not yummy. >> Can I sit with you, please? Yeah, sure. Thank you. Can I have the ketchup? Here you go. [Music] Huh? Guys, how are you eating this? It tastes so yummy and good. I'm going to get my own food then. >> What? What is that? This is what I call food. Burgers. >> Is it burger? Oh, hey there. Real booger is not allowed. No more real food in my cafeteria. >> Running is not allowed in the school. >> Sorry, teacher. >> Okay, Mike, let's go to the arts class. >> Okay, teacher. >> Oh, hi. >> Hello, teacher. Hi. >> I don't know what we're going to draw today. >> Probably a flower or something. Where's the paint? How do you draw with this? >> You don't know how to draw? >> No. >> Welcome to the art class. >> Today we're going to draw few flowers. >> What? >> I got it. >> Okay. I'm going to take it in the middle. >> H. Fortunately, I've got an idea. >> Yay. >> Wow. I love it. >> Oh my. What is it? >> I'm not done yet, teacher. >> Wow. >> What? The last piece. Teacher, I'm done. Wow. Nice. Jeez, look. Look at this beauty. Good job. >> Yeah. Yeah. >> Less time is over. >> Bye teacher. Bye teachers. Bye teacher. >> Bye-bye. My locker is blue. >> My locker is red. >> Which is the lesson. >> Science class. >> Oh, hello kids. Welcome to the science class. >> Awesome. I hope you have good experience. What do we do with this? So, this teacher's lesson is always fun. >> Okay, kids. Today, we're going to mix this. But remember, kids, test it first. >> Done. Done. >> Oh, look at that color, please. Now, it's your turn, kids. >> Okay, >> great job, girls. Look at the color. Now it's your turn. >> Wow, so cool. >> Chris, you did a great job. >> Mine, check it out. Mine's so small. Cool. >> Go, go, go, go. What? Nothing. Okay, now it's my turn. Everybody hide. Uh-oh. Is it done? Oh, yeah. It's gone. >> Mike to the principal right now. >> For what? >> Okay. [Music] >> Sorry, Mike. Sorry. >> May I come in? >> Take a seat, please. >> Okay. >> What's going on with your face and what's happened in the classroom? >> I didn't mean to do that. That was by accident. I'm really sorry about that, Principal. >> I know that you will be good students. Now you can go help. >> Thank you, principal. Bye. >> You're welcome. >> Bye-bye. >> Bye, Mike. [Music] [Applause] [Music] >> I messed up. [Music] H everybody was weird in school, but tomorrow I'll be ready for sure. Yay. [Music] [Applause] >> The next day. >> Good morning, kids. >> Good morning, teacher. >> Hi. >> What? I think he messed up days. Why are you not wearing Lego? But Mike, Lego day was yesterday. I messed up again. Yay. [Music] Come on. [Music] Come. >> Spider-Man, I need your weapons. [Music] [Music] One, two, three. Yahoo. Yeah. [Music] What's up? There's a balloon over there. That's my balloon. >> No problem, Mike. I'll help you. I see. Thank you. >> Yay. [Music] Huh? [Music] >> Here you go, Mike. >> Spidey, you're the best. [Music] Help! [Music] Help! Please! Help! Let's go! Help! I need your power! [Music] >> I'm made to help. I'm in the house. >> I No problem. [Music] Thank you. Yay. [Music] way down. [Music] Uh-oh. Looks like the hurricane is coming. No. No. No. No. No. No. Oh no. >> Huh? My house. Help. Help. >> Minion. I need your skills. [Music] [Music] What's wrong? I need to fix my house. Okay, I'm [Music] >> No time for break. Let's do it. [Music] Thank you. Meow meow meow [Music] me. Woohoo. Meow. Let's go. [Music] Where is the kitty? Let's go. [Music] >> It's stuck on the tree. Look, Alice. Help. >> Help. >> Help somebody. >> Captain America, I need your braveness. Let's go. >> Huh? >> No one anymore. Sorry, Captain America. I'm going to do it by myself. >> What's wrong, >> Chris? Look. Our kid is stuck on a tree. We need your help. >> Don't worry, guys. I will help you. Yay! >> Thank you, Chris. Kids, remember, you don't have to wear this suit to be a superhero. >> Just ask your friends to help you. >> Bye. >> Yay! >> Let's fly down. >> Yay! [Music] >> My knees are dirty. I have to wash them. [Music] Candy. Yay. It's candy challenge. Let's go. Oh, yay. Perfect. >> That's with the bucket. Hm. [Music] So tasty. Yay. [Music] >> So many sweets. Where have you got them? >> From the shower. >> From the shower. What? [Music] Yeah. [Music] >> Yay. [Music] No, no, no, no, no, no. What the candies? What's going on? >> Let's check it. Alice, >> do you want an ice cream? [Music] >> Wait, I missed it. >> Nom >> nom >> nom nom nom nom. >> Okay. Num nom. >> What? >> Ellis, you have to take a shower. Let's go. >> Okay, take it. >> Let's go. Let's go. [Music] It works. [Music] So many candies. I think it's enough for you. [Music] >> Uh-oh. Why you wonder again? Where is my candies? [Music] >> Oh, I have an idea how smart I am. Ta. Now I'm going to have some candies. I'm going to have some candy. I'm going to have some candy. [Music] Where is my candies? >> What? >> What? That is so funny. >> My drink is for kids. >> Everybody knows. Uh-oh. Hi. Yay. >> Oh, it would be nice to eat something. [Music] Let's check it out. H, interesting. [Music] Wow. Um, [Applause] [Music] well, sir, >> please wake up. Wake up. What happened? >> Go, go, go, go. Okay. >> Welcome to our carbon restaurant. >> Oh, thank you. Hm. I would like to order this salad, uh, pasta, and, um, a pizza, please. >> Any drinks, sir? >> The orange juice. >> Okay. >> Oh, well, thank you. >> Okay, sir. [Music] >> We have a problem. >> Michael, we'll figure it out. Okay. Here's your drink. Thank you. Okay. Yay. Here you go. Orange juice. >> Oh, pepper sauce. >> Ready again. >> Oh, >> thank you. [Music] >> Uh-oh. >> What is it? >> Best cardboard in town, sir. What? >> The dwell sir, it's going to happen again, sir. [Music] [Applause] [Music] >> H pizza. Okay. >> H I need milk, vegetables, eggs. [Music] >> Yay. >> Okay. [Music] [Applause] [Music] [Music] I'm going to help you again. Please be careful next door. Okay. [Music] Uh-oh. [Music] Thank you, Chris. >> Oh, finally my pizza. What is this? What is mushrooms in my pizza? >> Okay, no problem. Your pizza with mushrooms. >> It's actually Here you go, Mario. favorite. [Music] [Applause] >> That's enough. Yeah. [Music] Yummy. [Music] H I need some cheese. Oh, cheese. Yay. M yummy. Almost ready. [Music] Yum, yum. Sticking somewhere. I can't do my best. >> What? [Music] Delicious. Never mind. [Music] [Music] Y [Music] in here. [Music] This is not a restaurant. This is a total mess. T No, no, no, no, no, no, no. [Music] Let's play. Yeah, sure. >> Wow. Let's make him ice cream. Ice cream. Yay. Yummy, yummy, yummy. Yummy. >> Hey, this is my ice cream. >> This is my ice cream. >> I'll give you an ice cream if you will help me clean up your room. >> Yay! >> Let's do it. [Music] Well done. >> I'm finished. >> Okay, Mike, choose your favorite flavor. >> Strawberry. Okay. >> Yay. >> Here you go. Right. >> Thank you, uncle. [Music] >> Yummy. >> Yay. So yummy. >> Where did you get that, Michael? >> Huh? I got it from school. Ice cream. [Music] >> What? Huh? Hey, this is my ice cream. What is mine? >> You've got to help me if you want an ice cream. >> Okay. [Music] Yay! Yay! >> I'm finished. Can I have ice cream now? >> Here you go. >> Thank you. Welcome. >> Enjoy. >> Looks delicious. [Music] >> Cool. [Music] New ice cream. Yay. Let's go. I want ice cream. >> Yay. >> Hey, this is my ice cream. >> This is my ice cream. >> I will give you an ice cream if you wash my car. >> Yes. Yes. >> Uh-oh. [Music] Yay! Dad! Yay! Uncle, we're finished. >> Oh, thank you, kids. [Applause] >> This is for you. >> Thank you, uncle. >> Thank you. You'll be so yummy. [Music] M delicious. [Applause] [Music] Yay. >> Yay. >> Oh, hey. This is mine. >> No, this is mine. >> Hey, >> it's only for me. [Music] H. [Music] Huh. [Music] Oh no. [Music] What happened? You did this. [Music] [Applause] [Music] [Applause] [Music] [Music] [Applause] [Music] What a mess, >> kids. Come on. [Music] Sorry. Help. Help me. Balloon caught me. Help me. Mike, please help me. Please. >> Balloon man, catch me. >> I can help you. >> I think you should go through balloon challenges. You will get me. I'm going to get the blue one. >> Okay. Hurry up. >> Catch him. Hurry up, kids. >> You will get me. Where is he? You should pop the balloons. >> Balloons? >> No, this one. >> What? >> I know how to make it faster. Yay. [Music] Yay. [Music] >> Good job. You should call me. [Music] >> Good job, please. High five. The next is orange. >> Okay. >> Where is mine? >> Bubble man. Bubble. >> It's you, Bubble Man. >> Of course, it's me. And you've got 30 seconds to complete the puzzle. No. [Music] >> Yeah, I found him. [Music] >> Not so much time left. You should hurry up. 50 seconds left. >> It's a pentagon. >> You won't make it. >> I like I like it. Oh no. >> Oh no. >> Yay. Challenge completed. Yay. [Applause] >> Yay. >> Yes. Let's go. >> Where's Mike? >> Oh, here they come. I'm Eliza. I'm here. >> Mike, you should pop your orange one. >> Mike. Yay. Yay! Hurry up. Hurry up. [Music] Yay! >> Where is it? I don't know. >> Choose the bottom. >> I want this one. I want this one. >> And take a fire color. [Music] >> Good. So fun. Yes. Let's go. >> I want the best. >> Yay. Okay. [Music] >> Yeah. And the last one. [Music] >> Yay. It was fun. [Music] Y let's go. Yay. >> You should catch the human now. Okay. >> Okay. >> I'm waiting for you. Come on. Come on. [Music] >> It's a bus of balloons. You need special balloons to my >> fighting. [Music] [Music] [Applause] We have no balloons anymore. We need something here. Okay, this magical wants to help us. [Music] >> Michael, ready? I'm ready. >> Yay. Remember kids, >> teamwork always win. Together we can make everything. >> Yay. [Music]",
    "start_time": 4.4,
    "end_time": 3873.3799999999997
}