{
    "video_id": "F0OkwXKcPSE",
    "channel_url": "@mrbeast",
    "transcript": "Hi, me in ten years. I'm gonna schedule upload this video\nten years in the future. So, you're gonna see this in 2025. It's 2015 for me right now. Dude, what if I'm dead?\nDude if I'm-- Ooh, that'd be weird.\nThat'd be so weird. RIP. That would be really weird,\nbut let's see. 10-- dude, if I don't have a million\nsubscribers when you see this video,  my entire life has been a failure. I hope I have a million subs. I better have a million subscribers\nwhen you guys see this. But by the time you see this, I'll have finished high school,\ngone to college. Probably be doing YouTube\nas a job, hopefully. Maybe, maybe… Um. Yeah, uh, as of right now,\nI'm enjoying YouTube. Hopefully I still--\nfuture me still enjoys it. And, I don't know.\nI'd-- be crazy if I had some ridiculous amount\nof subscribers. At the time I’m recording this video, I have 8000 subscribers\nand 1.8 million views So whenever you see this,\ncompare these numbers to whatever I have\nwhen you watch this. Dude I really hope\nI have a million subs by now. Please future me, please. What am I doing with my hand?\nPlease have a million subs. I don’t--I probably should have\nthought about what I was gonna say. Just, hey, hopefully\nyou have a million subs. And uh. Dude, I wonder if you still-- Okay, so I should be studying\nfor a history test. And uh, I wonder if you and--\nor me in ten years remembers what grade I'm gonna get on this\nhistory test that I take tomorrow, that I'm not studying for\nbecause I'm making these videos. So I’m probably gonna do--\ndude, if you still remember the grade I get on this history test\nin 10 years, that's crazy. Dude, I'm probably gonna be married\nand stuff, eh. Alright. Oh watch me not be married\nand not have a million subscribers, not have any of this,\nand then you guys just think\nI'm a big loser. Then, yeah. I don't know. Hopefully you're still doing YouTube. Dude, what if I don't do YouTube\nwhen this goes public? That'd be weird. What if I'm dead when you see this?\nThat'd be even weirder. If you wanna, you want to see\nwhat time it is, just so you know\nwhat the date is. That’s the date.\nHopefully you can see that. Hopefully you still do YouTube. Um, yeah.\nI don't know. Mmh. Hey. Oh, my hair is messed up. Alright, yeah.\nI don't care. Hey future me.\nHopefully you're having a good day. So, yeah… I better have a million\nwhen this goes public. Ten years, man.\nTen years. I'm gonna be so different. I really am gonna be so different. Oh, man.\nMan. Alright, well. Alright, see you, guys.\nSee you, guys. See, me. Hey, me. One last thing just so you know\nwhat I'm talking about, it's currently October 4th. So uh, yeah. Like I said,\nthis is October fourth.",
    "start_time": 0.292,
    "end_time": 193.73499999999999
}