{
    "video_id": "4l97aNza_Zc",
    "channel_url": "@mrbeast",
    "transcript": "Take off your blindfolds! These two people used to date. They had a four-year romantic relationship\nand now they're exes. And if they spend 30 days\nchained together… I will give them $250,000. How long ago did\nyou two date? Three years ago. She broke up with me. He's salty. I can't force you guys to do it, but once you clip on the handcuffs,\nthe 30 day challenge has begun. I’m locked in. - Oh, gosh.\n- They're both handcuffed. From this point forward, if either of you decide to quit\nby crossing this red line, I will instantly unhandcuff\nboth of you. The video is over,\nbut neither of you wins anything. Have fun, you two. My ex-boyfriend?\nReally, Jimmy? Bro, what? - What’s up, dude?\n- Hi. Can I give you a-- Oh. Oh. Where are we? This is your happy home\nfor the next 30 days. This is the kitchen. You can hang out.\nYou can workout. You have separate beds. There's a question mark door,\nwe'll worry about that later. And most importantly,\nyou're probably wondering, since you two are handcuffed together,\nhow do you use the bathroom? Oh, no. Someone go in the bathroom. Stop it! I have to shower\nwith this on? Yeah, if you take it off at any point,\nthe video is over. Slide the handcuffs in there. Wait. You guys are cruel! Boom! Hey, she needs\nmore slack. But what if she has to use the toilet. Hey! Wait, I can't believe I'm in the same room\nas you right now. - Yeah, and you're kinda stuck with me.\n- Yeah. - Wait, am I stuck with you?\n- Oh, gosh. Actually, Suzie has been through\nthis kind of challenge before when she lasted 100 days in a room\nwith a complete stranger. But this time, she's trapped\nwith someone she knows a little too well. One thing to decide, do we even wanna be\neating together? I don't know. Ok, Josh is showering right now so I feel like it's time to get\nmy honest thoughts out there. I'm nervous for this challenge. We dated four years.\nWe're broken up for three, and now we're locked\ntogether in a box. At some point, someone's gonna\nhave to start saying something. Ay, ay, ay. - Jeez.\n- Sorry. Well, you might as well\nleave it on now. It's the morning of day two, and our exes are still trying\nto find their own rhythm. You fed me. That equals happy woman. With this 60-foot chain,\nthey can live their own separate lives. And that's exactly what\nthey're choosing to do. I was picturing like if we were actually\nchained close together and I was feeling\na little scared. Are you scared\nto be close to me? She really should be.\nBecause this chain will shrink, and these two exes will be forced\nto confront each other. Get me out of here! You make me wanna die. But for now, just living together\nis proving to be pretty difficult. - You get wet?\n- Uh, huh. Oh, sorry! With the disgusting pan grease\nall over me. Sorry. On that note, I'm gonna go lock myself\naway in the shower. Here's the deal. I've been pretty rough\non her today. She deserves it.\nYou broke up with me. I feel like we should talk\nabout our problems eventually. I want to acclimate a little bit more\nbefore just yapping. It's been a few days\nsince we've seen Jimmy in here. I'm ready for some action\n'cause right now, this is the vibe. Silence at all times. Things are so bad between them I wonder if a shorter chain\nwould bring them closer together, or tear them apart. It's day five,\nand time for the first offer. Happy day five! Wait why are you guys\non opposite sides of the room? 'Cause we can be. Well, come on over. You're coming up on a week.\nHow's it been? It's just like, I'm getting kind of\nused to her being here. It's hard to even like,\nreally talk about things. - Oh.\n- Yeah. To celebrate five days\nof being chained together, you're being served\na very special offer. Your chain is about to shrink\nno matter what. Bro. Offer #1 is a 50 foot chain, 10 feet shorter than\nwhat you currently have. - Mhm.\n- Ok. Offer #2 is a 30 foot chain,\nyour current chain cut in half. And if you choose this one,\nwe will add $25,000 to your prize pool. If you guys wanna make $25,000\nwhile sitting around in here then you would choose\nthis 30 foot chain. No, that's so short. If you choose this chain, you'll have to live a lot closer\nto each other. I mean I was around you\nfor four years for free. I mean, I can be a little closer for-- That's crazy. An extra 10K. Do you want your chain\ncut in half? I'm saying yes. I'm with it.\nLet's do it. Ok. Nolan, let's cut\nthe chain in half! Oh, gosh. Their chain has officially\nbeen cut in half. Good luck\nto the two of you. Cheers. I'm not regretful\nof taking more money. Well we still have\n25 days, but we also haven't really figured out\nthat this is shorter yet. Like, we haven't bumped into the issue\nof it being too short yet. It'll probably happen\nin a very short amount of time. Ohh! Like right now! Oh! Not even 24 hours into the chain\nbeing half the length. We are already having problems. Even right now, Josh is showering\nwhile I'm sitting at the table. I would love to be\non my bed right now, but the chain doesn't reach\nthe bed anymore. At 4 a.m. got woken up by Josh\nto go to the bathroom. I need to go to the bathroom. [groans] The chain being shorter,\nit's very uncomfortable in here. My God, 6 feet distance\nat all times please. Ew! You just got your sweat\nall over my forehead. Hey, I’m kind of walking! I’m Josh,\nI'm immature. [mocking voice] My name is Suzie. You're looking pretty gross. Thanks! D-Bag. I think this challenge might be easier\nif it was with a stranger. I know you're working on it.\nI know you're trying your absolute best, but you're absolutely insane. [gasps] You're being disrespectful to me. - It's not disrespect.\n- You're being mean. This morning I started with a comment,\nand then we kept having an issue about it. To be real, the problem with the comment\nwas that you're like, making fun of me in hopes that\npeople would join in. To also point fun at me. Bro, you're actually delusional. Suzie in the psych ward. I really don't know how I'm gonna feel\nabout you at the end of this. It's been an absolute fiasco. It feels like she escalates it\nwhen it's like, \"No, no. Just a comment.\nI'm not hating on you.\" - You know what’s crazy?\n- You. Funny. Let's see if we go one day\nwithout Josh pissing me off. Pardon? You keep saying things to embarrass me,\nand I don't appreciate it. It's literally a joke. No, that's so embarrassing to do\nto another person when who knows how many people\nare watching us! Oh, like \"that's disrespectful\" thing\nhas turned it into a bit. I'm not thinking\nin bits right now, I'm thinking in how I feel\nI'm being treated. - Everything's about you.\n- It's not. You're the star\nand I'm the accessory. It's not all about me at all. It's--\nwe're equal partners. Josh is the one who did it.\nJosh pissed me off. It's Josh's fault. Because I feel like you're saying things\nthat make me wanna die. I apologize,\nit's totally understandable. But the only way that we're gonna\nkill that now is to let that be yesterday. I wanna make it 30 days\nand be done. I'm certain that you do as well. Yeah. This is more rough\nthan I thought it was gonna be. We're not gonna survive this\nif it keeps going like today did. But I think we should try. Absolutely, I think we should try. We're just in here to survive, win money,\nand then never speak again. Fresh start? Sure. And though they agreed to get along\nfor the sake of the challenge, I wanted to see just how committed\nthey were on the next check-in day. It's day 10! Yeah! To celebrate, we’re going to-- Oh, no. Shrink your chain by 10 feet! - Woohoo!\n- Yay! For free. Oh. But before we do that, obviously, shortening the chain last time\nled to some personal space issues. [groans] And because in the future days, the two of you will have an opportunity\nto make a lot of money, in exchange for shrinking your chain, for one time only,\nI'm gonna unbolt the furniture, let you guys move it around,\nand then bolt it back down permanently. Oh. But first, let's update your chain. Can't wait. And to help move things around… Alright, alright, alright! Here is your expert crew. Alright. You have until midnight tonight to move\nwhatever you want around. Should we get to it? Yeah, rotate, rotate, rotate. After putting the boys to work, Suzie and Josh moved all the furniture\nwithin each area closer to each other, with an emphasis\non one area in particular. This is our bathroom and our bed. What we have tonight is what we will have\nfor 20 more days. It's survivable. And to sweeten the deal,\nI gave them one more surprise. - Suzie, Josh.\n- Chandler. We got a fridge full\nof our brand new Feastables! - No way!\n- Let’s go! Sorry, guys. This is our first time\nrevealing our chocolate milk. Oh! Cheers! Cheers. That's good. It's also made\nwith real whole milk and loaded with vitamins A, D,\nand potassium. You took the words\nright out of my mouth. It tastes amazing. Go find Feastables chocolate milk at Walmart, 7-Eleven,\nand Speedway locations nationwide. This is the best part\nof the whole challenge. Even though the chain got shorter, moving the furniture put Josh and Suzie\nin a better mood. The chain shrunk 10 feet, and so far today\nwe haven't had any problems with it. Is there anything you're concerned about? Being too close. Ok. Even though their fighting continued, the chain was actually\nstarting to bring them closer. And over time,\nthey were becoming friends again. We're super bored today\nand we've eaten a lot of Lunchly, so we're gonna put it up on the wall\nin a heart shape. And now I present to you\nthe first Lunchly heart in the world. Josh wanted to lay down and journal\nat the same time as I wanted to walk\non the treadmill. This is our compromise. Thank you, Josh. We should be working together\nto get out of here. Yeah, we have to get through\neverything. - Friends?\n- Friends. But now that they were finally\ngetting along, Josh couldn't help but wonder, why didn't they work out\nin the first place? Hey Suzie, can we talk? We didn't have a bad breakup. You wanted to go do other things\nthat didn't line up with what I was doing. Like, a reoccurring thing\nin the past was, I felt as if I had to be sharing with you\nwhat I wanted all the time. Honestly, I think if I were to\nentertain something again… I would need to feel that it's like,\nvery different than before. What did you do after we broke up? Bawling my eyes out\nbecause I was so alone. What’d you do when we broke up? I started crying. Like not following you but never\nforgetting your Instagram handle. Searching it up every other week. But it was weird like watching your life\nin third person after being a part of it\nfor so long. Felt like my heart split in two. Don't cry. I was still madly in love with you\nwhen I broke up with you. I didn't want to break up.\nI never wanted to do that. [chuckling] I don't think I ever like\nfully stopped loving you. What? So what do we do? I feel like this challenge is allowing me\nto see Josh in a whole new light. It has been… eye opening. The only problem is,\nwhat happens in this room is not a good representation\nof what life is in the real world. Even though Josh and Suzie were making\nbreakthroughs in their relationship, this was still a 30-day challenge, and the isolation from the outside world\nwas starting to get to Josh. Literally gave up my entire life\noutside of here to be here. And it's just now really setting in. Bro, I haven’t been outside in two weeks.\nMy whole life is outside. If I had to pay to get outside access,\nI would not do that. I just want to be outside, bro! What's up? I don't feel well. Mentally. And that's why on day 15, we had the perfect solution\nto their biggest problem. For day 15, we wanted to offer you guys\nan outdoor space. I'm giving you the chance to unlock\nthe outdoors and double your space. That means full access\nto the entire yard whenever you want. But here's the catch: you guys wanna keep\nthis outdoor area, you're gonna have to switch\nto a 10-foot chain. I've been missing the outside. We might have a better view\nof like the sunset or even sunrise. Yeah but I don't think that's worth\nlosing half our chain. If we take this off\nfor just getting to go outside, we're always this close. We shouldn't do it, and we can easily\nsacrifice not having sunlight. I just don't want it\nto be a missed opportunity further down the line. I’m very tempted to take this. Ten feet halfway through\nthough means who knows how much\nwiggle room we'll have, though? You guys have had time\nto talk about it. Are you taking the day 15 offer? Yeah, no. Alright well, go back inside. We’re just gonna enjoy it\nfor one more minute. Yeah, there's a 10 second timer. - I'm up. I’m in, I’m in.\n- 10, 9, 8, 7… 6-5-4-3-2-1! See ya in a few days. Alright. Do you feel regretful now that\nwe jumped inside? I don't know.\nI do miss the outside. Turning down the day 15 offer\nreally took a toll on Josh. And the next day, the thought of\ngoing outside was still eating at him. It’s a little bit, um, depressing today. You just woke up. Thinking it was Mystery Door and not. Having nothing change\nabout our daily life. This is the longest month of my life. The day that we were expecting something\nbig to happen, nothing happened. Why has today felt so long? Well hopefully the Mystery Door\nwhatever it is, it’s something good. Do you have any new thoughts\non what's in that room? Oh my gosh,\nthere's Teslas back there. That'd be crazy. Here's the thing,\nthis isn't the first time Suzie has faced\na mystery challenge. In a previous video,\nshe turned down a mystery box that had $50,000\nand her favorite car, a Tesla. And it crushed her. Oh, I wanna cry.\nThat's literally my dream. They got us Teslas! If it's a Tesla behind those doors, we have to take it,\njust for my redemption arc. Come on. But for Josh, the excitement\nof the Mystery Door still wasn't enough\nto bring him out of his funk. [groan] Feelin’ like I'm going crazy. Violence, bro. [grumbling] It's like, get me home! Josh was having\na hard time today, and sometimes you have to\nbe the one to continue pulling your partner along\nwhen they're having a bad day. So Josh is still sleeping, but I decided to make him\nbreakfast this morning because Josh was just\nfeeling really down. For you! Whoa! You made a heart\nout of bacon and eggs? Yeah. - Wow. A heart?\n- Mhm. Friendship? Friendship. Part of me is wondering what that meant.\ntryna figure that out. Like, you don’t just make someone\nbreakfast in bed. Josh was so confused and desperate\nto understand Suzie's gesture that he did something so drastic,\nso unthinkable. I mean, the one thing that he hated most\nin the entire world… I guess I'm gonna have to read\n“The Man's Guide to Women.” “When it comes to\nthe intricate dance that men and women do\nwhen they're attracted to each other, the women are in control.\nTheir actions were often subtle. All were definitive signals that a woman\nwas interested and approachable.” While Josh was wondering\nwhat was behind Suzie's act of kindness, Suzie was wondering\nwhat was behind the Mystery Door. I can't see anything.\nWhat if it's a little Tessy? Maybe we should make Jimmy\nsome banana bread. Good job.\nI'm proud of you. Thanks. Thanks? - Bye.\n- What? Can't wait for the chapter\nof my “Men's Guide to Women” to explain what that was. The book says if she wants you,\nthese are the signals: Direct eye contact,\na smile, repeatedly glancing at you. Here's my guess… She likes me. Is that the ring from me? Yeah. You still wear it? Every once in a while. I never was able to throw away\na single thing from our relationship. One thing in particular,\nI had to sell. What do you mean? The night before we leave here\nis when I’ll tell you. I don't think I ever told her.\nI was too scared. He kept most of the stuff\nfrom when we dated, except something that he's been holding\nfrom me this whole time. Let's just say there's a big reason\nit's a secret. I gotta say,\nI'm dying to know that secret. If there's anything keeping me here\n‘til the end of this challenge, it's that information. It's day 20, and it's time\nto spice things up a little bit. Happy day 20! How's it goin’? In front of you are five ways\nyou can open this Mystery Door. - Ooh!\n- Oh my gosh. Now, here's the thing:\nI'll be going from right to left, revealing an offer\nunder each platter. If you say yes to an offer, whatever's behind\nthe Mystery Door is yours. If you say no, only then\ndoes the next offer get revealed. But just remember, you might be saying no\nto the best deal on the table. Oh, that's messed up! Option #1, you pay $50,000. They hope that I take this one\n'cause I'm all nervous. - What do you think?\n- I think we say no to this. Ok. Offer #2, $100,000 out\nof your prize pool. Ugh! It's probably the last platter\nthat's better. I think we get rid\nof this again. The third offer… Ooh! Minus 25,000,\nand your chain goes to 5 feet. This is how close you'll be. You still have 10 days left\nin this challenge. Oh, God. Oh… If they say no,\nthey only have two offers left. Oh, this is hard! If they say yes, they will win\nwhatever's behind that question mark. Before you make a decision, do you remember\nthe last video you were in, where you said no to the mystery box\nand a Tesla? Yep. What do you think\nis behind that door? I have no idea. I can't see anything. Put your head on the ground. What if it's a little Tessy? I just wanna see the door! Let's take this…\nfor you. - Yes.\n- Yeah, we'll take this one. Alright, they have officially\naccepted the offer! My next offer was minus 25,000,\nbut your chain stays the same length. The final offer… Free. It's ok. They shrunk their chain to 5 feet,\nthey paid 25,000… What if they put two Teslas? Tesla, Tesla, Tesla… Teslas! You both won brand new Teslas! [screaming] Jimmy!! Come on in! I’m actually gonna cry! I know it's just a car,\nbut I’m actually so grateful! This is a $40,000 car. - Can I give you a hug?\n- Of course. Oh, watch out for Josh. It's like a redemption arc! Exactly. I'm so excited!! She's excited. I'm excited because we just launched\nour brand new creation for Feastables: Sour Strike Gummies! I literally can't believe this. Absolutely insane. They have no artificial dyes\nor sweeteners. Just clean, high quality ingredients. I literally feel like I'm in a dream! Sour Strike Gummies\nare now available at Target, 7-Eleven,\nand Speedway locations nationwide. This is the best day\nof my life! But don't forget these Teslas\ndo come at a cost. Let's see how the bathroom works\nnow that their chain is only 5 feet. Alright. Go to the shower. Alright. Oh! This chain can't get shorter. Oh… it can. We made you a Feastables banana bread. That actually looks good. I think the best way to wash this down\nis with some Feastables chocolate milk now available in all these retailers\nyou see on screen. It tastes phenomenal.\nHas 13 grams of protein. It’s in stores now.\nGo try the new Feastables chocolate milk. I'll see you in 5 days\nto shrink your chain again. - Great.\n- Wow. Can’t wait. I look forward to it. Oh. See you guys. Good morning. Ok, gentle movements. I can't even wash my hands. Suzie and I have discovered\nthe fun reality that a 5 foot chain sucks. This chain is really annoying.\nI can't even bring my hand up. Yeah it's pissing me off. [groaning] [groaning] Yeah, right.\nYou're gonna sit down. This 5-foot chain does not allow us to do\ntwo different tasks at the same time. - Ow!\n- Ah! [groaning] This is gonna get old real fast. - Hey!\n- I need the chain! Bro! It doesn’t reach\nin the shower. And that's my new reality. As he patiently waited\noutside the bathroom, his mind wandered back\nto the book. \"Be a gentleman.\nPull out her chair…\" Which inspired a change in his behavior\nthroughout the day. \"Open doors. Put the woman\nat the center of any conversation…\" What's the name\nof your car right now? It's Suzie. \"Briefly touch her forearm\nwhen you ask her to dance… \"Ask open ended questions…\" What the heck are we gonna do\nwhen we get out of here? I don’t know. We're gonna wanna just be\nhandcuffed again. [laughing] But it was the final chapter that focused\non their key issue. If you don't plan a date\nthat makes her feel special and important. That's where I completely screwed\nmy entire relationship. I had to be sharing with you\nthe smallest of expectations. Like we haven't gone\non a date in 3 months. I didn't continue planning dates\nthat made her feel special and important, and I didn't pay attention\nto what she wanted. I think she wants a date. So when Josh asked to speak to a producer\nin private about a date, I knew I had to make it happen. Aw! You do look handsome. Yeah. You look really beautiful. Thanks. We got candles.\nThey got real candles. You did good. I gotta admit. Aw, this is so nice. Please have a seat. Thank you, sir. I kinda like this,\nlike being on a date. We are emotionally getting closer again. It’s true. I think it's scary 'cause\nhow it ended the first time. I think this is a step\nin the right direction though. Can I take you on a real date\nwhen we leave? Like, outside of here? Yeah. Yeah. I'd love to go on an actual date. Ok. Wanna cheers with\nour Feastables chocolate milk? Cheers. To our MrBeast date. Yes. This has been a good time\nto reconcile. Like is there makeup anywhere? Kind of figure out\nthe other person again. No. Hi. Hi. The idea of him intrigues me. I'm glad to just have a date\nfor the first time in 3 years. It was probably one of the most fun days\nthat we've had in here. Perfect end to our date. I'm feeling real nervous 'cause\nI don't know what is gonna come next. It's day 25. Oh gosh. We're about to fundamentally change\nthis entire video and the change is\nunder this platter. Yeah, I hate this.\nMy heart is beating. Reveal what's under the platter. That's all you. I brought each of you the keys\nto your handcuffs. Up until this point, unhandcuffing yourself meant\nyou'd both lose. And if at any point between now\nand the end of the video you take your handcuff off, you actually get all $250,000\nand both Teslas. [laughing] Grab your key. Grab your key. If you take your handcuff off,\nyou get everything and the other person gets $0. Are you gonna do it? I'm actually scared now.\nI'm gonna always be on edge. I thought I was going to be like\na foot away from you. Oh and on top of this,\nevery single day going forward we are shrinking your chain\nby a foot. Oh. Oh. On day 30, you two will be\nthis far apart. Oh, gosh. But you don't have to do that. Because now you can take the handcuffs off\nat any point. That's crazy. This is wild, actually. You probably wanna know\nwhat's truly going on in his mind. And you probably wanna know\nwhat's truly going on in her mind. Bring in the lie detector. Are you kidding me? Nope. We brought in\na lie detecting professional. One of you might be\ntaking the handcuffs off. This is where the video gets fun. Josh, you are up first\nin the hot seat. We combed through your vlog footage\nand crafted questions that will really help her decide if she should stick it out in this video\nor leave today. - Whenever you're ready.\n- Ok. Have you ever doubted\nmy loyalty to you? No. Even though she broke up with you? No. True. Wow. He really trusts you. Whoa! Right. Brace yourself. Yeah, right. Since being here, have you thought\nyou might be better off single? No. - No?\n- No. Really? - Oh, great.\n- Uh oh. We're not giving you that one, buddy. That's literally a Mount Everest\non the graph. So it's a lie? It is a lie. Oh, ok. Let's keep going!\nThe questions get better as we go! Would you steal the entire $250,000? I don't think so. Yeah, you reacted a little bit\nto that one. You wanna think about that one? Mmm. We just need a yes or no. No. Is he telling the truth? I wouldn't give it\nto him completely. No. If there were no hard feelings… Of course there’d be hard feelings! Does that make you wanna\ntake your chain off? It makes me question it more. How do you feel now that\nyou got some hard hitting answers? Maybe a little bit scared. But then it was Josh's turn\nto ask Suzie some questions. Josh, are you ready? I'm ready. Have you hidden something\nfrom me you knew would hurt? Yeah. True. If you knew, like, how close I got\nwith someone else while we were not together. Ok. Something to talk about. I get a vibe you don't wanna talk\nabout it now? Nope. Ok. Next question. Do you believe that\nI hold you back in any way? Yes. - True.\n- The future outside of here… it's just hard to tell. Ok? It's hard to see that fully\nin this moment. In your perfect future.\nam I in it? Yes. True. It's funny how the answers\ndon't coincide. You wanna elaborate on that? In a perfect future, I'm in it. Yet I still hold you back. So your perfect future,\nI'm holding you back? I feel like you’d have to show me\nhow it is to, you know, date again. And what that would look like. We're getting some\ninteresting answers over here. You have her hooked up.\nAnything you wanna know about her? Are you gonna unchain yourself? No. True. Did you stop loving me? No. True. Josh is taking full advantage\nof this moment! Boom! Alright, maybe we un-hook her.\nJosh is-- Yeah he’s grilling me! Alright, now you guys have a lot of things\nyou need to discuss. Oh, gosh. I'll see you tomorrow\nto shrink the chain. The lie detector was pretty crazy. I think the one that I was like, “What?” was the one that you said yes to\nwith taking the money. I mean, it's just an honest thing. Like, Suzie already won\nlike 200 grand. So what? I'm still in here\nputting in the same amount. No, I know.\nIt's just a thought, like take it. Let's get outta here quicker. Today, we were given a gift. I could literally leave this room\nwith all the money. She broke up with me\nin the first place. That’d be the perfect revenge story! Hi! It’s day 26! - Bro.\n- Hi! - A 4-foot chain?\n- 4-foot chain! We actually have\nanother surprise for you. Oh. Oh wow. What is this? This is a soundproof box. You guys are gonna be able to talk\nand say how you really feel. And the other person\nwill not be able to hear you. Josh, let's have you go first. Oh, alright.\nShould I pull the chain? Bro! Josh? Ok! After last night Suzie,\nhow are you feeling? It was tough in a way. When he said that he would\ntake the money if he had hard feelings\nabout the relationship and the whole breakup still, maybe he wants revenge\nin some way. Something else that\nI've been thinking about has been the option\nto take my cuff off right now. He was quick to say,\nyeah, he would take it as if he deserves it more\nor something. Alright, Suzie, your turn. - Bye!\n- Bye, bye [unintelligible] We are only a few days out\nfrom the end of this challenge, and Josh still hasn't told me\nthis big secret that he's been talking about. You don't plan on walking outta here\nwith 250 grand? It's a good question. Josh might literally steal\nthe entire $250,000 prize pool. Well if he does, Current would be the perfect place\nto deposit all that money! I could live without working\nfor 2 years, 3 years. Nolan, would you like the ability\nto get up to $750 of your next paycheck\nin advance? - Yes.\n- Then you should download Current! Do you want help\nbuilding your credit score? - Yes.\n- Then you should download Current! I'm downloading it, Jimmy. If you use this QR code or\nthe link in description: Current.com/beast and download Current right now, I will personally deposit $1\ninto your banking account. I wish I could just keep doing that. I've already given away hundreds\nof thousands of dollars through Current over the last 4 years. Current can help you\nwith all your money needs. It's the #1 banking app\nfor your paycheck. It's probably what I will do. Get this, if Josh steals the prize pool and you guys download Current\nand use code Beast, you will technically make more money\noff this video than Suzie will, and you didn't have to spend\n30 days in a room. So download Current right now,\nthere's never been a better time. I'll send you $1 right now. Download Current\nand I will pay you to do it! It's the best place\nfor your paycheck. Alright guys, we're gonna leave\nthis box in here for a little bit of privacy\nwhile we're gone. Bye guys, we’ll see you tomorrow. - Oh no.\n- Alright. The short chain was clearly\ngetting to them, as both of them had a lot\non their mind. I'm really trying to be patient. Suzanne, you’re slow,\nand it pisses me off sometimes. I am a little bit annoyed right now. Josh keeps making me\ndo the activity he wants to do by literally picking me up\nand dragging me there. This isn't very nice. Good morning! Day 27. - From 4 feet--\n- To 3 feet! The fact that I can’t do anything in here without Josh literally hovering over me\nat all times is driving me crazy. Oh my God! Josh! Stop that!\nJosh, let me out! Why are we in the kitchen? - Are you done?\n- I am now! - This man--\n- I need water! Are you serious? I’m sorry. I just needed something to drink! So annoying, bro. Day 28! Ooh what?\nThat's so short! Let me tell you right now,\nthis 2 feet is tough to deal with. A little bump in the kitchen used to be,\n\"Oh sorry, my bad.\" And now it's like every single little bump\nmakes me wanna leave. I just wanna get out of here. That has nothing to do with\nwhat we were saying anyway. I could just leave! Josh today randomly brought up\nthis thing where he said, \"Oh, I can just leave at any time.\" He kind of made me a little concerned that\nhe's just gonna walk out at any point. 24 hours remain!\nHow you doing?! - Let’s go!\n- Woo! Yay! What's life been like\nwith the short chain? Pretty rough. Yeah, sleep was awful last night. Before we shrink down to a foot… Josh, I don't know if\nthis is the time to tell Suzie, if there's something\nyou wanna bring up? One thing in particular\nI had to sell… Tell me! Ok, so the last 8 months of us dating… Ok. I was saving for an engagement ring,\nthat I ended up buying. But my plan was on your family vacation,\nI was gonna propose under the waterfall. Are you serious? And we broke up\nbefore that happened. That makes me wanna cry. When we broke up, I sold the ring\nand I bought a motorcycle. Oh! [laughs] I actually don't know what to say.\nYou had an engagement ring for me? Yeah. I'm sorry. It's ok. I mean, he got a motorcycle out of it. I got a motorcycle out of it. Exactly. Oh my God. This is a 1-foot chain. - And lastly…\n- Oh let's go! This is exactly how much time\nyou have left. Yay! Well, have fun. Bye. It has been a day today. I finally found out\nthe secret from Josh. It was that he had an engagement ring\nsitting there waiting for me at home! Now I know that his heart was\nin the right place the whole time. I do see that future with Josh again. Alright, let's sleep\nby the money tonight, shall we? Waah! Nice! 12 hours and 43 minutes.\nHow does it make you feel? I think overall, the experience\nhas been amazing. I’m probably more so dying\nto get out of here. I am scared for the next 24 hours. On the lie detector he asked me if\nI would take my cuff off early, and I said no. True. But I never got that\ntrue answer from him. So I have been scared the last few days\nthat he might actually take his cuff off. Am I gonna take my cuff off? Well, it is a lot of money. $250,000 would be more so life changing\nthan say half of that. When we broke up for a very long time,\nI felt very lost and alone. I think it'd be fair for me\nto take the money from her. We have the best view\nin the world tonight! Our countdown clock. So if we get a full\n12 hours of sleep, we'll wake up with 17 minutes\nuntil Jimmy arrives. - You know what I've been thinking about?\n- What? Remember like 3 years ago\nwhen you broke up with me? Yes. And we like didn't talk\nfor 3 years… Mhm. Because I could literally just\ntake all the money and then we wouldn't talk\never again. Bro! I'm just saying! Three seconds on the clock. If Josh unchains himself\nbefore the time runs out, he wins the entire $250,000\nand both of the Teslas. Ten minutes left on the timer!\nLet's see if someone steals everything. How's it going?! Oh God, I’m nervous! It's actually time.\nIt feels fake. Suzie this could be your 125 grand,\nJosh that could be your 125 grand. Unless, one of you\ntakes the handcuffs off. And just a reminder, this is what you said\nduring the lie detector. Do you believe that\nI hold you back in any way? - Yes.\n- True. Would you steal the entire $250,000? I don't think so. You reacted a little bit\nto that one. A minute and 12 seconds. This is your last chance\nto steal the money! - Are you going to?\n- It’s the ultimate revenge. Oh my gosh.\nIs Josh playing the long game? Stop! Are you going to?! 16 seconds, you sure? Nah, he deserves half of it. I might deserve all of it. Woah! Josh! Is there anything you'd wanna say to Suzie\nfor when this video airs? I never fully stopped loving you\nafter we broke up. And I carried that with me\neverywhere I went. There was so much love left over\nfor her in my heart that I couldn't move on\nand allow myself to love someone else. Can I take you on a real date\nwhen we leave? Yeah! Ok. It's a date. Ok. Nah, he’s messing!\nThat looks like a guy who’s messing. I'm not gonna do it. 3, 2, 1… Time is up! Alright! I don't need that thing anymore!\nYou are now free. Oh my gosh! Here's your $125,000! Suzie, Josh, what's next\nfor the two of you? Oh! Oh woah!\nI was not expecting that! Ok! Looks like they're happy now! I hope you guys enjoyed. Subscribe.",
    "start_time": 0.0,
    "end_time": 2223.156
}