{
    "video_id": "zo7i8VTpfNM",
    "channel_url": "@mrbeast",
    "transcript": "Would you risk burning alive\nfor half a million dollars? Yes. Let's do it, man. Ok, good luck man,\nyou're braver than me. This is gonna be crazy. This man is literally\nin a burning building. There's fire around the door! The entire room is on fire. Oh my gosh, this is the craziest\nthing we’ve ever filmed. And behind him is $500,000, which he could win\nif he completes 7 fire traps, including: getting shot out\nof a cannon into fire, jumps through death defying\nrings of fire, survives massive fiery explosions,\nand so much more. - Get out of there!\n- Get out of here. Come on. In case you're curious\nwho this gentleman is, he's actually\na professional stunt man. But we are gonna push him\nto the max in this video. He’s still gotta get the money\nwhile the room's on fire. Alright, watch out Chandler! Alright, that's 2\nof the 10 bags! He’s on fire! He's literally on fire! Hey Nolan, get the fire extinguisher! Hurry up!\nThe house is about to collapse! Alright, that's it. The moneys on fire!\nOh my God, the money is burning. Oh! You did it! His legs are on fire.\nPut it out! Oh, my adrenaline is pumping\nright now. You managed to get $250,000\nout of that building. Let’s head\nto the next death trap! Take off your blindfold! Eric, welcome to deathtrap #2. What is this, man?\nHow high up are we right now? Uh, pretty high up.\nDo you wanna look down? Not really. Also, cue the fire. Oh, come on, man.\nWhat is this? I'm gonna be honest,\nuntil we filmed this, I didn't know you could\nlight water on fire. What's Jimmy's obsession with fire? This death trap is very simple. Hanging in front of this platform are\n3 bags of cash. Each representing what could be the new amount of money\nyou'll be competing for. And as they increase in amount, they get further and further\nfrom the platform. You have to pick one of these 3 bags\nto run and jump for. If you hang on it,\nthat will be your new prize pool. Look how far away that is.\nOh my gosh. That is a solid distance\nright there. Don't worry,\nif you miss, you'll just fall in a giant pond\nof flaming water. I got shorter legs, but they'll\nsurprise you with some power. Ok. Which bag are we going for? Do you want to take the easy route,\nlower your prize pool by 100 grand? Let's not do this one.\nIt's too easy, man. Alright. Oh, man. This is your current prize pool. Do you want the 250 grand, or do you wanna risk jumping 10 feet\nfor the 300 grand? I'm gonna risk it all. Ok. Only the 300 grand remain, so… Alright, here we are. And with that, oh-- Make sure you dodge the fire\nand the scissors. Copy. Is it really worth risking everything just to add $50,000\nto the prize pool? Now you're making me second guess\nmy decision making. Here, can I see you jump?\nLet's see it. Let's see, yeah. - You got the 300 grand!\n- I appreciate that. I don't think he got it.\nThat was nowhere near 10 feet. $300,000 on the line.\n100 million people watching. Let's see if he does it.\nLet's go! Three, two, one… See ya. Ah! [Jimmy] Oh! Oh! Wait, he's gotta\nmake it back, though. - Hang on.\n- Now he's gotta hold on. - He did it! He did it!\n- Yes! Yo! $300,000. Let's see if he survives\nthe next 5 death traps. Oh… you got it. We’re just getting started. Eric might be a little too excited\nabout flying over a lake of fire. So let's see how excited he is\nabout this next trap. Take off your blindfold. Behind you is your $300,000 you won\nin the last trap. What do you think trap #3 is? Throwing me off a cliff\ninto some fire. Not that far off. [laughing] Oh, great. Reveal the trap! Oh, Ok. For trap #3, we are gonna be shooting you\nout of this giant human sized cannon. And if you land inside\nof that yellow ring, you proceed with your $300,000\nyou've already won. But, if you land\nin that ring of fire, I will add another $50,000\nto your prize pool. I think it'll be awesome. I'm a stunt guy.\nWe're used to this kind of craziness. But if you miss both rings,\nyou go home with nothing. And you're probably wondering,\nhow do you calibrate the cannon? How do you know if you're gonna go\ntoo far or too short, left or right, slam into the concrete\nover there? That is exactly what I am wondering\nas I look at this monstrosity. Bring in the stunt doubles! We'll be giving Eric 3 stunt doubles\nto use as dummies. One by one,\nhe will fire them off to dial in the pitch, power,\nand direction of the cannon. If he doesn't hit the target\nafter all three stunt doubles, his final shot will be\nup to complete chance, and he could lose\neverything. If I can map the right distancing\ninto the 300k circle, and then make my way\ninto the fire and increase this, I think that's my move. Did you ever think in a million years\nyou'd be doing this right now? No, and now here we are doing it. This is your first\nof 3 stunt doubles. You can either get him\none step closer to winning 350 grand, or one step further away. What do you think\nabout the pitch angle? I'm gonna go up a little. So the higher he points it,\nthe further you go, just so you know. Ok, well let's ride. - Maybe a little higher?\n- A little higher? Yeah, yeah. A little higher? Ok. Now for the last part of the equation\npicture like a rubber band. The more you stretch it out, when you let go,\nthe further it flies. So the further he pulls\nyour chair back, the further you're gonna go. You're a tough dude. I'm feeling like\nwe should start you at 75%. Ok, so you want to do it right\nin the middle. Right in the middle. Yeah. Oh, boy. Oh, no. Does it feel real\nnow that you're in it? - A lot real. Really real.\n- Oh, this is gonna be crazy. Three, two, one… Fire! [Jimmy] Oh. [Chandler] It’s good! [Nolan] Right in the middle! Ok. Bring in the second stunt double. [Eric] Blue team. [Jimmy] There he is. Orange landed\nin the middle of the yellow. He wants you to land\nin the middle of the fire. If I put you in the fire,\nknow I love ya. But it's all\nin my best interest today. I'm gonna increase the power. Ok. Ok. And I'm going to bring this up\njust a little bit. Alright, how do you feel\nabout that blue? [sighs] I think I'm gonna find out\nvery quickly. Based on my math,\nBlue is gonna go a lot further. Have a good ride, dude. Let's do it.\nPull the pin! Oh! Oh! No good.\nHe missed. We are close. He landed in between the yellow\ncircle and the ring of fire. Meaning if that was you, the video would be over,\nand you would have got nothing. Yeah. Come on in, Red. Ok, bro Eric,\nthis is your last stunt double. You gotta nail it right now\nor you’re coin flipping it all. I'm gonna go up by 10,\nleave the angle. And we'll see what that gets us. Arm the cannon! - You better land in that fire!\n- You better get it dude! Three, two, one… Fire! Oh, wait. It's good, he did it! He barely made it in. I'm gonna increase the power by 5. And I think it's gonna get me\ninto my sweet spot. But first, why are you trying so hard\nto land in the fire, and add an extra $50,000\nto your prize pool? My dad's health has been up\nand down roller coaster from some cancer to health stuff. This is something that I can use to really invest into\ngiving them a good retirement and helping with their health\nand continued growth. That's why you want\nto keep growing the prize pool, and you wanna land in the fire and\nyou wanna keep taking all these risks so you can take care\nof your parents. It's a pretty special thing, so. I agree. I'd do the same for my mom,\nit's freaking awesome. Let's see if he lands\nin the fire. You have $300,000 riding\non this shot. Well, I'm taking care of my parents. I gotta do everything I can\nto support 'em, so… We gotta go big. Three, two, one… Fire! 300 grand on the line. - [Jimmy] He did it!\n- [Nolan] He did it! Yes, yes! - Oh my gosh.\n- We gotta give it to him. He did it, he's moving on\nto the next trap with $350,000. Come on over! Let's go, Eric! $350,000! But, but…\nI need to bag you. Wait. What? Don't ask questions. He still has 4 death traps between\nhim and his 350 grand. Let's go to the next one. Eric, welcome to death trap #4. Behind you is your $350,000… in a giant room full of fireworks. And above that room is a meteor. What do you think\nwe're about to do? Blow up this money if I don't get\nsomething accomplished here in a fast amount of time. - Correct, basically.\n- Yeah. You will have exactly 5 minutes\nto throw this grappling hook, and drag as many bags of money\nas you can back up onto the bed\nof this truck. When that 5 minute timer hits zero, that meteor, which will be on fire, is gonna crash into this room full\nof fireworks with your money. And whatever's not on this truck when\nthat timer hits zero will explode. Oh, Ok.\nI've never thrown a grappling hook. This is gonna be interesting. And before we start, we're gonna give you an opportunity\nto potentially win an extra $50,000. That is $400,000 in cash\nsitting in those bags. I came here with nothing, leaving with anything\nwould be amazing. So if I get one bag on this truck,\nI will be stoked. I would feel really bad\nif you only got one bag. Well, I'm going for all of them. The amazing things I could do\nfor my parents and taking care of them\ninto their old age. Aw, I’m rooting for you! I knew it! And just so we're\non the same page, I don't control that meteor,\nand those are real fireworks. When that timer hit zero, we literally need to be behind these\nblast shields or we could, like, die. I don't want\nto die here today, You know what?\nSame page. Come on, man.\nWe're on the same page. $400,000 on the line. Yell, \"Light the meteor.\" Uh, light the meteor? Yell it. LIGHT THE METEOR! Oh! Three, two, one… Start the timer! First throw. Alright, he got a bag! - He got a bag on his first throw!\n- We got one! We got first fish on the line, baby! Yeah, nah, these things are heavy.\nHe's gotta pull it up-- [grunting] Come on. Step it up. Here we go. Oh, look at that meteor up there!\nThat is crazy. Watch out! No, don't do that-- I might’ve messed him up. We got one, baby! Thirty seconds have gone by.\nYou got this. Come on. Wow, that meteor is burning. Come on, don't worry\nabout the meteor! The fire's dripping. It might light on fire\nbefore 5 minutes. Come on, we got one! Alright, #3! Guys, those are real fireworks.\nThey're not a prop. And when that meteor falls,\nthe explosion’s gonna be insane. I'm kinda scared. Come on, baby… Eric, let's go!\nIn 3 minutes, I can-- Oh, he's missing! When the timer hits zero, this truck is moving\n'cause if not, we can literally get hit\nwith, like, a thousand fireworks. We got it! This will put him at $200,000. 200! Come on.\nHelp me out, there. So, half the time's gone by,\nand he's got half the money. But now… - Come on!\n- He keeps missing. [grunts] Oh, it's stuck! - It's stuck!\n- Next hook. Wait. Alright, I had a feeling\nthat would happen. You have 2 left! - Thank you.\n- Oh my gosh, you're wasting time! At this pace, he's not gonna get\nall the money. - Don't talk like that, Jimmy.\n- Go, go! Don’t talk like that. Oh my gosh!\nOh, Eric! Oh no, Eric.\nI don't want it to happen like this-- I know! He is not getting the bags\nquick enough. He's gotta speed up. Ugh, I stepped on the line. His foot was on the line. Alright, he got one. Less than 2 minutes and\nthose fireworks are gonna blow up. Make sure you're behind\nthe glass wall, camera guy. Help me out, Jimmy.\nCome on. Alright. 90 seconds. - You lost another one?\n- Lost another one. Oh my gosh, there’s $150,000\nstill over there, and just over a minute left! Come on, man.\nLet's not leave this money behind. I’m gonna try and help you out.\nLet’s go! It bounced off the wood that’s laying\non the bag! - Come on.\n- Oh, no! I missed it. - Come on, Jimmy.\n- Why is this so hard? We got this, buddy. In less than 30 seconds, we gotta get\nbehind that blast shield! I'm not joking,\nthat meteor’s falling-- We got one!\nLast one, I think. Hurry up! You gotta go! Come on! Alright, 14 seconds--\n13 seconds. We’re good. Oh, that meteor’s falling\nin 10 seconds! We gotta go, Jimmy! It burned the power cables!\nOh, yeah. Hey, leave it behind! Go, go, go! Get in here. Close the door. Come on, let’s do this. Woo! - Holy cow!\n- Oh my God! Woo! It's safe to say\nthat 100 grand is gone. But he still has more opportunities\nto win money. Let's go to the next trap. Let's go! In honor of the $100,000\nthat just exploded in a ball of fire, we thought we'd go somewhere special… Eric, welcome back\nto where it all started. This is the room at the start\nof the video where you lost $250,000. What are we doing\nback in this room, man? I hate this room. Light the room on fire! Come on, man! The room is now lit on fire, and if you do not get this money out\nbefore it burns, you will lose it. But I will cut you out if you tell me you like my brand-new\nJack Link’s MrBeast beef stick. Let's go.\nI'm in. This is my brand new product\nwith Jack Link’s. What do you think of it? It's actually really good, man. Try some more. - That fire’s getting kinda big.\n- I know. Let’s go, come on! This is our original flavor. That's actually really good, too. Ok, but be honest, are you saying our brand-new MrBeast\nJack Link's beef sticks made with 100% real beef are good\nbecause you want me to cut you out? It’s actually really good-- I'm not sure I'm convinced. [unintelligible] It's great! I'll cut you free. Oh wait, actually,\none more thing. What do you think of the packaging? It's awesome, dude.\nThe coloring’s amazing. It's actually getting kinda hot\nin here. Alright, you're free. - Let’s get the money out of here!\n- Get the money. While y’all are doing that… We’re outta here, come on! - Hey! The beef stick!\n- Get the beef stick. You're gonna die. - Come on.\n- Ok. You just survived another death trap\nwith $300,000 in cash. - Everyone, cheers.\n- Woo! Let's celebrate.\nYou can try it. We have 4 flavors. Each beef stick has 5 grams\nof protein. You can buy it\nat these retailers. And guys, this trap was easier. But the next one, you're probably\ngonna lose a lot of money. Come on, man, wait a second.\nTalk to me here. I need more beef sticks. I hope Eric enjoyed all that protein, because he's going to\nneed his strength for this next trap. Welcome to trap #6!\nWhat do you think of this, Eric? Aw, man. It’s always fire! Not only did we bring back fire,\nbut we also brought the person that when I asked you\nbefore this challenge, you said you would trust\nyour life with… you said you would trust\nyour bank account with… every dollar\nto your name with… your best friend,\nPat. Dude! What's up, brother? I hope you're ready for this, buddy. You and your best friend, Pat, will be doing this death trap\ntogether. I'll explain more\nonce I teleport to the top. Alrighty, here we go, Pat. For death trap #6,\nEric and his best friend are gonna be chained together. Bring it out, boys. There's always a catch. That's pretty short. It is… not ideal. Eric is going to be chained\nto his best friend. While chained, Eric and Pat\nwill have to move together to scale this 50-foot tower\nand collect all 6 bags of money. And at the top of the tower, I have left an extra 50 grand\nthat you can add to your prize pool. Whatever bags are not grabbed will be\ndropped and incinerated immediately. And one more thing:\nif either of you fall at any point, the video's over\nand you lose everything, Eric. Any last words for each other? I love you, bro.\nAnd I trust you, man. Let's get this. Another adventure. Man, let's have a good time, bro. Tareq, why aren’t we close like that? You wanna be chained up? No. That’s fair. Three, two, one… Go! Alright, they are off. Slow and easy, Eric.\nSlow and easy. Come on, Pat. Platform's moving. They got the first 50 grand. Aw, perfect, dude! [Pat] Ok, Eric, we got this. Slow and easy, Eric.\nSlow and easy. Alright they have 2 bags. Ok, once you’re on level with me,\nI'm gonna move across there. If just a single bag falls\nin the fire, it's gone. - Move in quick. Go to carry.\n- I’m level, go. Go. Oh, these guys are crushing it. Slow. Bring it over,\nnice and easy. - Oh, gosh. You're going too fast.\n- Hold on! - I still have the bag in my hand.\n- Let me get my footing. Slow it down just a little bit. Don't fall!\nIf you fall, it's over! Alright. Ok. Alright.\nCan you come to me some? Come on, baby. Dang, they've already got 3 bags. It's moving quick. Coming.\nNice and easy. It’s moving quick. Come on, baby. Ok. Coming across. Go ahead. Little bit more space.\nA little bit more. Got it? Gosh, these are not easy\nto get off that hook. - Moving.\n- Ok! Come on. Ok. We're doin’ good.\nCome on, baby. - Got it. Boom.\n- Keep it up. Give me some slack, buddy. Go for it, Eric.\nLet me know if you have space. Smooth and focused. This is his final bag.\nHis extra 50 grand. Thing’s are getting wide up here. Alright, I see that. This is it. The last one. Alright. Nice and easy, Eric.\nDon't mess this up right now. [grunting] Don't fall. I'm not gonna fall! Get that on there.Yes! They have now secured the money,\nbut they still have to climb up top. Oh, dude, he's going! Come on. Here we go. Last little one. [grunting] Oh my God, he made it!\nHe made it! Woo! Yeah! You’re my bro, dude! Over the platform. We did it, dude.\nYou're my man. The hardest trap of this entire video is all that stands between you\nand $350,000. Ok, take off the blindfold.\nWelcome to your final trap. Woo! Alright. One more elaborate\nthan the last. This death trap is more like\nan obstacle course, where there are 5 different stages\nthat you will have to complete in under a minute and 5 seconds. Why is it a minute and 5 seconds? That's because we had 4 stunt men\nattempt this course, and the average of their time was\n1 minute and 5 seconds. The obstacle course will begin with you being shot out\nof the cannon again, and then jump\nthrough multiple rings of fire. After that, you will have to\ndodge swinging hammers, swim underneath fire, and lastly, run across\nthis massive fire hallway, then jump and grab your money\nbefore it falls and burns. And this time,\nthere's no way to get it back. Woo, here we go.\nNo pressure, right? Alright, Eric, take a seat\ninside your cannon. It's time for the finale. Eric, this might be the most\nimportant moment of your life. Are you ready? Jimmy, I got a lot of hesitations\non this one, man, but, all my time as a stuntman\nhas prepared me for this moment. You will have a minute and 5 seconds to make it across\nthis entire flaming obstacle course and grab your money\nbefore it burns. Do you have any questions? Anything you wanna know\nbefore I fire you out of a cannon and start that timer? What are the odds you give me\na little more time, man? I got some doubts in here, buddy. What, you want more\nthan a minute and 5 seconds? I mean, if you're willing to give it\nto me, I’d take it. Yeah. I can't do that.\nAny other questions? No. That was the only one, buddy. Whenever you're ready, let's do this. Alright, here we go. Three… Two… One… Fire him! And the timer is up! Ok. He has a minute\nand 2 seconds left and it’s literally dwindling down. If he doesn't swim faster,\nhis money will burn. The timer’s paused. So, scattered throughout the course\nare these safe zones. He's on the first safe zone, when he gets on a safe zone,\nthe timer pauses. So, you have 55 seconds left. How we doin’? Agh, gathering my breath.\nI got a mouth full of water, but I'm feelin’ good right now! I lost 10 seconds, but I think I can make up\nsome time here Jimmy. Have you ever jumped\nthrough a ring of fire? I have not jumped\nthrough a ring of fire. I’ve been into a house on fire,\nthis is a first man. Hey, first time for everything,\nyou got this! Next up, you have 3 flaming rings.\nSeems pretty simple, right? Hey, it's a fierce symbol,\nbut I put nothin’ past you, man. Nothin’ ever is as easy\nas it seems. The big thing is,\nthe gaps behind the rings. If you fall and have to\npull yourself up, that will eat up a lot of time. Nice clean jumps straight through. Here we go! Alright, it’s on!\nThe timer has started again. First ring. Oh! He's goin’.\nHe's good. - Oh, you fell!\n- Oh, he fell in the water? You're supposed to go\nthrough the ring not under it! That's what I was worried about!\nHe's wasting time! Eric! Let's go! Get through the third ring!\nGet on the safe zone! On the safe zone!\nPause! Alright. Aww! [grunts] 42 seconds remain! I lost a little time there!\nStubbed my toe, that's alright! You have 3 stages left\nin the course. If you finish in the next 42 seconds,\nwhat will that money do for you? It's gonna change my life, man! I'm gonna be doin’ a lot\nfor my parents. I’m mappin’ their health,\nI‘m mappin’ their retirement. They are my sole focus,\nand they're why I'm doing this, man. Oh my gosh, man,\nI really hope Eric wins. The course gets harder as he goes,\nso… let's see. You got this man! Thank you, boys! Lock in you got this,\nthat’s why we're here. Whenever you're ready. Alright. He's off. Ok, so these platforms move. Don't fall! That's what makes it tricky,\nit looks easy, but the platforms are floating\non water, not anchored down. - He got through! Next safe zone!\n- Woo! Ok! 34 seconds remain,\nbut I'm not sure that it'll be enough. Oh, man. This next part eats up a lotta time. Obviously, you can't swim\nthrough the fire. That would kill you. So, for this next part of the course… you have to swim under the fire. I wish I was a stronger swimmer,\nand I wish I had my breath, but I'm gonna get this done, man. If you look to your right,\nyou'll see a pair of goggles. You might want to throw those on because you're about to swim\nunder flames. The amount of time Eric has left\nmay seem like a lot, but the distance he has to swim\nis pretty far. And if he has to come up for air,\nit'll really set him back. 34 seconds remain! Between your $350,000 being\nin your bank account, or being in that furnace\nover there. That's on you, man. Here we go. Oh he's off!\nPlease do not get out in the fire. He only has 30 seconds left! - Where is he?\n- I don't see him. Where is he? Oh, he's there! Get up, get up! Alright it doesn't stop\ntill he’s up here! Come up! Come up! Grab the rope! Yes! Alright.\nStop, stop! Alright. [Eric] Ooh ooh, ooh. 17 seconds remain! Woo! Ok. It's not a lot of time\nfor the final course. There’s not a lotta time! But I got short legs,\nand they're made for sprinting, man. Here, catch your breath. He’s talking\nwhile he’s full of water. For this final challenge, we need you to put on\nthis fireproof suit because you will literally be running\nthrough fire. This whole time,\nI've been dodging fire left and right and now I'm running head on\ninto it? Oh, yeah. And it's gonna be\nall around me? Yeah. No, you will literally be\nrunning through fire. You escaped a room on fire… you were launched out of a cannon,\nyou survived a massive fireball… And now you'll have to run\nthrough the hall of flames and grab your money\nto win it all. How is he supposed to run\nthrough that? - Good luck.\n- Do this man! This guy's a freak! Woo! This suit will fend off the fire\nfor a bit. You might as well put it on. And finally, here's your gloves. See your $350,000? I see it, man. Once you leave the safe zone,\nyou’ll have 17 seconds to literally run through what I call\nthe hall of flames and grab your money. It's another house fire. The timer starts back up\nwhen he gets off the green pad. I gotta admit, this guy has been pretty fearless\nthis entire time. But I can tell that right now,\nfor the first time in this video, he was actually scared\nof losing his money. Not much time left.\nWill he make it? In three, two, one… See ya. He’s off!\nHe left the safe zone! [Tareq] Oh, he did it!\nHoly crap! Oh, wait he’s on fire! Put him out! Put him out! Hey!\nHe's on fire! He's on fire! Eric has officially won $350,000! Another spectacular end\nto an amazing stunt, dude! Make sure you subscribe.",
    "start_time": 0.0,
    "end_time": 1524.8919999999998
}