{
    "video_id": "QQEZv6SR0sw",
    "channel_url": "@rug",
    "transcript": "These are $10,000 worth of Pokémon cards. >> Hey, these are mine. >> Uh-oh. >> And today, I'm trying to trade up this for something like that. But before that, let me take you to where this journey begins. All right, guys. So, I just pulled up to the mall where the owner of my go-to Pokémon card store told me that she has some sort of challenge for me. And I have no idea what to expect, but if you know me, I don't back down from any challenges. I'm pretty excited, but a little bit nervous because I don't know her too too well. So, I'm not sure if the challenge will be extreme or light work. So, we're about to find out. Oh, it's Sabrina. Look, she got the safe in the middle. Hey, Sabrina, what's going on? It's an empty store right now, too. Is it that serious? >> It is. I have a challenge for you. Inside of this safe is thousands of dollars worth of collectibles just for you. There's only one condition. There is a giant collectible warehouse in LA called Franken Suns. And from there, you have to trade a dollar to an Umbreon EX in a PSA 10. >> Is that not like $4,000? >> Wow. >> Okay. No, this is a real challenge. >> Rule number one, make trades and try to get a higher value each time. Rule number two, if you get stuck, spin the wheel for a challenge. You only get three spins for the day, but be careful because if you lose, you'll have to restart. >> Wait, wait. Restart as in go back all the way to a dollar, >> how about we meet in the middle and instead of going all the way back to a dollar and go back to half the value of where I was at. >> You got yourself a deal. >> Yes. Let's go. >> Rule number three. You have until the store closes. >> All right. So, what am I starting with? Is it a physical dollar bill or is it an actual item? >> Nope. You're actually going to start with this. >> A basic energy card. Wait, this is going to be hard. Okay, you know what? Challenge accepted. And I'm taking what's in this safe. I'll be back with your card in a few days. >> See you then. >> Let's go. All right, guys. It is officially trade day. I got my basic energy card that I did topload just to look a little bit more special. But we got a long drive ahead of us. We got to head to LA, go to Frankincense for the first time ever, and I'm genuinely super excited about this. But Sabrina, I'm coming back with your card. I promise you that. Let's go. All [Music] right, guys. We just pulled up to Frank and Sun collectible show, and I am so excited. As you can see, the doors are closed, and we were told to pull up a little bit earlier by the son of Franken Sun, and he's going to give us a little exclusive tour behind the scenes and show us things that the public has never seen. And by the time we're done with that, the vendor should be set up and ready to go and we'll let the trading begin. And I had a good feeling because as soon as he opened the door, the first thing I saw was Pokémon. While Frankie was showing me around, I felt like a kid in a candy shop in here. There were a bunch of cool items from a giant Toys R Us sign to this giant Godzilla statue and even crazy collectibles that I had never seen before. You said you've been here for how long? >> We've been in this building for 5 years. We've been in business since 1988. >> Woo! 1988, the year Brandon was born. That's crazy. How far do you think I'm going to trade from this energy car? >> I think you're going to have a good time. I think you're going to go all the way up. We make sure you leave with a gem. Right. >> Thank you. Thank you. Frankie then took us into a restricted area where he showed us even more hidden gems like some signed WWE Hall of Fame steel chairs and even gifted me some insane Pokémon cards. >> So, this is the American set >> and this McDonald's. >> Yes, this is McDonald's. So, you had to get to have meal, you got to pack cards. I think there's three packs on the card. So, there's that. >> Oh my gosh. Thank you. >> And then this is the German set which is rare. Yeah, these are for you. Are you sure? >> To get from me. And then I'm going to give you a >> Thank you, Frankie. >> A blind pack of the German stuff. >> I've never seen a German Pokémon pack. >> This is from McDonald's 25th anniversary. And that's our 25th anniversary. So, this this is just a pack of these cards right here. >> Are you sure you want to give these to I just want to make sure? >> Yeah, brother. I'm going to give it to you. >> Dang. Oh my gosh. This is so cool. >> Now I got you set. >> Oh, the whole one. Are you sure, Frankie? >> Yeah. Yeah. Yeah. >> Dude, number one, two, three, four, and then so on to 25. >> Frankie, there's Pikachu. >> Oh, we got Pikachu at the end. like this, >> dude. Thank you so much. >> There's that. >> Frankie, thank you so much. I appreciate that. >> Oh my gosh. He even had me sign this wall that a bunch of huge celebrities had signed as well. Listen, they probably signed up there cuz they're like 7. >> They got Shaq. If there's an open slot next to Shaq, I want to sign a stool. >> I'm Oh, I don't need a stool. You can sign that. >> I'm 6'2. >> What the what? >> You got it. >> Come on, G. I'm actually 6'2. People think I'm 5'6 or something. You know, right now we're staying extra. You're 63. >> You got it. You're 6'2. >> I love it. That's what I'm saying. >> Once it hit 3:00 p.m., the doors opened and people started piling in. All right, guys. It is officially open. People are flooding in. It has been 5 minutes and non-stop people have come in. This is crazy, man. I'm not going to lie. And you said this is a dead day. >> So far, it's dead. >> This is dead. Non-stop people have been walking in through the door. But the video has officially started. We are starting with this. Sabrina said $1 card. It's a two cent card if we're being honest. And we're going to try to work our way to that Chase card for her. So, let's start walking around and start finding vendors. Let's go, guys. I don't know where to begin. There is so much around. There's sports cards, there's blind boxes, there's art, anime, any collectible you can imagine is here. Now, we got to get going though. Remember, we have until the store closes. Everyone that's going to trade me today is going to be a part of the journey. No matter what, it could be a cheap item later down the line, an expensive item. They are all a part of the journey. How are you? Nice to meet you. Nice to meet you. What kind of store is this? This import store. Oh, sick. You know what? So, I am doing a tradeup video. >> A trade up? >> I don't know how you feel about that, but I have a basic energy card. It could be anything and it's up to you. >> Oh, Pokémon cards. Wait, are you serious? >> Yeah, it's a Zapdos EX. Is this a sir, too? >> I think Yeah. >> What the heck? There you go. Thank you so much. What a great first trade. A Zapdos EX card. I appreciate that a lot. Thank you. While I was taking pictures with some supporters, someone randomly came up to me and handed me this Pokemon card. Told me to go to booth 420 and just walked away mysteriously. Someone just handed me this and he walked away. He said, \"Good luck.\" And he handed me this card. Wait, but we didn't trade it. So, do I keep Is this my personal collection one? Okay. He told us to go to booth 420 and he gave me this. So, we have to check out that booth. Let's go check it out. Is this booth 420? >> Yeah, but I don't see the guy here. Maybe he's coming around. >> Someone hooked us up. They're like, \"Go to booth 420.\" So, we're here. Yeah, dude. Wait, you guys got some cool stuff. I want to explain uh what I'm doing. And if you guys aren't interested, totally fine. But, I'm doing a tradeup video. I started out with a twocent card and my first trade was this, the Zapdos EX. If you guys want to be a part of it, anything would help. Like, it could be a $1 extra value, 50, whatever you guys want. And that's if you want to do it. >> You want to do anything. >> Anything. Yeah. Anything that can help me get to my goal. Let's see what they're cooking up. They're taking a look. >> This one hook you up. >> Oh, the MU EX. Are you sure you guys want to go that high? >> That's my boy. Let's go. >> Oh my gosh. What? Booth 420. Go show them some love if you guys are ever here at Frankincense. That's so dope. You guys are going to be a huge help to the journey. So, oh, we got the MUX. Let's go. Hey, Sabrina. This is going to be too easy. It's going to be way too easy. All right, guys. So, Frankie helped us get a really good head start, but now we're on our own. We were able to get up to a $60 card off of two trades, which is impressive. But now that we're on our own and we don't have Frankie with us, it might be a little bit harder. And the more expensive we go, the harder the trades are going to get. But speaking of Frankie, he actually has his own boot. So, we're going to see if he could trade up this Muex to something that he has. And then from there, no more Frankie help. It's just us. All right. So, this right here is Frankie's booth. He has a lot of blind boxes. Oh, he's got some Drake albums right there. A lot of different artists. Frankie. Hey, brother. >> How you doing? How you doing? Good to see you. Okay, good to see you again. So, you saw us get this trade. It's a $60 value. You've helped us a lot already. We're very grateful for it. >> I'm here to help you. >> We're going to be on our own after this, >> but we wanted to stop by your booth to see what you can do for me. It's a $60 value. >> I got this really, really cool fragment Pikachu Pokémon collab they did last year. >> Wait, fragments? Wait, is this fragments? See >> that? >> Those are fragments. Come on, man. >> Wait, so they did a collab with Pokemon? >> Pokemon? Yeah, this is it. >> Yo, that is so sick. >> We sell here at booth uh 301. >> Booth 301, baby. >> We got you one of those DJs. We can move up with that. Oh, there's a keychain. >> Yeah. >> 100 value. >> Oh my gosh. That's incredible. All right. Yeah. So, we'll go from a $60 card to a $150 value. Oh my gosh. Oh, no way. Is that Charmander? >> Charmander. >> Charmander with the fragments logo right there. Is $150? Let's make it official. >> Let's make it official. >> There we go. >> There you go. >> Frankie, thank you so much for the help. So, from $62 to $150, you said at least. >> You got it. We're trying to work towards this $4,000 card. >> You're going to get there. >> You think so? Go. Hey, thank you for the help in the beginning. If we get stuck, we'll come back. >> All right. Thank you, Frankie. Thank you. Yo, this is actually tough. Hold on. Wow. Fragment x Pokémon. This is going to be super hard because I'm going to want to keep some of these trade-ups, but we're going to have to keep trading and trading. So, we're doing this for Sabrina. Oh, guys, by the way, I just got into Pokémon about 2 months ago. Been super obsessed with it, and I haven't found my favorite Pokémon up until last night. I realized my favorite Pokemon is Gengar. That is my official favorite Pokemon. I don't know if it's going to change, but as of right now, it's Gengar. Oh, look at this, bro. Some WWE stuff. We might take a peek in there soon. All these bear bricks. Oh my gosh. If you guys know me, you know I have a lot of bear bricks at my house. You know what? I think we can find something in here for sure. Oh my gosh. Hi. How are you guys? >> What's up? What's up, bro? >> What up? You guys got all the cards as well? >> New product, news card, anything you need, bro. How do you guys feel about trade-ups? >> Depends what one you got. >> You seen one of these? So, this is a fragment x Pokémon collab Charmander keychain. I don't see one of these in your store right now. I don't know. >> We don't. We don't. >> You don't have one of these? >> We don't. We've been looking for one of those. So, >> wait. Are you kidding me? >> We have it. Might be able to work something out. >> Really? Let's go. Let's go. Here. You want to check it out? >> What's like the value on this right now? >> So, the value is around 150. >> I got you, bro. >> Okay. All right. All right. >> I'm going to have you come into the booth. All right. >> Are you serious? Come into the booth. Come through. >> What? Of course. Come through. Come through. Yes, sir. Of course. Take care of the cameraman over here. >> Usually he can't eat. I guess he can come into the booth. That's fine. >> Actually, like he wants to take some snacks like >> No snacks. No snacks. No snacks. No water. None of that. Okay. >> So, we going to show you this box over here. >> Wo wo. I've never seen this before. >> So, this box right here, bro, comes with two cosmic Eclipse, Unified Minds, and Evolutions. I know you kind of just got into the Pokemon, but last sold in this box is 300. >> This box is 300? >> Yeah, that sold was 300 on this one. >> So, we're doubling the value. Are you sure? It's up to you. >> No. Yeah, it's real. It's real. >> Wait a minute. This is so nice. I feel like these will go for a lot already. Wow. Well, thank you. You're a part of this journey now. >> Awesome, dude. Awesome. I'm glad to help, bro. Glad to help. >> Thank you. This is awesome. Okay, we'll see where we're going to go from here. Yo, fire $300 value in four trades. Shout out to Awesome Collectibles, baby. Let's go. Where are we going to go from here? We want to also consider like what we trade needs to be tradable to other people. Like it can't be something very niche and like uncommon, you know? I kept walking around and tried trading with a few more vendors, which understandably I got some nos from, but then we found these two guys who offered me something pretty crazy. I'm interested in whatever you guys are down for. If you're down for that, I'll take it. We just got it in like literally a trade right now. It is Umbreon, but it's not the one that Serena's looking for. It's not that one, but we could use that. So, this was like there's some listed 350, some 270, so like meeting in the middle around 300. >> This one was valued at >> three. Last one was 330. That's round three. >> Yeah. So, you going to do that? You pull that? >> Sure. I'm down. Let's do it. Okay. So, >> there we go. Appreciate taking on it. >> There you go. Good luck. >> Awesome. Thank you guys for being a part of it. >> You guys are done. Let me know if you guys finish if you guys get it today. >> Okay, I got you. I think we got some good luck today. So, all right, guys. The Umbreon V-Max PSA 10. Did she specify which Umbreon PSA 10? Yeah, she did. It's not this one. But we're working our way up. We're working our way. Sabrina, we're going to get it for you. I'm going to call Sabrina right now and ask her if this Umbreon PSA 10 will work and see what she says. Maybe she's generous enough to say, you know what, come back. You'll get what's in the safe for this one. Sabrina. >> Hey, what's up, bro? >> What's up? I have some great news. >> What's the news? >> So, I've only been at this for an hour and 15 minutes, and I got the Umbreon PSA 10 >> already. >> Check it out. If this is what you were looking for, I got you. I'll come back to the shop right now and we'll do the little trade. >> Wo! Wo! That's not the right card. >> Huh? You said Umbreon PSA 10. >> I'm talking about the Umbreon EX that you and Clint hold at my store in a PSA 10. >> Okay. Okay. Okay. I wanted to see if I if you would let this one slide, but you know what? We're making great progress. In 1 hour, we're at a $330 value. We're going to get you that card. >> All right. I can't wait to see you there and give you your safe. All right. All right, Sabrina, have a good one. Um, it didn't work, so we keep moving forward. This supporter offered me a trade, but unfortunately, he didn't have anything worth more than $330, but then we found another guy who gave us a scary trade. So, we are doing a tradeup video. We have this card. I don't know if you're into Pokémon cards. >> No, I don't know too much about it. >> Ooh. Okay. So, it's up to you if you want to do it, but it's a $330 value and we're trying to work our way up. So, if there's anything that's a little bit higher value than 330 that you have that you're willing to trade, make it fair. >> You want to trade a Chucky doll? >> What trade you want? >> I mean, wait, which Chucky doll? Wo, that's crazy. That is absolutely terrifying. >> They go for about 500. >> 500? Are you willing to make that trade? >> I'm willing to trade. I have one brand new. It's up to you, though. >> I think so. You think that'll be like easy to trade up though, or do you think that might be hard? >> I think the challenge would make it more fun. >> I think so, too. It's definitely hard. >> You know what? I'm down. Let's go, dude. Thank you. So that's a huge trade. 330 value to a $500 value. And I love Chucky. And you know who else loves Chucky? Baby Noah. Amanda's kid. So I wish I was ending with that so I could gift it to him. Hopefully some people that are in that card section really love Chucky. Woo. Wait, this looks so legit. I've seen so many different ones. All right, the official trade. Dude, thank you so much. I appreciate it. Can I take it out of this or do you think people would want it in this? >> It depends on who you're selling. I don't know. >> We'll walk with this. Thank you so much. I really appreciate that. That's a great trade. W. We're working our way up. Okay, guys. So, we've been at this for about an hour and a half, and we went from 2 cents to a $500 product. We are making great progress, but we're all hungry, so we're going to stop by, get some food. All right, let's get some good eats, and continue this challenge. We're not going to make it to the PSA 10 Umbreon X till we get food in our system. All right, we got our food. We got Chucky here. He got his burger right there. We got Frankie with the pizza. We got the whole squad behind the scenes with some food. The quality of the food is insane. >> Yeah, it's delicious. This place is unbelievable. We're going to fuel up and we're going to trade this good guy. I went up to a few more vendors, but no one seemed interested in the Chucky doll. Wondering if you had anything higher than a $500 value that you'd be down to trade for. >> Probably not for me. >> Okay. >> And it had me thinking if I had made the right decision in trading to this item until I found these sports vendors. I was wondering if you guys do any trades here. >> What are you asking for? >> So, it could be like a card. It could be like anything you guys have that's like a little bit higher value. And if you guys are interested, of course. This is a five. is like 80 or 100 bucks. So, it's like almost 600. >> Wait, that one's five? >> That's 500. >> 500. >> There's a case hidden. >> Drake May is actually on my fantasy football team. Wait, but that's the same value as that. >> A little higher, but I'll give both. >> Oh, both. >> Yeah. So, this is a double trade. >> It's like 5 580. It's almost 600. >> Oh my gosh. I mean, I'd be down if you guys are down. >> I'm really You have yourself a deal. >> Let's go. That's awesome. Thank you so much. >> Luke Keequley and Drake May. Let's go. So, you said like 580. >> Yeah, it's about 580. That's so helpful. Thank you for being a part of this journey. Enjoy the doll. Good luck. >> All right. Thank you. Thank you. Let's go. We got a card or cards. All right, guys. I am so happy we made it back to cards. I thought I was going to get stuck with Chucky for a while, but shout out to those vendors right there. They hooked it up with two cards combined worth of 580 to 600. I think my best bet to get this Umbreon is to stick on the card side of things because if I try getting a random item, I might get stuck with the same problem. So, we're going to try another vendor right here. I see my goat, LeBron. Kobe, what's going on? >> Well, what up? How you doing? >> Fortunately, I used to be a Panther fan, so I might like that a little bit. >> How much How much is the love? >> This last sell was $500 and this is around $80 to 100. If you're interested on doing a trade or if you have something in mind, >> I do have a Curry. I was thinking about that right there. I just had Curry, greatest shooter of all time. Of course, >> don't think there's a lot of these actually signed. This is a magazine inside. It's framed PSA DNA. How much does this like go around if you were to? >> I would say 700. >> 700. Now, before I do this, so you're willing to trade for these two? >> We got a deal. Let's go, dude. Thank you. Hell yeah, guys. This is honestly a solid pickup in my opinion, dude. Thank you. Hell yeah. I wish I could take this home, but I got to trade it up. >> I know. I know someone else is going to end up with this, one of these vendors. And it's PSA certified. That's how you know it's legit. Okay, guys. So, now that we have this, I think our best bet is to still stick with sports to go back to another card, but obviously a higher valued card than $700 because I do think if we want to go back to the Pokémon world, we have to pull up with a card. Even if it's a basketball one, I think it's easier to trade up than this. So, let's find another sports vendor and hopefully we get up to our first $1,000 value. Right now, we're at 700. Let's see how far we could go. All right, we were just told that someone wants us to come back to their booth that first denied a tradeup and now they want to be a part of it. So, let's see if they like Steph Curry. I mean, who doesn't like Steph Curry? Is this the booth that you guys wanted to come back for a trade or who was >> Oh, sick. This is worth $700. >> Oh my god. >> Yeah. Come on. You like Curry? >> Stephen Curry. >> Stephen Curry. Auto PSA. Came straight from a magazine as well. >> You're looking for about 800, right? >> It could be 800. It could be 900. 1,000. >> I can do eight. >> Eight. So, we got a Charizard and then two Japanese cards, >> a Flareon, and an Eevee. And these three combined is >> $850. >> $850. I'm looking for value. So if you guys are down, I'm down for these three for the Steph Curry. >> Yeah, let's do it. >> Are you down? >> Yeah, >> dude. Oh my gosh. Let's go. There it is. I need to see it hung up somewhere. >> Honestly, I'll probably keep this. >> Yeah, right. Well, thank you guys so much for this trade, guys. These are beautiful. They look worth a little bit more than $850, but this Pokémon booth right here looks insane, and it looks like they have a ton of stuff. So, we'll check it out. We'll see if they're down for a trade. And again, I'm down to bring out that wheel. You know, with my challenges, I'm going to win them. What's up, man? How you doing? >> How's it going, dude? >> Good. Good. Nice to meet you. So, I I come here with a challenge. I started with a basic energy card, two cents, and I've worked my way up to this. From what I was told, around $850 with all three combined. And I wanted to see if you guys were interested in any trade. And I also have a spin wheel where we could do a challenge. If I lose, I give you this and I trade down to a $425 item. It's a risk for me though cuz if I lose the challenge, I go down half the value. Wait, I'm actually nervous for the spin wheel. I kind of don't want to do it. Did you do your research? >> Yeah, dude. >> Please tell me it's worth 850. >> Yeah, it's right around there. I think I I got like 8:30, but I mean, people have like a couple bucks difference. >> Okay, we're cooking now that we're getting to like the bigger bucks. We need some negotiation. We need to talk more. Takes a little bit more time. But here's the problem. This place closes in 2 and 1/2 hours. So, uh, we're still about $3,000 away from our prized possession. Okay, after about 10 minutes of waiting, >> he's back. Can I tempt you with this thing? Can I reveal it? Yeah. Pikachu 10 surging sparks. >> Oh, what does that go for? >> This is around 1250 to like 1300. >> That's what I need. >> I literally just got it right now off my homie right now. >> Okay, let's check out the other ones. But that one 100% I think I'm down for. But let's just see the others. And that is for the wheel, right? >> That's for the wheel. >> I'm down. I haven't pulled out the wheel yet. You know what? Let's do it. So, this is for those three cards I gave you in exchange for that Pikachu EX PSA 10. Worth around 1250 to,300. Okay, guys. So, this is what we're trading for. You know how much this would help for our journey to the Umbreon? It's a chase card. People always looking for it. Pretty easy to trade. >> Don't they call it like butt Pikachu or something? Booty Pikachu. I want you to spin the wheel. Give it a good spin. Oh my gosh. Oh my gosh. What is it going to be? >> A classic coin flip. No, I'm good with the coin flip. So far, I'm up right now. So, >> you're up. >> You know what? I'm going to ruin your streak. I'm Let's do the coin flip. Let's see it then. >> No. Okay, you flip it. I call it. >> Okay. Last time I did this, I picked tails and I won. Tails never fails. Okay, so tails and then heads. Okay, let's go. Let's go. Tails. Come on. fail. >> GG's. Fair and square. Fair and square. Fair and square. Back to 425. Losing that coin flip was devastating. Having to go back to nearly half of my current value definitely felt awful. >> I'm going to let you pick. I picked out two of them. One of them is Japanese. I don't think it'll be that hard to get rid of, but usually English is easier to move, so I'm going to let you pick. Okay. >> The Japanese is worth more. This one's around 425. The Japanese one's around like 500. So, you just let me know. >> So, Japanese is harder to move, but it's worth more. >> You get a little bit more value here. >> I'm looking for value. I think I'm going to take that one. Let's do it. Let's do it. Okay. We didn't go back to $425, but $500. That's fair. Thank you for doing that. And on top of that, not knowing whether or not I'd be able to trade this card since Japanese cards are harder to trade. Luckily, we found someone who was willing to give me a little deal. I'm kind of trade up. This is 5:30 right now. >> 530. >> Yeah. All right, let's do it. Appreciate that. Hey, we're moving up slowly but surely. But honestly, things were moving kind of slow. I went from a $530 Garchomp and Gueritina GX to a $650 Leafeon V-Max. Then to a Scarlet and Violet Ultra Premium Collection with a shrouded Fable ETB on the side for a combined $700 value, all of which took around 45 minutes. With time running out, I began getting desperate. But I had a plan. One thing I realized is Sabrina didn't say that I can't go to the same vendor. So maybe some of the vendors that hooked it up earlier might be down to trade for more. I think I know which place to go to. Awesome collectibles right here. Let's see if they're down to maybe do a challenge. They could try to throw me like a big card or a big product worth a lot. And luckily he said yes. So heads is this and tails is that. >> Julian, you lose. Your job is on the line. >> Oh, his job's on the line. Julian, I actually have so much anxiety right now, bro. Cuz this is a big trade. This will get us towards the Umbreon. All right, let's do it. Come on, please. >> 2 3. >> Should I do my outro? >> GG's. GG's. >> Okay, we're going down to 350. Can you guys trade me something for $350? >> Yeah. So, it's $420. >> Are you down? Yeah. >> Thank you so much. Thank you for not making me go all the way down to 350. Thank you guys. Thank you. Appreciate you. Thank you so much. Have a good one. Okay. Take care. All right, guys. Since the value of this is $420, we thought to go back to booth 420. It was like the second place we went to. They took care of me. So, I think we could do something. Booth 420, $420 value. They'll probably give me like a $2,000 value, I think. >> Let's go. Let's go. >> We're back. We're back. We're back. I could offer you something. I could offer this plus a challenge to make any choice. >> Plus the challenge or just don't need double or nothing. >> Yeah. Double or nothing. Oh my god. I love that. >> Either your challenge ends now or going. You got to start doing. >> Are you down for double or nothing? >> We're down forever. I'll just do it for fun. >> That would be huge. If we go back to 840, that would be huge. You find another booth and do nothing and then you're up to 16. >> Yeah. Well, that's what we're going to do. >> Okay. I think that's our best bet. You want to spin the wheel? >> No, I'd rather just dice roll. >> Wo. Good point. I mean, if that's what they're offering, then I don't even have to use the wheel. Brother, if I lose this again, I'm actually leaving. You know what? I'm I'm 0 for two in coin flips, but there's no way I could go for, right? >> I'm feeling heads. I'm feeling heads, brother. If this is tight, >> I'm ready. I'm ready. >> Sorry about that. >> Sorry, brother. I called it before you played. >> Did you say tails? >> Yes. 100's older, bro. I'm sorry. >> Damn. Thank you guys. $120. >> Yeah. Now we can start all over again. You have two hours. >> I appreciate that. >> I'll see you back here again at the end of the show. >> I think so. I think so. We'll be back. >> Thank you for this. Yeah, we won't give up. We never give up. Never give up. Thankfully, they didn't let me go empty-handed. So, we're starting back at 120. We have about an hour. I think our best bet is to start double or nothing, right? But if I lost, I wouldn't have enough time to make anything, which would end the video. This coin flip will either make or break this entire challenge. All right, guys. This is it. Doing a double or nothing. If I lose this, it's officially over. I'm at zero. I won't even take something from them because I feel like it's going to be impossible to trade to that Umbreon. So, this has been brutal. I'm not going to lie. But, how about to change it up? I flip the coin and they pick. I think that's only right. Let's just switch something up. All right, guys. So, this is the card that he's willing to add to the trade, which is 175. So, more than double or nothing. So, these two are up for grabs. I I got heads. I got heads. So, are you ready? >> Tails. >> Come on. Heads. >> Come on. Heads. >> Heads, baby. >> Yes. Okay. Finally, I got cooked, dude. Oh my. I was 0 for three. So, are you sure? Like, I just want to make sure you're comfortable with it. Now that I lost, I'm sure. >> I appreciate that a lot. Thank you. Oh my gosh. Let's go. It felt really good to finally win again. And to add to that good feeling, there were a few supporters of mine who gave me some awesome trades to hopefully help me get back to the value I so desperately needed. They said it's like 175 plus 120, so 295. >> You need a trade up, right? >> I need a miracle. >> I think I got it. Really? >> I think I got it. >> Oh my gosh. >> Oh my god. Bro, what do you need? >> Pulled out the suitcase. >> I'm willing to take anything. And if you want to make it fair, we could do like a challenge for me to win it. You see what I got? >> Okay. Okay. Okay. Take your time. No pressure. This might save us. This might save us. How much are you down? >> Oh my gosh. So, I started with a cent. So, technically I'm up. Worked my way up to 850. Now I'm 295. >> Okay. Okay. Cook, cook, cook. >> Rest and Zechrom tag team. >> Oh my gosh. >> Ignore the sticker. This card I would say the value is at 330. >> 330. Well, I mean, I'm willing to make the trade. Anything that'll help me go up just because I've watched you since Modern Warfare 3, bro. I'm down. >> Thank you so much. I really appreciate that. Let's do it. Appreciate it. Let's go. Thanks. 3:30. Thank you, man. Thank you. >> 330. >> 330. >> That's what I got for you. >> Hold up. Oh my gosh. Hold up. We're about to leave. We might get saved right now. >> 400. >> 400. >> 400. 420. >> You're down. >> Dude, this is beautiful. The Rayquaza. Thank you so much. You just helped out a lot. I appreciate that a lot. Thank you. >> He says since Mar 2, bro. >> Oh, let's go. Let's go. Trickshotting days, baby. We're back. >> Wait, what? >> What? Yes. >> What happened? >> 300 bucks. >> Double or nothing. Right now, >> I was going to say I'm down into a double or nothing. If you're down, if you want to take >> I'm trying to do double >> double >> for me and you. >> Yeah, that's a $400 card if you're down. This would be so big if we went back to the card, but it's like, do I want to lose 400 bucks? >> You're not going to lose. >> No pressure. No pressure. You don't have to do them. >> Yeah. Let's go. Double or nothing. You want to shake on it? Let's go, guys. So, this is what we're playing for. Winner takes all. You have dice. You don't want to do coin flip. >> No. No. No. >> Wait. So, what's dice? Whoever rolls the highest. >> Yeah. Whoever, I'm going to lose this. >> No, no, no, no. Don't say that. Don't. Actually, no. Yeah. Speaking of >> rock, paper, scissors, shoot goes first. >> Okay. Okay. >> Rock, paper, scissors. Shoot. >> Rock, paper, scissors. Shoot. >> Two ones. >> Two ones. >> Snake eyes. >> Snake eyes, please. Oh my gosh. No. Four. >> 10. >> I'm beyond cooked, >> dude. If you hit a double six though. >> No, that's not going to happen. We all know that, >> dude. You never know. Sexy, sexy, sexy, sexy, sexy, sexy, sexy. >> This video is over. This video is over. We got to go break the bad news to Sabrina. GG's though. GG's. >> Yeah, of course. Of course. Now we do the sad walk. Hold on. >> Had a risk. >> Oh my god. I can't believe I actually won that. >> All right, guys. So, we are walking away empty-handed. Definitely not how I expected this challenge to go, but hey, it's all good. We got to break the news to Sabrina tomorrow. And I'm hoping she'll understand how much effort was put into this. Who knows what she's going to do. She's a super nice person. So maybe she'll reveal what's in the safe and maybe give me another basic energy card as a gift, but who knows? Or maybe she'll still give me everything in the safe for trying. We'll see. We'll find out tomorrow. All right, guys. Good morning. It's currently the next day and we're about to head to Jeny's to reveal what happened last night. I didn't want to pull up empty-handed, so I'm bringing her a little something in this briefcase. So, all right, let's go break the news to her and hope for the best. Oh, I'm kind of nervous. Like, I feel like I'm letting her down in a way cuz I was very confident. Hey, but sometimes you take some L's in life, you just turn it into a W after. Oh, okay. Wait, wait. I got to like lock in. I got to act. I'll be like I'm all hyped. Ready? Oh. Oh, Sabrina. >> Oh my gosh. You are going to be so happy. >> What do you have for me in the game? >> What do you think I have? I'm face, bro. There better be the Umbreani X and a PSA 10 in there. >> I think you're going to be very, very pleased. Here we go. It's time for the reveal. Should I get the PSA or go ahead? >> Go ahead and open it. Go ahead and do the reveal. >> Sorry. >> That's a nice elite trainer box up there. What is this? Long story. Uh, I lost everything. Started from the 2cent energy card, made it all the way to 850. We were doing great. Boom. The wheel comes around. I lost. Got back up to 700. Wheel comes out. Coin flip. Boom. Lost. Work my way back up. Time started running out. I started having to do double or nothing with people. Boom. Lost. >> How am I supposed to give you what's in the safe? >> Well, that's the point of the challenge. I don't get what's in the safe. I guess >> you lost. Can I at least see what I would have got? >> Fine. I'll show you what you would have wanted. >> Okay. Okay. Okay. Okay. I'm so sorry, Sabrina. I tried. It was a roller coaster of emotions. I'll be honest. It was super cool being around everyone. Everyone was very nice, but I lost a few coin flips and it just took me down and I actually ended up with nothing. Not even the energy card. >> You lost the two cents I gave you. >> I know. I know. I'm sorry. Before you reveal what's in here, this is going to be my motivation because if my viewers like this video, I do think we do a part two. >> I want to run it back. >> I would love to. I don't want to just walk away on an L and just never try it again. >> All right, you guys heard that. 100,000 likes, we'll do a part two. But Sabrina, show me what I would have had. >> This is what you would have gotten if you just brought me that Umbreon 10. >> Oh, stop it. Stop it. The Pikachu Mario >> in a 10. >> PSA 10. Wait, can I like see it real quick? Can I like pick it up? >> Fine. >> I won't walk out with it. I promise. Wait, so two PSA 10s Mario Japan. This is a promo card. Both PSA 10s. I see a Mega Evolution booster box, which comes out tomorrow. By the time this video is up, it's out. And lastly, oh, the Pokemon Center Fusion Strike ETB. This is good for me to see. This is very good for me to see because it motivates me. Thank you, Sabrina. That was fun. Even though I took the L, you take some L's in life, that's totally normal, but got to come back from it. Thank you guys so much for watching. Huge shout out to Sabrina from Jinky's Co. Check out her channel. Go show her some love. Any last words to the viewers out there? You guys heard him. If you guys want him to run it back and win everything inside of this locker, be sure to like this video. >> Let's go. Hey, make sure you guys hit that subscribe button and we'll see you all with the next video. Peace.",
    "start_time": 0.08,
    "end_time": 1952.799
}