{
    "video_id": "kciim9MQbkY",
    "channel_url": "@rug",
    "transcript": "Where do I even knock on this door? >> Faze rug. >> Yo, welcome back to a brand new video. What is going on, guys? I hope you're all having a fantastic day. Come on in. Don't be shy. What are you doing, guys? Today's video is going to be crazy. It's not your ordinary Faze Rug video. We got a crazy special food video. Let me explain. I am putting myself to the ultimate test to go to as many buffets as I can find to try to eat as much food as I can because I'm trying to hit a mystery calorie number. You comfortable over there? >> I mean, I guess so. >> Dude, come sit down. >> I can sit. >> Stop being shy. Of course you could sit. >> I just wasn't sure if I was allowed to. >> Yeah, you're allowed to sit. You just can't go in the pantry to eat. >> Okay. Yeah, I I'll never eat on the job. >> Okay. Yeah, I was going to say. >> What's up with you? >> Just trying to film this intro right now. Speaking of intro, I don't know why I told you to sit down because we have the next shot. >> Oh, >> like right over there. >> Okay. >> You want to Let's go. >> I'll follow you. >> Okay. Yeah, let's go. So, the way this is going to work is I'll be randomly pulling out five numbered balls from this lottery picker and whatever numbers come out is how many calories I'll have to eat. This is going to be a terrible idea. >> What happens if you pull 99,000 calories? >> Then I'm screwed. And it's funny you mentioned that because I actually have to do a punishment if I don't hit this mystery calorie number. But what's the catch? You guys are probably wondering, there's a catch, right, Rug? Yeah, there always is. Because I won't know what the mystery calorie number will be. I'm going to be blindfolded when we pick these numbers. The only people that are going to know what my calorie number is is you guys and the cameraman. By the way, if you can't see the TV, subscribe if you're hungry, cuz like usually when I do food videos, people get hungry. People watch my videos while they eat food. But if you're hungry right now at this very second, you have to subscribe. Like you must do as the TV says. Are we ready for this? >> Let's do it, man. >> Is this start? >> Yep. >> Okay, first number. >> Oh no. >> Oh my gosh. Can you fix it? >> No. Is this a good number? You can't tell me, but >> I don't know, man. >> Oh no. First number down, second one to go. [Applause] >> Oh my gosh. This is crazy. Oh, this might be my worst challenge yet, huh? Oh, that went for a while. I'm scared. Let me know when you got it. >> You're getting some big numbers. >> No. Number four. Let me guess. I got a number four. >> That's actually a good one. I >> mean, we're at the fourth number, so like I needed the smaller numbers in the beginning. Final number, guys. I'm cut. >> Okay. >> Okay. I'm going to take my blindfold off. You can actually put the balls back in there now that we got the numbers. >> I'm so satisfied. >> You pulled. >> Wait, don't tell me. I can't know throughout the whole day. >> Are you feeling lucky? >> No. >> No, I'm not. Do you think it's possible for me? >> I think it's possible if you have some help. There's no way you can do this by yourself. >> Help. Okay. Well, then you got to throw me a lob with some help throughout the day. Okay. So, we got the mystery number. I have absolutely no idea. Come take a walk with me. I need to mentally prepare myself for this challenge. Even last night, I was looking up ways how preers prep for eating a lot, and that's exactly what I did. I drank a ton of water to stretch my stomach. I ate a lot of fruit. I tried preparing myself, not only physically, but mentally, for this challenge, and we just pulled five numbers that I have no idea what they are. We're going to keep track of the calories of what I eat. My cameraman and you guys are going to let me know when I hit that number. And when I do, I actually have 10 prizes for 10 of you guys out there. I'm doing this challenge for you guys. That is my motivation to not give up. I'm going to keep thinking of you guys. Let's go eat at our first buffet. >> All right, guys. Brian's getting ready right now. You and I both know that he got a pretty big number, so I've got a few things up my sleeve today to help him out. And I think I'm going to throw in a few challenges throughout the day. We'll see. First place of the day, we have Seaside Buffet. One thing about these videos where I know I'm going to be eating a lot is you need to pace yourself. You can't go into the first spot and just start scarfing down a ton of food because you're going to get way too full for the next places. They have a set. Oh my gosh. I can't get away. I can't get away from the blind boxes. They got a stacker. They got my boooos and a Pokemon card box. Dude, look at the aesthetic. It's actually fireside. Wait. Okay, you could add it to the chest. Are you sure? >> No way. Thank you so much. >> Honestly, even if I get the small prize, I want to get a Pokémon pack. That would be insanely fun. Woo! Woohoo! Woo! Oh no! Second. Good luck. >> Thank you. Oh my gosh. So nice. >> Oh, I'm going to win. All right. >> It's my birthday. So >> Oh my gosh. For real. Happy birthday. I got you. Please. Come on. For your birthday. >> Yeah. We're breaking up. >> Happy birthday, bro. Happy birthday. >> Try again. >> Are you having a good birthday so far? >> I mean, I am now. Should you win me? >> Okay. I got you. I got you. I got you. You like my stance? Yeah, dude. Are you going to win? >> Oh my god. Minor prize, please. >> Should I take the minor prize? Which one do you want? Which one do you want? >> The ham. >> That one right there. >> Yeah. >> Happy birthday. >> Yay. >> Of course. What was your name? >> Carrie. >> Carrie. Nice to meet you. Okay, we're going to avoid salad. I don't know how many calories that is, but it's not a lot. We're going to start with some shrimp. Oh my gosh. Oh, chocolatecovered strawberries to end off the meal. Dude, that looks insane. I can eat a lot of shrimp, but I don't know what else is in this buffet, but there's a lot. So, this will be my seafood plate. I can scarf down three sushi. Okay, plate one complete. Okay, we're going to set this down and then go look at the hot entre. This looks absolutely incredible. I could get at least three of these in. These kind of look like Popeyes French fries. I love Popeyes. Spicy chicken. I love spicy. This looks like a solid plate. Second plate down. I'm looking at that over there, though. The noodles. We got to get some noodles. Dude, this is going to be a lot of calories. Stay away from the veggies. I think I'm going to skip out on the chicken. I think just like steak, marinated beef, and shrimp. All right, while that's being made, we're going to grab our dessert to have everything on the table ready to go. Guys, I was on my way to the dessert station, but we noticed they're putting stuff on my table. Look at all the crab legs. Wait, my mouth is genuinely watering right now. Am I going to be able to eat all this? This is so much food. >> No, no, no. This is too much. Definitely got to make a s'more here. Okay. Oh, yeah. See how it's already like getting that crisp? This is how I like it. You see that? This is what they like to call a sorryar s'more. This is not a s'more. I'm disappointed in myself. Like, what is this, guys? Dude, I want to take a bite so bad. Should I do it? >> Yeah. >> Oh my gosh, that looks insane. Okay, this has to be the last plate from this buffet. >> Can we make an exception today where cameraman can eat food? >> Yes. >> Yeah, >> 100%. >> Can you do that for me? >> 100%. I got We're at a buffet, bro. All you can eat. All my cameraman can eat. How about that? >> This looks so good. >> You're rolling. You're starting with dessert first. I thought it was going to be a little off camera thing, but >> All right, guys. So, we used an app to measure how many calories each plate is. And in front of me right now is 2,670 calories. That's about the average amount of calories a man is supposed to consume in one day. But, we're going to try to do it in one sitting. I'm actually going to start with the sushi cuz I'm not the biggest fan of sushi. So, I might as well start with that. That's good. Am I close to my goal now? >> You're not even close. Yeah, man. We'll dip this in some butter. Guys, butter has so many calories. Just this cup is 500 calories of butter. Start with the salt and pepper chicken wings. >> I know the food is good when you go quiet. >> Oh, 100%. Okay, let's try the Mongolian beef. Wow. What did I get myself into? I already know sometimes after my food videos, my body feels so bad. Salt and pepper chicken wings. One of the best. I just know what this day is going to entail. I'm all happy and jolly now, but by the end of the day, I'm going to be so slumped. Let's give this a try. Mhm. Man, I love crab. I usually get seafood boil. I get king crab all the time. Come on. Please be a clean pull. Oh, there we go. Oh, there we go. You smother it with butter. Mhm. Am I getting close to the number? >> You're definitely putting a dent in it, but dude, this is only the first place. >> How many places do you think I'd have to go to today to have a chance of hitting it? >> At least like five. >> I'm not lying. I'm getting full. Okay, I'm tapped out from this meal right in front of me. And we did some calculations. We had to involve some mathematics because we had the calories of each plate and we divided the percentage of how much I ate from each plate and added it all together. And it looks like I ate roughly around 2,000 calories from buffet number one, which is amazing. Like I thought I was only going to eat like 1,000 max. I'm not that hungry right now, but I do have room for dessert. So they got a chocolate fountain. They got more s'mores. They got ice cream. I'm going to try to eat as much dessert as possible. Maybe push myself to 2500 or 3,000. You think that'd be a good idea based off knowing the mystery number? >> Put those numbers up, man. >> All right, we're at the chocolate fountain. Look at how delicious that looks. It says, \"Please do not put anything else besides fruit and marshmallows into the chocolate fountain.\" So, we could do marshmallows as well. Let me just fill some cups up. Who knows? I might even just drink some of the chocolate. Can I do that? >> Yeah, that looks good. >> Wow, that looks fire. We'll grab some strawberries. Grab some marshmallows, too. This has to be a lot of calories here, just like the chocolate itself. Another thing we have to keep this as legit as possible is we even brought a food scale to measure out certain types of foods that we're going to input into the app that translates into calories. So, we're trying our best to have the most accurate calories that I'm actually consuming. All right, guys. We got the food scale right in front of us. So, let's put one of these cups of chocolate on it. So, that's looking like 53 g. Now, we input it into the app to see how many calories it is. So that right there is 284 calories. We multiply that by 3, 852 calories. Each marshmallow is 22 calories. Yeah, if I eat the marshmallows with all the chocolate, that's an extra 900 calories. 918 to be exact. And a strawberry is 4 calories. So I don't even know if we need to count that. Actually, every calorie will count on this challenge. So that's some good stuff. Oh, that is so good. I don't know what my body is going to feel like after this, but I need like 3 days off after this video. Oh, my stomach is brewing right now, guys. I'm tapping out. I can't do all three of these. We got all three marshmallows. We got one of the cups down, which is good. So, from this plate right here, we calculated around 380 calories. So, buffet number one, 2,380 calories. That's a lot. Is there going to be like challenges or something that I could like take calories off the number? >> I've got some stuff up my sleeve. >> Okay, I'm not going to lie. I have to use the bathroom. All right, guys. We just pulled up to the next buffet. Pan Asia Grill Sushi Buffet. About 2,300 calories in. I heard they got habachi in there, which is one of my favorite foods of all time. Benihana, Shogun. So, I'm definitely going to hit that up. >> Before you go in, I actually have a surprise for you. It's something you're definitely going to need to hit this calorie count. >> Really? >> Yeah. Yeah. All right. Do you want to come out? >> Come out. >> Oh my god. Eric, do it. No. No way. No way. Wait. You had this planned with him? >> Oh, yeah. We've been coordinating, you know. >> I'm hungry today, too. Wait, Eric, first off, you're in shape, brother. Thanks, man. I just saw a video of Eric doing a 600 lb deadlift. >> 600? Yep. The more plates I can eat here, the more I'm going to be able to lift in the gym. >> Hey guys, I've done a lot of challenges with Eric. This man can eat. How many calories do you think you could consume in one sitting? We're at a buffet. This is all you can eat style. So, it's different. >> It's the best place to be. I'm going to say minimum it's going to be 10,000 today. >> Like in here, just one place. Okay, that has to hit my >> That'll make a dent, you know, a pretty good one. >> Maybe a little bit more. Okay, wait. Let's go check out the buffet, dude. Eric. Yes. >> What do you think in this buffet has the most calories? Like, what type of food? Like the dessert? Probably the fried stuff. >> Do buffets hate to see you coming? >> Yeah, usually. >> Guys, she asked me for my YouTube channel and I typed it in and she was already subscribed. Wait, so you've seen my videos before? >> You have any labu? >> No, I actually just opened some laboo yesterday. Yes. Boxes? Yeah. You guys like Laboo? >> All right. You guys are awesome. Thank you so much. >> Rug has to eat 19,411 calories today. At the last spot, he ate 2,380. So right now, yeah, we got to get 17,31 calories now. >> I think I can do some damage here. He only ate 2,000 calories at the first spot. >> He's not built like you, man. >> We got to work on that, Rug. >> You're him. >> I'm him. >> Timothy, did you find out about the number? >> Only 2,000 calories at the first spot. >> No. 2380. Well, hold on. The average man eats 2500 to 3,000 in a day. You should be proud of me. We got to work on that. I think today is the day we bump up that capacity. So, are we close to the final number? So, the bad news is we're pretty far away. The good news is I'm going to get you close to >> You're here. That's the great news. Okay, before we get food, how many calories is a Dr. Pepper? >> 180. Wait, is it actually? >> Yeah. >> You know it off the top of your head. 180 calories. >> Counting is like also part of my job, too. So, >> that is true. >> Eric is going to play as the app today. The app we were using was My Fitness Pal, but you're my fitness pal today. Now, the fun part. We actually get to see how much food you're going to plate. Hold up. Look at that. I had this at the last spot. I drank a cup of it. So, we don't do the desserts first. >> No. Sushi's a little bit too low calories for me, unless it's fried. >> So, we're looking for fried. How's fish? >> Not good for this. >> Not good for calories. >> I could go for some fried rice. Is fried rice good for calories? >> Fried rice is great for calories. >> Oh, hell yeah. I love fried rice. Chicken wings. Got to get our protein in. >> So, how many calories you think you're going to go for? >> Minimum 10,000. What if the number's like 50,000 though? Like, I'm cooked anyway. It's like we're both cooked if it's 50,000. There's no way. This looks like a Panda Express plate. I got my fried rice, orange chicken. That looks like a kids meal at Panda Express. I'm going to see if I can eat this and then I'll hit the hibachi. So, there's some fried sushi over here. We're going to have to get Ooh. Okay. I feel like you could eat all that in one bite. >> I could most definitely do the whole >> I'm kind of still delusional from the last spot. 2,300 calories in one spot's good, right? >> This dessert's looking good. So, is this what you're starting with? >> Maybe. Maybe I'll get full. I don't know. >> No, no, no. You're not getting full. You're Eric the electric. I don't think you can get full from this. >> Yeah, this will just be the first course. From looking at all these plates, what can you estimate for calories per one? Between these two, 2,000 calories right here. >> Oh, and then these two right here, most likely I'd say about 1,500. >> Oh, so 3500 right here. Yep. >> What are we thinking on mine? >> 650. >> 650. We'll take it. Okay. So, 3500. 650. That is 4,150 right here. If we finish all of this, let's go. Wow, that's light. That's three down. Three down in 10 seconds. I'm still chewing my fried rice. Bro, if you need help, let me know, bro. Like, I got this. Oh, no. I'm so glad I could chill a little bit. If it wasn't for Eric being here, I probably would have forfeit the challenge. Wait, you already ate one of them? They're good. >> They're actually fire, right? I'm still chewing my piece of chicken, bro. I'll try speed running right now with you. You need to go a lot faster than that. You're two plates down. Yes, sir. I have so many questions, but I don't want to like interrupt him while he's doing He just got two forks. He just got two forks. He's eating with two forks right now. Okay. Yo, can you come with us to the third spot, too? That's the goat right there. Literally, Eric is him. What did I just witness? You just ate that chowine in 30 seconds and he used two forks. Like right now with the noodles, were you chewing or you just swallowed? >> It takes too much time. >> Swallowed hole, man. >> Oh my gosh. By the way, guys, I need to say this. While Eric is eating, he is a professional. Do not try to imitate what he's doing right now. He trains for things like this, okay? So, don't eat like this. He already ate more calories than I have in the whole day in 2 minutes. Like, think about how crazy that is. I'm about to finish my spring roll, Eric. I can do this. I can do this. Let's go run. M. That's so rough. >> Oh my god. I just looked down. He's gone. Wait. I think the shrimp had like the tail that you have to take off. >> I knew you weren't going to care. Like it's like whatever. More calories. No. Is this real? >> He beat you somehow. >> I mean, bro, what? I should be embarrassed of myself. How do you feel, though? Are you full? >> No, that was pretty good. I think it's time for another round. Got to have some croissants up in here. Little croissant action. Little teriyak chicken. M. Yes, sir. What is that? >> It's a stuffed mushroom. I see more cheese than I do mushrooms, which means I got the right thing. What do you guys think? I mean, that's got to be 100. >> 125. >> 125. Okay, give me that extra one, cuz I could do this. Maybe we throw some ice cream in. Wait, you're going for a dessert? What goes with croissants? Dessert's got to go with croissants. >> I think so. Yeah, I think you got to throw in some Is that cheesecake? >> Definitely got to get a slice of cheesecake. Wo! Cream here. How many do you want? Let's do two. Three. I'm going to check out the ice cream real quick. Oh, this is good. >> I can do that. You're going for more plates? >> Yep. Keep going, bro. You want 5 6 7 8 9 10. Let's go for some more sushi. There's no such thing as too much sushi. >> Have you ever been kicked out of a place cuz you're eating too much? >> I almost got kicked out of here a long time ago. Baked salmon. All I know is it's salmon and it's got cheese on it. I'm liking this. I'm feeling I'm feeling good. >> More sushi. All for you. I'm full, brother. Look at my ice cream, bro. Like, why does it look like that? That ice cream is looking pretty sassy. >> So, right now we have consumed about 4,500 calories. Um, and yeah, we So, how many calories is on our our table right now? >> 300. >> Okay. >> This I'm thinking is about 800 right here. >> Okay. >> Yeah, that one's probably around 900. >> 900. Okay. >> Yep. Right here. 750. Right here is about 750. >> Dang. Okay. So, 3500 calories right in front of us. Yes, sir. Let's get it. W collab. What is that? Beef. Teriyak chicken. Teriyak chicken. Okay. Oh my god. Brain freeze. Holy. No. No. No. This I can't be a real human, bro. I can't. One thing I love about Eric is he's a pro eater and he keeps it kind of clean. You know what I mean? Like you're not just like stuffing your face. You keep it clean, professional, but you're going crazy. My mom always told me to eat as clean as you can. Always listen to mom. Okay, let's try the cookie. That's a good cookie. That's a great cookie. I still have a brain freeze. Wait, can you eat ice cream fast, too? >> Oh my gosh. I need to see that. >> You definitely will. Mhm. >> What is that? Stuffed mushrooms. >> I get my veggies in today. >> There we go. Do you ever carry tums around like for situations like this? >> It's not going to help out too much. >> No. Oh my god. You literally cleaned it. >> Just buy them, baby. >> So, when you're eating like this, do you do any mental preparation before? >> Depends on the challenge. Today, I'm just winging it. This is light work for you. How am I doing? You're doing amazing. Good. I'm >> doing great. The fact that you're going to go for more after this is crazy. >> Yeah. I'm really excited about the dessert section. >> That's what I'm looking forward to the most to watch you do that. >> Is it okay to eat sushi with a fork? I do that. You do? >> Cuz I don't know how to use chopsticks. >> You never fail to impress me, bro. >> Always. I'm being so nice so he can like go get more plates after, bro. Like, you look handsome. You look good. The muscles. >> I'm feeling pretty full. >> I'm actually curious though. You don't have to answer this cuz I know you're in the zone, but like how do you manage to stay in shape while you do these crazy food challenges? >> I'm a powerlter, so I do heavy weightlifting. I run a lot. >> Let's get this stuffed cream puff right here. M. This is motivation for you. M. The dessert section, you about to go crazy. >> Oh, yes, sir. The dessert coming up after this, I think. So, I'm so glad dessert has a lot of calories. See, my mom loves salmon. I wonder if she would like eat that big of a portion, though. You got to get your healthy fats in. >> Mhm. This is impressive. The cream puff is like the best thing I had so far. You haven't even tried it yet. Wait, >> I got some right here. My favorite part right here. Dessert. >> Let's go. >> All right. Rob said the cream puff is going to be good. I'm a cream puff connoisseur. >> There we go. >> You're right, bro. >> Yes, sir. If I feel like this, what does Eric feel like? This is life for him, though. >> I'm feeling pretty good. >> Really? Right after this, you can just walk outside and start running. >> I don't know about running. >> Okay. Okay. >> If I'm going to run, you're going with me. >> Okay. Okay. We won't do that then. So, by the time I finish one plate, he finishes four. A 144 deal. Oh my god, bro. You actually just finished all that. Bro, I'm your right-hand man right now. Whatever you need, I got you. As long as it doesn't involve eating. >> A massage would be great, bro. Hold on. >> Oh, yeah. That's just what I need. I'm told I have like the man hands for massage. >> You do have good massage hands. >> Thank you. >> How many more plates you got in you? >> I think I got four more in me. >> What? So, right now we are at a total, including the first buffet, 10,390 calories. >> That sounds pretty good. >> Am I close? >> Let's just say I think you should keep eating. >> How much further do I have? >> You got to use him right now. >> Okay, Eric, come on. Let's go. You got this. Come on. Are we going back for another cup of chocolate? I feel like Who's the guy from Willy Wonka that got sucked into the thing? Augustus Glue. I feel like him right now. >> We got some coconut macaroons on here. The only real way to judge a dessert at a buffet is if you get four of them. This is the first dessert course right here. Look at my plate, bro. What are we thinking with the chocolate fountain? We got to take a little bath. Not us, but the cookies. Take a bath. >> The cookie. So, I actually had a cup of chocolate at the last buffet. It's 282 calories for a small cup. >> For a small cup? Yeah. I don't believe in small cups. >> Wait, what if I get a soda cup? Or is that too much? >> No, that would actually be perfect. >> Scan heavy. >> Nice, brother. That's the calories we need right there. >> At the end of the day, this kind of like a milkshake except without the milk. What are sesame peanuts? Like, is that a dessert? >> I don't know what those are, but I'm about to try some. >> Oh my god. You could just carve down all that. >> Do you think this is enough? >> I thought that was more than enough, but you do what you want. >> Peanuts are very calorie dense. Boom. There we go. Here we go, baby. All right, we got the dessert right in front of us. Bro, mine is a killer plate, by the way. This is around 300 calories. I know that cuz this is 282 and a marshmallow is around 20. But tell me about your plates. >> So, we got these little cakes over here, which look incredible. This is about 600 calories right here. >> And then we have a plate of cookies. 1,000 calories for these. >> Ooh. Napoleon Square coconut macaroons. This is about 1,300 calories right here. >> And I feel like you're going to eat that in 10 seconds. Probably five. And then over here, we have my personal favorite plate of the entire spread. Double chocolate brownies with some sesame peanuts. That's about 1,200 calories right there. >> This is a lot of calories. So, all of these plates combined is 4,400 calories. Oh my god. Do you think you can? >> I mean, what am I questioning? Of course, he's going to do it. >> I'm putting this down. >> But you know what? We didn't count that cup of chocolate, which we brought out the scale for because I'm very curious know how many calories it is. Cuz if this small one right here is 282, this is a heavy one. >> 597 g, you do not have to drink all that. Like, you already have done more than enough. Use what you want from it and we'll subtract Okay, sounds good. >> That in itself is 3,189 calories. Sounds like good news to me. This has to get me to my mystery calorie number. Of course, right. >> You're going to need a little bit more work out of this. Do you have another like professional eater lined up or something or what? >> I have another surprise that'll help you out, but it's not as good as Harry. >> No, no, no. Nothing is as good as Let's dig in. We got this. We got this. Let's go. >> Cookie in the chocolate. Oh, we lost half of it. Dang it. You'll find it later. >> I found it. Oh. >> Oh my god. >> How thick is that chocolate, bro? >> Why dip a cookie in milk when you can dip it in chocolate? >> There we go. Add more chocolate. See, I have to go to the bathroom. Like, I don't know how you feel. That'll be tomorrow morning. Bro, how much of that chocolate have you gotten? Dang. Okay, I've seen a dent already in that chocolate. I'm done drinking the chocolate. I'm going to let Eric do the rest. I can't. It's too thick. Is the dessert the heaviest part? Last round was heavier. Really? This is the the most delicious part. Honestly, it's the more fun part. >> Oh my Oh my god. Can't go wrong with more chocolate. >> You got this, bro. If you are not yet, subscribe to this man on YouTube. You all have to subscribe. He's the goat. He's going to be the reason why I hit this. And you know, I'm actually doing this for my fans. If we hit this mystery calorie number, I give 10 prizes to 10 people in the comment section. So, I'm going to do it for them. >> We're getting you to that calorie goal. >> Oh, hell yeah. Two plates down, two to go. This is like the higher calorie plate, right? So, the Napoleon square. What even is that? A custard. >> It looks really good, though. >> The powdered sugar. One bite is all he needs. >> It's good. Mhm. All right. I got a fortune cookie. Whatever this fortune says, it has to correlate to the rest of my day. Okay. It's easier to make friends than to keep them. That's deep. >> Yeah, that's a pretty >> That's a date. >> Every so often, you get really deep forces. >> No, for real. All right, Eric, this one's yours. Confidence will always lead you on. Don't forget, be confident in yourself. For real. >> These taste like the Girl Scout cookies. Like the Samoa the Girl Scout cookies. Are you Samoas? >> You want to try one? >> I can't. After this, like I need at least a 2hour break. >> I hope I'm close to my calorie number after though. Cheers. >> Oh my gosh. No. That's very sweet. >> Very sweet. >> Very sweet. Three plates down. >> Last plate and we hit so many calories at this buffet. You know what? I'm trolling if you guys can't tell when I say we. Like Eric has done so much damage. You did good. >> These are one bite for you for sure. >> You want to try one? They're so peanuts. >> Yeah. Yeah. I'll try those. >> Pretty good, huh? It kind of tastes like kettle corn in a way. >> Like sweet popcorn. M. >> I'm so intrigued watching this. I'm very entertained. I hope you guys are entertained from this, too. Oh no. Yo, is it like sponge texture? >> Yeah. Are you sure you want? There we go. There we go. Run. There we go. Good, isn't it? >> Yo, I got to add more contribution. I would regret it if I did it, you know. Last one. Last one. Last one. Last one. I dedicate this to you, my guy. No. No. We got to get a round of applause. >> Come on. >> There we go. >> I am impressed. How much of this did we get down? >> About halfway, I think. >> Let's go. Maybe 40%. >> Okay. Make it halfway if you want. >> Make halfway. Make it halfway. >> Oh my god. That's halfway. 100%. What do you feel the next day? >> Terrible. Terrible. Horrible, right? Yeah. I probably won't be looking at any sort of Chinese food for probably a good month after this. >> Really? >> Yeah. But it was delicious. >> Just from this dessert round, you were able to consume 5,714 calories. >> That's good news. >> That's amazing news. >> Yes, sir. That leaves us with a total of 16,14 calories for the entire video. We had to have hit it. >> Getting close. Getting close. >> No. Eric, question for you cuz you're not going to be there at the next spot. Can I by myself complete this? >> I believe in you. I think you can. Okay, >> you got this, bro. >> Thank you so much, Eric. Oh my gosh, you just helped me so much. Literally got me an additional 14,000 calories yourself, bro. >> We still got another buffet to go to. So, huge shout out to Eric the Electric for helping me go show him some love on his channel. And I got to complete this challenge for you guys. Let's go. You got it. >> All right, guys. So, I was told to navigate to a park. And in my surroundings right now, I see a dog park. I see a basketball court. I see dis golf and just a nice open beautiful park. Now, why are we here? >> So, I have a special surprise for you. You need this cuz this is going to take some calories away from your next meal. >> Really? I was going to say I must be pretty far if we're doing a challenge. >> Eric made a good dent, but if we don't do this challenge, you're going to be struck when you finish. >> I'm cooked. Okay. What's the challenge? >> All right. We're going to do a basketball challenge. You're going to have 1 minute. You get 250 calories off for every free throw, 500 calories off for every three-pointer, and 1,000 off for every half court shot. >> What? Hold up. Look at this rim. Not only is it a double rim, but it's slanted. Okay, my strat here is to go for three-pointers only. That's 500 calories off every three. I feel like I can make three or four here >> in 3 2 1 go. >> That's good. >> Yes. >> That's 500 calories right there. >> Come on. Good. >> Yes. There's 1,000 calories off. >> Thousand calories off. >> Keep it going. >> No. >> How's that stomach feeling? It's >> bad. >> Oh, and that's the double rim. Good. >> Oh, 30 seconds left. 1,500. I'm going to try a free throw. >> All right. You have 12 seconds. >> Yes. >> I'm going to go for the half court. 2,000 5 4 3 2 1 >> Oh my gosh. >> 2,000 calories off, >> bro. You locked in. It's going to be close, but I think it's possible at the next spot. >> So, I'm close. >> You could complete this challenge. You're close. >> Okay, 2,000 calories off the mystery number. If my cameraman's confident, then I'm confident. >> Okay, so Brian's in the car right now. He had to eat 19,411 calories today. And so far, he's eaten 16,14. After the basketball challenge, I'm taking away 2,000 calories. So, now he only needs to eat 137 calories to complete the challenge. >> Yo. >> All right. You ready, man? >> Wait, what were you doing? >> I was just talking to the viewers. >> They know how many calories I have left. >> They know exactly how many calories you have left. >> I need some motivation, guys. Like, right now, pause the video and spam some W's. You got this rug, and I'm doing it for you guys at the end of the day. All right, hop in. >> Let's go. >> Let's go. All right, guys. For the next spot, we wanted to switch it up. We're not at a buffet, but we are at an all you can eat Korean barbecue, which still fits the buffet vibe and get the best Korean barbecue in town. All you can eat, baby. This is like my second home, guys. I come here all the time. All the employees here treat us like family. Look at the menu, guys. We got some premium short rib, which I love. But my favorite thing from Korean barbecue of all time is teriyak brisket. Also, the best side, which I hope has a lot of calories, is corn cheese. But yeah, if you guys like Korean barbecue, what's your favorite thing on the menu? There's so much to choose from. I think I'm going to just go with some brisket and corn cheese and just try eating as much as I can. And hopefully hopefully I hit that calorie count. All right, chat. We got the marinated teriyak brisket. It is so good. It's crazy cuz I'm not that hungry, but my mouth is still watering when I look at this. Oh, yeah. Oh, we're going to need a little more than that. Get all the juices on there. And then we got premium short ribs. Now, this is some high quality meat. Yes, sir. Got my rice here. Let him cook now. So, there's my routine. We dump the rice right here. We grab this sauce right here, which I think it's like brisket sauce. I usually ask for more chef rug, baby. On and off the court. Throw that on the plate. Let this cook a little more. Oh, I need a fork. I can't use chopsticks, guys. Oh, hold up now. That's pretty good. Here's the corn cheese right here. >> Oh, let's go. I appreciate that. Thank you. The rice is 205 calories. Corn cheese is looking like 300 calories. So, if I consume these two right here, that's 1,058 calories added to my total. I got to go crazy. Hold on. Let me channel my inner Eric Electric. Let's do the cheese pull. Mhm. See, for me, this is easy to eat. So, I feel like I can easily get another two corn cheese in. Short rib. I'm doing this for you guys at the end of the day. So, I stay long, pace myself. I don't need to rush. There's no time limit. We got this. >> Thank you, bro. What a lovely person. I mean, robot. Let's add another 300 calories right here. I need this day to end. I need 3 days off after this. Like, I'm going to sit in my bed all day. No, I'm going to play video games. The food is so good, but I'm so full. >> I'm feeling it. Are you still going to have some chai eats tonight? Yeah. >> What? I'm going to be on the brink of death and I'll literally have chai. I need like a break, bro. I'm going to go get some fresh air. Got some food that's for my team that's not being added to my calories. You can start cooking it. I'm going to just head outside for a second. I really need some fresh air, bro. Oh, let me take a seat, bro. Oh my gosh. Okay. Okay. Okay. Can I at least get a hint? If I'm going to eat all of that and still not complete it, I don't think I could eat anymore the rest of the day. >> You really are close. Like, if I was you, I would finish all the food on that table. >> Okay. >> That's all I can say, though. >> Okay. Okay. That's That's all I needed to hear. I can do it. And you know what? I need to put some meat on these bones, bro. Like, I need this light work. No reaction. >> All right, we got the sesame. What are they called? Sesame >> Yeah, sesame bowl. >> And it has a red bean paste in it. >> Yeah. >> How many calories do you think this is right here? >> Uh, it's probably about like 75 calories each. >> Okay. Appreciate that. Thank you. I surrendered on the corn cheese. I'm going to give this to you. This is your only exception to eat today. >> I will take >> Hold on, hold on, hold on. I have to hand it to you. There you go. Thank you. So, I decided to replace my corn cheese with a dessert. I can't eat regular food anymore. I feel like I could probably scarf this down. This right here is 300 calories, the same amount as the corn cheese. And you were telling me if I ate everything that'll be good. So, I'm going to try to eat all of these. They're warm. I was expecting ice cream. >> Mhm. That is hot. M. That's sweet. We'll take it slow. One of the workers said that one of these was 75 calories. But another worker said one of them was 210 calories. So, I was thinking, why not meet me in the middle and say 150 per ball? And I already just ate one. So, I'm going to try to eat one more right now. I'm This is all that's left in my stomach. Like, I cannot eat more than this. And of course, I want to make sure like I'm feeling okay after this challenge. I never want to push myself to where I'm like risking my health. So, I know I can handle one more of these. It's so thick. The paste is like peanut butter consistency. Last swallow. I'm not eating the rest of the day. >> Really? You were actually like 4,000 calories away, dude. You weren't even close. That wouldn't have even mattered. >> What about the pep talk outside? >> I was just trying to motivate you, dude. I'm trolling. >> Shut up. You only had to eat 19,411 calories and we did it. You're over. Oh my god. Oh my god. Oh my god. Oh my god. Yes. I literally was not going to eat anymore at all today. Like I literally tapped out. I got to give a shout out to Eric the Electric cuz if it wasn't for him, we would have been cooked. 10 of you out there watching will be getting a prize. I'll explain it when we leave. I just need to relax for a second. Oh my gosh. You guys ready for the stomach reveal? Oh wait, this is the biggest I've ever seen my stomach. All right, we won the challenge. Meaning I am giving 10 of you guys $100 gift cards to your favorite restaurant. So all you guys have to do is drop a like on this video. Make sure you're subscribed cuz I'm going to check. Comment down below what your favorite restaurant or fast food place is. And of course comment down your Instagram to make it easy for us to find you when we pick the winner. So thank you guys so much for watching. This was an incredibly fun day. Like I said, I'm going to go into hibernation for 3 days after this video. I ate way too much, but I had a lot of fun. Love you guys so much. Thank you all for the support. And other than that, it has been your boy Faze Rug and I'm out.",
    "start_time": 0.08,
    "end_time": 2190.32
}