{
    "video_id": "ryo1T90ekSg",
    "channel_url": "@rug",
    "transcript": "Yo, what is up guys? It is your boy Faze Rug and welcome back to a brand new video. I hope you're all having an amazing day as always and we got another banger vlog for y'all. You guys have been enjoying the vlogs so much as I have been enjoying filming them. So, I want to do another one. And real quick before we get started, I just want to thank you all so much for all the recent love and support you have been showing me. It definitely doesn't go unnoticed. I am very very grateful for the position I'm in. Very grateful for you guys and I'm just incredibly happy. So, thank you. But we got a full day ahead of us because I am starting off here on my balcony of my master bedroom. And as you can see, it needs a little bit of work. I am in my transformation era. I just redid my garage doors the other day. I filmed it. I love the way they look. You guys love that I filmed the process. So, I'm like, you know what? I've had an idea to like redo my entire patio for the longest time and that motivated me to do it now because I want to vlog it for you guys. So, let's just take a look around real quick. I've had these two chairs sitting here for the longest time. I don't even sit on them. We've got what is that? Like poster paper, like black and white poster paper. I think we made paper airplanes for a video like a year or two ago and we left the paper there. Got a random basketball. My screen door has been off for the longest time after a windstorm. We got Lola just chilling. She loves it out here. So, I definitely want to do something for her out here if I can. And then I got this washed up couch that I've had for like 7 years, and I definitely want to get rid of it. By the way, this is not the color it's supposed to be. Let me show you the color it's supposed to be. That right there is the real color, but sitting out here in the sun every single day took the color away. So, we're going to start this vlog off by going to a furniture store and getting some ideas of how to transform my beautiful balcony. I already have a few ideas in mind. I want to get like a nice L-shaped couch. Maybe a nice little fire pit table right here. I don't even have like a little table out here. Possibly some swing chairs in the back. Maybe some plants to make it feel alive out here. I actually come out here every single morning. As soon as I wake up, I come out here to get some fresh air, enjoy the view, enjoy the nice little breeze, have my morning cup of coffee, sometimes take my morning calls out here. So, it is very important to me that I make it feel more like home. Just so you guys see my POV, it is a beautiful, beautiful view, beautiful day as always. And I don't know if you guys could hear it in my voice, but I am pretty tired. I've had a long, long week, but the grind does not stop. So, we are pushing through and I'm really excited for the weekend. But guys, I hope you do enjoy this vlog. And without further ado, let's head to the furniture store. All right, guys. Before we go furniture shopping, we need to make a pit stop at Dutch Bros, which is a must. And I told a special little someone to meet us here, and she's going to come furniture shopping with me. If you guys don't know what Dutch Bros is, let me put you guys on. It's a coffee spot, and they have energy drinks, and I get it at least, I don't know, three to four times a week. And the best part about Dutch Bros is that they're known to just be the nicest people in the world. They ask you about your day. They ask you what you got going on. They converse with you. Like, they're just super super good people in general. And they always treat us so nice every time we come. >> Oh my god, you're back. >> Hi. >> And we're just talking about you and they said they know your order already. >> Wait, you guys memorize my order? >> Well, I just remember it's Dutch love and then the soft top parfait cupcake. >> Cupcake. Yeah. Hand blended extra thick. >> Okay. >> Oh my god. Let's go. Oh, and a quarter sweet. I love Dutch Bros so much. I'm having a Dutch Bros truck at my birthday. >> No way. No way. >> I'm getting a Dutch Bros truck. What up? What up? >> Not at your birthday. >> At my birthday at Petco Park. Kayla, you're coming furniture shopping with me? >> Yes. I'm so excited. I love that kind of stuff. >> I always need a girl's opinion for what I'm going to be putting in my house. >> Can I take a video with you? >> Of course. Yeah, of course. >> Would you say hi to um my brother? His name is Jameson. Yo, Jameson and Stace runs, thank you for watching the videos. I appreciate you. >> Awesome. Thank you. >> Yo, he loves your videos. >> Hey, huge. Shout out to Jameson if you're watching this. Thank you. Oh my gosh. Thank you so much. I appreciate that. Thumbs up. Look at that. >> They always be showing some love here. Thank you guys. Thank you. >> I want to take a sip so bad, but I have to be respectful for Kaylin. >> Please take a sip. >> Say it one more time. >> Take a sip. >> This is insane, guys. Insane. >> We're Dutch Bros addicts. Realistically, we come here way too much. One day there's going to be a Faze Rug drink on the menu. I guarantee it. All right, shall we hit the furniture store? >> Yes, let's do it. >> I haven't been to a furniture store in so long, so I'm excited. >> I don't even think I've ever been to a furniture store. >> First experience with me? >> Uh-huh. >> We made it. Jerome's furniture. >> This takes me back to when I was a kid. Not always furniture shop with my mom and dad. Hey, I'm so excited for like transforming my house. I really didn't think you guys would like it, but once I put my garage doors in, you guys really love the process of it. So, I've been wanting to do a lot of renovations in my house, and we're starting with little renovations, and then we're going to go to the big ones later on. Outdoor Supertore. Let's go. Oh my gosh. A swinging chair. Okay, we got to get two of these. >> Yes. >> Hold on. Let's Let's test it out. Yo. Yo. Yo. >> We're getting this for sure. Two of them. If they have >> two two >> that'll go more like in the backside, I think. I feel like even just the design and aesthetic of it would fit really well up there. >> Yeah, I love this. >> So guys, I did say I wanted a little fire pit up there. And this is what I'm talking about. Like >> cuz it could be a coffee table, but also >> a fire pit. And it's like a small one. You don't need a big fire pit, guys. My dad just called me and he said he found a snake at Brandon's house. Wait. Oh shoot. He sent me a picture of it. >> Wo wo. He should not get near that. Oh my god. That is insane. How does Brandon's house always have? >> Wait, that's a rattlesnake? No, >> that's a Yeah, >> Dad, do not go near that snake. >> No, it moved and went to the corner and and then she did the same thing. She robbed herself like like a >> Dad, that's a rattlesnake and a big one. >> Is it? >> Yes. Yes. It looks like a venomous dangerous snake. Please call animal control. >> Yeah. Yeah. The problem I have to work here. >> No, you don't. Okay. Wait for animal. Look. Papa rug can't work. Like >> Ron, do you want me to call them for you? >> My Kayn could call them. >> Yeah. Yeah, please. >> Okay, Dad. Thank you. >> Let me know if they're coming soon or >> Okay, I'll call right now. >> Yeah, just keep watching it from a distance. Not going to lie, guys. I'm really messing with this one right here. The couch we saw over there is a little too big. Like, I would say we're not going to have that many people up on my balcony. This is pretty nice. I like the circular fire pit right here. And guys, I'm telling you, like right now when I go out there, I have a cup of coffee every morning when I sit on that couch. Like I don't even have a little table or stool to put my coffee on. So cushions look nice. Set the coffee there. Kick my feet up. I'm not going to do it here, but kick my feet up. Guys, what do you think? This and then those two swing chairs right there. I don't know if you have like the layout in your head, but I know my balcony pretty well. But it'll all come together when we get everything. The only problem is they said we can't do same day delivery and we might have to pick it up tomorrow. So, we might have to do the transformation tomorrow, which I don't mind. Of course, I do think plants though. Kaylin, what do you think? Real plants or fake plants? >> I really want real plants. I would bring it like >> But would you be able to take care of it? >> As long as it's something easy like watering it, I could do it >> cuz we could get these. But >> that was boring. >> Yeah, we want real plants. >> We want real plants. >> All right. We just purchased all the furniture. We're going to pick it up tomorrow, but in the meantime, >> we got a rattlesnake on the loose at Brandon's house. I didn't know there was a rattlesnake removal company, but we called them and they're on their way. >> So, of course, we have to get it done professionally. Don't want to mess with any rattlesnakes as it's very dangerous. So, we're going to go check it out. >> Yep. Let's do it. >> All right. Dad, what are you doing? >> I'm scared. >> Dad, where is it? It's in that corner. >> Okay, guys. We're not going to get near it at all because we're obviously going to wait for the professional to do his thing. This catch is going to be educational purposes only. We want to record what to do when you see a rattlesnake. >> They say it's a diamond back. >> Yeah. Oh. Oh, it's actually it's really small. >> No, it's because it's like >> You need help, Pops. >> Yeah. >> All Papa Rug wants to do is work. >> Now I can't do anything anymore. >> He's got some obstacles in his way. >> Cuz I wanted to wash this area because I'm about to to seal the the driveway. >> This is like the second rattlesnake at Brandon's house in the last 2 months. >> Yeah. One was inside the garage. >> Yeah. It's funny cuz Brandon's the most scared of snakes and it has to come to his house. Guys, I forgot that my brother built a basketball court in his backyard. He's actually not home right now. He went on a trip. So, we're just going to use his basketball court. Papa Rose, you still got a shot, right? >> Oh, yeah. >> No matter how old my dad gets, I feel like the older he gets, the younger he feels. Let me give you an assist. Hey, you ready? Hey. Oh, if I make this, >> I'll jump in the pool. >> I was literally going to say that. >> What else are we going to do? >> Okay, where do you want me to shoot it from? >> Right there. >> Okay, this is for Papa jumping in the pool. >> Oh, hey, I got rained. >> He's here. >> He's here. >> I come down the >> Oh, shoot. Here we go again. >> You got that? >> I got it. >> Got him. and then to leave the court. [Music] >> Okay. What's his name? Jack. Okay. Shout out to Jack first off if you're watching this. What's up, Jack? >> Hello. >> How are you? >> Good. >> Nice to meet you. I heard you watch the videos. >> Yeah, I do. >> We're actually filming right now. So, you're in the vlog. >> Hey, let's go. Hope you guys have a good rest of your day. >> We will, too. >> All right. Thank you. >> Thanks, guys. Do you think we could put a GoPro on like your rig? >> Uh, yeah, we can do that. >> Let's go. About to get you guys the best angles. >> Are you okay if the phone gets struck by the snake? Cuz this does happen from time to time. >> I'm okay with that. >> Oh my gosh. Okay. Any disclaimers for the viewers out there? >> Don't try this at home. >> Uh, if you see a snake of any kind, if you're a child, the first thing you need to do is run and tell an adult. Doesn't matter what type it is. That's our safety advice. Um, if you do find a rattlesnake, call a trained professional who is uh trained and, you know, has the appropriate permits. >> Perfect. Awesome. Thank you. >> So, before I grab the snake, I'm going to put this color card down there and then I'm going to take some pictures of it. What this does is the scientists use this to identify their natural colors and the environment they're in to help understand their ecology a little bit better. >> Okay. >> Yeah, I see the tongue. I see his tongue. All right. So, I'm going to bring him up and this way. So, you should step a little back. Oh, >> this one's tame. >> Yeah, this particular species is a little less irritable than >> That's awesome. Wow, that was so easy. Appreciate you. >> Like what I say to you. And for everybody out there, like and subscribe to both of us. >> There we go. There we go. You heard it. Wait, it's so cool seeing it in there. >> The rattles. >> Sorry, I'm paranoid. I'm paranoid. >> It was a bug. It was a bug. >> Oh my god. >> All right, guys. We got to clear the patio right now. So, we're going to get rid of this couch and you guys are going to be able to see the canvas without anything here and try to like put a picture to it from what I showed you guys at the furniture store. So, um, Papa Rug wants this couch. So, we'll get rid of this, get rid of that. Let's get to work. >> I got it. I got it from here. >> Okay, I'll leave it to it. Help me guys, please. I have never seen my balcony cleared like this. And it looks even bigger than it did before. >> Yeah, it's massive. >> Look at this. So, there's one problem here. The paper that I told you guys about in the morning actually got stuck onto the floor. So, we're probably going to need like some hot water or something. Hot water soap, like a squeegee or something >> to scrub it off. But you could play like football up here. >> You could put a whole bed out here. [Music] A basketball court up here maybe. Okay guys, so what we are going to do right now, we're going to clean the entire floor. As you can see, there are so many spider webs in every nook and cranny. Did I use that right? >> Yeah, you did. And uh my dad is going to come here later tonight and he's going to add sealer >> which is going to make the floor shiny and >> glossy and just clean. So it's going to be ready for the furniture to be delivered tomorrow. So me and Kaylin are about to go into clean mode right now. >> Let's do it. >> Let's go, guys. We are about to bring the hose up here and we're going to hose the entire thing. Kaylin is swiffer sweeping and uh dusting. >> Yeah, as you can see, I've never cleaned this in the 3 years that I've lived in this house. Guys, before we hose this down, I got to vacuum. [Music] Oh, look at how dirty. We got to obviously pick up the big pieces that won't go down the drain. But look. Oh, this is lowkey satisfying. Like knowing that it's getting clean and new furniture is coming in tomorrow. All right, guys. We're going to clean the rest of this and then wait for it to dry and then Papa Rug will come by with the sealer. The view is so nice right now. Tell me it doesn't look crazy. It does. Looks like cotton candy. >> Such a blessing, guys. I'll say it till the day I die. I don't care. Thank you guys for everything. I wouldn't have this without you guys. So, love y'all. Papa rug. >> What's up, guys? >> Good morning. >> Good morning. >> What did you bring here? >> Uh, we're going to seal your patio. >> Okay, perfect. So, the furniture is going to come in in about 2 hours. You think it's going to be dry by then? >> Yeah, the weather is nice. It's a little uh >> gloomy. >> Gloomy hot. So, an hour, 2 hours, we'll be we can step on it. Okay, perfect. [Applause] All right, guys. All the furniture has arrived. Papa Rug is here to help me assemble stuff. >> It's a lot of furniture for a little patio. >> Oh, you'll see. >> You think it's going to fit? >> I think it's going to fit. And we're going to have a lot of room. But look, guys. Can you tell the difference with the glossing and the ceiling that Papa Rug did earlier? I I could tell a huge difference. >> I swear it looks like it's brand new. the tile like you just put it on. But look at it. >> You can really see the glossiness. And now we're going to fill this up. All right, here's the patio before. All right, guys. We got the couches assembled inside. So, now it's time to put them together outside. But we got some more stuff. I can't wait. It's going to look so good. We got the phase rug down here with the weights because the carpet was pretty crumpled. >> Okay, let's hang these up. Dad, you hang this one up. And then we got the pillows for it. I feel like that's going to be my spot for sure. Wait, so like this, right? >> Does that look weird? I'm like scared to sit. Wait, Dad. Did we assemble this right? >> Yeah, we did. Don't worry. We're good. >> Wait a minute. All right, we got the two swinging chairs. Now, let's bring out the couch. That's going to be nice. But the couch goes there. So it's like it's like a bigger space there with the fire pit here and then the two chairs there. >> That way you can use all of them. >> That's what I was thinking. And it'll look nice. >> You don't need to walk behind that now. >> Okay. Change of plans. [Music] Yeah, this looks amazing. Yeah, the other place we had it guys, like it was covering the door when you want to get out. So that's literally perfect. >> This corner, I would pay million dollar for this. >> The breeze, the mountain, the views. All I need Netflix. >> Oh, if you had some Netflix here, guys, look at the the POV right here. >> Me and Pops. Dad, >> good job. >> Good job. All right, so we got the fire pit. Yeah, >> right here. But um Brian wants to do the See that? Okay, Brian. >> Can you look look? There we go. There we go. Oh, no. It's going all on the couch. Go this way. Go this way. And we're done. >> Wow, that looks beautiful. >> Guys, let me know what you think in the comment section down below. But right now, we're going to go back to yesterday and continue the vlog. All right, guys. So, for this segment, I recently have gotten into Pokémon like crazy. It is a new hobby of mine and the Pokemon community has welcomed me with open arms. So, I decided I wanted to do a Pokemon pack battle. Bring in my opponent. Oh, wait. The opponent is you guys. So, I got this gifted to me by a supporter named Luke at the mall. And it is a Scarlet and Violet Surging Sparks Elite Trainer Box two pack. Meaning there are 18 singular packs in there. I wanted to challenge you guys to a pack battle where if you guys beat me, I will pick one person in the comment section down below to send every single card I open. Here's how it's going to work. I'll be opening one for me and one for you. And whoever has the highest value in that pack gets a point. And of course, whoever has the highest points by the end of this pack battle wins. All right, guys. I stand corrected. There's actually 15 packs. There's six in here and nine in here. So, we'll just take one out and do seven and seven for the pack battle. Here we go. So, we got nine in here, six in here. We'll take one from the middle out. We'll probably open this at the end of the pack battle. And now we got 14 right here. We'll go 1 2 3 4 5 6 7. Hm. Which which stack do I want? I'll go with this one. And I'm going to pop up the chase card of this entire pack here on the screen. It is the Pikachu EX, the special illustration rare. So, if we open that, that's the best card in the pack. All right. Now, we're going to transfer over to my pack opening station. All right, guys. We're starting with the first pack here, and this is for my side. Let's see what we got. Watch me pull the chase card first pack. Here we go, guys. Let's do it. [Music] Terminator. Sounds crazy. Okay, I definitely didn't get anything crazy, leaving me with $323 for my first pack. Now, if you guys get higher than 323 in this pack, you get the first point. I wish you guys luck. Oh, another wraps. Ooh, this one looks nice. Leaving you guys with a total of $4.16. So, you guys win round number one. It ain't over, though. We got six more packs. Let's do it. We got our first reverse holo. Oh, this looks crazy. All right, we got our first double rare from the pack battle. We got the hydrogen EX and that leaves us with the most expensive pack so far, $489. But we still got your pack to open. Will you guys beat $489? Got the first reverse holo, Zerude. And we got your holo of the pack, leaving you guys with $421. So I win round number two, baby. Let's go on to the next round. Starting with my pack. Here we go. Oh, first reverse holo. Second one cast form. Come on. Ooh, Landerus for the holo. Okay, leaving me with $3.71 for my third pack. All right, guys. 371. We've been seeing a lot in the fours. I feel like you guys are going to get a crazy hit right now. Ooh, that looks crazy. That looks like a nice reverse holo. Oh, you guys won the third round for sure. Oh, this looks sick, too. The most expensive pack of the battle. $512. You guys get another point. Okay, we got our first reverse. Come on. Second one. Oh, and then this is the full holo right here. $366 for my fourth pack. I'm not feeling too confident here. I think you got this one in the bag, guys. All right, first reverse holo. Second one, Crocalore. And full holo, Landerus. The same one as the last pack. $3.94. Round four goes to you guys. Dang it. That's three points to one point. I could still make a comeback. I just need to win the last three. Oh, what is this? Wo, a trainer. I don't know if a trainer is good, but we got the energy search pro trainer reverse holo and Zerude full holo, leaving me with $4.39. Please be enough. >> Okay, Xernius, Colber, and Rabka, leaving you guys with $361. So, I win that round. It is now three to two. Two more packs to go. Okay, first reverse holo. Haven't seen this one yet. Second one. Excadrill. Oh, I got this already. $3.82. That is not what I want to hear. This is your pack right here, guys. You could win it with this one. Oh, that looks nice. That looks nice. Another reverse haul. Oh, you guys win. Oh my gosh, this is beautiful. $524 and you guys have officially won the pack battle. Congrats. Congrats. We still got the last two packs. This is yours. This is mine. Let's just see if we get the chase card. We'll go really fast. No chase card right there. But still nice. [Music] This one's nice. Nice little full holo, but no chase card. But wait, we had the one pack that I took out from the beginning. Let's see if the Pikachu is in here. Okay, here we go. and the full holo right here. So, no chase card in what we open, but all these cards that we open will be going to one person in the comment section down below. All you have to do is drop a like, make sure you're subscribed to me, comment down below your favorite Pokémon of all time and your Instagram so we can actually reach out to a winner. To make things a little better, I'm going to sign the box that I put all the cards in. Boom. Good luck to whoever wins this. And we got one more fun little segment for this vlog. Hope you guys are enjoying so far. I am so excited. >> I am so excited, >> guys. Kayn has been dying to see a storage unit in person because I've done many of these storage unit videos, which you guys all love. So, we recently just won an auction for $270. And I'm taking Kayn on our first storage hunt. Since my last storage video, I read a lot of comments of people saying, \"I wouldn't mind this being a series. rug needs to do more storage videos. Rug plus storage unit equals greatness. These are fun. Like, you just never know what you're going to find, if you're going to lose money, make money. But we're about to find out. >> Let's go check out the unit. So, we had the lady actually unlock the unit for us, and she told us it belonged to someone ex-military. >> Mhm. >> So, whoever's unit this was, thank you for your service. >> Thank you so much. Now, let's find out what they left behind. >> All right, Kaylin, you want to do the honors of opening it? >> No, no, you do the honors. Whatever like jumps out. I need to make a run for it. >> Here we go. Oh yeah. >> Okay. >> So, this storage unit has a lot less items than my usual storage units that I buy. But I'm just very intrigued in the bags and the boxes. And guys, please please let me know if you want to see more storage unit videos cuz I'm down to travel for them, too. Like, if I find out there's a unit that has some crazy stuff, I'm willing to spend a lot of money on one for your entertainment. All right, Kaylin, where do we want to start? Do we want to save the bags for later? Like, I wonder. No, I think we just start off with this. >> Okay. Oh my gosh, there's two of them. >> I'm not even capping. That is That is very heavy. So guys, usually we have an appraiser with us like Renee from Storage Wars or Rene's brother who also helped us in the Vegas video, but this was kind of on the fly. Like we bid for it last night and we won it today. So, we kind of wanted to go. But there are a lot of tools on your phone that you can actually use to see the price of things. So, we'll do good on the appraising. Okay. Oh, it's in there. It's in there. Hold on. Oh, that looks like it's in good condition. So, this is a Samic brand. Look signed by anyone. >> No, no signature. >> Wait, here. Let me play a song for you. >> Wait, you know how? >> Yeah, >> actually. >> What? Hidden talent. >> Ready? Yeah. >> Hey, there. >> Okay, Kaylin. So, this is what we're going to do. You're going to hold this. So, I was taught by Rene's brother to use Google Lens and it'll pop up a bunch of listings of people selling the same product based off the picture you take and seeing how much it's worth. Would it be this one right here? Used Samic D9 antique natural acoustic guitar. But this looks different cuz look, the logo on this is different than this. It actually has the model number. Look here. Let's go in here real quick. Let's go into my house. Okay, I found the exact one. This one says $89. What would you What would you say to be safe? >> I'd say 80 bucks. >> 80 bucks. Cuz I see this one right here. It says $90. >> Cuz this is still in good condition. We don't have a full price on it. So, let's just say it's $80. >> Let's go 80. >> Yeah. >> Okay. All right. First item, $80. Out of $270 that we spent. I think we're going to profit from this unit. This bag is so heavy. It could contain so many different things like memorabilia. Maybe books. Diagnostic microbiology. the 13th edition. You know, these are actually pretty expensive. >> Yeah, it's like a school book, right? >> Reminds me of school. Literally smells like a school library. >> Yeah. I will say books in school are super expensive. Do you remember if you lost one, you'd have to pay back like 200 bucks? >> Yes. Oh my gosh. The concept of anxiety. >> A simple psychologically oriented deliberation. >> Look at my look at my pronunciation. You're good. >> In view of the dogmatic problem of hereditary sin. >> What's that? a micro set. What the >> Wait a minute. >> This guy was a scientist. Yeah, I think we made a good amount of money just with this bag of stuff. >> Let's Cuz guys, we're going to We're not going to like scan every single book. We'll scan a few and then kind of do an estimate of what we think this bag is worth. And we'll be conservative. We're not going to just try to shoot high. Okay, let's just see this one. New is $105, but used says $23. So, let's say let's give it 20 bucks. >> Okay, >> let's give 20 bucks to this. This one's 16 book. Oh, no. That's That's the ebook. Let's go 15. Let's go 15 for that. Okay, let me try this one. Like, I just want to see like a different kind. Yeah, paperback is about 15. >> So, we'll go 10 for that one just for it to be used. What the heck is a hematology? Like, I don't even know what that means. I'll probably scan one or two more books and then we'll count how many books are there and just give like a rough estimate. $82. >> But that's >> and it says condition good. >> That's a used book. $82. Looks like it's in good condition, too. There's notes in here. Let's go 50 bucks. >> Yeah. So, these four $95 and 30 books right here. I mean, guys, even if you put them at $10 a pop, that's $300, but they're worth way more than $10, I would say. So, there's small books like this, but then there's also textbooks with hard covers that are more expensive. Should we go like $15 to be safe, just so they even out? Mhm. >> So, right now, we found approximately $625 of value in this $270 unit. >> Yeah, we already made back everything and made a profit. >> We didn't do these. $20 pre-owned. So, we'll throw that in there. We'll go 10 bucks for this. >> Okay. >> Oh, wait. There is some stuff in here. So, there's Oh my goodness. I want to meet this person. Oh my god. I see Diary of a Wimpy Kid. >> Didn't you audition for that movie? >> Don't play the clip. Someone's a big fan. >> Can we get a mic over here, please? >> Oh, I love Dr. Seuss. >> Oo, collector's edition. There's a collectible. >> Another collectible. >> No way. >> Cat dog. >> Oh, I don't know if anyone's interested in cat dog, but we'll check the price. But first, let's do the book. Says 13 bucks. So, let's let's put each book at $5. Yeah. >> And let's just scan these just in case. Okay. Two disc collection. 13 bucks. Okay. >> I'd say let's let's throw $10 on that. >> Okay. >> Okay. And then Nick Tunes cat dog. Yeah. Five bucks. >> We're at 705. >> 705, baby. Okay. >> Okay. >> What is that? Could that be the printer? Oh my gosh. This is really old. Yeah. It's actually for receipts. So, this one says it's 35 bucks. That's used. >> This was brand new. >> We'll just still keep it at 35. Okay. >> Seems like there's some stuff in here. Let's check it out. It's like a little mini sword. What do they call these? >> Like a letter opener. >> Letter opener, >> I think. So, sometimes swords. My grandpa used to have one. >> Are you serious? >> Literally. Yeah. >> Oh, >> a camera. >> Camera. >> Wo. This is so vintage. I mean, it's a little damaged. This is like decent condition. >> Yeah, this one's not that dam No, this one's pretty damaged. >> What the heck? These could go for a lot. 10 bucks. >> Cool. Should >> we say five bucks? >> Yeah, we'll just do five. >> Five bucks. And now >> letter openers. >> That's what I think. >> Let's see if I just scan it on Google Lens. Let's see. Yeah, it is a letter opener. What? Elite ball knowledge. 50 bucks. And it comes with all three. Calpack rolling luggage backpack pre-owned for $47. Let's just go 30 bucks. 30 bucks is good. I think that's solid. Oh, one thing we didn't do, we didn't value that table. >> Oh, yeah. >> So, let me see what that could be worth. Doesn't even say the price. Let's go 30. Try to keep it conservative. Uh, sadly, we got trash. This bag looks like pretty high quality, though. Condition new. 55 bucks. We'll give it 20. >> Yeah, give it 20. >> Oh my gosh. Okay, so you guys already saw a lot of books. We counted how many there are in this bag, and there was a total of 40. So, we're just going to say conservatively $10 a book, and that is $400 added to $875. So, we're at $12.75 right now. And $10 is really conservative cuz out of curiosity, I just checked like how much this was and used was 55 bucks. Oh, wait. Hold on. Whatever this is. Shorts >> and more. What? >> Wait. A hat. Is that Airbnb? >> Yeah, I think so. >> That's random. Maybe he owns a Airbnb. Okay, guys. Me and Kayn are going to count again. We're going to count and just times it by 10. 23 books, $230. It added to the total value. Oh, hold on. Now, this has stuff in it. Little Disney princess suitcase. >> Cute. >> Nice little bongo set. >> Okay. >> Okay. Here's one used. $46. >> Okay. >> So, we'll go 40. >> Yeah, that's 40. >> Not bad at all. What's in that princess bag, though? >> Let's see. Nice little notebook. Ooh, Chanel perfume. >> She has like >> This is like La Palooa. >> Wristbands of where she's gone to. >> Oh, hold up now. Animal Crossing. >> Animal Crossing. Eugene, why are you laughing? >> Because you and your cards. >> Just cuz I got into cards, you're laughing about my new hobby. That's really messed up, actually. >> No, I'm not laughing at your hobby. I'm laughing that you think you >> $12. No, $5. What about the actual suitcase? Okay, we'll go 10 bucks from that. We got the chainsaw right there. Maybe this belonged to Texas Chainsaw Massacre. So, someone recently sold this used for 50 bucks, so we'll go 50. Let's check out this vase. 10 bucks. All right. So, we tried scanning all the furniture, but nothing really is popping up. So, we're just going to say they're $0. Like, you sometimes see free furniture on the side. Like, they're not in the best condition. So, >> nothing for the furniture. But, but this unit from what we conservatively valued everything at was $1,615. >> And again, we spent $270 on this unit, meaning we profited $1,345. That's actually crazy. >> That's insane. The jackpot of this locker, >> the books. >> Books. If it wasn't for the books, then I don't think you'd find any value. I don't even think you would profit. >> I don't think so either. >> I think the coolest thing about storage units is that they all have a story to them. We got the smartest ex-military guy. >> Mhm. And we saw his daughter's um memorabilia. >> Memorabilia. >> Thanks for taking me on this journey. >> Of course. Of course. If you guys want to see more storage unit videos, please drop a like on this video. Make sure you hit that subscribe button down below. get me to 30 million subscribers. And other than that, it has been your boy Faze Rug >> Kaylin, >> and we are out. >> Peace.",
    "start_time": 0.08,
    "end_time": 2012.96
}