{
    "video_id": "SpUTBRJNIO4",
    "channel_url": "@rug",
    "transcript": "Social media has taken over the world. It used to be a place to stay connected with friends and family, but now it's become a shopping paradise, especially on Facebook Marketplace. You can find people selling all kinds of things from cars to collectibles and everything in between. You name it and it's probably there. But there's one thing that I didn't expect to find. Food. There are people who sell homecooked meals through Facebook Marketplace. They're turning their houses into actual drive-thru restaurants. You place an order by messaging them on Facebook and in minutes you have a fresh home-cooked meal. So, today I'll be going to five different houses to try as many different foods as I can. But first, let's find my first meal of the day. So, I typed food in the search bar in San Diego and this is what pops up. Fresh made to order Filipino food. Creamy carbonara per tray. Soul food. Oh, we got a video. Oh, that's so fire. Hold on. The mac and cheese. Oh, is that fried chicken? Oh, so we got the colored greens, the mac and cheese with that cheese crust on the top. Looks fire. We got fried chicken. And I'm not sure what else there is on this plate, but it looks good. This is definitely an option. Oh, these tacos look fire. What is this? Gourmet sabzi. Oh, it's Persian food. But hold on. Is this AI? If it's not AI, I'm impressed. I think we're going with this. I mean, they went all out with the video. The mac and cheese is catching my eye so much. All right, guys. Before we pick up my first meal, I had the idea to come to the mall and surprise the person with the best home-cooked meal of the day with a brand new iPhone 17, which actually came out today. Let's go. All right, guys. We just got to the Apple store and look at the line. Got a long line out here. Thankfully, we placed it online, so I don't know if we have to wait in the line or if they have it ready for us. We'll see. Should I wear my Ray-B band Metas? I feel like it's only appropriate for this video. All right, guys. POV, your phase rug. This is what you see when you film a YouTube video. We just got word from the Apple employee. This is not the line. No, that's not the line. That's the line. I did not even see that. Hold on. Let's go take a walk. Oh my gosh. Yo yo yo yo yo. No, no, no, no, no. This can't be real. This actually can't be real. Wait, we won't be able to get the video done if we wait in this long. >> This is going to take all day. >> Look at that. Yo, it literally goes boom boom boom boom. This is like a roller coaster line. Okay, we came up with an idea, guys. I'm going to have someone from my team wait in this line to pick up the iPhone. So, I have time to make a video for you guys. All right, let's go pick up our first home-cooked meal. All right, guys. We just left the mall and we haven't gotten a response from the soul food person. So, we might have to find a new home-cooked meal. I realized since this is Facebook Marketplace, it's not like a professional restaurant where you just place an order for pickup and they have to do it. These are people that are just doing this for fun as a little side hustle, maybe a side business. So, if they don't see the message, I mean, it's not guaranteed you're going to get the food. So, we're going to go back on the marketplace right now and find our first meal. First thing that pops up is that AI picture we saw earlier. Oh, Spamasubi. Wait, free? I love Spamasubi. I used to literally buy Spamubi from my friend in high school all the time. She would make it at home, bring it. What if it's her? What if it's like a full circle? It's actually her. I forgot her name. Rosalyn, if you're watching this video, I loved your spam subie. Oo, Persian food. Oh, wait. This kind of looks like kufta, which is like a meal my mom made. Oh my gosh, it has the tomato, the lettuce. I see the olives. We're going to go with this Persian food for our first meal of the day. All right, I'm going to message this person right now and hopefully they see it and make the food for us. All right, guys. My GPS took me to this apartment complex. I'm having a hard time figuring out which one it is. Let me just stop real quick and grab my phone and look at it. Oh. Oh my. Oh my. Oh my. I'm sorry, bro. Chill. >> Hi. This is my first time ever ordering off of Facebook Marketplace. >> I'm so excited. You look official. It looks good. >> Thank you. >> Venmo or cash only? >> Venmo cash. >> So, how long have you been doing this for? >> 6 months. >> 6 months. Nice. That's awesome. It smells so good. What is this one exactly? ground meat with uh tomato, onion, and salt, pepper, and it's >> because like I'm Middle Eastern as well, so I feel like my mom has made something like this. It's called Kufta. I don't know if that sounds familiar. >> Yes. Yes. I have a kufta. Persian people say kufta tabi. >> Oh, okay. Is that what this is? No. Oh, okay. Okay. Okay. That's just like what I have. >> This is Kot. >> Kotlet. Yeah. >> Kot. Okay. Thank you so much. I'm excited to try it. Thank you. Have a good day. Okay. Back secured. Let's go. All right, guys. We just pulled up to a local park near where we picked up the food and we're going to give it a try. It smelled so good in my car. I haven't had Persian food in a long time, but I think this exact dish is similar to something my mom has made. We're about to find out. It's meant for me to sit here. B. So, we got this right here, I believe, is bread. I want you guys to look at it first. Here we go. Ooh, looks healthy. First meal from Facebook Marketplace. That is so good. It's pretty salty, but it's fire. It tastes exactly like what my mom has made in the past. It's incredibly good. If I have any Persian viewers out there, let me know if you guys have had this. I'm curious what this is like with the ground beef. I think it's olives. I'll try it, but I don't like olives in general. Oh yeah, it's olives. Yeah, I'm going to avoid the olives. Some crunchy lettuce. This is gas. I don't know if I'm being biased because I'm Middle Eastern and this is what I was used to growing up, but it's bomb. M. Well, let's try the bread. M. Wow. This is a top tier meal. Let's make a little sandwich here. Grab this. Insane. Got some lettuce in there. Then you got some tomato. Middle Eastern food is so underrated, guys. This tomato, it's hot tomato. And it also reminds me of like a breakfast I eat. My dad puts tomatoes on the pan and you eat it with eggs and this thing called boserma, which is like a type of beef with the breakfast. Very, very similar. I don't know if I'm just eating this much cuz it's my first meal. I don't want to get too full cuz we got a lot more to go. Next tier. So good. We're going to go find our next meal on Facebook Marketplace. Let's see what my second meal of the day is. Here we go. All right. So, I see Filipino fresh food. It looks like lubia, but it almost seems more for like big parties cuz it says you're hosting a gathering at home. Party trays. Perfect for parties, potluck, or just because I think that might be a little too heavy for me. There's so many options. Best boils in town, guys. I just found a seafood boil. That is one of my favorite meals of all time. If I'm ever hosting anyone at my house, we're ordering seafood boil. Oh, they got crab, corn, sausage. Oh, the sauce looks amazing. We're messaging this person. I've never had a seafood boil homemade in general. I usually order it from a restaurant. So, this will be my first time getting it from someone's home. This is very exciting. Let's go. Okay, we're in the pickup spot. I think now we wait. I was going to sit here, but there's a band-aid on there. What a beautiful day, guys. Beautiful day to be eating Facebook Market. Beautiful day to be eating Facebook Marketplace foods. It's a little hot. Sometimes I just be yapping. It's a great time to ponder. Just look around. Think about your future. Wave to the UPS driver. Say thank you. They work very hard. >> Thank you. See, you get one of these back. >> Hi. How are you? >> Good. How are you? Oh my gosh. seafood boil. >> This is awesome. That looks insane. >> Great. Thank you. Thank you. We hope you guys enjoy it. >> Thank you so much. Wait, how long have you been doing this for? >> Um, for a couple of years. Ever since 2020. So, yeah. About 5 years. >> Smells so good. How are you? How are you? Nice to meet you. >> The creator of the sauce. >> Oh, what's the sauce? >> It is a Louisiana style Cajun sauce, but she knows more than I do about it. >> Thank you so much. Oh, it's so nice and warm. >> Careful. It's really hot. >> Yeah, it actually is. I was about to burn myself. Wait, so is this like a side hustle? Like >> Yeah, it's definitely a side hustle. We stopped for a while. Um, but now we're just trying to raise money for my granddaughter's birthday. So, we're back at >> Oh, that's awesome. >> Thank you so much, guys. Guys, look at how shiny the crab looks. Look at how saucy, juicy. Hi. How are you guys? Nice to meet you. Nice to meet you. Nice to meet you. What you guys doing? What up? >> This is your second time meeting. >> Yo, Gio. >> Yo, Gio, come out, bro. >> Gio, we here. We here. Hey Gio, my guy. >> He sleeps with you on >> you on the block, bro. >> Let's go. >> Appreciate you, bro. >> What happened to your wrist, bro? >> I was hooping, bro. I felt au, bro. >> You want to get a photo? >> Yeah, let's do it, bro. >> One, two. Lit. >> I appreciate you guys so much. Thank you. Have a good one, bro. >> Thanks, baby. >> That's some real real fan love, man. I guess I'm on the block. Let's go. All right, guys. We found a little local park. Can I tell you guys, the smell of this seafood boil is insane. I'm a seafood boil connoisseur, so I've had a lot of different places. Oh, we're about to get messy, bro. I hope they put gloves in here, but I don't think so. But usually I eat seafood boil with gloves. Woohoo. Okay, so we got some utensils. We got some lime. More utensils. Oh, we got extra sauce. That looks insane. You already know the homemade sauce is going to hit. Bro, this fly keeps flying me. Nah, that is the best presentation for a seafood boil I've ever seen. Dude, wearing white is probably the worst idea for a seafood boil. No matter what, it's going to splash on my shirt. I already know it. Oh, you already know this is spicy. First things first, we're trying the sauce. Look at that. Ooh, it is lemony. It is spicy. It's good. Squeeze that lime. Oh, this is an S tier before me trying it. I'm not even trolling. Here we go. Oh yeah. Oh my. >> Wait a minute. We did a phase rug run. That is crazy. Let's try the corn. Look at the sauce on the bottom of the plate as well. None of it is left untouched. That's got to be the greatest sauce I've ever had. Considering this came out of someone's kitchen, like they homecooked it. You just know it's made with love. I think when people are cooking from home and run a business from their home, they care a lot more about it. Bro, the potato in a seafood boil is a must. The shrimp. I usually get headless shrimp cuz I just don't know how to peel this. You guys see how messy it is? Oh my gosh, there's like five flies around me. Oh my m M. That's what you like to see. I think you know where I'm rating this based off my reaction already. So, this is most definitely an S tier. And it might be hard to beat. I know I gave the Persian food an S tier, but this is just different. Like, come on. Look at that. So satisfying. I think I need to find a bathroom to wash my hands. All right, guys. Look. We've had Persian food. We've had a seafood boil. I need some Mexican food. I'm fing for Mexican food, especially homemade Mexican food. And I found this listing for tamales. And I am a sucker for tamales. My old friend in high school used to always bring me tamales around the holiday season. His mom used to cook them and they were so fire. And I heard they're more seasonal when they get cooked. So I found a listing that says tamales and oha de platano. And I need tamales. Bro, it's not Christmas. It's not New Year's. It's not any holiday. It's just a random Friday in the middle of September. Hopefully we get a response cuz they look insane. Especially with that sauce. Oo. I'm glad I made some room for this. All right guys, we are pulling up and it looks like it's in a building. I think it says Mesa food and liquor. And this is where it took us. That's interesting. Tamales from a liquor store. See, this is the interesting part about making YouTube videos. You never know where you're going to go, what you're going to do, what you're going to eat. And I had no idea that we were about to get tamales from a liquor store. We'll see how it is. Guys, look at this. >> Hey, >> what up? What up? >> Yo, let me get >> nice to meet you. Got fan love on the street. We got the elote sign. So, they have elote here, too. I'm here for the tamales, but if they have more, I'm down. What are you doing, my guy? Film the video, bro. >> I knew I was going to meet you one day, bro. I just didn't know. >> Hey, I appreciate the support, bro. Thank you. You have a nice day. >> Have a good one. Okay. Hi. How are you? We saw a listing on Facebook Marketplace for tamales. >> Yes. >> You guys have them here? >> There's a lady. She sells them outside. >> Oh. >> But she's not here right now. >> She's not here? >> No. >> When does she come? >> In the afternoon. >> Anytime specifically like 4 or 5? >> I think after 4:00. >> After 4:00. Thank you so much. Appreciate it. I was a drink. >> A drink? >> Yeah. Go and get some drinks. >> Really? Come see. >> Oh my gosh. Thank you. Anyone who owns liquor stores, they're just so nice. Like my dad, even when he has regulars coming, he's like, \"Just go get some candy. Go get some chips.\" Like we just love giving back. >> They're speaking my language. I don't think they know that I know what they're saying right now. Should I say something in Rocket Surat? >> Hey, me too. Babby call with own liquor store. YouTube. >> Oh, really? Oh, yeah. >> His kids watch me. Miam, Grace, and Faith, thank you for watching my videos. >> Actually, more and also Ronita, >> Ronita, >> Miam, >> Mariam, >> Yousef, >> Yousef, >> Randy, >> Randy, >> that's it. Everybody else, how >> all of you guys, I love you. Thank you so much. I'm going to get electrolytes. Thank you. We're going to be outside or you want to take a picture now? >> Take a picture now. >> All right, guys. In 3 2 1. >> Okay. Thank you so much. I appreciate it. Have a good one. Okay. >> Thanks. Okay. Now, I guess we wait for the tamales lady. All right, guys. We just got word that the tamales lady is going to be here in a little bit. So, we figured we might as well knock out another spot, try to find some more food on Facebook Marketplace in the meantime. Okay, I see some Filipino food. That sounds good. But, I don't want to get too full before the tamales. Oh, I see homemade cookies. Ooh, honestly, maybe a little dessert. Like, not too crazy, but like a cookie or two could be good. But, okay, there's homemade cookies. Homemade cashew cookies. Okay. Nah, not cashew. Dubai treats. Oh my gosh, these Dubai chocolate chip cookies look absolutely insane. We're doing this. Oh, they got like cakes as well. Anything Dubai chocolate, I'm down. All right, guys. We are pulling up. I'm so excited. It was perfect timing cuz when we messaged her, she said that she just made a fresh batch and that they would be ready in 20 minutes. Coincidentally, we were 20 minutes away. But we are pulling up right now. This is actually a beautiful area. I've never been to this area in San Diego. The houses, the palm trees. We on the bougie side with the Dubai chocolate cookies, too. Hello. Nice to meet you. >> You, too. >> How you doing, Brian? >> Jennifer, hi. So, here's a sample for you. >> Oh my god. Wait a minute. This is crazy. Should I try it in front of you? like honest review. How long have you been doing this? >> Well, when it got popular on Tik Tok, then I started doing it. So, so I decided to make it. So, I started that, but I started doing the labu ones and Oh, it's just got >> Wait, labubu cookies? >> Dubai bars? >> Yeah. >> There's labu ones that you make? >> Yes. >> Oh, no way. >> You want to see my Instagram? >> I would love to. Yeah. Okay, I'm going to give this a taste test. >> You like it? >> Wow, that's really good. Instagram that I have is Choco Loco Flan because I I'm from San Antonio, Texas. See my Texas flag. >> No, I like it. No problem. >> And I used to make FL cakes. So, I kept that Instagram for it. So, it's called Choco Loco Flan. I >> Well, this is delicious. 10 out of 10. So, thank you so much. I appreciate that. >> You're welcome. Thank you. Make sure you give some to the cameraman. >> Well, there's this thing my cameraman can't eat on the job. >> Yeah, >> I always ask, but no water, too. >> Oh, I'm sorry. >> Nice to meet you. Have a good one. Okay. Appreciate it. Take care. >> Bye. My halfeaten Dubai chocolate cookie. This is so good. It's a S tier. Everything's going to be an S tier. Everyone makes fun of me for my ratings cuz they're like, \"Oh, Rug, you always say good things about everyone.\" I'm like, \"But it's the truth. Like, everything I've had today is an S tier.\" I'm not even trolling. Why would I troll? It's time for some tamales now. Free of charge. >> Free of charge. Take it. >> Are you serious? Have a great day. Okay. Thank you. We pulled back up to the liquor store and they got the tamalees stand up right now. Bro, I am so excited. For me, it's between tamales or p so as my favorite Mexican food. Bro, they got a whole operation out here. They set up the tent. This was not here 30 minutes ago. Hello. How are you? How are you? Oh, you have hot dogs here? Enchiladas. >> Enchiladas. Oh my god, the bacon cooking. Can I get some tamales? Should I go over here? Hey, no way. Antos, Mexicos, las luchonas. How's my Spanish? >> It's good. It's good. Yeah. >> Hell yeah. Wait, that looks so nice. 5:30 to 10:30. So, if you need a late night snack, this is the perfect place to go. Oh, wait a minute. That smells so good. Let's go. Thank you. How often are you guys out here? >> We're from Monday to Friday. I already know this is going to hit. Here we go, guys. I haven't had one in so long. Cheers. >> Wow, this is so good. So good. Thank you so much. You got to give him a good tip. Very hot, fresh. It's unbelievably good. It's one of my favorite foods of all time. M. So, I think this was the pork. I'm going to try the chicken. M. This one is poo and salsa verde, which is green salsa. Wow. Can you guess where I'm going to put this on the tier list? Just guess. >> Does it start with the letter S? Does it start with the letter S? Only the fourth sier of the video out of the four places we've been to. >> Pretty much what everyone orders. >> Are you serious? On the house. >> Enchiladas. >> Enchiladas. Oh, that looks insane. Oh my goodness. >> M I'm going to share with my team. >> Really? You're not trolling? >> Cuz like we're in front of people. So >> Oh, bro. What do you mean? I'm not trolling. >> I'll eat this later then. >> No. No. You eat it right now. >> Thank you. >> Of course. >> All right, guys. So, we finished eating and we were here by the liquor store and I grabbed $500 in cash to surprise them because food was amazing. They're out here working super hard. Like I said, satisfying hungry people and it was delicious. So, I think they deserve a nice little $500 tip. What up, bro? How are you? Nice to meet you. You want to get a photo? >> Yeah. >> Thank you. Did you already pay for your food? >> No, not yet. >> Okay, I'm going to take care of it. >> Are you sure? >> Yeah. Yeah, I'm going to take care of it all. Guys, I got you with a tip and for her food, too. For their food, I got you guys with $500. Gracias. >> I appreciate it. Thank you for me. >> What? Again, you guys are so giving. Thank you. Thank you. I appreciate it. Thank you. Of course. Take care, guys. Thank you. >> Mhm. Thank you guys so much. I appreciate it. Thank you. Appreciate it. >> Take care. Nice to meet you. Nice to meet you. Appreciate it. >> Of course. Thank you guys. Have a good one. Love you guys. I think we go one more spot. The final spot. Could be dessert. Could be another meal. I'm having a lot of fun. And we still got the iPhone to give away. We'll see who deserves the iPhone at the end. All right, guys. We came to fill up at the gas station and I started looking through some options and I found some Filipino food and it says fresh homemade food. We got a boomerang as the main slide, but it says free. Is it free? I've never seen this food before, but I didn't want to go for like a heavy meal. I feel like I've been eating a lot today. So, nice little bite-size finger food for the end. And Filipino food. We haven't had Filipino today. So, we're going to message this person and see if it's actually free. Oh, it's not free. I just scrolled down. It says $15 or creamy bacon carbonara is $35 per tray. But I think the one that I'm going to try is called Show My. I don't know what Show My is, but I'm always down to try new things. So, we're going to try this Facebook Marketplace Filipino food for our last spot of the day. Let's go. Baby, are you down? Down. Guys, this video is so crazy. We're literally pulling up to people's houses and getting food delivered. But technically, we haven't had a drive-thru moment. Like, I said it's like a drive-thru, but every time we keep getting out of my car. So, for this one, should we actually have it delivered to us through the window? >> This will be the world's first. >> Yeah. World's first drive-thru. Oh, I think they're coming out right now. >> Hi. How are you? >> I'm good. How are you? >> I'm doing good. Oh my gosh, I'm so excited. >> No, it's like really, really hot. You got to be careful. Okay. >> Oh, it is pretty hot, but that means it's very fresh. Let's see. Should we take off the foil? >> It's like a Filipino dumpling. >> Wo. So, what is actually inside? Like, is it like a type of meat? shrimp, pork, um, green onions, crispy garlic on top, and I made my own sauce. >> Your own sauce? Oh my gosh, thank you. It smells so good. And then here's 20. You can keep the chain. >> Thank you so much. The sauce. >> I appreciate that a lot. >> Hope you like it. Give me a thumbs up on Facebook. Okay. >> Of course, we will. Appreciate it. Have a good one. Okay. >> Thank you. A real drive-thru for a home-cooked meal. Oh, it is so hot, though. I can't even hold. I thought I was going to drop it at one point. It smells fire, bro. I love how like diverse this video was. We had Mexican food. food. We had Filipino food. We had dessert. We had Persian food. We tried doing as much as we could today, but this is definitely going to be the last one because I am getting very, very full. All right, we're going to drive somewhere to eat this so we're not just sitting in their driveway. You know what? Let me take off the shades for this one. You guys missed my eyes. Oh, I wish you guys could smell through the screen. Oh, this looks insane. It's going to be so hot. I know it. That's so good. It's like perfect for this time right now cuz I wasn't too hungry, but it feels almost like an appetizer or like a finger food. The sauce has a kick to it. A lot of flavors, the shrimp, the pork, the garlic, everything. I think I'm giving my first A tier of the video. Insanely delicious, but we're comparing it to the other food I had today. I think this goes at an A tier, which is still really, really good. But, okay, now it's time to make our decision on who wins the iPhone 17. And I think I know who's going to win that. All right, guys. All the meals we had today were phenomenal. I had an amazing day. I'm very, very full and it was a success. But now it's time for the winner of this brand new iPhone 17 Pro. The orange one, too, cuz that's the one I want. This goes to the seafood boil. I mean, the food itself was phenomenal. I did a phase rug run. I don't think I've ever ran from food being that good. And on top of it, they said they started their business back up to raise money for their granddaughter's birthday. So, I'm like, this, it's the perfect story. It's the perfect gift. The iPhone just came out today. So, I'm really excited to see their reaction. And you guys know me, I love giving back. I love making people happy. Love making them smile. Especially you guys watching the video out there. Hopefully, my videos bring a smile to your face. So, let's go surprise them with this. All right, guys. We just pulled up. I messaged the lady that we're coming back to give them a little gift. I think they said they're outside. I'm going to park right over here. I actually love recording with the metas. Like, let me know if you guys like this POV. I could bring them out for more videos. Hello. >> Hi. >> How are you guys? Oh my gosh, the seafood boil was absolutely delicious. I'm not going to lie. So, I know you said you guys started this back up for um your granddaughter's birthday coming up. Oh, right there. Oh my gosh. Hi. Say hi. >> Oh no, she doesn't like it. Okay. So, we were doing this video where we were trying Facebook Marketplace foods. >> The person who had the best food, we wanted to give them a little gift. >> Oh, wow. >> So, I don't know if this would go to her cuz she might be a little too young, but it could be for one of you guys. We got you the new iPhone 17. >> Awesome. >> It actually just came out today. >> Oh, wow. >> Yeah. So, um this is for you or for you, however you guys want it. Split it up. >> Thank you so much. Thank you so much. >> Very nice to meet you. Thank you so much. Yeah. It's nice to meet you guys. The food was delicious and you guys are good people. >> Oh my god. Thank you so much. This time I don't want to miss the opportunity. Can we take a >> absolutely. Can you guys subscribe to my channel? >> I already subscribed. >> Let's go. We got the sub. Hey to anyone out there watching that hasn't subscribed. >> Awesome. >> Make sure you subscribe. >> Thank you guys so much. I appreciate it. It's nice to meet you. Nice to meet you. Pleasure. How you doing? >> Hello to my kids. They're following you. Leo and Jorge. >> Leo and Jorge. Of course. Have a good one. A huge shout out to Leo and Jorge. Thank you for watching my videos. I appreciate you guys. All right, guys. Thank you so much for watching today's video. If you enjoyed, please be sure to drop a like. Please subscribe, guys. Get me to 30 million subscribers. If you guys are new to this channel, I've been making videos for over 13 years now. This is my passion. I love what I do. I love spreading positivity. I promise you will leave with a smile on your face every time you watch a video. Thank you for the support from the bottom of my heart. It means a lot. And I hope you all have an amazing rest of your day. Other than that, it's been your boy Faze Rug, and I'm out. Peace.",
    "start_time": 0.16,
    "end_time": 1507.44
}