{
    "video_id": "8IbXBEH-4BU",
    "channel_url": "@rug",
    "transcript": "The other day, I was at one of my all-time favorite arcades growing up, Chuck-E-Cheese. I was having a good old time playing games, shooting hoops, racing cars. But that's when I realized I might be getting a little too old for this place. I wish there was another Chuck-E-Cheese, but for adults. And that's when I stumbled upon Chuck's Arcade, which is the newest version of Chuck-E-Cheese. I have to go check this out. But you know me, I have to turn this into a challenge. I want to see how many tickets I can win in 24 hours. Not just from one arcade, but three arcades. I can't do this alone, though. So, I'll be going head-to-head versus my cousin Clint to see who really is the biggest gamer in my family. And in the end, whoever has the most amount of tickets from all three arcades will get to pick any prize they want from one of the best arcades in the world. Time to teleport to the first arcade. All right, we are here. Where's Clint? Something went wrong in the teleportation. Hold on. Hold on. I'll be right back. Oh my. Oh, Clint. You know what? Close enough. Come on out. I need to do some work on my teleportation device. There's some like errors that go on, but it's still a work in progress. It's in beta mode. >> We're good to go. We're here at the arcade. >> Chuck's arcade. >> And we're about to make this arcade our arcade cuz we got to play till we win, right? >> I miss these jokes. Yes. Without further ado, shall we begin? >> Yeah. I think today between us, it's Mortal Kombat. We're taking each other down >> and we're going to do a fatality on each other. >> All right. >> Okay. Maybe not. All right. So, you know the rules. 60 minutes at each arcade. But we're actually going to start with a challenge that you don't win tickets, but it's going to eat your time. So, you're going to want to finish this challenge as fast as possible to have more time to win tickets. >> So, is that the twist of the video? >> Actually, at the halfway mark at every arcade, we're going to have to do another challenge. And that can give you an advantage or a disadvantage. All right. So, what's our starting challenge? >> Here you guys go. This is the first challenge right here. >> Win prize from a claw machine. Okay. That could take one try or 30 tries. >> Yeah. >> So, Clay, this is what we're going to do. We're going to set timers on our phone. >> It's going down. 3 2 1 go. >> All right. Find the easiest claw machine on Minecraft. This looks really easy. This is like a fat Hello Kitty burger. Like, how is it not going to work? >> First try. I don't even need to like Oh my gosh. Oh my gosh. Oh my gosh. >> I got one. >> There's no way. >> There's no way. >> Yes. >> We're going to go get some tickets. Let's go. >> What the heck? Look at this game. The mega bonus is 1,000 tickets. Come on. Come on. Ah. 20. It's all good. Come on, Steve. All right, Steve, here we go. Let's go win tickets. Okay, it says you could win 250 tickets. I've never seen this arcade game before. I love discovering new ones. Oh, wait. Did you see that? >> Okay, I'm going to learn the timing. But look, I still got 15 tickets. Once I learn the timing, it's over. >> All right, Guardians of the Galaxy, you can win 150. >> Hurry up, Paul. Hurry up. Hurry up, Mantis. Oh, wait. Groot. I have Groot. Just one more. >> This is a scam. It's going to keep telling me one more character to win. I don't want to keep playing the >> Okay, I think I know what to do. >> Well, that wasn't it. 75 tickets. Wait, let's go check on Clay. Did you win? Oh, you finally got one. >> I got Steve. >> How long ago? >> Quit talking to me. >> Okay, sorry. Oh. Oh, okay. A lot of these games are timing and I got timing. Timing timing. I will be disappointed if I don't get one jackpot here. >> What? Wait, somebody won three. Please tell me that I don't know what to play to win tickets. Like, >> no. All right, I got 20 tickets. >> Wo wo wo wo wo. This is going to be my game. >> You can make it. >> See, he believes in me. You can make it. Oh, who was that? >> Who won that? Who won that? >> Wait, you got the bonus? >> No, someone else did before I got there. So, it wasn't him. It wasn't him. Thank god. Did you get the bonus on that? >> Not yet. That's >> this game. Just like that. Time to win some last try. Come on. >> Oh my gosh, it was so close. Okay, let's keep it going. >> I'm going to try to figure this game out again. Give me someone. Give me someone new. Mantis, he already was on there, so that didn't help. Come on. Give me someone new. He's already on there. >> Oh, wait. All I need is I go out of war, but I know it's drag. >> Did you hear Cliff scream again? >> I hear him scream. >> Oh my. If he wins that other game before me, bro. Back to this. Oh, I got a bonus. >> He got the bonus. >> No. Wait, what was the bonus? It was 250. Wait, but it's not counting the tickets. Wait, I don't think it counted the tickets. >> Can we check with an employee? >> Yes, please. >> It had to. >> Excuse me. So, I won the bonus at a basketball game and I don't know if it counted the tickets. Can you check? >> Yeah, tickets added. >> Oh, no. >> No, I shouldn't have. >> Okay. Clint's behind this, isn't he? >> As you can see, Drax is the first one on the train, so I need to time it. So, I'm going to go now. Oh yes. Yes. Give me the power. 17 more minutes. Now I can try to make it again. >> I won the bonus. We won. But there's nothing that counts it. It's counting. That's two jackpots, guys. I should have 500 extra tickets. We have the film. I could spam this. That's three bonuses in a row. I could literally just non-stop play this game, but it's not working. Hey, this is going to get patched, bro. This the easiest game to win. Did I just get scammed? >> Good luck. Come on down. >> Multi-chip bonus. >> Multi- chip. >> Oh my goodness. Oh my god. How many multi- chips? Oh, come on. Give me the be. Give me the be. Give me the beat. Give me the be. I just won 100 though. How many tickets did you get? >> I got the multi-chip bonus and they just dropped so many chips. It was crazy. You want to see? >> Let's go. Let me The employee disappeared when I told him about that ticket thing. Bro, I think he accidentally walked into your teleporter and he's probably like in prehistoric. >> Yeah, he's stuck. He's stuck. He went somewhere else. >> Bro, no, no. We got to find my guy, bro. We got to find him, bro. >> Should we go knock on the door? >> We're going to knock on the door, bro. >> I got to complain, bro. I feel like a Karen right now. I need my tickets. Just for fun. >> It doesn't give you your tickets. He was right. When in doubt, Spider-Man. >> Yes. >> Big ball game. >> This is a thousand for the Mega Blaze. >> Oh, bro. Please. I hit the jackpot four times. I'm not even calling. I just got to them right now. They're going to be >> Oh, they're going to be Yeah, they're getting at it right now. Are you serious? So what I won will go into the card. >> It absolutely will. >> Almost the 30 minute timer. >> Right on my sneeze. >> All right, stop playing. Don't worry. >> No, you quit playing. You play too much. >> You play too many games. >> Play too much. >> All right, 30 minutes is up. That means we have our halfway point challenge. So, whoever wins this challenge actually can choose one of these papers on the table. Some contain an advantage for you and some contain a disadvantage for your opponent. So, this is going to really help the winner of this challenge. >> I like a little game of chance. Let's get to it. so I could get through it. Ooh. Okay, here we go. >> For the next challenge, we're going to go head to head. Ooh, >> little one v one action. First, to finish three tasks. One, make it into the corner hole twice in a row in ski ball. Take a picture in the Marvel Adventure Lab and get a cup of OG Skittles from the Skittles machine and sort them by color. First to finish wins. >> Last two super easy. First one hard. >> No, that's easy for me. >> Okay, Mr. Quarter Pocket, let's rock it then. >> What am I? Dr. Seuss. >> Yeah. Wait, hold on. No, this is actually Dr. Seuss. The Dr. Seuss of YouTube. Okay, Clint, are you ready? >> I think I'm ready. >> In 3 2 1 go. >> Ski ball. >> Okay, we got to sort these as fast as possible. Come on. Come on. [Music] >> Okay, stop. That's too much. [Music] What did he do? Did he hit the jackpot? Wait, this might take a long time. This is going to be satisfying once I'm done. Come on. >> I just got 634 tickets. >> Guess I'll try my luck here. >> Start making the green pile while we're at it. Guys, I'm in the zone right now. Okay, yellow's done. As long as I get this, taking the picture should be easy. And then I can spend more time on the ski ball. Here we go. I can't even play right now. I got to go somewhere else for the meantime. >> I need this challenge, guys. I feel like me and Clint are closing tickets, but I saw him hit a few jackpots in front of my eyes. >> Do you think I could eat one of those, too? >> Of course. Yeah, go for it. >> Wait, you actually let me eat? >> Listen, I'm a changed man. Yes, you can eat. >> Okay, while I'm waiting for the machine to give me all my tickets that I can't even keep playing, I'm getting the cup of Skittles. I'm going to taste the rainbow. >> Thank you. Goodbye. Once I separate the purple, the red will be separated on its own. I hope to still see Clint at ski ball and done. >> Wait, Clint, you already made the ski ball. >> I I won so many tickets, it won't let me go. >> Marble Labs, we need to take a picture. Are you guys about to do this one? >> Oh, okay. Okay, I'll be back. >> Like a camera. I got to stay focused. Oh, man. Oh, man. one. Are >> you guys just about to do it right now? No, you're good. You're good. Thank you so much. Thank you so much, guys. >> Okay. Luckily, he's doing fan shout outs. I heard him say hi to a fan and all right. >> Hello. >> Hi. >> I am Jarvis. >> Hi, Jarvis. Clint doesn't know that I hit a picture at the same time. >> 3 2 1 action. >> Oh, hey Clint. Can we take a photo at the same time? Does it count? >> Did you hit the ski ball? >> Not yet. >> I'm getting to right after this. >> You got this. >> Thumbnail. Well done. Okay, that was excellent teamwork. Okay, each comic takes about a minute to print, but while it's printing, let's go play. No, don't get it. Please. Come on. I think you're done. >> Oh, little does he know that I got so many tickets from this game. So, whatever. >> Woo! That's tough. Hold on. I I just want to let you know, too. I did that twice. I was just trolling you and I got the corner twice in a row again. >> Twice in a row. Oh, >> yes. Now, I get to pick one of those papers. I wonder how close we are in tickets. I feel like we are. >> Yeah. Let's check it out at the end. >> At the end after this arcade, we'll see how many tickets we have before we move on to the next one. But for now, let me get my little advantage. All right, let's see which paper I want to choose. We'll go 1 2 3 for Bradley Beal. The be reveal freeze. Your opponent cannot play a game for 5 minutes. Keep in mind, guys, we have an additional 30 minutes at this arcade. This is going to be huge. Hold on. 30 minutes. Freeze. Okay, let's go. >> Brian, can I at least chill a little bit? >> Yeah, you can chill. You can chill. Just you can't play a game. Let's take advantage of this 5 minutes. Guys, >> the thing is I probably won so many tickets in ski ball. Do your thing, Brian. Go play an extra 5 minutes. What's this? Guardians of the Galaxy. What do I do? Oh, the ball. Oh, you fill up each character. That's kind of hard. We just have to fill in the blanks. But this might take too long. If I get 1,000, I win. Come on. >> Oh, so close. No, I keep getting sad. 5 4 3 2 1. And in case you didn't know, I do know how to count. That proved it, bro. How do you get the bonus chips? It almost seems impossible. Come on. The five minutes are up. What the heck? That was the fastest 5 minutes ever. I'm off this game. Good. Get out of here. Get out of here. Did they fix this? Oh, wait. We got my tickets for it, right? We got my tickets. Okay. Oh, he just got it. Did you see that? It went off the glass. >> One more time here and I'll go and I'll come back. I like this game. I lied. One more after that. No way. Played three jackpots on this game already. >> Three more. Not one. I can't do it in front of you, bro. You make me nervous. Did you win the Plinko? >> No, not yet. Wait, wait, wait. >> How much time is left? Nope. That's me. Watch this. This one's for you, baby. I love you. >> Oh, I didn't. Okay, you go ahead and try it. >> I want to see the jackpot with my own eyes. >> Do you want to sit here and watch me for your life? >> I do. Yeah. Yeah. I just won the jackpot three times in a row over there. I'm feeling nice. >> I feel like we're close. Actually, no. I'm beating you for sure. No. Low balance. >> I'll give you >> Okay, I'll hit the jackpot for you. Come on. No. Oh my gosh. Play. Oh, I almost hit the bonus for you. All right. All my credits are done. I'm confident in stopping right now. I'm good. Not going to look. Blind box open. >> Yes. Okay, you're done. That's it. I >> I held on to that. >> Let's go. Okay, keep in mind we still got two more arcades to go to after this, and the games are going to be crazier and crazier. But now, let's go see how many tickets we have in total before we move on to the next arcade. >> All right, let's go. >> Let's go. Oh my gosh, this scary. All right, Clint, I want you to go first. >> I like that youards. Age before beauty, right? >> I mean, you're still beautiful. Oh, damn. >> I think we each got three cards cuz we both ran out of two and got our last minute crunch in there. >> Yep. So, we got three cards to see how many tickets we got. I'm scared cuz I know you hit a lot of jackpots. >> All right, my first one. >> Tickets added. >> 1159. >> 1159 tickets added. >> Oh, 110. Okay, that's good. tickets at >> 1787. Wait, that's a lot. >> My total is 3056. >> Dang. From the first arcade. That's pretty impressive. >> Oh, I hope I'm still in it. All right, let's see what you got. >> 3056. We got >> tickets added. >> 9.89 >> tickets added. >> 1126. I like this. Come on. Give me over a,000 on this. >> Tickets added. >> 426. 2,541. But hey, thankfully we're going to two more arcades. It is not over, Clint. All right. Well, it's time for the next arcade, and it's still anybody's game. >> All right. Uh, this time when you teleport, can you please like make sure to get it right? Like, check your destination. >> Oh my god, bro. >> Bro, on star. >> Hey, Dad. >> Real quick, I was going to say, did you fix the teleporter that you built for me yet or no? >> No, I don't know. >> Ready? 3 2 1. But before we teleport, here's a word from today's sponsor. Football is back and there's no better time to place your piss. With Underdog, just pick higher or lower on two or more player stats for a shot to win real money. Underdog just dropped their ladders game for the NFL. With ladders, you pick three to five players who you think have a big game in them. Winning is straightforward. The bigger their night, the bigger your payout. So, your payout will jump up for each level hit by every player. Pick who goes off correctly, and you could take home up to 1,000 times your money in one night. one night. Here's my latest ladders entry. And you can try out ladders today by signing up using code rug and play just $5 to get $50 in bonus fun. Now, back to the arcade. >> Oh my gosh. >> Hey, he's here. >> I just pulled a Bad Bunny. I don't know if he's no good. And Clint, we're actually at your spot, Boomers, because you're a Boomer. All right, guys. Well, we are here at Boomers for the next arcade. And let me just tell you, the arcades we're going to are getting better and better with more Jackpot games. And Boomers actually has such an underrated arcade. I've never been to this one. This arcade has so many more jackpot games. Chuck's Arcade was amazing. It was nostalgic. It had cool new games we haven't seen before, but it was pretty small. This one, there's a wide selection of games. So, we know the drill. 60 minutes. But we are going to start with a task that can eat time up. So, what is our task to start? Here we go, guys. I figured make a hole in one. >> It only makes sense when you're out boomers to play some mini golf. Like this is the mini golf hot spot. >> So our 30 minute timer will start when we make our first attempt for the hole-in-one. And depending on how long it takes to make it, that's taking away from your time to stack up those tickets. >> Dang. So I feel like I have a disadvantage here because it's called mini golf and you're shorter. >> Clint, keep talking. Keep talking. I just absorbed that and I turned that into motivation. All right, guys. So, we're going to set the 30 minutes on the clock. Remember, once these 30 minutes are done, we do the halfway challenge. But how much of this time is going to be used for the arcade? It all depends on your golf skills in 3 2 1 go. Ooh, Malibu looks way easier. First try. This dude is gapping away and he could just be hitting a hole in one like that. Oh my god. Come back. Come back. >> Oh, we take turns. >> No. That is lit. It went off the track, fam. Oh my gosh. Oh my gosh. Oh my gosh. You know what? I'm going to a different hole. I need a challenge. Oh. >> Oh, what? >> Guess we got that one. >> Okay, get out of here. Get out of here. >> I just wanted a bit of a challenge, you know. Now we win some tickets. I'm going for jackpots only. Let's see if the basketball game here is a little bit different or if the timing is a bit different than Chuck. [Music] Time your shot. >> Come on. >> Oh, hold on. This doesn't seem right. [Music] >> Come on. No. Story of my life. Always this close. I'll try Brian. It's different. It's okay. We still get tickets when you miss. It goes higher. I realize like this one shoots higher. Okay, now this is a hack I actually got off Tik Tok. You see the jackpot right there? Once it hits the O with that yellow thing in the corner, you drop it. So, right, it's different. Oh, I might be cooked, brother. Wait, did that just drop again? Wait, add another ball. Bonus ball. Okay, here we go. Oh, I got it straight into the five. But that's not what we're looking for here. >> Brian is getting way ahead. I've actually already wasted 10 minutes. >> Okay, we're waiting for the jackpot to come around. Here we go. >> What the We move on. [Music] Oh, finally. Let's go. That means I have about 14 minutes to win tickets. I don't know if my extra 2,000 over Brian would hold up here, but we're going to try. >> All right. This is all about timing. >> One all play. You're in, >> dude. Yes. Finally, but we have about 13 minutes. >> 1,000. Yes. Right in front of my opponent. I didn't want to win anything until then. Let's go. >> I was in such a good lead and I just screwed myself over. >> You got to play smart. You got to move and move right. [Applause] >> You know what? Let me play stacker for fun. Guys, on the go at Sacker. >> Where's the Okay, I'm not getting consolation. >> What's the minor prize? Oh no, it's those little balls. Now we're going for a major prize. Oh no. 125. Come on. Mystery value. What's my mystery value? 94. Okay. 94. That's random. Another mystery. >> Okay. I've been seeing this Monopoly game everywhere. It looks cool. So, let's give it a try. Oh, that's sick. I feel like you could get like 1,000 tickets from it. It just looks like one of those games. Come on, let's go. Oh, no. That's it. Oh. Oh, I got the chance. Oh, six tickets. Is this actually six? Chance. Come on. Chance. Chance. Come on. Chance. Go. That's good, right? Oh, 52 tickets to the bonus. Let's get out of here, >> brother. I am Mr. Mystery. I'm going to go somewhere else for now. I'll come back to that later. How did I shoot? Damn it. Wow. >> So, there used to be a life hack for this where you just drop it. They definitely patched it. They cut this shorter. All right, let's do the main road. Yeah, >> I'm him. 20 seconds till the halfway challenge. Buzzer beater. Darn it. Okay. How many jackpots did you hit? I hit Jack squat on the jackpot, brother. >> He is so cooked. I'm telling you, I'm feeling it right now. Chuck's Arcade was a warm-up for me. But you never know because whoever wins this challenge gets an advantage. All right, Clint. I'm going to keep it above. I think I'm beating you now overall with the tickets because I've hit two jackpots. I've been going crazy and you were only up by 500 leading chunks. >> Dang. You might need to win this challenge. >> You're right. You're right. You know what? You've been booming in boomers. You know, I'm proud of you. You're blossoming here, brother. But you know what? After this halftime showdown, I'm going to bring myself back up. >> Okay, let's see what it is. Here's that next challenge for you guys. >> You open it up. You open it up. Race >> race to the finish on the go-kart track. Okay. >> Oh my gosh. >> I'm glad that we're going to actually be using the go-karts cuz I really was feeling for that. And remember, if you win, you pick one of these. >> Oo, it. >> Rules are simple. First to cross the finish line three times wins. >> All right, I like that. >> Let's do it. >> Now, I did whoop you in Mario Kart when we were kids, right? >> But IRL, I don't know. My name is Faze Rug. I was a beast at Mario Kart when I was younger, but we'll see if it translates to real life. I got this. >> What's going on? It's Clint here. He's playing Mario Kart. Well, I'm playing Mario Fart cuz I'm about to gas this up. Let's go. >> Okay, Clint. So, this right here is the line. Are you ready? >> Are you ready? >> I'm ready. >> Let's go. >> In 3 2 1 go. Oh no. Oh my gosh. It's tripping me. I need to get ahead. Sorry. Sorry, sir. Come on. I suck at drifting. Yes. >> Yes. Yes. Yes. Yes. CL, you suck. What happened? >> You hit me with the green shell. >> I did. I know. You actually spun out. That's crazy. >> I mean, you won. >> Well, I had to cross the finish line. I might let you go. Go ahead. All right, guys. I'm going to let Clint get a little head start here, but I just need one lap right now. Oh, he's catching up. And hold on. I didn't cross the finish line. Oh, here he comes. Yes. Oh, damn it. I was in the lead and I spun out of control. I call it that Brian got one of the red shells and he tossed it at me. >> Let's go, baby. >> Hey, good stuff, though. Good stuff. >> Yeah, that was fun. That was fun. >> All right. Well, let's get back to tickets. >> Let's go see my little advantage or disadvantage to him. And we're back. >> I feel like you should choose that one. >> Oh, no. It says chance. Flip a coin. If heads gain 500 tickets, but if tails lose 500 tickets. >> Damn, dude. Ryan, you're a risk taker. I would actually be disappointed if you didn't take it. >> Does anyone have a coin? Cuz I don't carry coins. >> Uh, yeah. I actually have a coin first. And this right here is for you. >> Of course, hunk. Okay. Heads for 500 tickets. Tails. And we take 500 tickets off my total. Oh, what is that? My luck just keeps getting better and better. R me my 500 tickets, baby. I'm ready to play, dude. Okay, well, we got 30 minutes left. Let's set it on our phone. Once we check our tickets at the end of this, we'll add 500 to mine. Let's go. We just hit another jackpot. Just like that. 30 minutes on the clock. Start. Wait, can I get a hug? Yeah. Yeah. [Music] Starts now. Let's go. Go ahead. You I'll give you that head start. Here's the thing. I'm going to play the same way I played. It's chaotic and it's the only way I'm going to win here. >> You're getting confident, man. Dude, I mean, I already hit two jackpots. I just gained another 500 tickets without playing a game. What the world? I feel bad for him. I want him to win a jackpot. All right, now we can at least take our time. >> Let the chaos ensue. >> I need fast games. I need games that get me wins. >> Hi, how you guys doing? Let's get 150. Why don't >> Oh, that's good. Oh, that's good. >> What? Dude, I don't know about this one. I don't like it. >> You know what? I'm going to get an inside secret on what the best games are to play. He might know some insider secrets. What is the best game to play to win tickets? You can do any of these ticket games. Here's the ticket range. We can pick them up. Monster drop in the back of the arcade. Oo, monster drop. That was the one that was working good earlier. Hell yeah. Thank you, man. All right, you spun that wheel so many times to work out my left hand. >> That's 100. It doesn't look like 100, but they gave it to me. Let's go. They know they want me to win, bro. You know what? Run me another thousand from this one, huh? You see how much it skipped? Oh, oh, oh. That's what I needed. What happens? Oh, hey. Music went down. But now, you know, you get a Clint dance with that. I did it. I got one jackpot. Look at that going up. Look at that going up. I'll come back to this later, but I went over 1,000 tickets there. So, we doing something good. All right. This isn't four tickets. This is purely to show you guys how wet my jumper is. >> They call me young Justin Herbert, by the way. the final round. All right, to the final spot. Okay, I'm going to play stacker again cuz why not? Woo! Woo! Woo! We're heading up. Woo! It's getting hot now. Woohoo! Woo! Woo! Woo! This is the last one. Oh no! >> Darn it. Time's up. Dang, that would have been a good buzzer beater. All right, let's see how many tickets we got from Boomers and we add that to our Chuck's Arcade tickets. >> Let's do it. >> Let's go. Come on. All right, Clay, it's time. >> I think you should go first here cuz I went first last time. Plus, I'm nervous. >> Okay, view card balance. First card. 2,938. That's my first card. I don't even know if I used this though. But 2,938. 1,137. So, that's 4,075 tickets. But wait, coin flip. 4,575 tickets from boomers. I literally doubled what I got from Chunks. >> Don't forget that I was about 10 minutes behind you on mini golf. >> Let's see. Hey, it's still anyone's game. First card. >> Okay, but that's not the good card cuz I know you hit the jackpot on something crazy. 3428. >> Dang, that's close. Wait, that's really good. >> So, I got 3661 in this round. Oh my gosh. Wait, that's actually more than I thought. I wasn't that far ahead for having more time. >> You know what? At this point, I feel like we're very close to each other. Our total scores are probably like 500 apart. Your 500 saved you. >> Wait, hold on. Now, let's see what our totals are, including Chuck's Arcade, and that's the official score at this point of the video. So, I have a total of 7,116 tickets. >> And I have 6,717. >> Woo! It's close. Sing. >> We're about 400 tickets apart, but we still have one more arcade. And you know it's anyone's game with these rules. >> Oh, let's go get it on. >> Play it. Last arcade. May the best arcade player win. >> Wait, we should do a teleport. >> Handshake. Yeah. >> Ready? >> Wow. The DAP of teleportation works. >> I love it. Yo, Papa Rug has been advancing his technology >> and he took us to round one, which has a bowling alley and one of the biggest arcades in the world. I hear they have claw machines from Japan like filled. Like I'm ready to get back in our like Japan phase, man. >> Same. Same. So, this one's going to be pretty interesting. We saved the best for last. I personally have never been to a round one in my life, but I heard they're so popular. So, we're going to experience this for the first time together, >> dude. So, round three is at round one. >> It is exactly. We're pretty close. So, 400 ticket difference. So, this is going to go down to the wire. Let's see what our task is to start the challenge. >> All right. Here's your task. I knew it. >> I knew it was going to have something to do with bowling. Bowl until you get a strike. Okay. What are you better at? Mini golf or bowling? >> I'd say I'm better at bowling hopefully. So, we'll find out. >> All right. Well, the timer is going to start once we bowl. Let's go. All right. You already know the 30 minutes are going to start once we start bowling. And this is so important. We got our names. We got Clinty and we got Ruggie. If you get a strike first try, you're going to have a really big advantage. Clint, are you ready? >> I'm ready. Ready. Okay, let's get the 30 minutes on the clock in 3 2 1 go. No, that's not a strike. That's not Oh no. Oh no. Oh no. Oh no. >> Yes. >> Not a strike. Damn it. >> This the one. >> No. This lane longer than usual. >> I'm going to try the middle finger method. You put your middle finger in the thumb hole. >> Yes. >> Does not work. Don't try this. Are we serious? No. Why are you going there? Oh my gosh. Clint got a gutter. And I got one pin. World's worst bowlers. Okay, here we go. Oh my gosh, Clint. It's always so close. That's the one. Yes. Yes. Let's go. We're taking off the shoes. We are at an advantage here. Clay is going to be here for a minute. Wait, you could use a little dinosaur helper and get out of here. Shushu. I'm serious. You could, guys. Okay, I'm at like a 400 ticket lead right now. I don't even want to get caught. I just want to go as crazy as possible. Oh my gosh. >> I'll let that count. Okay, perfect. Yes, it was a spare, but I'll let it count. Spare me a good time. Thank you, Brian. >> Okay, take it. I've never played this game. Oh, that was heavy. Give me some luck. First time at round one. Oh my gosh. Oh my gosh. Did I just get 750? Oh no, I have to spin it now. I thought I got 750. Come on. Come on. 750. What? No. Okay, we got 150. We're out. I'm going to come back here. I need to get it in yellow. >> There's so many. Oh my gosh. No. The bonus is 300 here. I can't get away from this basketball one. Okay, come on. Please be easy. Oh, see how different that is? I got 100. At least I got 100. Yes. It's not even the rim. It's about how hard they launch the ball, too. Wait, it doesn't even go towards the rim. It goes in front of it. Look at the side angle. Does it even go towards? >> It almost looks impossible. I don't trust those games. Oops. How many tickets you got? Four tickets. 5 minutes left until a 30 minute timer. 5 minutes. I've never seen jumbo jumping jackpot. 500 tickets. Say less. All right, I'm still got it, guys. Wait, was I close? 42 tickets. You'll go so fast. Oh my gosh. I need to be healthier. Oh my gosh. Look what it is. Look what it is. One mega bonus winner. >> I just won a thousand like that. Let's go. Let's go. Don't tell Brian. >> Okay. Ready. That's the one. That's the one. Yes. Yes. 1480. Buzzer beater cuz the 30 minutes are up. Guess who just won the jackpot last second. >> Damn. You got a jackpot? >> I did. How much was it? >> 1,500. >> Damn, >> it was It was big. Did you get a jackpot yet? >> I don't remember. Except that one time I hit a jackpot. >> Nah, I got the jackpot, too, baby. >> Okay. Okay, this is looking close then, but you already know the deal. Mid round challenge. >> I'm ready. >> Let's do it. All right, we got the table of advantages and disadvantages in front of us. But let's see what the challenge is. Hopefully, no more bowling challenges. >> And hopefully I can actually pick one this time. >> All right, here's the next challenge for you guys. Let's open it together. A has cousins. See? Set. Boom. Play the boxing game. Highest score wins. Two tries each. >> Okay. >> Okay. The classic boxing machine. You want to go first or should I? >> I think you should go first. >> I'll set the tone. So, we each get two tries. Highest score from that. That's yours. At least 800. 798. Okay. At least I get one more. Okay. Clay, you go next. All right. I like that. We'll take turns. Hey, Clint's actually strong, so I'm scared for this one. >> But my aim is bad. I feel like I'm going to go here. >> Oh, okay. >> That's horrible. That's horrible. >> This is good for me. I heard with this one, it's not even about power. It's about accuracy. I need to get at least 800. >> That's 800. Yes. Okay. Okay. I'm not going to lie, my wrist hurts a little bit after that one, but 836 is my score. All right, Clay. This is your last chance. You need higher than 836 to win this. >> What? >> There's no way. >> Yes. >> How did No. Okay, I got to let you know something. >> What? >> It's cuz you're young. So much life ahead of you. I wanted you to experience wins, you know. >> Am I young, though? Cuz everyone thinks I'm not young anymore. >> Well, you did win, so brother. >> Oh my gosh. Hey, but you never know. It's still anybody's game. >> This might not deter me. So, let's keep going. >> Let's see what paper I'm going to pick. All right, we are back at the table. Clint, just to make this a little bit more thrilling for you, how about you choose a paper for me? >> I'm not thrilled to be honest. Let's go here. >> That's my fate. I feel it. >> If it's something like the coin flip at the last place, I can lose tickets. So, >> that's what I want. >> Locked up. Your opponent must wear handcuffs for the rest of the round. >> What in the Acon? I'm locked up. >> Hey, let's go back like this or front, >> brother. There's no way. >> Okay. Okay. Okay. I think I'm going to do it backwards. >> Okay, >> there you go. >> I don't want to hurt you. >> No, >> I'm cuffed. >> Let's go. Okay, guys. The final push. The last 30 minutes in 3 2 1 go. It all comes down to this, guys. No, he was going for my game. Well, luckily there's two of them head. Stop pausing this. Wait, what the heck? There's a mole. Wait, you don't even time it. Oh, >> you have no time for time, brother. Let me show you how to win this game. Okay. I was not >> Was it the monster? >> Danced around on it. >> No. Okay, here we go. First try. That's all I need. Wait, this one is mad delay. Oh my gosh. At least add the bonus balls. This is the best I can do like this. Okay, get me out of here. Get it. >> How many do I get? Press the select button to collect your tickets. >> How many? Oh, it's 101. Okay, that's weird. But 101. I saw so many games I wanted to try. This arcade literally has it all. I saw earlier a soccer game. I'm going to use that. I clearly have feet. Bro, this sucks. Oh, I got four tickets. >> I haven't been lucky with Plinko, so let's try this. Oh, I almost got the bonus. I feel like the handcuffs aren't that big of a disadvantage to play. You can play games like this normally. Oh, 500. Yes. You just keep going. See, look how easy it was to win 500 from that game. Now, we're going to go to a game that requires a lot of skill, timing, focus, and you get 500. So, I'd rather go with the luck, but we'll see how I do. Dude, like that's crazy. It looked like it was good. It literally looked like it was going in that time. After this one goes, I'm going to go run there and throw two balls down and come back. And this is my only way of waiting like this. Please, I'm not getting any tickets from this. >> I have time for one more game. I'm going to try this tight rope. You have 400 for the bonus. Wait, so what do I do? I didn't see that. This is hard. It is kind of hard. That was terrible. It's over. Let's go find Clint. I think I won this. I think I have this in the bag. Go. Clint, we're done. >> Guys, time is up. Did you hit any jackpots? >> No. I spent so much time on this game getting nothing out of it. >> I hit another jackpot. >> Okay. I'm sick to my stomach. I really wanted to win this, but it's all good. >> Hey, we'll see. You never know. >> Let's check it out. >> You never know. All right, we are here at the victory zone and it's time to see who won the challenge. We've played an unhealthy amount of arcade games today. >> Wait, but before we do that, is it also time to release me? >> I'm so sorry. One, two. All right. How was that? >> Because I was kind of like held down, I tried to restrategize and I found a game that you can win 8,000 tickets if you did it once. >> Wait, you didn't hit the jackpot once? No, >> I did not hit a jackpot once. >> I honestly respect you for going for that. >> I had to try it. Dude, >> let's remind everyone of our current tickets. I have 7,116. >> And I have 6717. >> 67. All right. All right. I'll let you check your balance right here. >> So, we're going to add this to 6717. >> Oh, 2167. There's still more 67s. >> All right. I got 8884 is my total. To make the math easy, if I have more than 2,167 tickets on this car, I officially win. And I'm very confident in that one. 3,085. I have officially won the entire challenge plan. It was really, really fun challenging you. >> That was a lot of fun. >> It was still pretty close to the end. So, >> honestly, it was that really, really was close. We maybe had like a 2,000 ticket difference, like 1,500. >> 10,2001 was my total. >> Not bad. Hey, I'm excited to go into the store and pick a prize. >> I'm toasty. I'm going to join you. >> Can you please join me? >> Let's go. >> I need your advice. Oh. Oh my god. So many kawaii things in here. You already know where I'm looking at. >> Oh, like inside the glass. >> Slushy machine. I want that so bad. They have a freaking cotton candy machine. >> Cotton candy. >> A Naruto rice cooker. Oh, wait, >> wait, wait, wait, wait. No, no. >> A Naruto rice cooker. You should always think about giving to the people you love the most. That's what it's all about. I love that idea. >> I was already thinking about that. >> Thank you. >> But can we come to an agreement? How about we both come together and pick a prize from here and we give it to someone out there. >> That's like way better than what I was thinking. I was just going to get a rice cooker for me, but you know what? I'd rather see it go to someone else. >> All right. >> What did we end up choosing? >> I'm so excited for whatever fan is going to get the most awesome prize. The Naruto rice cooker. Dude, I >> I couldn't pass up on this. >> I'm jelly roll for this. This is awesome. >> I like that. I honestly didn't know there was a Naruto themed rice cooker. So, let's go find someone and make their day. >> Yes. >> Who do you think? >> An anime fan. We need to find someone. >> Yeah. We need like a Naruto fan. >> Do you guys like anime? >> Yeah. >> You guys like rice? >> I love rice. Asian. >> Do you want a Naruto rice cooker? >> Heck yeah. >> We just won it from the shop, so we ought to give it to someone. >> Amazing. It's nice to meet you. >> I'm going to make sushi rice. >> Oh, guys, don't worry. We're doing that tonight. >> Hey, have a great day. Okay, >> thank you. Let's go. >> Hey, no better person. We could have gave that one, too. Well, guys, time to do my outro while walking backwards. Hope you guys enjoyed today's video. If you did, please be sure to drop a like. Clint, great game. It's always fun doing a challenge with you. Please make sure you guys drop a like, hit that subscribe button, get me to 30 million subscribers. And other than that, it has been your boy Base Rug and Clint, and we are out. Peace.",
    "start_time": 0.0,
    "end_time": 2599.359
}