{
    "video_id": "p0frgTBXkw0",
    "channel_url": "@rug",
    "transcript": "Thrift stores are a gold mine. Shoppers have found some of the craziest items that resell for big money. People have even made careers out of shopping at thrift stores and flipping for profit. So, today I'm testing my luck because I'll be going to five thrift stores to see what I can find. But, of course, it wouldn't be a Faze Rug video without a challenge. So, I'll be playing thrift bingo. This is how it's going to work. My goal is to find items on my bingo card in order to complete one full line. And if I can do that, I win. But hiding behind each spot can either be an advantage, disadvantage, or nothing. If I can't complete bingo by the end of the five thrift stores, it's over. Oh, and one more thing. There's also a game over card that will immediately end the game, and I have no idea where it is. If I fail, I'll have to donate one of my most prized possessions. Let's get to shopping. All right, so we are here at our first thrift store, CSU Thrift, and I have five minutes at every single thrift store I'm in. So, I'm on a time crunch here, but I got to get five in a row in order to win the entire challenge. So, here is my bingo card. As you can see, some of the options. We got an item with a tag from a different store, a full outfit under $25, a Funko Pop, many, many different options. But, as you can see, there's a free space right in the middle, which we're going to start with. And of course, there's something behind it. I should have known. Nothing in life is free. That is true. Minus 2 minutes. Okay, cool. So, we're starting off with a disadvantage. I should have guessed that that would happen. A free space. Nothing in life is free. Okay, so I guess in this thrift store, we only have 3 minutes to start off. So, not the best start, but I'm going to get at least three spaces knocked off. We got this. All right, 3 minutes on the clock. I've never been to this thrift store, so I don't know my way around, but hopefully I knock out at least three of these spaces. Okay. In three, two, one, go. Oh my gosh, this is actually sick. I'mma leave this here and take a look. Hold on. What is that? Sports memorabilia. There's a lot of sports items right here. Oh, wait. Please don't touch. Not for sale. They got a LT bobblehead right there. They got my boy, my goat Braun. Wait, so these aren't for sale? So that's technically not sports memorabilia, unless there's more. We got to cook here. We got to cook. And I can't ask the employee for help cuz that's like cheating. Classic Coca-Cola, bro. I want to come here just to shop, not for the challenge, dude. Wait, I'm not finding any though. Is it a minute left? Stop. Listen, an item over $100. There's got to be an item worth. Actually, I don't know cuz thrift stores are cheap. I consider this sports memorabilia right here. Dylan sees bobblehead. Go Padres's. Wait, I have to peel this off. Please don't be anything under it. Oh, we're good. We're good. We're good. Okay, there's a souvenir, right? A pin. That's like all Padres's though. Oh, what is this? Ain't no way I just got one item. Oh my gosh. This store has so much to offer. Look at this, bro. The hood of the car. Kellogg's cornflakes. I just got one item, guys, because all these aren't for sale. I feel like I could have found a lot from this shelf. Okay. Question. Would you consider this sports memorabilia? >> Definitely. >> You sure? >> Yeah. >> Okay. Okay. Definitely counts. I will say this is probably one of the coolest thrift stores I've ever seen. >> I want to come back here like off camera and just shop. >> Yeah, definitely. That's so fire. It's okay, guys. We got four more thrift stores to go to after this and hopefully I don't get minus 2 minutes next time cuz that was bad. I'm going to study the board before the next one. I'm going to memorize every single square. All right, guys. So, we got my one item for my bingo card, but I did want to see what I did miss. So, I noticed this NASCAR jacket. Look at this. M&M's, Pedigree, Pontiac. This is so fire. And I guarantee you it's more than 100 bucks. Yep. 230 bucks. Okay, it's all good. Now I know going into the next one if I see jackets like this I'm going to go for them. And he said there was definitely an animal section. So let's go check that out. I feel like I just fumbled the bag here. Like I didn't even go through the clothes. I didn't go through anything. And look, I didn't even notice this. Yeah, guys. Look at that. More shirts with animals on them. I'm just doing this for motivation. Like I'm seeing what I missed out on to motivate me. I think I'm ready for the next spot. Hopefully I at least have 5 minutes there. Here's an update of my bingo board. Look, if I had saw that jacket right there, I would have had two in a row. I would have just needed these three. I could have put my full focus on these three. But now, let's just move on to the next and hope I do better. That's the only thing I can do. We are at our next thrift store out of the closet. And this time, I got 5 minutes. I am so confident. I'm so motivated. I literally studied this entire board. Watch. Quiz me. Go ahead. >> What's on the top left? >> An item with a tag from a different store. >> I'm surprised you got that. >> I I'm telling you, I studied. Okay, give me one more. >> Bottom right. bottom right. Is that this one? Yeah, you got me. >> An item older than me. That's got to be 46. So 46 years. That's going to be tough to find. But 5 minutes on the clock. Let's do it. I saw pictures of this thrift store and it looked like they had so many items. Let's hope I knock out at least three or four. 5 minutes on the clock starts now. Oh my gosh. Let's go. Okay. Okay. Okay. What's going on here? These all look older than me, right? Okay. So, a lot of clothing. Try to keep our eyes peeled for a clothing piece with an animal on it. I'm just going to look through the clothing. This time I'm not going to sell the bag. This Minnie Mouse. Is this like a Minnie Mouse dress? Like a picnic tablecloth, right? Okay. Uh books, maybe. Oh my gosh. A raggedy hand doll. No, no, no, no. Okay, that's definitely the creepy doll, guys. Fun fact, the real Annabelle doll that inspired the Conjuring movies was actually this type of doll. What if this is the actual one? Like I don't think it's possible, but Oh, I don't want to touch it, but I have to for my bingo card. >> You have to >> have gloves. No, no. I'm I'm not even trolling. You can probably find gloves. >> I actually don't like touching stuff like this. I don't know if it's cursed. You know what? For the challenge, >> no. No, no, no. >> What? What? >> There's no way. If you're scared of it. >> Okay, time is ticking. I'm >> No way. Stop, dude. Stop. This is >> Please be good. This has No, this has good voodoo. This is a good doll. Okay, I'm just going to manifest that. This is the good doll. Oh my god, it doesn't have a foot. Okay, that's creepier. Okay, let's peel this off. Come on. Don't be anything behind it. An advantage. Nothing. One down from the bottom row. Let's keep going. >> You got to lock in, bro. >> Okay, I know. I know. I know. I know. Okay, what's this? There has to be something. There's some old board games. Oh, mugs. Wait, it says a funny mug. I don't like touching this, bro. Funny mug. A funny mug. Is there anything that's funny? Dynamite, Dad. Oh, there we go. Stay positive just like this doll. It's positive vibes here. I think this is a funny mug. Hey, please be an advantage behind here. Please something. Okay, nothing. But it's okay. That's two X's right there. We're looking good. Wait, 101 Dalmatians. Excuse me. Is this VHS? >> Yes, it is. >> Oh my gosh. There's no way we sniped that. A vintage Disney VHS is on our board. Do you think I could get that? >> Yes. >> Thank you so much. I appreciate it. Fun fact, I used to have a fear of Dalmatians. Like I used to be very scared. I think I had a bad experience when I was a kid. Like two Dalmatians chased me down. But yeah, this is crazy. A Walt Disney classic. Oh, I just realized it's 200 bucks. So, I could do one of two things. I could either mark this as an item worth over a hundred bucks or vintage Disney VHS. But to be honest, the Disney VHS is going to be harder to find than that. So, I'm going to go with this. You're done. Check out and head to the next store. I think my time was going to run out anyways. Oh, 5 seconds left. Hey, perfect timing. I'm cool with that. Yes, I'm actually happy about that. Three. Two of them are pretty cool items. I'm so scared of this one. Okay, this is great. We We did a good job. Wait, it sucks that I only have 5 minutes in each spot cuz I feel like I'm missing out on so many cool items, even if they're not on the bingo card. Just cool items. Like, look, I didn't even realize this. Oh, some Star Wars stuff. Feel like there's got to be something here. An item with a name on it. Oh, you know what? This row is looking good. All right, I'm ready to check out. >> All right, I got you. >> Awesome. >> The 101 Dalmatian. >> Yep. What do you think about this one? >> That away from me at all. >> Oh my gosh. Wait, why did I grab this? I feel like there had to have been another creepy doll. >> This of all things. Look, she doesn't have a a foot. >> I'll be praying for you. >> Oh, you touched it. >> Oh, I guess I'll be myself, too. >> All right, we did good though, guys. We did good. All right, guys. Here is an update on my bingo board. Two in this row and two in this row. So, I'm looking good here. But don't forget, there is a game over slot. It's like mind sweeper. There's one of these that can end the entire game. And if I don't have five in a row, I lose. I actually forgot about that until right now. But then I don't know where it's at anyway, so it wouldn't change how I play. But real quick before we head to the next store, let's see if I missed anything that was out in plain sight. Item with the letter R on it. Is this for sale? Phetic alphabet. This could have been something for sure. There's one that's actually cool. An item from your childhood. So, something that I seen in my childhood probably could have been a book. Video games. I didn't even know. Vintage video games. One of them as well. If I see Rush Hour here, that's my childhood for sure. Me and my parents would watch that movie all the time. We were right in front of here. But then the mugs caught my eye. This most definitely could have been the item from my childhood. I mean, I play Twister as a kid all the time. Too late now, though. But that's something to keep in mind for the next one. But what if that slot right there is game over? There's a lot of risk in this video, but I'm willing to take it. All right, guys. We made it to thrift store number three, and it is San Diego's largest vintage and antique mall. Yes, they're calling it a mall because it's 40,000 square ft. Now, this could be a good thing and a bad thing. Good thing, I could probably find everything on this bingo card. Bad thing, I got 5 minutes. Oh, yeah. Another bad thing. One of these squares can end the video. Another bad thing, I could pull a disadvantage. Some good things come out of it, too. There could be an advantage under here. You never know. But I think the time is always against me cuz the 5 minutes goes fast. And guys, after this thrift store, I only have two more to go to. So, hopefully I knock out at least three and I get close to the finish line. 5 minutes on the clock starts now. Oh, dude, they have so many cool things. I've actually been to this thrift store a long time ago, like 2 or 3 years ago, for another challenge. Oh, we're going to find a lot of stuff here, but I got to hurry. Antiques would be a great spot to find an item older than me. That would be good. So, something that was made before 1996. Okay, this looks old, bro. That That's got to be old. Come on. But it's $95. I feel like we can find something cheaper. What's over here? Some jewelry. Oh, there's a camera. Is that over $100? Nope. That's 50. Oh my gosh. How have I not found anything yet, guys? 3 minutes. No way, bro. I mean, there's a picture with an animal on it, but that's not that's not a shirt item with a name on it, maybe. Dude, they have so many cool items here. So many. Oh, you know what? Coins might be good. If they have coins, those will be older than me for sure. I'm so overwhelmed, guys. There's too much. There's too much to look at and I feel like I'm passing a lot. Oh, these are cool. Oh my gosh, these are so cool. Look at these comics. There's got Oh, what is that? That's a h 100red bucks. The baseball. I'm just going to grab that. I'm going to grab that. It's a $100 baseball. I think that's cool. I think that'll be my $100 item. So, we got that. There's a paper. One color. For the next round, all items must be the same color. Are you kidding me? As if this wasn't hard enough, at the next thrift store, everything has to be one color. What? All right, guys. We got a minute and a half. Okay, another creepy doll. And it literally says scary doll. I kind of wish I got this one more than the other one, cuz the other one legit is like an Annabelle doll. Hopefully not the real one, though. What is this? Mattel Mary music box. Guess what's on the board? An item that makes sound. We could just do that one. Okay. An item that makes sound. I like it. I like it. Okay. Please don't end the video. Okay. An empty slot. That's perfect. Let's go. I promise you I fumbled the bag on this one. Let me tell you why. There were so many items older than me. 100%. There were so many and I just like I didn't grab them. I didn't put my eye on one of them. Like I'm sure everything here I'm sure this is older than me, but I'd rather use it for the item that makes sound. But like look. Oh great. There's a typewriter that's definitely older than me. 1930s camera, guys. I'm telling you, just so you know, all of these are around me. Like, I can knock this out in one store, but it's the time that's killing me. That's crazy. And I could easily just miss it. Wait, is this Hocus Pocus? Oh, never mind. That's Oh my gosh, I'm stupid. It's Queen Elizabeth. I sold the bag here. I'll be honest. And I got a disadvantage for the next thrift store. Are you kidding me? Okay, well, we got to go grab that baseball cuz that was the top row item over 100 bucks. And we'll go check out. Great to have you back. >> Yeah, of course. I almost forgot how many crazy cool things you guys have here. >> Oh, yeah. >> For the challenge, my time ran out. >> Oh, no. >> I got something that makes noise cuz that was one of the options. And then this one says an item over a hundred bucks. So, I found that baseball or I think this one right there. Yeah. >> Oh, very good. >> 1940 through 1950 ball stamped commissioner name. Can I grab it? >> Of course. >> All right. This is the one right here. Pacific Coast League. Looks great to me. Awesome. Yeah, let's do it. I think it's time we move on to the next. It's going to be hard now. One color. I don't know how I feel about the last one. I think it's going to come down to the last thrift store here, guys. But without further ado, let's head to the next store. All right, guys. Fourth thrift store. It randomly started raining out of nowhere. Look at that. But I'm not going to lie, I'm loving this weather. I miss the rain. I miss hoodie season. I miss sweats, hot chocolate, chai khalib, all of the above. But guys, you know what happened at the last store? I have to pick a color. I don't want to look behind me and get any ideas. I'm going just go with white. I think there's a lot of white items in there. Maybe pillows. Maybe I don't know. I don't I'm just going with white. You know what? As long as I get one or two items from here, I will be satisfied. Let's do it. 5 minutes on the clock. White items. 3 2 1 go. Oh, wait. There's a lot of stuff in here. Hold on. Okay, so got to keep a lookout for white items only, though. So many books, movies. Wait, an item with a name on it. and patch it. I think that counts, right? This is a white book. Please don't be anything. [Music] We're good. We are good. Let's go. That is three right there. We're looking good so far, guys. Madden09. Would you say 2009 is vintage? I think so. That's like 28 years ago. Wait, hold on. I did the math wrong. 15 years. What? 16 years. A white case right here. Vintage video game. Okay, but I have to be careful. What if that's the one that ends the game? Yes. Nothing. Nothing. Okay, I'll take nothing. I don't even want the risk for a disadvantage. Okay, we're good. That's two items. I'm actually doing a lot better than I thought. And we still have Oh, 2 minutes. A random ball. I don't think this means anything. Maybe I could find the item from my childhood in here, too. Halloween. Oh. Oh, hold on now. Oh, an easy bake. They got an Easy Bake oven. Yo, only '90s babies would know what an Easy Bake oven is. That is so sick. This is so hard. This is not looking good. This is not looking good. Um. Oh. Oh, hold on now. Wait, there's something with a different language. There we go. An item in a different language. Yes. Oh my gosh. What a crazy find. I did not expect to find this. I wasn't even looking for something in a different language. I could have swore I remembered it though. Okay, here we go. That counts. That counts. We literally got three at this thrift store and I was at a disadvantage. Come on now. Stop playing. Okay, let's see. Imagine this is game over and it ends the whole video. I win. I win this challenge. Plus 2 minutes at the next store. Let's go. Finally, I get an advantage. I feel like I was only getting disadvantages the whole time. So, now we got 7 minutes at our final thrift store, and the board is looking good. All right, guys. Before we head to the last thrift store, here is an update on my bingo card. We are looking amazing. Now, going into the last store, I need to strategize. The more papers I pull, the higher chance I could get the game over, which I don't want. So, after looking at the board, I got to focus on the skateboard. If I get the skateboard and do the trick, that allows me to have three options to choose from to get bingo. If this is an X, we got this to get bingo. We got diagonal to get bingo. And then we got this one to get bingo. So, I have three options to choose from. And thankfully, I have 7 minutes at the next store. Gives me more time to actually just chill and take my time with it. I hope I win this. Let's go. All right, guys. We made it to the final store of the video. But we got the Salvation Army, which is one of the most popular thrift stores in America. And I am hoping we win this thing. We need to find a skateboard. If we find a skateboard, we got three options to choose from to win the entire thing. If not, I'm looking at this row right here because there's three X's. We need a Christmas sweater and a shirt with an animal on it. Luckily, I have more time added to the clock at this thrift store. We got 7 minutes. Let's get it. Come on, guys. Hopefully, we win. 7 minutes on the clock starts after you. We got more time. We got more time. Skateboard. Skateboard. Okay, there's backpacks here. We got some shoes. Oh my gosh. Well, I thought that was Gucci. We got some nice Vans. Classic. These are pretty sick, too. It sucks that I can't ask. We have to find it. There is a designer item here as well, but it's not really going to do us any justice. We need four on this side. Oh, we still got an item from your childhood. I mean, Monopoly is from my childhood, right? I think that counts. Even better. Candyland and shoots and ladders. This is a twoin one childhood. I should I should take off two squares for that one. Okay, we're good. We're good. We're good. Okay, so either an item with a date on it, a full outfit under $25. That might take too long. Okay, Christmas sweater. Oh, wait. Wo. Was this a Christmas sweater? >> I think that's just a flannel. Dude, I've wore this for one of my Christmas videos before. Wait, play the clip. But it's not technically a Christmas sweater. Would you consider this a Christmas sweater? >> No. No. It looks like pajamas. >> Oh, darn it. Okay. Okay. Thank you. Like that would have been a good find, but I feel like we could find one. Okay. Okay. Okay. Okay. Okay. Okay. Christmas sweater shirt with an animal on it. Um um um um um. Shirts. Here we go. Hawaiian shirts. No. Dude, there are too many clothes to go through. And skateboards on my mind. Of course. That's a llama. A llama's an animal. >> I think that counts. Oh my gosh. Yes. We just lucked out so bad. And hold on. This kind of tough. I might wear this. Okay. Yes. Let's go. Come on. Come on. Let's go. Okay, we just need one more and we win a Christmas sweater. I think I'm going to spend the last 2 minutes. Oh my gosh. We have 2 minutes. Here we go. Here we go. 2 minutes to find a Christmas sweater. They have so many cool things there, too, though. Can I still get a skateboard? There's bikes over there. There has to be skateboards here. Come on. Come on. I see basketball, soccer balls, weights, mini golf clubs, golf clubs, bowling balls. No, there's got to be a skateboard. Boogie board. We're getting Oh, snowboard. No skateboard. There's no way. A boogie board. No, they got to be in the board section here. You know what? No, we're going for the Christmas sweater. We're going for the Christmas sweater. Okay, 1 minute. 1 minute. Okay, Christmas sweater. This looks like a sweater area. You would see a Christmas sweater right away, right? Like the color of it. Is that Santa Claus? >> That kind of looks like it. >> But would that be considered a Christmas sweater? >> I don't think it's a sweater. That's the only thing. >> Why are you going against me? >> It's a costume, bro. >> That is true. It's a costume. Okay, this is the Halloween section. No, Mickey is very Christmy. Okay, I think this is our only section. Wait. I don't want to check the time. Work hook. [Music] Can I check something real quick? I I think I saw something, but I'm not allowed to help you out. >> Wait, you saw something over here? >> Out of the corner of my eye right over here. >> No, bro. Please. >> Okay, so I saw this, which has Santa, but I don't know if it's a sweater, >> brother. That would be counted as a Christmas sweater. 100%. It has Santa and reindeer. Okay, it's okay. You know what, guys? This was all just for fun because ultimately at the end of the day, even if I took this L, which I did, I have to find a prized possession of mine to donate to a thrift store, which I am not mad about at all. I actually am excited to go home to pick something out of my house and put in one of these thrift stores. So, I'm totally cool with doing that, but I just don't like taking L's in general. So, like, it's more of the L that's making me upset, but donating one of my prized possessions, I'm actually very excited about. Okay, let's just say I got the Christmas sweater. [Music] That's why I would have taken the L anyways. Huh? Is this rigged? I mean, there's no way it's rigged. I would have got game over anyways, guys. All right, let's head home, find a nice prized possession in my house, and bring it back to this thrift store. And this is how I'm greeted. She is going to scratch my glass, but I don't care. Oh gosh. Oh, hi Lola. Hi, Lola. Hi, Lola. Hi, Lola. Hi, Lola. Hi, Lola. All right, so this is the item we're going to be donating. All right, come guys. That's how she greets me every time after a film date, cuz I'm gone all day. Watch this. Watch how she's going to come around the corner flying. Lola, look. She's going to fly. [Music] All right, guys. Prized possession of mine. I think something that comes to mind is maybe a pair of valuable shoes or something that has like a cool story behind it. So, we'll go up to my closet and check it out. Before we go into the closet, my new patio is my new spot, my new hangout spot. Look at how good it came out. If you missed my vlog, we showed you guys a little transformation. It is absolutely beautiful. Especially around this time when the sun has gone down. It is so so beautiful. We got the swinging chairs. We got the wet glossy look on the floor. Shout out Papa Rug for doing that. The couch. And then my favorite part. Here we go. It is a vibe. My gosh. Oh, I love doing transformations, guys. Like you guys really love when I showed you guys my transformation for the garage doors. You guys love when I showed you guys this transformation. So, I got more ideas up my sleeve if you guys want to see it. But, let's go check out my closet. I think I have an idea of what I'm going to donate. I might do it. These are my first pair of Gucci shoes ever. And if you guys didn't know, I had a Faze Rug Gucci era. I was obsessed with Gucci. I literally wrapped my Lamborghini Huracan Gucci. So, these mean a lot to me, but I don't wear them anymore that often. Like, they kind of just sit in my closet. And I mean, if I lost the video, I needed to find a prized possession to me. These are definitely it right here. So, someone at the thrift store is going to have a great come up. All right, let's go donate. Okay, before we leave, I got sent this by Mr. Beast, and I think it's beef jerky. So, let's check it out. Snack like a beast. Unpack the world's most epic protein snacks. Jack Lynx is like the most popular beef jerky brand. So, let's give it a try. Ooh, wait. These look sick. Jack Lynx, Mr. Beast. Little card. What's up, AJ and Big Justice? Wait a minute. Wait a minute. Is this supposed to go to the Costco? Guys, I guess we got to rate it on the boom meter. Okay. Oh, what is this one? Teryak. Dude, the packaging is actually insane, guys. I actually had no idea that Jimmy was partnering with Jack Links for beef jerky. Ooh, it smells crazy. Okay, here we go. This beef jerky deserves five big booms. Boom. Oh my god. Wait, it's actually fire. It's actually fire. Fazer rug approved or AJ and Big Justice approved. All right, let's go. So, I decided to actually sign the shoes to make them more personable. This is actually an iconic moment. Here we go. Damn, my first Gucci shoes signed. I actually am curious if anyone out there is watching this video, who is going to get their hands on these? Cuz this is a huge come-up. All right, >> I know you're already home. I'm on my way out. Do you want me to drop them off for you? You would do that? >> I'm happy to do it, man. >> Dude, that would be amazing. Take care of my viewers for me. Okay. >> All right. I am a little tempted to put these on eBay, but I promise. >> Come on, bro. Don't do that. It's for a good cause. >> It's for a good cause. >> All right. Well, thank you. I appreciate it, guys. Enjoy this trip with my cameraman. And uh I'm going to do a little voice over for you guys so you still hear my voice. Today was such an amazing day, and it feels so good knowing that one of my most prized possessions will be going to a good home. I never realized thrifting could be so much fun. But more importantly, I love the fact that it gives people a chance to find quality things at an affordable price. And hey, just like Forest Gum said, life is like a box of chocolates. You never know what you're going to get. All right, so I just dropped off Brian's shoes at the thrift store, and they said that they're actually going to put them in a glass case. So if one of you guys comes by, you might be able to buy Brian's first ever Gucci shoes. All right, guys. Bye.",
    "start_time": 0.0,
    "end_time": 1478.72
}