{
    "video_id": "OVx_norCGr8",
    "channel_url": "@rug",
    "transcript": "Yeah. >> Did you hear that? >> Did you hear that? That was over there. >> What's going on, guys? It is your boy Faze Rug and welcome back to a brand new haunted video. Tonight, we are going to be investigating my parents' house. But before that, I decided to come to my childhood home where the root of my haunting began to get some answers. And you already know I had to bring the best of the best. Sam and Colby here. >> This is crazy. Sam and Colby are here at my childhood home. >> It's weird. I've been here before, though. >> What? >> What? >> He comes here three times a week. >> Oh. Anyway, >> tonight is going to be fun. I definitely want some answers as to what's going on in my life. Not just here at my childhood home, not just, you know, my parents house, but like just my life in general. But the main route of everything is obviously at my parents house. So if you guys didn't know, a lot of creepy things happened to me growing up in this very house. And when I started making YouTube videos, it was in this house. And you know, I played the Charlie Charlie pencil game in here. >> Okay. >> Explore the haunted tunnel that started in this house. No way. Seems like every house you've lived in has been haunted. >> I'm the problem. >> Did you play the Ouija board in here? >> Of course. >> This is a legendary spot then. There are people living in there now, so we can't go inside. But I figured we start with a little investigation here and possibly invite whatever is in that house or if something's already here with us to come to my parents house before we do the full investigation. >> Let's do it. Yeah. >> Okay. Hope you guys enjoy. Please drop a like, hit that subscribe button, and it's hell month, baby. >> Shout out to Cole. Let's go. >> We got a crazy one for you, bro. We've never actually shown you this. I don't think >> a spirit bridge, >> a brand new piece of ghost equipment on Rug's channel, the spirit bridge. So, any spirits around here can use their EMF energy to manipulate this and communicate to us. Yeah, wherever we want to do it, we can get started and see if there's anybody here. >> If there's uh any spirits that are around us right now or coming from my childhood home, uh this is Brian. Uh can you come say hello or give us a >> What did I say? Karma. >> Karma. >> Karma or camera? Can you see us right now? Yes. >> A tiny yes. >> Do you remember Brian? >> Debut. >> Debut. >> Debut. Your first house. >> Oh, this is my first house. That could be whoever we're communicating with. This is Sam and Colby, some of my closest friends. So, you can respond to them as well. We are planning on going to my parents' house tonight. And we just wanted to invite you over there. >> University. >> University. >> Something like that. We wanted to invite you there to get some answers to see if this is someone or something attached to me. >> Debut. >> Say debut again. >> I don't know. >> Are you still here at my childhood home or are you with me? >> Silly. Silly. >> Silly. I am a little goofy. >> What if that's like like an evil thing where he's just like, \"Silly, I've been with you.\" >> Why? Why you got to make it like that? Why you got to make it evil? >> I'm investigating. I'm trying to figure this out, you know? >> Is this something that's attached to me? Bring >> bring bring. >> Yes, we want to bring you over to your mom's house. >> Well, but you just said attached to me and it's like bring like you're bringing it along already. That's what I got out of it. >> Is this a spirit that's attached to me? >> Yeah. How long have you known Brian? >> What? That was a screech. Can you tell us if you're a good or a bad spirit? Why do I set up >> adventure? >> Adventure. Ooh. If you want to come on an adventure tonight, we are about to head to my parents house. Would you like to come with us? cuz we're inviting you there. Sorry, Mama Rug and Papa Rug. >> Okay. No, I'm sorry. What the hell was that? >> What was that, >> dude? I just got the chills cuz that sounded that was bizarre. >> Entity. >> Entity. >> Ooh, it's an entity. Okay, that makes sense. >> Okay. >> Does that mean it's like a human spirit or something that was never alive? >> Is this a human spirit? >> Passport. >> Passport. >> Passport. >> Bring adventure passport. Like it's traveling with you. >> What did it say? Important >> refused. Important. >> We are going to head to my parents house right now and we just want to know if you're going to be there with us. >> Bring. >> Bring again. >> Did he say? >> Yeah, I think it was bring. >> Was that bring? >> Yeah. We want we want to bring you so you can tell us your story. >> You have to come back here afterwards. >> Unless you're attached to one of us. >> Can you just tell us once and for all like where you're coming from? >> Attached. Did it say >> attached or attack? >> Yes. >> I heard attack. Attack. >> Oh, >> I don't want to get attacked tonight. Can you just tell us your intention? >> V >> V >> play. >> Play >> play. >> Maybe it's a playful spirit. >> Maybe it's a kid. I >> I don't know. >> Sounds like a little game they're playing. >> Yeah, we're like that was crazy that >> Turn that off. Turn that off. What the? Turn that off. Turn that off. Turn that off. Turn that off. >> After we were like, \"What game?\" It's like, >> let's not forget that they can play tricks on us. They could make us think that they're this fun, playful, nice spirit, but can be an evil one at the same time. >> For sure. >> Okay. Well, we are going to my parents house right now. Um, if you are here at my childhood home, please come with us and then come back later tonight. >> Yes, please. >> Please. >> Only follow us to give a few answers. >> All right, guys. We're almost back to my parents house to start this investigation. But earlier in the day, we actually went there before to ask them about the hauntings. We're here at my parents house with Sam and K. >> Dude, this is so crazy seeing you guys here. I lived here for 7 years of my life and you guys have never been here. Huh? I feel honored. Thanks for inviting us. My gosh. Of course. And we're going to get to the bottom of a lot of things tonight hopefully. >> So, this is super haunted as well. >> Oh, absolutely. Ouija boards have been played in here. Scratches on my back have occurred here. A lot of noises, footsteps, and a lot of things recently that my parents have experienced as well. >> Really? So, it's like still haunted. Not even just with you. It's like >> still active. Yeah. Here we go. >> I think they're going to a party, so they're probably going to be like dressed up. >> Uh Faze rug, can I get a picture? >> Yeah. Yeah, please. >> Okay. >> Hey, my god. >> Rug. >> How's it going? to your >> Insane. >> I did not expect that. >> Saturday night, we have to go out. >> And you're leaving us here with the ghost. >> Up to you guys if you want to stay. >> How cool is it? Sam and Kobe are here. >> I know. Big fans. Big fans. >> Of course. Like us. The family loves Sam and Kobe. And my fan base. They love you guys. It's time to get serious, guys. We're here to get to the bottom of a lot of things. since we moved in and it was that Ouija board first things start happening and when you left the things still happening here I experienced something when my husband went back home right to Iraq you experienced something >> I swear it was I didn't probably tell you but I called your security you can ask him >> you called security because you thought something was happening >> there was like knocking on the window I look at the camera we have camera everywhere I look at the camera there's nothing and I still haven't throw away the Ouija board I don't want to look at it I You asked me. >> You have the original. >> They said the priest said don't throw it. Don't break it. >> Wait, Mom. You can't find it though. >> I I looked in here. Oh, it used to be in this room. And it's not only that. The thing that I hear the crying baby. >> Crying baby. >> I swear you hear like like the baby crying. It's >> like it's okay to talk about it though. >> It's up to you if you feel comfortable talking about it. >> We lost a baby. >> Oh, I'm sorry. >> We lose a girl. And I always think about imagine if she was alive. You were four. Five. >> I was four. >> Four. So imagine if she was 24. And maybe it's in my mind to hear those voices. The baby voice. >> I'm sorry. >> Or sometime when I walk I hear I go, \"Oh my god, she could have been here.\" >> And that I hear it all the time. Pop her up. What have you experienced? >> To me, I don't know. I don't want to say much, but I always hear stuff >> like footsteps or like >> from upstairs. Honestly, I just don't do anything. >> My room was upstairs with my brother. I don't know what it could be like. If it could be a spirit attached to me or a spirit that came out of the Ouija board that stayed here. >> Something that I could have left here. >> I think it's you because you start doing the scary stuff at the old house for childhood. >> The old house was crazy. >> The thing that we experienced there shadow there's a video that recorded me live. >> There's a video where like I was just playing video games and I hear my mom screaming. We're not recording. And like me being a YouTuber in 2016, I grab my camera. >> I grab my she's okay. >> What's happening? I grab my camera and she's like sitting at like the top of the staircase. She's like on her knees like this and she's like, \"Oh my gosh.\" Like there's something downstairs real quick cuz I know you guys have to go. Is there any specific things you want us to focus on? Like any specific answers? Like what's here? I don't know if you guys think it's like a negative entity here or just like a >> Do you think it's negative or do you think it's more like it doesn't like hurt you guys or anything? >> No, that that's the thing is we're kind of okay with it. >> Okay. Okay, cool. >> So that's good. So it feels like peaceful. >> Yeah. >> Yeah. >> Okay. So maybe if it has a message for you guys. >> I was going to say do dead people send message through those things? >> Oh yeah. Because I lost my sister at 47 years old and I kept seeing her in my dreams and and even at the old house they said they used to see somebody going up up the stairs. >> Focus on upstairs because since they moved out the boys it's believe it or not we don't go upstairs and there's even on the room like when we walk in there's spider >> anything like in your guys' room or you don't hear anything in your room >> honestly in the room? No. >> Do you think there's multiple things here or is it just like one main entity? And does it happen like weekly, monthly, or how often? >> Not a month. I wish it was monthly. >> Every >> at least three, four times a week. >> Do you think it happens more now or more back when Brian used to live? >> I think before. So maybe bringing you back is going to make things more active. >> Yeah. So don't come back, Brian. >> All right, guys. Well, we got some work to do here. >> Yeah. Take your time. Have fun at the party. >> We'll do. Thank you to see. Nice to see you guys. >> Great to see you. >> We'll see you. Maybe we'll come back when you guys go here. >> All right, we made it back to my parents house and they left the house ready for us. I told them to turn the lights off and make it spooky. >> Oh, scary. >> Definitely more of a different vibe than when we were here earlier. >> I've done investigations here before and a lot of haunted stuff, but having you guys here, I feel like the energy is just going to be a little bit crazier. Dude, unlike our other investigations that are like at hotels and stuff with you, this is so quiet. >> It's so quiet >> and it's like very personal to me, which I love. >> We heard what your parents have experienced, but what about you specifically in this house? Like what's the craziest thing? >> Scratched on my back. >> The the back scratch. >> Back scratch for sure. How long ago was that? Probably like 6 years ago. >> What's weird about that is your parents were saying like, \"Oh, we think it's a benevolent good entity, not like an evil thing.\" So maybe like what scratched you was only attached to you. >> Yeah. And I believe when I got scratched, it was after I came back from Hotel Del Coronado and it was when I woke up the scratch was there. It could possibly have been from there or I got scratched there and I didn't see it in >> that looks terrifying. >> Oh my dash. >> Red LED lights. Okay. >> Oh my god. >> He wanted to make it extra spooky for us. Let's check out the ambiance in the living room. >> Creepy. >> Let's go. >> First investigation in your living room. >> Let's go. We're just using a regular Home Depot flashlight. So, basically, you just twist it on to turn it on and then twist it off. Yeah, to turn it off. And it's as simple as that. Like, spirits can go up and physically tap it or use their EMF energy to turn it on and off so we can ask questions and see if it turns on. >> And while we have that, we will also be using the spirit bridge that we were using earlier. See if we get some of the same answers from in front of my childhood home. That'd be great. Or maybe they're even more clear because there's more spirits here. In reminder, the last thing it said was >> Was that one set up, too? >> This one's on. >> Awesome. We are back at my parents' house. If there was anything that was at my childhood house that came with us as we invited you, you can go up to one of these flashlights and tap them and it'll let us know you're here. I always get anxiety when we ask the questions just before anything happens. >> Yeah. >> Oh, this one. >> Okay. Okay. Almost immediately. Yeah. You got to give it some time. Okay. Thank you. >> So, something's here. >> All right. You can go back up and and touch it to turn it off. Yeah. When you turn it off, then we can start asking you some questions. Did >> you hear that? >> You heard the crack? >> It was like on the ceiling. >> Oh gosh. From the attic. That >> Oh, okay. If that's you making the noise, can you turn off the flashlight, which it was already turned off? >> Okay. Well, let's >> Oh. Oh, that turned on. >> Now, this one. Okay. So, two different flashlights. Maybe multiple spirits. >> Okay. Thank you so much. Can you come up to this device and start communicating with us? We are here at my parents house. >> Oh, now they're both >> manufacturing. >> Manufacturing. >> If there are any spirits in the room with us right now, can you make yourself known uh by giving us any sign through the spirit bridge? Medications. >> Medications. >> Medications. >> Angry. >> Like it was going to say angry, but it said ang. >> Can you be a little more clear with us? I know it's a little hard, but if you can tell us anything about yourself. >> Reception. >> Reception. >> Reception. Okay. >> The creek dude. >> If a spirit's in the living room with us, can they instantly like teleport up? Could they be in multiple locations at once? Or could it just be multiple spirits? >> Possibly. Like there's a lot of different theories to it, but sometimes people can communicate to the same thing in different rooms. >> So, we're not really sure. >> How many spirits are with us right now? Can you give us a number? >> I find that offensive. >> I find that offensive >> to ask how many spirits there are. Can you tap this if it's over five spirits? >> Wait, so could that mean no than that? >> Wait, I don't know. Then >> could we use the flashlights as yes and no? >> Okay, so the red flashlight is yes, the blue one is no. >> If you understand this game of yes or no, can you go up to the red flashlight and turn it off? >> Thank you. >> Thank you. >> So if there's multiple spirits here, can you go up to this red flashlight? And if there's not multiple, it did. >> I don't like it. >> There's only one. So if there is only one. Do >> you mind going? >> Do you mind going? Do you mind going and turning it on? >> Oh my gosh. >> Sales. >> Oh, wait. >> There's only one. >> Oh, there is only one. >> Yeah, it said it and then only one. >> So just to confirm, there's only one spirit with us right now. >> Yeah. >> What did you say in this house right now? >> Yeah. Talk to us. >> Oh, the red one turned on. >> Just when you said that. >> Yeah. And we are specifically talking to one person about this. >> Okay. Holy. Okay. Thank you. Is this spirit attached to one of us or is it >> manor? Manor. >> Manor. >> Manor is another word for house. >> Oh yeah, it is. >> True. >> Oh, it could be like >> Oh, no. >> It's no. >> So, wait. The question was are you talking to one of us? And it said no. >> And it said manner. So, it could be part of the house. Hey, just to clarify, in case we got that correct, if you reside only in this home, can you go up to the red flashlight? >> Creations. >> Creations. >> What could that mean? >> I don't know. >> If you're a spirit that is attached to me, can you go up to the red flashlight? >> America. >> Hm. >> What if it's attached to >> No. Wait. Both of them. Both of them. No. And yes. Could they just be playing games with us? >> Maybe. That was like perfectly on time, right? They both turned on. >> Super weird. >> Selling. I still want to know if it's like a good or bad spirit that we're talking to. I don't know. >> We'll see. >> We'll see. >> Is that what that said? >> What it said? >> I think so. >> Just to clarify, your intentions are good in this house. Can you go up to this red flashlight? And if you don't really like us and you don't have good intentions, can you go up to this blue flashlight? >> It doesn't want to tell us what type of spirit it is. >> Huh. >> Have you experienced this? >> Yeah. I mean, it makes sense that someone doesn't want to say like what their intention is. >> It said we'll see too. So maybe >> mercy will >> tell us later. >> Yeah, maybe they just want to get more comfortable with us. >> Is that true? Do you just want to talk to us more? >> Oh yes. >> Um >> eight >> eight >> eight on god. Before it said that I thought I heard footsteps. >> No. What do you reside upstairs? >> Daddy. >> Is that what it said? >> I don't know. >> It said bro. Wait. I'm getting chills. I don't know. >> So, eight. Could that have been answering our question from earlier? >> How many are here? >> My mom said that she hears a little girl crying. >> Mhm. >> Like baby screams. Is that you who we're talking to? >> Oh, no. >> So, it must be someone rel >> Didn't your mom talk about her sister passing away? >> Yeah. Wait, is this Oh, yes. Right after. That's crazy. >> Is that who we're talking to right now? >> Oh my gosh, I'm getting chills. That's my aunt. Is this my >> What the was that? >> I don't know. But I didn't like that. That scared me. Is this my aunt we're speaking to right now? >> Oh, there's so many. >> Janette. >> Janette. >> Janette. I don't know a Janette. Janette. I wonder if my mom or There's a huge crack. >> Oh, was that I thought that was your pocket. No. Do you have a message for my mom or my dad? [Music] >> You? >> No. I has a message for you. >> Oh, so you have a >> adopted. >> Haunted. >> Haunted. >> What did that say? >> Oh, no. >> Is that a siren? >> Is there something you want to tell me? >> Binding. >> Binding. Like it's like bound to you. >> Can I just get a confirmation if the spirit we're talking to right now, are you attached to me? Understood. If you are attached to me, can you go up to the red flashlight? And if you're attached to the house, can you go up to this blue flashlight? >> Oh, so it's attached to the house. >> Huh? >> Talk. >> Can you give us a sign as to where you want us to go in the house to get better answers? Miss, any sign? A noise or something through the spirit bridge? upstairs. >> Oh, it was definitely upstairs. >> So, could it be like another spirit trying to tell me something about my relative? That's the closest I've gotten. >> I think so. >> Okay. Why are you so attached to this house? Can you give us any reason as to why you stay here? >> Immature. >> Immature. Is it better for us to go somewhere else to give better answers? >> We're going to head upstairs. We invite you to come up with us. >> Oh. Oh. >> Oh. It's literally like, \"Oh, no. Stay here.\" >> That's the second time it was like, \"Nah, don't leave.\" >> That's so weird. >> Do you >> Why do you want us confirmed it? >> Who is this? >> There is something that's down here, but that means there's probably other spirits upstairs. >> What if it's like trying to warn us from going upstairs? >> Is that true? Are you warning us about the upstairs? >> No. >> Oh, it turned off. >> Preventing. >> It's preventing us from going upstairs. But why? That was like a little girl's voice. >> Is there something that you're scared of upstairs? >> Madam >> bedroom. >> Madam. >> Madam metals. >> Metals. >> Oh, another big creek. >> There's something upstairs. >> Yeah, 100%. >> Is that where your mom saw the shadow figure or was that in the childhood home? >> That was in the childhood home. >> That sounds like we were what we were talking to at your childhood home. Why did you mention the childhood home? Are we talking to the spirit from the childhood home? >> Do you guys not hear that upstairs? >> That was footsteps. >> Yes. We know you don't want us to go, but if you could please follow us and protect us, we >> two quiet. >> Yeah. It's like don't go preventing like stop. Like why? >> Did it just say why at the same time? >> Yeah. I think I like finished your sentence. It's hard to get answers from the Hello. >> Hello. >> A new person came in. >> Maybe. I just think we should probably go closer to where your parents have been experiencing the hauntings. They didn't really seem like anything happened right here in the window. At least maybe like by the stairs. >> That'll make this spirit happy, too. >> Yeah. >> It sounds like it's knocking on a front door. >> Door finger. >> Oh, >> the hell? >> That was the scariest one. >> What the hell? That just sounded like a door knocking and someone whispering in a house. I thought he said like >> something on his finger. >> Yeah, something on my finger. >> Yo, that was the most terrifying thing I've ever heard. And we just said we were going to move towards the stairs, which the front door is there. >> That's good. Maybe it's going to be us there. Okay, I'm going to turn this off. >> All right, >> it's an ancestor, right? I don't know if we were speaking to the ancestor, but maybe an ancestor is here. >> Yeah, made it clear it's a relative. >> Relative. >> What I got is the message that they want to tell you is about the relatives. There was a spirit here that doesn't want us to leave, but there's probably other spirits in the house. >> It said eight. What if there's like eight entities total in the house? >> I'd be lying if I said I wasn't confused. >> Yeah, maybe just the next investigation we'll have clear answers >> for sure. >> Yeah. >> Okay, let's head towards the front door. >> Let's do it. >> I can't get that knocking out of my head. >> So scary. >> Should we see what it sounds like to knock? Dude, stop. Please. >> Uh, is that kind of like how it was? >> It was like a hurried knock and then we played it back and it was like, \"Hey, >> so we are here at the entryway. We got the the staircase right here. >> And we are pretty much working our way upstairs, but we want to take it a little bit slow. But I was thinking of putting the re pod at the top over there. >> That's a good idea. >> And by me placing it physically, I mean one of you guys, cuz I'm not going up there by myself. >> Oh, >> crazy. I was like, how do you play nose goes between two people? >> We went very close. >> I didn't touch my nose, though. >> Okay. Can someone come with me? Please. Please. Come on. No. This isn't a joke. I don't want to go up there, >> bro. I'm paranoid. >> Okay. Okay. >> I didn't want to go up yet. Okay, we'll just set it here real quick, please. Can you go in front of me? Sacrifice camera. >> I mean, it's only right. >> Camera guy never dies. >> That is true. That is true. >> Perfect. >> Okay. >> Okay. >> Not only do we have the rim pod, we also have the Oalis, which basically takes EMF energy. Depending on how much the spirit can select a word from a word bank that's on here. So we can actually get direct communication kind of just like we had with the spirit box, but this works solely on EMF energy. Okay, so we moved towards the door and the last thing we heard was knocking. Are you here in this room with us right now? >> Became temperature. >> Temperature. >> It did get like a little warmer in here. >> It did. Yeah. Yeah. >> September something >> something. It's September now. >> Yeah. If you recognize me. >> Wife. >> Wife. You have a wife. You want to marry me? Supposed to be a secret ghost. Chill out. But if you recognize me, I lived here for 7 years and we believe we were speaking to someone who stays in this house or something that stays in this house. If you actually do recognize me, can you scared >> maze scared and maze? If you recognize me, can you go up to the re pot at the top of the stairs? Wo, why? Three things. Wait, there's three things. Are you saying there's three different spirits? Can you clarify? age. >> Age maybe age of three. >> Are we still just trying to figure out how many spirits are here in general? >> Earlier it said eight. >> Eight. >> But now it said three. Can we get a clear answer on how many spirits are in this house right now? >> Slame. >> Cuz I don't know if someone passed away in this house. >> I don't know. Why is it extra quiet? >> I don't know. >> That's kind of creepy. >> It's too quiet. >> Cuz there were so many noises like just a few minutes ago. >> Like the creaking, the footsteps. Are you still here with us right now? >> Paper garden. >> Did you hear that? >> Did you hear that? That was over there. >> I'm actually like my eyes are are wondering. It was a distinct hum of like a little girl right over in this room. What's that? >> A little girl. >> That's my dad's office. >> It said paper before. Is there paper in there? >> Can we go in there next? >> Is that okay? >> Yes. Is there anything in here? A little girl. One of the >> daddy. It said daddy before. Dad. >> Little girl. >> That's so weird. >> What if this is Bianca trying to talk to my dad? >> It's a little girl. >> She would have been 24. But I always wonder too like if since she wasn't born, does she grow up to be the age or does she stay a baby? We've been told that spirits can kind of choose how they want to portray themselves in the afterlife. So, she could like portray herself as 10, 24. >> Oh, okay. I'm just worried that it's something else trying to play a trick on me and like try to make me think that it is. And it's like messed up and it's like messing with my head. But that like that was so loud. >> That was so loud. >> Again. Was that again? >> Again. >> Right outside again. >> I heard it from this side this this time. You know what I'm like not worried about, but like what if it wants my parents here to give answers cuz they live here, you know? And like if it is my baby sister, what if she wants to talk to like my mom and dad? >> Mhm. >> It sounds almost like both the times that we just heard that it almost sounds like it's crying. >> Isn't that what your mom said too that she >> Yeah. Like did she say like a little girl like screaming or crying? >> Yeah, something like that. >> That was more back towards the door. from Pete brought is who we're communicating with someone or something that we brought to this house from somewhere else. >> Dude, that was a freak upstairs. Okay. It's really interesting that we're not getting super clear answers on the equipment down here, but everything is pointing upstairs and it's all like a physical thing like sounds and and voices. >> There was one thing that didn't want us to go upstairs. >> Yeah. Which was in the living room. That was like one of the most clear voices we've >> I don't know if we've even heard something that clear before. >> Yeah. >> In I'm not even kidding. Like that >> out of all the places you guys have been to, >> we've definitely heard some weird obviously, but like that little girl home twice like 10 minutes. >> Are you scared of being here with whatever else could possibly be in here? >> Dead silence. That's the weirdest thing. We literally stopped recording to change the battery and this thing started exploding with words >> like immediately. >> And guess what? The last two words were done and finished. >> But then as soon as you turn on the camera, stop. >> Done. Finished. It's like I'm going to show myself off camera. Broken fire mountain. I don't know if this is one of the houses that caught on fire. >> Yours did though. >> My house caught on fire. All things have been leading us to go upstairs. >> Mhm. >> So, we thought it'd be a great idea to split up. Fantastic. >> I don't think I've ever done something like this in one of my videos. Splitting up. I don't like it. >> We're proud of you, man. >> Thank you. You guys, >> you're going alone, right? >> I'm taking him. What? >> No, I'm not going alone. >> Oh, we were taking Charlie. >> You guys have your own camera. >> Oh, okay. >> You guys got me out of my comfort zone, though, because in your videos, you guys make me go alone in the dark all the time in the conjuring house. Okay, I don't want to spoil it. Sorry. Can I say it, >> dude? Dude, what? >> Look, but look, I'm holding it like this. Yo, what the Hold on. Right when I said conjuring house, I swear to >> I'm holding it like this the entire time. I mean, we can look if it's on camera. I didn't do anything to it. It was behind my back. Look at this. The top just broke completely. >> What? >> I was holding it behind my back. This >> whole thing just broke open. >> What the hell? That's never happened. >> I hope that's a good sign that they're like, \"Oh, I'm going to break your equipment before we even start.\" What kind of good sign could that possibly be to break something? On that note, we should start this investigation. Yeah. Let's go upstairs. Um I think I'm going to go to my room which is down that hallway. >> You guys have any? >> Should I give you a quick tour real quick so you guys are familiar? >> Sure. >> Let's do it. >> Okay. It's funny. When me and Brandon used to live here, like I would take this staircase to go to my room and he would take that one cuz his room was on the other side of the hall. We're finally upstairs. >> Here we go. >> We made it. >> I feel like you have been wanting us to come upstairs. We still have the re pod set up right over there. >> Mhm. It's like the ghost actually equipped dead silence. Oh my gosh, it is so quiet. It is eerily quiet. This was my room. >> Oh, nice. Okay, >> OG, >> let's go. >> This is so crazy. Sam and Kobe are here, bro. Like, this is a full circle moment. And you have played like the Ouija board here >> in the attic. >> In this attic? In >> this very attic. We played the Ouija board. >> Oh my god. I climbed up. You had an attic in your own room. >> Yeah. The reason why I wanted this room was cuz of the attic. >> Oh my god. >> I know. I know. And then this is where I woke up one morning with scratches on my back. >> Oh >> And you said that was like after the Coronado >> Hotel Del Coronado. I'll show you guys to my brother's room and then you guys can investigate there just in case. They're bouncing around the house. >> What the heck? >> It said like America, right? >> So it's another thing that led us here. >> Everything's been pointing upstairs. Okay. >> Well, hopefully they talk to us. >> That chair is terrifying, by the way. >> I don't know why there's a wrapped chair just sitting at the end of the hallway. >> My brother's room is actually empty. Oh, it's echoing. There was a huge leak in his room from like the ceiling and it just completely destroyed everything. >> Took like 6 months to like completely fix everything. >> Maybe the spirits hide here because like everywhere else they know like it's like occupied. >> True. Okay, I really hope we get some answers. I think there's multiple spirits. Is it something attached to me? Is it attached to the house? Is it attached to you guys? Like, did you guys bring something in right now? There could be multiple spirits for sure. >> Do we bring from the childhood home? >> Exactly. And the main thing is my parents just want to know what it is. All right. Good luck, guys. >> See y'all soon. Maybe 15 minutes. 20 minutes. >> 15 20 35. >> It's okay. At least I have Charlie and you guys have each other. >> See you on the other side. >> All right. Good luck, guys. >> Bye. >> Bye. >> Bye. [Music] You are going outside. >> I think they might be out here, baby. >> You think they're outside? >> I think they're out here. >> I just honestly wanted to see or what is this bal? Dang, dude. >> B is kind of dope. >> Nice little nice little chill out here, man. >> I'd be chilling out here, dude. If I was Broatis. >> Yeah, dude. He's got a candle out here, though. That's pretty sick. Maybe he's summoning some demons. >> He could be, honestly. >> To my old room. I am going to set up the reod here. I do feel like maybe if it's just me by myself, including my cameraman, maybe it'll have more answers and be a little bit more active. And this right here is an Alice box, which pretty much spits out words. Kind of the same thing like the spirit bridge earlier, which I can't get out of my head. But yeah, we're going to also have this and try to ask some questions to get to the bottom of whatever this thing is in here. >> Oh, we've got a mirror. >> Oh my god, look. Look, he's a mirror. Wait, >> is this the first portal we've seen in the house? >> I think so. >> Oh my god. >> Why do we have a mirror on a mirror? >> Wait, I was just kidding about this being the most haunted spot, but this reason could be. >> My name is Brian. I actually lived here, specifically in this room for about 7 years. >> Disease. >> Disease. I experienced a lot of hauntings in this house, and I'm just trying to figure out what is here. >> Revoked. As in it got removed from here. I don't think so. >> All right, guys. So, for our investigation, we are going to be using the envoy, which Oh. So, I don't know why this envoy keeps breaking, but we're going to just put it right here for a second. If there are spirits in this room, they can physically tap this or give their EMF energy to influence this device to say yes or no. So, we can literally figure out what this thing is. It's one of the only devices that's to do with physical touch. >> So now it's on the yes or no function. But again, just like this, if a spirit comes and physically touches it, you can choose yes or no. So if there is any spirits, >> yes. >> Yes. >> Immediately. Yes. >> Okay. >> My parents still say they hear noises, unexplainable noises. Can you tell me if you stay in this house? I want to know if this could possibly be my little sister Bianca and what your message is to me or our parents. >> Aim >> H >> boat. >> Boat. I have done a haunted investigation on two boats. The Queen Mary and the Star of India. Star of India. I got scratched on the back of my neck, I believe. And that that was also with Sam and Colby. >> Are there more than five of you in here or in this home? Yes. No. No. >> No. Never mind. What? No. >> There's not more than five. And >> maybe we can figure out exactly how many. We think there's one with Brian. We also think there's one definitely at this house. So, there's at least two. It >> No. >> No. >> Is there three spirits? >> No. >> No. >> No. Again, it just freaked out on No. No. No. No. No. >> So, is there four spirits in this house? Yes, >> it said yes. >> Perfect. >> Oh my god, it's >> double yes. >> Double yes. >> Okay, so you got it right. So there's four spirits in this house. Is this spirit from the star of India? >> Corner. >> Are you in the corner of the room right now? >> Nana. Result. >> Result. I want a clear answer. Did you follow me home after the star of India? Haunting. >> Haunting. Oh my gosh. Could it possibly be from the boat? That is the last thing I would ever think. >> Can you tell me if all of them are good? >> No. >> No. >> Double no. >> Yeah, double no. >> Oh my god, >> dude. It's answering twice. I wonder if there's two specifically right now with us. >> How many spirits are here with us? Is there two? >> Yes. >> Wait. Wow. You got that right on. >> This is crazy. Which means the other two might be with Brian. >> No. >> No. Maybe one. >> Is there one spirit with Brian? >> Yes. Oh my god. Did you get >> one spirit walking around? Two with us, one with Brian. >> Wait, is the spirit that's with Brian right now? Negative. >> Yes. >> Yes. >> Jane. >> I don't know of a Jane earlier. Didn't it say Janet? I'm not familiar with these names. Is this spirit a family member of mine? Monica. >> Monica. Jane and Monica. I don't know any of those. I wonder if they have any ties to my parents >> store. >> My dad owns a liquor store. We know there's four spirits here. >> Yes. >> Do you guys have evil intentions? >> No. >> Again, I think we're talking to two very nice spirits. Is there some entity in this home that does have evil intentions? >> Yes. >> Literally just Yes. again. Dude, were you talking to the two nice spirits? There's someone with Brian that's not good. And they said there's someone here that has evil intentions. >> Yeah. >> Are you going to ever hurt their family? >> Yes. >> Said yes. >> That's not good. >> That is not good. >> Yes. Again. >> Three yeses in a row. Yes. Yes. Yes. I'm going to try placing this in the corner in the closet >> soon. >> Soon. Like soon. It's going to tell me. I used to live here and my parents live here and I just want to get some answers for them because I just want to make sure they're safe. >> Choke. >> Choke. >> That's not good. >> Are the spirits who reside here ancestors or relatives? Yes. >> Yes. We've been talking to Rogue about possible Bianca, who is his little sister, and also his aunt. >> Yes. >> Yes. >> Both. >> So, both. >> Just to confirm, is the aunt and Bianca here with us cuz you're the good spirits. That's weird. It goes on to say, \"No.\" Wait, what? Are we only speaking to one of Rug's relatives? >> Yes. >> That's what it is. It's okay. That makes way more sense. >> Should we go check on Sam and Colby? >> Let's do it. I heard some screaming from over there. >> I did. I want to see what happened with them. >> Some good answers. >> I think I got some stuff, too. But it it was like messing with me. >> We found out that there are four spirits in this entire house >> right now currently, and two of them are good, but two of them have a negative intention. Oh gosh. And we learned that the two good ones were with us. So whatever you were talking to. >> No, it was one of the darker spirits. And of course it said for choke. It said choke. Oh my god. It said boat. And I said we've been on a boat together. The star of India. >> You're right. >> And I had gotten scratched there. >> Yeah. >> And I said, \"Are you a spirit that followed me from the Star of India?\" And it said haunting. It's We asked, \"Are the negative spirits something that came with us tonight?\" And it said, \"Yes.\" So, what if it's from a place that we've all been to together? What's crazy is there are spirits here that have been here for a long time. We're pretty sure one of the spirits that we're talking to was your relative. >> We're not sure if it was Bianca or your aunt. >> Yeah. >> But one was in here with us. >> Yeah. It's crazy that like wouldn't you think that they would be with me? Maybe they were scared of the thing that we brought in, you know. Wait, that's true. The only thing that I'm afraid of is we were talking too in here. You were talking to one negative entity. Where is the last one? That is so scary to think of. Like the the image in my head right now is that it's like sneaking around the house. It's like peeking in here, peeking through there, probably walking around. Like would that make sense? Because the entire time we've been here, the answers are kind of unclear, but it's always there's one thing out in the distance. There's footsteps, there's creeks, there's like a voice in the distance. It's like it's not giving us direct answers. Maybe that's what's been screwing with us this entire night. But what we could do is maybe we could combine the two. Like if we were getting the good and you were getting the dark, maybe we meet in the middle right here at the top of the staircase. Oh, in between we could do the essence and hopefully we're going to get a lot of collaboration of like all the spirits. I actually like that idea, dude. Oh my gosh. We haven't had activity on the reod all night and now they're both going off. >> We have dual re pods set up. That one's going insane. It is weird though. Again, we haven't had activity with the reod all night and now it's just freaking out right before we do the final. >> Absolutely no activity with the re pod, by the way. Like nothing. We are about to do the essence method. If you could stay up here with us. So, like as you can see, Sam and Colby are like far enough that it won't make the reod go off. See? >> Nothing at all. >> So, if it's them, it's going to be them, not us. So, you guys have all the info, lots of questions to ask. Get me out of the Estis method if things get hectic, please. >> We'll do. We'll do. >> Time for the finale, guys. If you don't know what the Estus method is, we have the spirit box that goes through different radio stations at a fast speed. >> Spirits can basically use their EMF energy to choose a word from those radio stations. And I'm going to be blindfolded so I don't see anything and wearing noise cancelling headphones so I don't hear the questions they're asking. So if I'm saying things that make sense then we're communicating. >> Mhm. >> There was a huge crack too guys. It's feeling more active. >> Yeah. I mean >> what the was that was a massive crack >> downstairs. Wait. That was going off. >> Wait. That was like a boom. >> Yeah. I don't even know how to describe this. >> No, no, no. That sounded like a metal gate. >> Wish I ran out. >> Wait, wait. Is there a voice? >> There's somebody here. >> Oh, it might be my parents. Oh, if it's not my parents, we're cooked. Someone's >> There's somebody here. >> Hello. Oh my gosh. >> There's definitely somebody here. >> Oh, both of these now. >> Wait, it better be my parents. But they said 20 minutes away like 5 minutes ago. >> Hello, mom. Dad. >> Hi. Oh. Oh, thank Oh, we just got super scared. Wait, mom, you got sick. >> Scared of me. >> Are you serious? >> Yeah. Don't get near me. I just got ankle. >> Wait, I'm so sorry. >> It's okay. It's not your fault. >> Wait, were you feeling sick before you left? >> Like earlier, I felt like a headache and stuff, but it got so much worse. My nose. >> I just hope it has nothing to do with like what we're doing. >> Well, let's see. >> No, no, mom. Please. I hope you feel better. >> Oh, yeah. Yeah. from. Hi guys. >> Hi. >> Hope you feel better. >> Good night, >> dude. That has nothing to do with what we're doing because >> I think they're all here. >> Oh my god, dude. It's like something followed you. >> As soon as my parents got here, it's like happy that my parents are here. Maybe. >> Yeah. I'm really curious if now it's going to be more active than ever. >> Oh my gosh. Temperature change >> both and then >> at the same time. >> So, it's weird. Why is the temperature not changing on that? Mhm. >> You know what I mean? Like, is it just like colder or hotter on one side? >> Do you guys hear how loud this is, by the way? >> So loud, dude. >> I'm going to be able to hear anything. Rug, can you hear us? >> Can you hear us? Okay. >> Can you confirm how many people are here with us in the room? >> Earlier you said four. Is there four spirits still here? >> Many. >> Many. Wa. >> Oh my god. Or is there another? >> It can be. It can. >> It can be many. Are you saying that there's a way that new spirits come in and out of this house? >> Did you hear that? It's coming from Brandon's room. The portal. Is there a portal in Brandon's room? >> What you owe? Here. >> Here. >> Here. So, you said there there can be many people here. Is there a reason? >> Soon. >> Soon. >> There will be a reason. >> Oh my god. It said flu. >> No, it didn't. I swear it just said, \"Was there a reason that there's many people here?\" And then it said, \"Soon?\" We should see if we can get them away. I think so. >> Are the two negative entities here because of us? >> Were we the ones that brought the negative entities here? Can you confirm that? >> I just can't. >> I just can't confirm that. Why is the spirit that we're talking to right now have any >> give now? >> Give now. >> Give now. Does something here make mama rug sick? >> Never. >> That sounded sarcastic. Like never. >> Do us three have two attachments. >> Could be from something. Could be from >> I feel like we're talking to one of the good spirits right now. >> Mhm. And they just don't know where these attachments are from. >> Yeah. Do you think it could be from the Star of India investigation or do you just not know? >> History. >> I heard that. >> Mhm. >> History could be from >> It's from a long time ago. >> Yeah, bro. >> I'm like not getting clear answer. >> We were talking to a good spirit. I think it confirmed that we do have two negative entities following us three. It's not really sure like where it's from, but you said vote before, so I was thinking it was Star of India, but we don't know. We asked it and said history. Like some place with history. >> History. >> But that could be so many places. >> It could be. Yeah. Whaily house. >> Anywhere we went. >> Literally everywhere. >> Okay. Maybe one of you guys tried just in case I'm like missing it. >> Okay. So, what's the update? It's that So, we confirmed that there's many spirits here and that it was going to tell us some reason why or message soon. We don't know what the message is or where it came from. >> Can you tell us where you came from? >> Can you show? >> Show. You'll show us where you came from. Weird. The left side. >> Can you let us know that any negative entity here will not stay here? >> You brought >> the ones that we brought. >> Oh, will you leave? >> Terrible. >> The ones that we brought were terrible. So, we're probably talking to the nicer spirits. Can you figure out what those other entities intentions are? Why are they with us? >> Won't. >> It won't. You won't be able to figure out >> grave. >> Grave. >> I just want to make sure that my parents are going to be safe after this investigation. Like whatever it is that's negative here is not going to stay in this house. >> House. >> Yes. Can you confirm that no one in this house will be harmed once we leave? >> Well done. >> That doesn't sound super >> Yes. >> Yes. >> Okay. So, >> it's like a delayed answer, but I think that was confirmation. Yes. >> That no one will be harmed in this house >> once we leave. >> Reputation. >> Reputation. Well, those spirits that leave this house try to harm anybody else. >> Who? >> The spirit. >> Scratch. >> Hatch. Is this the spirit that scratched me in this house? >> You could try. >> I could try. Have you scratched Brian before? can't lose. >> Can I ask who the good spirits are that actually reside here? Are they both relatives? >> Family. >> Oh. Oh, okay. >> That's awesome. >> Okay, that's amazing. That's amazing. So, the positive spirits here are your relatives, are your family, and they're probably not happy that like we brought something negative here for the night. >> I'm a tell. >> Is that why that you you really haven't been talking with us too much tonight? It's because you weren't happy. >> Oh, that's not why. >> No. >> Can you give me one of the names of the good spirits that reside here? Can you give us the name of one? >> You know, coming through. >> You know, it's the one coming through. Oh, got >> hot. >> Oh. Oh. Oh, >> that's the temperature. >> The temperature just changed. He said hot. Is that you coming up and standing next to us? >> Is this beyond >> at the stairs? >> Yeah. >> Forever. >> Look, as long as the good spirits are going to stay here with my parents and protect them and know that like, you know, nothing bad will happen. >> Yeah. >> Over. >> I just want to ensure that we take the negative spirits with us. Like even if it if it's with me, you know. >> Can you see the negative entities? >> Help. >> Oh gosh. Help. Can please >> can please >> in between? >> They're in between us. >> Are they right next to us? >> Travel is here. >> Could it be attached to just the house? >> They're with you. >> They're with us. So, it's not necessarily the house. I think the relatives are here, but there's two other ones that are with us. >> Okay. >> Leave behind. >> Huh? >> We don't want to leave them behind. >> No. No, we're not leaving them here. The spirits are not welcome to be left behind here. This is not their home. >> Home? >> No. >> Oh my god. It's saying that like they want to be left here. Maybe. >> No. No. No. No. No. You are not welcome to stay here. You're going to leave this house with us. The good spirits are staying here. The negative ones are leaving. >> That's right. >> Okay. >> I'm staying. >> No. >> Your fault. H >> the negative entities are not welcome to stay in this house. As soon as we leave, you're leaving, too. >> To the spirits of Rogu's family, can you help us ensure that they leave the house tonight? >> No power. >> We don't have power to do that. >> Oh gosh. >> What do we do to make sure that the negative entities do not stay here? >> I made that happen. >> Like might. >> Yeah, maybe. Can you just confirm one more time that the negative spirits will not stay here once we leave? I just need confirmation. >> Good for each other. >> Can we get them out? >> I think so. >> Did that make any sense? >> Yeah. >> Did it actually? >> We pretty much don't have like a fullblown confirmation if like the negative entities want to leave. So, I feel like we just have to be demanding and put our foot down and just let them know they are not welcome to stay here and they have to leave. There's a good chance they will leave with us, but we want to do something to force them out. >> Okay, we're back to where we started. We got the holy water here, and we're going to just ensure my parents safety first and foremost. So, >> starting here, and then maybe we go like up the staircase, around, down the staircase, and then out the door. >> So, even like just on the couch or >> Yeah, just around the area. >> Little flicks. Just >> make sure >> no negative entities can stay here. You must follow us home. here. Any negative entities that are in this house right now must leave. You cannot stay here. Any negative entities are not welcome to stay. Any last words to all the spirits that are here that came with us tonight? You must leave with us as well. You are not welcome to stay here. This is not your home. >> We repeat, you cannot stay here. any negative entities must attach to us and follow us home. You do not stay here. You follow us. >> We kind of got some answers and we kind of didn't. But the good thing is that we know that there are two family members that stay here with my parents. >> So your house is definitely haunted and in a good way. >> In a good way. >> And even if we were to bring some negativity here, I think they are going to leave with us. But please keep us updated over the next like week like if everything's okay. >> For sure I will. Thank you so much for watching today's video. Please be sure to drop a like, hit that subscribe button, go show some love to Sam and Colby. >> It's hell month. >> It's hell month. >> It's hell month coming out soon. >> All right, guys. Get out of here. Peace.",
    "start_time": 2.72,
    "end_time": 3099.16
}