{
    "video_id": "vAFnZjy8uTM",
    "channel_url": "@rug",
    "transcript": "Recently, I've become obsessed with blind boxes because you never know what you can get. And even better, you might just pull a rare secret from Laboos to Skull Pandas and even sign memorabilia. Today, I'm going to be buying a blind box from every store that you didn't even realize sells them. Stores like Five Below all the way to a Halloween costume store. And my goal, find as many secrets as possible. But before all that, I think it's a good time to start things off with a classic Faze rug vlog. Hope you enjoy. All right, guys. It is the best time of the year. It's the beginning of the burr months. Kayla told me to say that. >> Yeah, the burr months. >> September, October, November, December. We are here at Spirit Halloween because every year I think they come out with new animatronics and I'm obsessed with Halloween. I'm obsessed with spooky stuff. I saw on Tik Tok they had like the Squid Game red light green light girl. I don't think you could purchase it, but that would be so sick to have in my house. So, let's see if they have it at this spirit. Wait, no, they upgraded. Dang, what a crazy entrance. >> I'm scared. >> We got the nun. Oh, it's like a haunted house but in the daytime. >> I just know, Brian, this one if you stand there, she's going to scare you so bad. >> Oh, I guess not. >> Turn around. She's going to turn her head. >> She jump. >> Sorry. I'm sorry. I'm sorry. Wait, that's crazy. Does he come to life? >> Hello. >> I'm scared in here. I don't like this. >> It's too much going on. Hey, they upgraded spirit Halloween, bro. Hey, we got to find the red light, green light girl. >> Not everyone who does gets to live to tell about it. >> Okay, >> bestie. Guys, I'm trying to buy one or two animatronics for my house just to get into that spirit. Look. Oh my gosh, this actually works. >> Does it? >> It has a footprint. Ready? Here we go. >> You will be playing red light, green light, >> green light, >> red light. >> Oh, move. Let's see what happens. She's scanning. >> Player eliminated. >> Oh, >> I got eliminated. At least it's not like the show, right? Where I actually just get eliminated. >> This is cool. They have their own Squid Game section. >> This is your store. Can I please buy it? >> You would be number five on the list, dude. >> Really? Five people have asked? I knew it. I knew I would pay so much money. >> So, how's this going to work? How's this going to work? >> We go to the first one and the first one doesn't want it. Then we call the second one. Second one doesn't want it. We just go down the list. >> How can I like bump myself up? I can't remember. >> You can't. No. >> Wait, hold on. That's a strat right there. Wait a minute. It's me. For some reason, >> it's a duck. >> For some reason, everyone in my family calls me Jigsaw. My challenges are not that intense. I'm sure everyone out there watching can participate in a Faze rug challenge without calling me Jigsaw, right? >> You don't have any idea. >> It's not that bad. They're just fun. Like, if you lose, you lose. Chucky the Duck, Michael Myers, Beetlejuice. Oh man. >> Oh, look at these. They're like mystery stuff, >> guys. So, I've been into this mystery box stuff with like Laboos and different collectibles. I wonder if you can actually get a secret out of one of these. >> I don't know if they have secrets. >> Exclusive exclusive A and exclusive B. Wait, >> but they have the terrifier, too. >> Is this the new wave of like all these secrets? Like, even with this Sonic, they got exclusive A and exclusive B, too. Wo. We might have to get some and unbox them. Mhm. >> Okay, we're going to get one of each and hope to get the exclusive Freddy Krueger mug. >> Oh, this one's cool, too. >> Scream for my coffee. >> Uh-huh. >> I'll take that. Do you want anything? >> Yeah. You pick me one out. I'm putting it in your hand. >> Don't lie to my viewers. What? You used to have a crush on Jason Vorhees. You used to have a crush on him. >> Absolutely not. >> Really? You guys both like swimming. >> I think you're just making things up. >> Just throw that in there for you. >> Speaking of your crush, >> it's not my crush. >> Yeah, you used to like Jason Boris. It's fine, >> guys. Brian has been on this kick of lying lately where he tells people things that are absolutely absurd. >> I just think it's it's trolling. >> No. And then he doesn't tell them that he's kidding. And so people come to me and ask me questions like, \"Oh, did this really happen?\" >> I'm sorry. It's just funny. They got so much guys. Oh my god. >> This is what your baby's going to look like. >> What the heck? Wait, he lowkey does look like me, bro. This is like a a kid in a candy store for me. >> I'm excited to open like the things we got. I feel like we're going to get something cool. We need to find one animatronic that we're both happy about. >> Okay, >> this would be sick in my house. Imagine in the living room >> when people walk in. >> More clowning around. It's time for >> Oh, come on. >> That wasn't even scary. Wait, a terrifier. Is this an animatronic though? >> Head and torso move left and right and hands wave. >> Low key, I want a terrifier one cuz the terrifier is like he's becoming one of my new favorite horror characters, but they're sold out of a lot of his stuff. art is absolutely terrifying. >> Terrifying. Uhhuh. >> Wait, I didn't do that on purpose. That's crazy. Or did I? >> All right, we're going to stop recording and then we're going to find the animatronic. We'll pick it up outside. [Music] I actually got scared. [Music] We had to make a donation to a Rady's Children's Hospital. Give it a little signature here. There we go. All right, guys. We found where we're going to put Art the Clown right here. So, at the entrance way, but we got a lot of work to do. >> We do. >> You ready? >> I'm ready. >> All right, let's do it. Okay, 5 minutes in. It's a lot easier than I thought. >> Yeah, I told you we would get this done in an hour. >> We're on step eight and there's 24 steps. >> Shout out Kobe. >> Mhm. >> Okay, we're going to finish this up, guys. [Music] >> Guys, I stand corrected. This was actually a lot more complex than we thought. Let's just say we didn't put half the screws that we needed to cuz we physically weren't able to do it. Remember when you said like this is going to take a long time, but the thing says estimated build time is 10 minutes >> for who? Papa rug. Maybe >> probably >> not for us. Damn. Hold up now. Oh. >> Oh my god. >> Oh my god. He waved. >> I turned the volume down because I think it's copyright. But let's hear it for a second. [Music] >> She doesn't like art. She doesn't sit. We did it. All right, guys. We just pulled up to my parents house and we actually have a special guest here who flew in from Arizona. We got my boy Dennis. And for those who don't know the story behind Dennis, he actually was a huge, huge supporter back in the day. He used to watch my videos, my brother's videos, my parents' videos, and my brother flew him out one day and he became family almost instantly. So, I thought it would be a good idea to put him in the hot seat and quiz him on our old old videos to see how big of a supporter he actually was. Yo. All right, brother. Hey, what was that? We have to make up for it, bro. What was up, bro? >> What up? >> What a good makeup. Hey, >> we're locked in. Okay, wait. Let's get Papa run. >> I don't know. I'll try. I'll try. >> Okay, here we go. >> Hey, that was all right. That was all right. >> All right. Decent. Decent. >> Dennis is here. >> Dennis, you want to tell all the viewers out there how you became so close with us? Wait, my turn. My turn. Uh, so I was a huge supporter of my boys right here, the whole family. Thank you, bro. >> This is a guy came out to Arizona sadly. And we met as like he was a fan. I was the YouTuber. And now we're literally like >> brothers, >> brothers, best friends. He's part of the family like in my parents house. He sleeps at my house. He hangs out with Rug all day. And it went from being a supporter to this. It's crazy. >> So you never know to all the supporters out there. >> For real. I always say that. But Dennis, I was thinking we put you on the hot seat and we all quiz you on our old videos just to see how big of a supporter you really were. I'm so scared. >> Oh yeah, and I want everyone out there to play along too to see like if you guys know anything about the history of Faze Rug and the fam. Okay, Dennis, what was the very first prank I pulled on Brandon? >> Was it the Gatorade prank? >> No. Oh, for one, it's the winning the lottery prank. You remember that? >> Yeah, I knew that, too, bro. This question you would not know unless you're a huge fan of the family. Who is my favorite basketball team? >> Oh my god. >> It has to go back to this, bro. Lakers. >> Yes. >> Yeah, that's correct. That's correct. There you go. >> Yeah. Back then >> Dennis. Dennis. Dennis. I don't know if you're going to answer this. What was our most popular video in our channel? >> The Lego tower. >> The Lego tower. >> Definitely popular. >> Okay. Okay. Elite ball knowledge. Okay. >> All right. What was the name of my zombie girlfriend? >> I know it. >> What? >> Uh, Debbie. >> Oh, >> you got it. Okay, you're doing good. We'll have one more question for me. >> When me and Brian used to film YouTube videos before he was even rugged, we did the father son Calaldian show. My brother was looking for his girlfriend in one of the drawers. What was her name? >> Oh my gosh, that's so good. >> Oh, I know it. >> Huh? Vanessa. >> Yeah. Yeah. Hi. Is this Vanessa? >> Let me check if my parents are haunted. >> Okay, Dennis, how did I discover the haunted tunnel? >> I don't even know this. And I'm his brother. >> I was playing a certain game. >> So, which game you play? >> Pretty much. >> Pokémon Go. >> Pokémon Go. >> We went to go hunt Pokémons and Anthony knew about a tunnel and I was like, \"Okay, sure.\" Like, we'll go there. And then my phone started glitching and going crazy and we heard a noise and I ran out and that's how the haunted tunnel was born. And the rest was history with >> The rest was history. Dennis, you did good. I'm not going to lie. I put you on the spot. >> You killed it. Hey, let me know if you guys knew any of those answers. >> Hi, Dennis. >> Hey, well, don't be zooming in, bro. >> No, you look good. You look handsome, bro. Dennis, we're going to open these, okay? I found them at Spirit Halloween. Each of them could possibly have an exclusive. That's lit. I've never done anything trying to open like a rare item. So, >> bro, it's so fun. What do you think about the fit, bro? This is literally a 2K 26 outfit. I think. Wait, I think I'm actually wearing this shirt in 2K26. The same exact one. >> Okay. What do you want to do? I want to go for horror first. >> Okay, go for it. What's the secret? I said this at Spirit Halloween. Tell me that's not the detective or the food inspector that goes and he chokes on like the fly. >> Oh, I know what you're talking about. >> And he has the hat. >> Yeah. Yeah. Yeah, that could be. But is this the Doodle Bob? Whatever. >> It looks like Doodle Bob, right? That would be insane. >> Doodle Bob would be the best. >> You open yours first. Oh my god. Please be Doodle Bob. Sleepy Doodle Bob. Is that Mr. Krabs? >> Yes. It's the sweet victory one. >> Okay, we got the horror one. What's the mystery one? There's two. This looks like It the Clown, though. >> The Nun. >> I'm not going to lie, I like the Nun. You remember when we were playing what's it called? >> We were playing the Conjuring map on Fortnite and the Nun was popping up out of nowhere like, \"Ooh, I want to open Ghost Face.\" >> Do it. What's in the back? >> So, we can get two exclusives from Ghost Face. So, let's do it. >> There you go. >> Okay. Don't lose. Don't look. Don't look. Call me. >> Call me. Reach me if you want to reach me. If you want to reach me, it's okay. >> Is that a regular one? >> Oh, I didn't see it till last second. >> Hey, I messed with this one, though. >> I should have got more of these. These are sick. But we have three more chances right now. Okay, Dennis, you're next. >> I want to do this one. >> Okay, Chills and Thrills. There's Georgie from It. There's Pennywise, Freddy Krueger, Sandorm. Don't look. It should be like covered though. It should be covered. >> It's not. I feel it. >> Really? Okay. Ready? >> Darn it. No, >> Freddy. It's not The Secret, but it's Freddy Krueger. >> Yeah, I'll take Freddy Krueger. >> I'll go with The Nightmare Before Christmas. Two exclusives you can get. >> No. >> Oh, no. Is that a secret? No. >> Where? Where? >> The Lochness Monster. Dennis. Last one. It's Beetlejuice. There's two secrets you can get. Oh no. I already feel it. >> What is it? >> I just feel like it's not a secret. >> Can you tell me what you think? >> Who knows? Who knows? Dennis, please. >> I already know what it is. Can I tell you? >> Yeah. Which one is this? The tombstone. Ready? Tombstone pile driver. You guessed it. Beetlejuice tombstone. We didn't get a secret, but this is Bro, these are so sick for Halloween. >> We got the lit ones out of all of them, I think. >> All right, Dennis, which one do you want? This is going to hold a a good memory. >> What I want you to keep for memory for us is the none. >> Okay, >> I'll take my first ever opening. So, I'll take Mr. Krabs. >> By the way, these are not the only blind boxes that I'm going to be opening in this video. There's still a lot more coming up, so stay tuned. All right. Good morning, guys. We got my cup of Scream coffee right here. >> What's up, guys? I just woke up, but it's a big day. I don't know if I'm just getting old because I'm very excited about what we're doing today at my house, but we're switching out my garage doors. Okay, I don't know if that's a UNC thing. I don't know if that's a age thing, but I'm very, very excited about it. But I can't I can't go down the stairs now. Can I please can I go down? Okay, she's going to lead the way. But I do want to show you guys how old and loud and creaky my garage doors are and how excited I am for the new ones. Listen to the garage. Okay, you're probably going to cringe. It's really bad. [Music] Sheesh, man. And to be honest, I just want to upgrade and modernize the garage and the look of it cuz you know, the house itself is very beautiful. It's white. It's modern. But I feel like the garage doors just don't go with it. So, we're about to have a big upgrade. Again, I don't know if this is something that excites you guys, but I don't know. Let me know in the comment section down below if you want me to ever record renovations in my house. Like, my dad, Papa Rug, does that all the time at his house, and a lot of people seem to enjoy it. So, let me know if you guys want me to record me renovating. But, this is going to be a good start. Okay, now we wait. I think I'll set up a GoPro or something for like a time lapse, but should take a few hours. Let's get a nice cold start on the Lambo. [Music] All right, guys. Just had to move the car out of the garage to give them space to work with in there. Also, I don't really know what this vlog is. I kind of want to just pick up the camera and record my day-to-day life for a few days and put it together in one video cuz I know some people actually enjoy these raw OG types of vlogs. So, if you're one of those people, please show your support. Show yourselves in the comment section. Drop a like on this video cuz I personally love making these videos. And I actually have a team call in about 10 minutes. And yeah, this is a standard Monday morning in the life of FaZe rug. Let's go. On the way to the greatest room of all time. Literally feels like I'm entering a new world when I go into my game room. Here it is. Oh my god. I didn't realize I look this chopped when I wake up. >> You don't look chopped. Don't be so hard on >> chat. Is this chopped in the morning or is this is this normal? All right, guys. My garage doors are officially done. We have both of them opened right now. I have yet to see them fully closed on this side. So, I'm very excited to see the transformation. And I actually could do it from my phone, which is sick. I couldn't do that before. They look sick. >> Great. They look so good. They're so quiet out here compared to the other ones. >> Yeah. Am I good to turn around? >> They're down. >> Oh, now this matches the vibe of my house. This is what the house should have come with before. Wow. What a huge upgrade. This reminds me of Minecraft for some reason. Hey, shout out to the company that came and did it. Shout out to the kid that I met. He's a huge fan. So, if you're watching this, I appreciate you. Let me know what you guys think in the comment section down below. All right, guys. So, Kayn and I just pulled up to the mall because we want to open some more blind boxes. And you guys won't believe how many stores actually have blind boxes now. For example, the spirit Halloween one that me and Dennis unboxed earlier in the video. I've really been into collectibles lately. And if you guys have been enjoying videos like this, please show some support. Drop a like. We're honestly just going to go walk into stores and see what they have cuz from what I've seen online, they got stores like Five Below, Spencers, just a bunch of different stores where you could buy something and possibly pull a rare item. So So we're going to go around and try to find some. >> Yep. Let's do it. I'm ready. >> All right. All right, guys. We just pulled up to Mo and right when you walk in, it literally says free blind box for your birthday. Okay. See, this is what we're looking for, guys. We're looking for the question mark. says mystery. Guys, by the way, blind boxes aren't necessarily only meant for the secret. That's just what we're hunting. But you can actually just what? >> Care Bear one. >> Do they have secret? >> It does. Yes. Hidden items. But some people actually just get them to hunt for something they see on the box. Like if someone gets this, they're like, \"Oh, I really want the purple one.\" Like that's what they're hunting for. But we going for the hard ones. No way. Wait. This is sick. Snoopy. And there's two secrets you can get. 1 in 48 chance and 1 in 96 chance. A super slurp prize and a super duper slurp prize. We're getting a lot of these ones. Here we go. Watch this. Clearing the shelves. What is this one? Donald Duck. Oh my gosh. Yo. >> Oh yeah, it shows what it is. But look at how cool it is. It's a Walt Disney one. I think we got our secrets for the day or just from the store, actually. All right, so >> wo scary. >> All right, guys. So, we're starting with the peanuts plus Rockyoto. The cool thing I noticed about this is each one has a different chance. 1 in 6, 1 in 12, 1 in 48, 1 in 96. So, you already know we're going for that secret. Mhm. >> Cup of noodles. Wo! I love the little bags it comes in. I don't even know what the secret's supposed to look like, so we're actually just going to be shocked. These are good size. Okay, so I'm going to assume that this isn't the secret. >> No, this is the one in four. Snoopy. >> All right, we're going for not the Snoopy one. Come on. Not Snoopy. Not Snoopy. Not Snoopy. Okay. No, we got the one in four one again. But that's the astronaut one. >> Wait, >> the space traveler. >> Wait, this is the space traveler one. Look at the back. So this is actually one in 12. Wait, Kaitlin, >> this is Joe Pool. >> One in six. >> For some reason, I thought you got the secret. I was like, I see red. >> Oh my gosh. >> What' you get? >> What is this? Is that a secret? >> Flying. >> No. Okay. Okay. Wait. This is sick. Vagle Scout. Hey, we've gotten different ones every single time. So, we've gotten every single one except Woodstock and one of the secrets. Yeah. >> Secret. Secret. No, we got Joe. Cool. >> And we got Woodstock. >> Woodstock. That's the one in 12 chance. >> Cool. Well, at least we got all different ones. >> We got Space Traveler and Woodstock, which are like the hardest probabilities besides the secret. So, on to the next. >> Should we do Care Bear? >> Yes. >> So, this one, it doesn't save a chance. Oh, it does. One in 36. That's promising. >> Oh my gosh. Purple. >> Wait. >> Wait. >> Did you get it? >> Wait. Hold on. >> I think you got it. >> Sweet dreams. Is it on there? >> No. >> Shut the hell up. Wait, did I just get the secret? >> I think so. >> We got the secret. We got the secret. >> How? How is >> 30-year-old man getting excited about a secret? >> Wait, wait, wait, wait, wait. They turn on. >> What? >> Okay, >> that makes it even cooler. >> Okay, hold on. Wait. What did you get? >> I don't know. >> Secret. Secret. Secret. >> Cool. >> So, you got the birthday bear celebration star. Look, it's a it's a cake. >> Oh my gosh. Stop. >> I love it. >> Yo. Oh, >> that is so stinking cute. Hopeful heart bear. >> Hopeful heart. All right, we got the secret from the Care Bears. Let's go. And >> yeah, the cool thing about these blind boxes is some of them come with like stands just how like my Care Bear came with the pillow. Oh. Oh, we got the birthday boy celebrating duck. >> Got the three pirates. >> Dude, the Oh, wait a minute. >> I know. Their cards are cool. Holographic. >> You see that moving? >> Cute. >> That actually looks so sick, bro. >> We love that. >> They took their time with this. They got holographic cards. I can't imagine what the secret's going to be. Oh, this comes with like some accessories. I got photo duck. >> Ryan, you're running out of space in your house for these little figurines. >> I have too many. They're piling up. >> That's why we got to do more giveaways. >> I agree. >> Here we go. >> A >> Oh, >> me too. >> Really? So, this one is Daisy. Is that the pirates that you got? >> Oh, I got Scrooge. >> Oh, okay. >> One at least. Last one. You can do the honors. You're the lucky one. >> Okay, let's keep it going. If not this, like I said, more stores. Four stores and seven years ago. >> What is this one? Why is his head upside down? >> Oh, it's the raised butt. >> The raised butt. >> Boy, >> look back at it. Look back at it. These are cool. Honestly, although we didn't get the secret from these, we still got some really nice figures. >> Uh-huh. So far, one secret. >> And it lights up, too. Should we go find more stores? >> Let's go. >> Let's go. Before we head to our next blind box opening, we're going to get a fortune cookie because last time we got a fortune cookie, we pulled the Umbreon in 18 packs. So, it's my new good luck charm. I think the fortune said with great risk comes great reward. >> Ooh, okay. We were wondering if we could just buy two fortune cookies. No, they're free. >> Really? They're free? >> Oh my gosh. Thank you. Thank you so much. Appreciate it. Thank you. >> Thank you. >> All right. We open them now on the way to our next spot. So, this is how I do it. >> Mhm. >> Hi. How are you? >> Are you being rug? >> Mhm. >> I watch your videos. >> Thank you so much. Come back now. Where? >> I don't see it. >> Where did it go? Oh, is it? Can I grab it? >> Oh, >> you ate it. >> Oh, maybe don't do that. Okay, it's still readable. Your generosity never ceases to impress those around you. >> 100% facts. Mine says, \"An unexpected windfall will soon be yours.\" So, is that feeling good? >> That's a secret. >> You want to take a photo? >> Yes. >> Sorry, I almost choked on my fortune cookie. >> Okay, >> I'm okay. I'm good. I'm good. Thank you. >> Awesome. >> Awesome. Thank you guys so much. Enjoy your night. Thank you. >> Okay. I swear we heard screaming twice when you started recording. I don't know if you caught that one. >> I did. But guys, we found a Popart vending machine with a bunch of different blind boxes. So, we're going to test our luck here. We'll just get one in one. >> Perfect. >> So, that skull panda is nice. I wonder if they have a secret, though. It's $30.99. It says it's hot. Secret. Symphony of wishes is the secret. Oo, >> it's like a party. Your >> items are ready. >> That is so cool. >> Open. >> Wow. Your item is ready. >> I like that. >> This is so cool. I have a lot of skull pandas at home, too. >> Yeah. And we haven't gone the secrets from that yet. Here we go. >> Come on. The all red. It's not red. >> Oh my gosh. But stop. >> That's nice. >> These are so cute. >> You got Song of Snow. >> Okay. I love that. Let's see what you get. >> Darn it. I saw what it was. >> No, >> it was the Wanderer's Tomb. Look at what I just got. Their eyes move, too. So sick. This one's the wanderer's tomb. Hey, although we didn't get the secret, these are still nice. I like All right, guys. It's getting late tonight, so we're going to pick this up tomorrow. And our battery's running out of c battery. >> Our battery is running out of camera. >> I'm running out of battery, but our camera's running out of battery. We didn't bring an extra one by accident. So, we're going to pick this up tomorrow and open more blind boxes. But I hope you guys are enjoying so far. I promise you we're opening another secret. >> Mhm. >> All right, guys. We are kicking off the day at Five Below, which is a place where mostly everything is $5 and below. Very convenient. And I just saw some Tik Toks that they got some blind boxes in there. And I may or may not have seen Spongebob. So, we got to get the secret Spongebob. Whatever it is. Oh, and did I mention my candies at All Five Belows? So, we got to hunt for that first. Here we go. Freeze-dried sour strips, peach rings, watermelon. These are bomb. I will say my favorite oneup out right now though are the fruit chews. They're our first ever non freeze-dried candy that we dropped and they are so fire. They sell out like that. So, if you see them, make sure you get your hands on them. Oh, here we go. Mystery Pop minis. They got Harry Potter. One in 72 is Harry himself. Wait, there's snow globes. A snow globe one. Wait, this is kind of sick. And these are all $5. This is actually a really good price. By the way, guys, this hobby of opening blind boxes is not about spending a lot of money. It's about collecting items that I personally find interesting. So, I don't want you guys to think that in order to open blind boxes, you have to spend a lot of money. Do it at your own pace. Have fun with it. And even if you don't want to open blind boxes, experience it through the lens of watching a Faze Rug video. That's what it's all about. feeling like you're always there on the adventure with me. So, let's see what else they got here. Oh, Marvel. Hold up now. Oh, yo, the one in 72 is crazy. Even the one in 24, the white one. Wait, they got some cool stuff. Spongebob. Oh my gosh. Wait, this one's open. People were peeking, bro. Wait, look. No, that's messed up. That's messed up. These are open. Wait a minute. That is crazy. They literally opened every single one. Oh, they have more there. Opened, dude. Okay, this one's not open. They gave up. You know what? We're going to get more of the Spongebob ones cuz I love Spongebob. I don't know why I'm more excited about these than the other ones cuz I actually know all the characters. All right, we're about to check out. Can't forget One Up for the rest of the day. We should do like a blind box of OneUp or Oh my gosh, even better. What if we did a blind box, a Faze rug blind box, and we had like figurines and we had like a rare character that gets unlocked? Like either I could be the rare character, maybe Bosley. That's like one in 96 that you can open. And then you can get all my other like family members. Oh, yo, that's a crazy idea. I might have to cook on that. I'm not going to lie. A phase rug blind box. Honestly, guys, for all of these blind boxes, like we got at least 20 to 25. 109 bucks is not bad. Bag secured. Now it's time for a secret. There we go. We'll go with the Spongebob one. The non-opened Spongebob ones. It looks like the rare is like the shape of a coffin. I'm going to assume it's that one episode. It was the he was number one. But let's find out cuz we're going to get it. Oh, I saw yellow. I'm thinking it. Oh, Patrick W hit. We got Patrick for the first one. Sandy cheeks. I want Doodlebop. I know that's not the secret, but I actually like Oh, Squidward. Okay. Okay. So, we got three out of six so far. I'm feeling a rare coming. Another Squidward. I don't want Squidward twice, bro. He was so mean. Final Spongebob. Give us the rare. Oh, hell no. Bro, we got three Squidwards in a row, bro. Oh, well. All right, Spongebob is done. We did not get the rare. Oh, we got some nice little keychains. Okay, next we'll go with I really like the Harry Potter globes. If I were to guess which house I would be in, it would be uh Gryffindor. These are snow globes, which are sick. You could get two of them that are one out of 72. I think it's Hermione and Harry in a snow globe. Here we go. Wa wa. Wait a minute. These are sick. These are actually crazy. Which one is this? So, this is a 1 in six. So, this is like a high possibility of getting. So, honestly, I would even be happy if we got like a 1 in 12. Something that's just harder to get. Oh, what is this one? Yo, wait. I don't think this is 1 in six. Oh, 1 in 24. 1 in 24 chances and we got it. Okay, come on. Give us Harry, Wingardium, Liviosa, Hagrid. One in 12. Not bad. It's not the one in six, but it's the one in 12 one. Two more. One of these is the secret. Oh, the owl. This is one in 12. That actually looks really sick. Last Harry Potter. Give us Harry. Harry, where are you? Oh my gosh. Is that him? >> No way. >> Oh, that's the one in 72. No actual way. Wingardium obliviosa. That's the only thing I know. Yo, dog. That's so sick. We just pulled another secret. No way, guys. They had so many of these. We picked the right one. We got the phase road luck. I knew I felt good about Five Below. I really did. And it's because OneUp is in there, too. Last but not least, we got Marvel. Oh, the two secret ones are glow-in-the-dark. Woah, woah, woah, woah, woah. Oh, this is a 1 in 36. No way. On our first one, chat, are we getting the secret from Marvel? Are we getting the glow-in-the-dark? Nothing's glowing. One in 12. We haven't gotten the most common ones, which is 1 in six. We got 1 in 12 and 1 in 36. Last one. Glow-in-the-dark, baby. Come on. I need to see some glow out of you. Nothing's glowing. Woah, woah, woah, woah. This is sick. Wait, which one is this? 1 and 12. That's awesome. We got two 1 and 12s and one 1 out of 36. These are actually sick. What the heck? The detail on each figurine is so nice. Dude, Five Below was fun. And these are the cheapest blind boxes you can get. I'm not done. I think we move on to the next place. All right, guys. We are here at Cutie Surprises. And as you could see, it's the grand opening. Very new store. In fact, me and Kayn came here a few days ago off camera just to check it out. And they had so many crazy blind boxes that I had to come back for the video. Including rare laboos that you can't even find in the US. Like you have to source them from a different country and they're snow globe laboos. And as you guys know, we just got a snow globe Harry Potter secret. So, and not only that, they got tons of other rare, cool, exclusive blind boxes and an unboxing station. So, let me show you guys around. I'm acting like this is like my house tour. Like, let me show you guys around. Come on in. But they treat me so well here. They're like family. Great to see you guys. How you guys been? >> Good. >> Good to see you. Good to see you. Good to see you. Thank you. Thank you. Yeah, of course. My guy Noah. How you been? >> Good. >> Good. Good. One of the coolest stores I've ever seen. Like all different types of blind boxes. And oh, I want to show them the signed laboo. Guys, I was here, like I said, over the weekend and I signed two laboo. And are these the rare ones? >> This is the secret for the macaron. The exciting macaron. >> They had me sign a secret labu. Thank you guys. Thank you. You told me there was some rare ones like the snow globe ones that I was really excited to see. We have it over there. So, no one want to show it to you. >> Oh, no. Show me. Show me. It says big into energy crystal ball blind box. So, they're from PopMart, but you can't get them from the US or how does that work? >> I haven't seen there in the US right now. I know in other country they do. >> Yeah, cuz I've never seen that before. So, all right, guys. We're going to prep for this, unbox everything, and set it all up, and we'll get going. Oh my gosh, guys. There's a pen blind box. So, you can actually get a secret pen, one out of 72. But these all look so sick, even without the secret. Like, all of them just look nice. >> We could give you one of these if you want. >> Are you sure? >> No way. You guys are so awesome. Thank you for letting me do this here. That's so sick. I had to start with the crystal ball laboo. I mean, these look insane. And I really hope we get the secret. I actually looked it up and this is what it looks like. So, come on. Fingers crossed. Even if we don't get it though, like these actually just look so nice. Woah, this is nice. So, we got the loyalty one. Oh, snow globe. Wait, it actually lights up. Oh, wait. Yeah, I just saw the light. Oh, you could see it. No, you can't. >> You could see it. That is so sick. It tells you that you got the loyalty one right here. So, you're going to see it right when I take off the top lock. Here we go. Ready, set. Ooh, wait. This one's nice. This one is Serenity. Okay, wait. Let's turn on the light for it. That's sick. Okay, so we got Serenity. We got loyalty. And we keep going till we find that secret. Luck. This is what we need right now. We need some luck for the secret. All right, three more, guys. Which one's this? Hope. I hope I pull a secret. Two more snow globes. Ooh, we got love cuz I love you guys so much. From the last one we're going to get, it's either going to be happiness or the secret. Come on, let's do this. Whatever it is, they'll both make me happy. Oh, it's the happiness one. Honestly, these are all so sick. I don't even care that I didn't get the secret. Like, these just look crazy. They all turn on. They have a light inside. Like, look at this nice little collection we got. I had to do the pens. The pens are one of the coolest things ever. I didn't think there would ever be a pen blind box, but here we are. Okay, so we're either going to get all six that are on the box or five plus the secret. I don't know what to expect. Woah, these are sick. It comes with a keychain attached to the pen. And that one is I think this is luck. A secret pen would be nuts. This isn't a secret, but this one is the happiness one. It says it on the back right here. All right, come on. Secret pen. Secret pen. Secret pen. Green is serenity. I know Kayn would die for these. Three more pens. This one looks like love. Look at the keychain for this one. All right, two more, baby. This one is hope. Hope we got this secret. Come on. Come on. Come on. Come on. Come on. Come on. Come on. I think that's loyalty. Yep. It's loyalty. Oh, these are sick, though. Even though we didn't get the secret banger. All right, we got the remaining blind boxes in front of us. And I really wanted to go for this one cuz you like pour the drink inside of the cup. You don't drink it, but it's a scent. And I had thought there was no secret because it didn't show it on the side. But I turned it to this side and there is a secret. 1 in 54. You get this to start. I think this is the little bottle it comes with because it feels like there is liquid. That's so cool. You have the cup. It literally says, \"Warning, don't drink.\" So, do not drink this if you get it. And the liquid right here. What? This is so cool. Sparkling apple drink. Okay, so we got green apple ice cubes. What? So, we'll put the ice in there first. Let's smell this. Oh, that smells so good. This goes here. And this goes. I think that's what it looks like on the box. It smells so good. Yeah. Do not drink. Do not drink. Oh my gosh. I could open so many of these. Bikini Bottom buddies. We need the two Neat Toads hugging each other. One in 72. Come on. We didn't get a Spongebob secret earlier from Five Below. So, we're going to get one here. Oh, wait. This one's cool. Which one is this one? This one is the working fish. It looks tired. And it comes with the card right here. Wo! Oh, it's like a boating license. I want to go for this one. The space molly. This is so cool. The two secrets one in 108. Woah. Wait, this looks cool. Oh, La La L. Hey, this still looks good for a basic. Okay, next one. Once forgotten corners. This one I'm hoping we get the secret because it says buried. Boom. Wo. Which one is this one? We got Seek. Hold on. Oh, look at this. So, it comes with like a little keychain that says, \"Good luck.\" And then the card. Absolutely beautiful. Sioi Neverland one in 72, baby. Oh, these are big. What the heck? Wo! Hold on. Comes with the heart. Oh, yeah. The eyes. Hold on. Hold up. Look at that. Blue and pink or regular. This is actually sick. I love the eyes. All right. Two more. So, this one 4% probability. It's a rainbow spirit. So, if you guys see rainbow, it's a secret. Oh, rainbow. Come on. Oh, not the rainbow, but woah. Oh, it's a bag. Oh, that is crazy. No way. This is so cool. Okay, I'm going to give this to Kayn. Okay, last one. Last chance to get a secret here. Skull panda crystal balls. 1 in 72. I don't know what to expect here. Wait. Oh my gosh, I just revealed it. The pan flu. Dang it. Why did I look? Why did I look? Oh, what? This is crazy. It comes with like a little stand, too. How does that look? So, that is the pan flute. Sick. Oh my gosh. Although we didn't get the secret, these are all just such sick collectibles to have. Thank you guys for letting me do this, actually. >> Wait, the big one. I have a surprise. >> A surprise. This was more than enough of a surprise. What is this one? Is this Naruto? Stop it. This is so nice. There is a secret you can get in this, but I lowkey want that one or just Naruto himself. Okay, let's do it. Oh, wait a minute. I don't know. I don't know the character, but this is so nice. What? Thank you so much for the gift. I appreciate it. Thank you guys. Yo, we got a lot of cool stuff from here. Like the pens, the snow globes, the crystal balls, baby 3 mayonnaise. Like, I'm learning so much about these. So, huge shout out to Cutie Surprises. Thank you for having me. Appreciate you guys. Thank you. >> Yeah, of course. All right, guys. So, we saved the best for last because in front of me, we have three autographed baseballs and two autographed footballs, officially licensed autographed sports memorabilia. The cool thing about it, you have absolutely no idea which player you're going to get. You can get a star, a current player, a rookie, and a retired legend. So, it literally says that this box containing an authentic autographed baseball has been obtained under the MLB authentication program and can be verified by its numbered hologram at MLB.com. So, it's the real deal. And then these two are MLB ones, so it can be from any team, any player. I just got these from my guy Renee and he told me they opened a Jaden Daniel signed football worth over $25,000 cuz some of these can actually be game used as well. All right, this is the most expensive blind box opening that we're going to do. So, let's hope we get someone crazy. I'm hoping for Fernando Tatis for baseball and Justin Herbert for football. Those are my top two. Okay, let's start with the Yankees. So, I think these baseballs were $300 each. So, for one box, 300 bucks. This is actually crazy. We're going to have three new signed baseballs and two new signed footballs. So many layers of protection here. There's a card right there. I don't want to look at it because I don't know if it says who's on it. There it is. Oh my gosh. a 1998 World Series ball. Congratulations. You have unwrapped an officially licensed baseball autographed by Bernie Williams. So, if you guys didn't know, Bernie Williams played his entire 16-year career for the New York Yankees. So, he was loyal. Now, let's see like how much this ball would go for. Shows it's worth around 250 bucks. And we got these baseballs for $300 each. I still think this is a crazy pull for sure. So, we almost broke even on the baseball, but let's see what else we got in store. By the way, I think the same company makes basketballs, too, but I couldn't get my hands on them. But me and my guy Renee were planning on doing a crazy opening all signed sports memorabilia, and I want to get basketball. So, let me know if you guys want to see a full video of us opening signed sports memorabilia. On to the next. So, this one, I mean, we're really manifesting Otani. That could be worth 20, 30, $50,000. So, we got to get really lucky for that. Come on. Give me at least. I think game used would be crazy. Hey, wait. The card is right there. Wo! Whose signature is that? It doesn't even have like a number or anything. All right, let's see who it is. Manny Machado. Oh my god. You have unwrapped an officially licensed baseball autograph by Manny Machado. I did not recognize his autograph. Mm. It makes sense. Hey, my goal was a Padres's player. We got him. I know I said Tatis, but Machado is a beast. All right, just looked it up and this is actually going for $400, meaning we profited $100 from this box. But of course, I'm not going to be selling it. Manny Machado is the goat, so we're keeping this baseball. All right, one more baseball and then final two. Hi, Lola. It's like a new toy almost. Imagine show Otani signed baseball and I just throw it for her to chew. Here we go. Let's see if I could recognize the autograph. At least game used. It should be dirty. It's gold, right? Am I trolling? Is it gold? >> It's very gold. What the heck? Wait, does that mean anything? Hold on. Before we even look. Could it be vintage? Wo. Oh, it's the art ones, I think. Right. This looks like an art patch from the Oakland A's. It's time to see who. But what the heck? Is this the art baseball? Cuz art is 1 in 68. Is it a legend? Is it a current? It's Dennis Eckersley. Dennis. Dennis. I don't know. Dennis Eckersley. I'm sorry. Maybe he's like a legend. Let's look it up. He's 70 years old now, so he's most definitely retired. He played for the Cleveland Indians, Boston Red Sox, Chicago Cubs, Oakland A's, and St. Louis Cardinals. Okay, so we found an eBay listing with the same exact ball with like the logo and his signature, and it's 120 bucks. So sadly, we actually did lose on this baseball, although it was the coolest looking one. Hey, I'm very happy with the finds, the three baseballs. We got Manny Machado, one of my favorite baseball players ever. But we still got the two footballs. Let's get Justin Herbert. Come on, that would be insane. So, I'm going to read the odds on this. Single signed 1 and2. Rookies 1 in5. Inscribed 1 in7. You guys should subscribe, by the way. Multi-signed 1 in 36. Art 1 in 104. Game used 1 in 165. And vintage 1 in 783. So, we're going for the vintage. Here we go. Ooh. So, the baseballs were 300 each. The footballs are 500 each. So, they're worth a lot more. So, let's see who we get. 2022. Wait, is that offensive rookie of the year or defensive rookie of the year? Starts with a GGW. GW from the NFL. Congratulations. You have unwrapped an officially licensed football autograph by Garrett Wilson. All right. So, Garrett Wilson was the 2022 offensive rookie of the year, which is super sick. And he plays for the New York Jets. Okay, now let's see how much this is worth. It says $200. So, we lost about 300 on this one, but it's okay. This is all for fun. This isn't for me to try to make money. This is me to add to my collection. Last football. I'll take Justin Herbert. Final one, guys. We need to see a different color football. I want to see something like game used dirty. So, it's looking it's looking normal here. Says 83 Zoo Hall of Fame 2014. Andre Reed. He sounds really familiar. So, we looked it up and it looks like this is going for about $180 on eBay. So, another L. But I had a lot of fun making this entire video. We are going to end it there. Please make sure you drop a like, hit that subscribe button, get me to 30 million subscribers. We are getting closer and closer every day, and you guys mean the absolute world to me. So, I appreciate all the love and support. And I'm going to be reading a lot of comments on this video. Please comment down below what you guys thought of this overall vlog. I love you guys so much. And other than that, it has been your boy Rug and I am out. Peace.",
    "start_time": 0.08,
    "end_time": 2568.7200000000003
}