{
    "video_id": "OzPWcRgtOsY",
    "channel_url": "@rug",
    "transcript": "Limited edition snacks are like shooting stars. They show up out of nowhere, shine bright for a little bit, and then disappear forever. Which is why today I got as many limited edition snacks as I can find because I want to try them all before they're gone for good. And not only that, I'll be dropping them into a tournament style bracket where they'll be going head-to-head versus their original versions. Whichever we think is better, we'll move on to the next round. And finally, the last two snacks standing will face off against each other, and only one will be able to walk away as champion. Who will win? The unique limited editions or the classic originals? Let's find out. Ding ding ding. Wait, should we use my ding-ding or use the actual sound effect? >> We have to use your sound effect. >> I think it sounded better. All right, guys. I'm here with my cousin Jessica. >> Hello. I missed you guys. >> We all missed you. >> Thank you. >> You need to be in more videos. >> I will. Mark my words. And behind us is the bracket. So, we have all the limited edition snacks going against their originals. >> Who do you think is going to ultimately win? Like, not a specific snack, but do you think a limited edition version or the classic? >> I'm going to go with limited edition. >> I think a classic is going to win. All right, Jessica, I'm going to let you pick. What do you think we should start with? >> I'm actually going to go with the first thing that I saw when I walked in. >> What is it? Dill, pickle, goldfish >> versus the regular goldfish. I don't like pickle. >> I do. >> Oh my gosh. Okay, then we'll start with that one and work our way down. Let's go. >> All right, before we start, Jessica, check the expiration date on that thing. >> Wait, why? You're going to feed me expired food? >> I don't know. Some of them we have to get on eBay because you can't find in stores anymore. >> We're cutting it close, but we're good. That one's close. That's a month away, but we're good. Let's see like what they look like. They look well seasoned. >> It's pretty good. That has so much more flavor than regular. Mhm. >> It's weird at first, but then it gets good. >> It's like a strong taste. >> I would buy those. >> I have my winner. >> I have my winner, too. Back to the wall. Oh my gosh. Okay. You have to hold it. No. No. No. You're good. You're good. Okay, Dill Pickle. Moving on to the next round. >> Yay. >> Okay, I'll pick next. How about original Cheezits versus Wendy's Baconator Cheezits? >> Let's go. Let's do >> We're going for the Cheezits round. Let's go. >> I eat Cheezits all the time. Like in my pantry, I have the the small little bags. So, it's weird cuz I like bacon with breakfast. like with my eggs, but then bacon on sandwiches or burgers is a nogo for me. Let's go. >> Wait, I don't want to touch it. >> It's that bad. >> We know OG Cheezits. >> Mm- >> No. >> It's like smokeoky barbecuey. >> A baconater and Cheezits. Like I feel like this doesn't go well. >> I think it's just not meant to go together. It doesn't go. >> The more you eat, the better it tastes. But I still think original wins. I don't know. >> Me, too. >> Do you agree? >> 100%. >> We know. >> Uh, no. This one. >> Oh, >> yeah. Sometimes brackets can be a little confusing, but I think we did a good job. >> Yay. Just to clarify how a bracket works, like the winner of the Twinkies will then move on to here and then in the next round it'll be Twinkie versus the Cheeit and then it'll move on and we'll make our way to the end and it'll meet with the other side as well. So, Jessica, go for it. >> I do want to choose something, but it's um >> it's up there. Don't say the Pepsi. >> I want to try the Pepsi. >> I'm down. All right. Shall we? >> We shall. Wait, we should think of a new transition line cuz it's always like Actually, that was a good one. Shall we? We shall. Okay. Do that one over again. >> Shall we? >> We shall. >> Let's go. Oh, and I still added. Let's go. >> Look at how cute this thing is. >> Cute, but kind of scary. Pepsi yellow. >> That's cool though. Classic Pepsi. Oo. >> Cheers. >> Cheers. I have like the flavor on the tip of my tongue of what I think it is. Hold on. >> It really s It smells good. >> It's pretty good. Almost like a cream soda but sweeter. I don't >> Ooh, >> it's not bad. >> Is it vanilla cream soda? >> It lit. Yes. >> Okay. >> It literally tastes like vanilla and cream soda. >> Yeah. It's good. >> I personally like the Peeps. >> I I do like the Peep. >> Do we agree on Peeps? >> I agree on Peeps. >> Me, too. All right, we agree, right? >> Yes. >> Moving on, baby. >> That was good. >> I get to choose. >> Your turn. >> Okay, we haven't done candy yet. Let's go Swedish fish. >> Okay, what's the >> This one is glow-in-the-dark if you point a black light to it. >> Let's do it. >> That's cool, right? Wait, hold on. No, no, no. We need to think of a new transition line. >> Let's just try it. >> Let's just Let's just try it. >> Let's just try it. >> Let's go. Oh, no. Don't say let's go. Okay. Okay. >> Let's just try it. >> Let's just try it. Okay. So, we got obviously OG, which are really, really good. But Jess, what do you have? >> I have Swedish Fish Glowups. Strawberry watermelon. >> Ooh. So, the flavor itself is strawberry watermelon in one. >> Yes. >> It says, \"Look, we glow under a black light.\" So, we have a black light right here. So, let's go to like a dark room and test it out. Okay. Wait. Turn on the black light. >> Wo! >> Already? >> Guys, look. Wait, this might be tough. >> That's crazy. >> I guess, guys, there's confetti in here, which adds extra points in my opinion. >> That's cool. >> Okay, let's go back. Let's go back. >> Do you want to try these first and I'll do original? >> Sure. Okay. >> I was too excited for these. >> Cheers. >> Cheers. [Music] Mhm. >> Really? M I forgot how good a Swedish fish was. >> This is really good. Bro. Oh, >> bro. >> Oh. M. >> Pink Starburst. >> That's a good comparison. Wait, but original is crazy. >> Not better than these. These are so good. >> This tastes better. >> Okay. >> Okay. Let's go. >> Just make the decision. >> Let's make the decision. Dude, this is hard because this tasted better. Like the limited tasted better, but then Swedish fish has that distinct original taste that brings me back to my childhood. I think >> Okay, how about this? If you can reach to change it, I'll let you pick. >> Sounds like it's coming from the bottom. >> Oh, >> yeah. I No way. >> Those are good, but Brian's right. Like a OG Swedish fish is like >> it's it's like no other. >> Yeah. >> Okay, Jessica, your pick. >> I think the KitKat churro is very interesting. Our first chocolate of the video. >> Let's just eat it. [Music] >> Dude, Kit Kat after it was in a freezer. >> I was going to say refrigerated, but freezer works, too. >> Okay. How did you eat a Kit Kat? Did you actually break it or did you just take a bite? >> That's kind of disrespectful. I broke it. >> I'm being disrespectful. >> Oh, wo. >> Look at that. >> Wait. original Kit Kat. It's too good. It's too good. >> Kind of smells like a normal Kit Kat. Oh, no. It doesn't. No, it doesn't smell like >> Does it smell like a churro, though? >> Kind of like cinnamon chocolate. >> Like a horada. >> Mhm. >> Right. >> There's no wow factor coming from you. Wait. You don't like it? Or the aftertaste? >> Make your own opinion and then I'll I'll tell you mine. >> I think it tastes more like white chocolate than cinnamon. There's a hint of cinnamon >> at the very end. >> Yeah. It's got to be OG. >> OG. I don't know. >> I'm sorry. This is so good. Easy. >> I saw something earlier. It's these Pringles. It's original Pringles versus roasted pepper and hummus. >> Perfect for us. >> That's our culture. >> And I'm excited. >> And I'm so excited to do this. [Music] >> I personally don't like Pringles. >> Sorry. I do. Oh, you know what? I like Pringles. Just sour cream and onion. Oh gosh. Oh gosh. Oh god. Oh my god. They're pretty bad. >> Yeah. Yeah. You probably went in with like a strong whiff. >> I don't like hummus though. >> Come on. >> You are overexaggerating. They are not that bad. >> We're going to have to fight then. Why? You really think that's better than original? >> Yeah. >> I'm not mad if we don't put original up there because I would never choose original Pringles ever. To the board. >> To the board. All right. Well, we're I'm not bringing the ladder, dude. >> Wow. Look at them tippy toes. >> I'm tall. I'm tall, bro. >> Good job. >> Hey, wait. So, now we got our first second round. Pepsi Peeps versus the Pringles. That's going to be good. >> That's going to be a good one. >> This is going to be good. Okay, Jessica. Anything that stands out? Pitch black. That's so cool. >> That's what I want. >> That's exciting. >> What's the flavor? >> Do with a blast of dark citrus punch flavor with other natural flavors. This looks beat up. I'll be honest. Check. Check it. Just check the expiration. >> We have our first expired product >> by 2 years. >> Oh, purple. >> Little midnight purple. Oh, wait. And it has carbonation. Pretty good. Like a a sweeter Mountain Dew. >> Baja Blast. >> Yeah. Cheers. All right. >> It has carbonation. >> M. Okay. >> Is it sour? >> It's medicine. >> Oh, yep. >> Not bad. It's been a while. >> When I drink Mountain Dew, it just reminds me of like having pizza with it. Like we would always get like Dominoes and have Mountain Dew as one of the sodas. Oh, remember we used to dip the crust in Pepsi or Coke? >> Yes. >> Is that normal or No, you're shaking your head. >> That sounds awful, dude. >> Wait, wait, wait, wait. Are you saying this is something we just used to do? No. There has to be people in there that used to dip their crust in soda. >> Wait, that's shocking. I thought it was normal. Hey, should we go back to the wall and make the decision? Cuz that's hard for me. Like, this is good. >> You know what? It does just taste like grape juice almost. Okay, let's go make our decision. Yeah. >> Okay, I have my answer. And let me know if you agree. >> Okay, I'm going with pitch black only because I feel like Mountain Dew is only good when you get the other flavors. >> Yes, I agree with you. >> Here, what should I pick? So, we just did soda. How about cotton candy? >> Okay. >> Dr. Pepper cotton candy versus original. >> Yum. >> I wonder how that's going to taste. I've never tried it, surprisingly. >> Okay. >> You like Dr. Pepper? Yeah, I love Dr. Pepper. >> Same. >> Wa, that's so sweet. Doesn't this look like like a lung? >> It does. >> It looks like a like a pancreas or something like Okay, ready? [Music] M. >> It's all good. Mm- >> No way. This tastes more like cotton candy than that does. What do you think? >> I think it's good. I think the texture of this isn't cotton candy, but the taste is literally cotton candy with Dr. Pepper. Do you have an answer? >> I don't know. This is a game time decision. Wall time decision. >> Wall time decision. >> Let's go. Do we both agree? >> Yes. >> Original. >> Original. >> I think original cotton cam is going to move on. >> All right. >> Yay. >> Let's take a look. You know what? We keep talking about this off camera. I think you made a mistake with this. Like look, original Swedish fish. Amazing. But we keep both talking about how good the strawberry watermelon was. Can we do a swap? >> Let's do a swap. Do the >> Take it back. There we go. >> Yay. >> What's next? Your pick. >> My pick. Let's go. Chamoy. >> Wait. Sea salt versus sweet, tangy, and spicy chamoy flavored chips. That sounds crazy. >> Fire. Chamoya is fine. >> We switched spots. I don't know why I don't think Sea Salt Original is the best. >> I feel like anything flavored is going to win against the original. >> I do too. I do too. >> Cuz who likes nonflavored stuff? >> Not bad. >> This sweet. M. This is so good. M >> right >> guys get these if you can get them burger >> for sure. >> Mhm. >> For sure. >> Oreo is going to be hard. >> Do you know what that's for? >> Yes, I do. And we're going to pick it right now cuz I want to try Oreo. >> Okay. >> So guys, there are so many different limited edition Oreos and we bought like six of them. So, we're going to spin a wheel with all the flavors to see what original Oreo is going to go up against. >> Okay. I like that. >> Let's do it. Here is the wheel. Jessica, please do the honors. >> Really? >> A good spin. >> Okay. What do you want it to land on? >> Dirt cake. >> Really? >> I I want the dirt cake one. It just looks cool. What kind of Sorry. >> Oh, okay. >> Just sign for me. It's here, Jessica. >> Jesus. >> Come on. That's how you spin a wheel. >> Dirt cake. Dirt cake. >> I want post. >> Hey, how' you do that? >> Yes. >> Okay. >> Dirt cake it is. >> Here we have the dirt cake flavored cream. And it says gummy worm inspired sprinkles on top. >> That's cool. >> So gummy worms sprinkled on top of the Oreo. Never seen anything like it. >> Wo. That's the dirt cake. >> Yum. >> Oh my gosh. >> Mhm. Mhm. Yeah. Yours looks different on the inside. It's like creamier. >> Okay, hold on. This tastes exactly like an Oreo. >> Really? >> I don't like chocolate on chocolate. It tastes exactly like an Oreo, >> right? >> Mhm. >> All right, since these taste pretty much identical, I think we spin again for another flavor. >> I agree. All right, you spin this time. There we go. >> I wanted posty >> Selena. >> Okay. Okay. I've heard really good things about the Selena ones. >> Okay. Here we have the Selena Gomez. It says it's chocolate and cinnamon cream cookies. >> Okay. Sounds good. >> Oh, it smells so different. Cheers. >> Oh my god. >> M. Kind of tastes like Biscoff cookie butter. >> I'm good. >> The comparisons are so good. Wait. It does taste like Biscoff. >> Mhm. Like imagine you have to give up original and only eat these forever. >> Yeah. You got to put yourself in that mindset for everything. >> Yeah. >> You can only choose one or the other for the rest of your life. >> I I kind of agree. This is going to be a hard round. >> Oh, why did we make the switch now? >> Swedish fish versus Oreo. >> Oh, that's hard. I think I'm going to go for Takis. What are the flavor? What is that? Zombies. zombie flavored. I don't know. There's only one way to find out. >> Oh, it says the flavor. >> Habanero cucumber. Kind of sounds weird for a chip cucumber. >> Let's see. >> Cuz Takis, I'm not going to lie, are pretty spicy as is. >> Kind of smells good. >> Wo. M. First of all, hot. >> It is pretty spicy, too. >> Oh my god, I'm going to die. >> You want water? >> Yeah. >> Okay. You could taste the cucumber like crazy. You could taste habanero like crazy. It's good, but it's spicy. >> It's very spicy. Oh my gosh. This is a wall decision cuz I can't make a decision right now. >> I think on the walk to the wall. I have to think about it. On Wall Street. Let's go. >> I think original should take this one. >> I think so, too. >> Really? I don't know that you just have to have a a certain palette that you want that cucumber habanero. >> Ooh, this round when we get to it is OG versus OG. Kit Kat versus Takis. Okay, I want to try this one >> cuz this is super weird. This flavor is AI flavored. >> What? >> Like it doesn't say a flavor. It's like >> what's going to happen? >> It's actually called AI. >> We're going to have to determine what flavor it is for mystery. Okay. OG Coke versus Y 3000. Year 3000. >> 3000. >> So, oh, it's literally called futuristic flavored. What does the future taste like? >> We're about to find out. Okay. Oh, Coke year. >> Should I check if it's XR? >> No carbonation. >> 2023. >> Oh, this one actually has no carbonation. Ooh. After Takis, something spicy and then drinking a soda. It's going to hurt. Is it good? >> I don't taste it. >> It tastes like something. It's just not good. >> But like what? Like is it like It doesn't have too much of a flavor, though. >> It's just not that good. It's like um >> like a >> It almost tastes like marshmallow, too, in a way. >> Okay. But that one was really good. This one's not good. >> We should go with the one that we dip our crust in. For sure. >> 100%. >> Pizza crust. >> Sold. is crust and coke. The best >> crust and coke. CNC. Dude, if we're the only ones that's done that here. Okay. You've eaten pizza, right? >> Pizza? Yeah. >> Okay, that's cool. Have you gone to the crust? >> Yeah. >> What do you do with the crust? >> Uh, it depends how hungry I am. >> Okay, so you eat it sometimes. >> Sometimes. Yeah. >> Have you ever dipped it in soda? >> No. >> Why? >> Ranch? >> Ranch? Maybe ketchup? >> Ranch? Okay, that's weird, bro. Coke. >> That's all I wanted to know. >> Coke. Next time >> we need to find someone. No, I don't care. I'm filming a video right now and I had a quick question. >> Yeah. And they got >> So, with pizza, um, when you get to the crust, have you ever ever dipped your crust in Coke or soda and ate it? >> What do you think? >> No. >> No. >> Oh my gosh. We're weird. >> I'm shocked that you just called me about that. >> Wait, wait, Nick. Cuz we're like, we have to call a food professional here, bro. >> And then I'm going to delete your number. >> No, Nick. No, no, please. I'm kidding. I'm trolling. I'm trolling. >> I don't think I'm going to try it. Be honest with you. I don't think I'm going to try. >> Okay. All right. Thank you, Nick. Oh god, we just got cooked. >> We just got absolutely flamed and cooked by Nick Diovani. Next, we got Skittles versus Shriers Skittles. >> What are those? >> I think it says try if you dare. And it says, \"Some are so sour they'll make you shriek.\" >> Oh my gosh. >> So, is it like random? Like is it like only one out of the whole bag is sour? >> Like a roulette. >> Let's try. >> Sam, we keep getting called weird by people and like I I need someone that has done what I used to do as a kid with my pizza so I don't sound weird. >> Oh god. >> Do you eat the crust of the pizza? >> Of course. >> Okay. Okay. Okay. This is a good sign. Have you ever dipped your crust in soda and ate it? Brother, I'm going to hold your hand when I tell you this. That is super strange. >> What? >> What? >> I've never heard of this in my entire life. >> Okay. Well, don't knock it till you try it, Sam. >> All right. I'm going to try that tonight. >> Please let me know if you like it. >> Dang. Okay, >> Jessica, take a Shriers out. So, those look normal. >> Oh, okay. Which color did you get? >> Green and orange. >> You did two in one. Like, are these sour? >> These look like normal. They don't have like the sour powder. >> Yeah, >> we have not found the sour one yet. >> I swear they're regular Skittles. >> It's not sour. Dude, I think sour Skittles is is a wave. >> I would choose these, too. >> Here we go. Okay, so this side's complete. Wait, we still have three. Let's go with Twinkies. A cherry slurpee Twinkie. [Music] I don't know about this one, guys. I don't like Twinkies. And I I don't know if I'm just saying that cuz my head feels like it's going to explode. But >> we just don't like Twinkies, I think. And this one expired 3 weeks ago, so not bad. >> Oh, not bad. >> He's just going in. Okay. >> M. That's good. >> Oh, wait a minute. >> That is full. I hate Twinkies. >> Ew. In my opinion, original Twinkies is better than the slushie version. >> You're not even trying any of the original ones either. >> Yes, I am. Not bad, though. >> Oh, okay. >> OG. >> OG. >> You got a OG verse OG. >> Oh, we already kind of know. >> We kind of know what's going to move on from this one. Ooh. Original Hershey's Kisses vers Cinnamon Toast Crunch collab. >> I feel like this one will be good. >> So, you want to do this next? >> Yeah. >> Yeah. Let's do it. That looks crazy. The branding on's actually sick. But original is so good. >> Oh, so you like Hershey's Kisses? I do. >> I love Hershey's Kisses. >> Wo. Mine's pointier. >> She's nice. [Music] Oh, it's crunchy. >> What? >> There's I think cereal in here. >> Ooh. >> Yum. But really sweet. Maybe like milk and cereal vibes. >> It doesn't hit like the original. It's really good, but like for a one-time purchase, like a one time buy. Original Hershey's all the way. >> My energyy's gone. Maybe I might get another wind. >> Okay. Dr. Pepper versus Dr. Pepper Zero Sugar Dark Berry Jurassic World. >> Wow. >> Dinosaur flavored. >> Ooh. >> Let's go. [Music] No expiration date on this can, but promoting the movie Jurassic World. So, >> let's see when Jurassic World came out. Hold on. I need to search up when this came out. Hold on. 2019, but it got re-released again in 2022. >> Okay. >> So, hopefully we got the 2022 batch. >> Hopefully, we did. >> Okay. Has its fizziness. Cheers. Tre is ew. >> No. No. Let me >> wait. Tastes >> like air. >> No. It tastes like very watered down Dr. Pepper. It's sour. >> Hey, this is going to make it all the way. This is going to win. >> And to conclude round number one, Dr. Pepper moves on. >> Woohoo. Woo! And now we have round number two of the bracket. These snacks have moved on. We both like them a lot for a reason, but imagine putting them against each other now. I know >> it's going to be pretty hard to make it to the end, but we shall see who comes out on top. And to make this next round interesting, we're each going to do one of the sides. >> So, we have a coin right here. Green side, red side. This is for me then. Wo! I'm on the red side. So, I am going to take care of this side while Jessica's going to do that side. And then we're going to make it to the third round. So, it looks like I'm starting with pitch black Mountain Dew versus spicy dill pickle goldfish. What about you? >> I'm doing my favorite Pringles versus Peeps Pepsi. >> Okay, we already know which one's going to win next, but let's go. [Music] >> I wonder what you're going to pick. I have my winner. >> I need to just refresh my taste buds cuz the dill pickle was the first snack of the video. >> True. >> These are surprisingly really good. >> Like really good. >> This is good. What the heck? >> What's it going to be? >> Okay, I have my answer. >> Yeah, >> but we're not going to say it here. We're going to say it at the wall. Hi Mountain Dew or spicy dill pickle. >> What's it going to be? I am going. >> Oh, >> spicy dill pickle moves on. It was too good. I don't know what it is. It's fired. >> Okay, there we go. >> Pepsi Peeps. >> No shocker there. Oh, Jessica, you got a hard one. I'm actually glad I don't have the size. Oreos versus the Swedish fish limited edition. >> That one was hard. >> My next round is Takis versus Kit Kat. Ooh, these are two originals. Ooh. Okay, >> let's pick. >> Let's pick. This is going to be tough cuz like they're in their own category. Chips and chocolate. >> Yours is going to be hard, too. >> M. >> What would I eat more, Kit Kat or Takis? Hardest decision of my entire life. >> I actually don't know what I'm going to do. >> Do you have an idea? >> I'm going to make my decision there. Let's go. I'm going to pick the one thing that I actually eat more than the other. >> Oh, >> no way. >> No way. You tricked me. >> I don't like Kit Kat is so good, but like Takis are a classic. Okay, Jess, >> I have the next hardest decision to make. I'm >> telling you, the the more rounds we go, the harder it's going to get. >> Yeah. But I will say I liked one a little bit too much. >> Oh my gosh. Oh my gosh. The Swedish Vision limited edition. >> I would I can sit there and like snack on those nonstop versus Oreos. I feel like after a few it's too chocolateaty. They're good. I love Oreos, but these are fire. >> Okay, >> what's next? >> Twinkies and Cheeits >> versus CocaCola and Chamoya. That's a hard one. >> Let's get into it. >> Yeah, >> this one might be quick for me. >> Yeah, >> that verse classic Coca-Cola. >> I will say it was my favorite soda. I know. Compared to Dr. Pepper, Dr. Pepper is second, but favorite soda ever. >> This is a clear winner. >> Let's go. >> Should I go first? >> Yeah. >> Cheese it. >> Yep. >> Versus either Hershey's Kisses or Dr. Pepper. I think I know what Brian's gonna choose. Speaking of soda, I don't even need to drink it. I just know I love it. >> Okay. Well, we got the last one of round two. Jessica, very interesting. Sour Skittles and cotton candy. Dr. Pepper versus Hershey's Kisses. Let's go. All right. >> So, I think I know my winner between the two without having to taste them. Are you just enjoying your chocolate to enjoy it now? >> Yeah. Honestly, I want to have like a fair judgment, but >> Kisses are good. Of all the chocolates, Hershey's Kisses are good. >> They're so different. >> Mhm. I know what you're going to choose. >> You don't know what I'm thinking right now? >> I don't know what I'm thinking right now. Let's go. >> Go for it. >> Me? >> Yeah. I'm curious. I'm curious. >> Oh, what? >> These just have more like depth to them. Like you chew, there's more of it. Like this just kind of You put it in your mouth, it disintegrates. Yeah. There isn't much to it. I love me a good Skittle though. Your turn. >> No suspense. No suspense. There's no suspense. Hershey's Kisses is delicious, but Dr. Pepper >> holds a place in your heart. >> Okay, round two is complete. For the third round, I thought of another twist, >> of course. >> So, we are going to bring in our special guest. Come on in. Come on in. >> Hello. Hello. Hi. Come on in. Nice to see you. >> Nice to see you. >> We are full. >> Yeah, I bet. So, we thought bringing in someone with a new fresh palette to take us to the next round will be sick. So, Kaitlin, we have the next round for you. We got spicy dill pickle goldfish versus Takis. >> All right. >> Cheezits versus Dr. Pepper. >> That's going to be hard cuz I know you love CheezIts. >> Yes. And Dr. Pepper. She loves Dr. Pepper. Yeah. Those are a go-to snack combo right there. >> And then on this side, we got two limited edition snacks. We got Pepsi Peeps and Swedish Fish Strawberry Watermelon. >> Okay, never tried those. >> And then CocaCola versus Sour Skittles. >> All right, this is going to be interesting. >> All right, let's go. >> All right, Kaylin, beginning of round three. Pepsi X Peeps versus Glow-in-the-dark Swedish Fish. >> Okay, should I try this one first? Yeah, we love that one. It's pretty much marshmallow Pepsi. >> Yeah, >> she didn't like it. >> She's giving Hold on, let me tell you this. Vanilla cream soda >> kind of, but like it kind of reminds me of like butter. >> Maybe it's the cream soda part. Like the I don't know. It's like tastes like butter kind of butter. >> Okay, let's try this. >> Oh, >> okay. I have my answer. I think we'll hit the board, I think. So, all right, Kayn. >> All right, >> I knew it. This one is definitely the winner. You still might need the light. >> Not for me, though, cuz I'm tall. >> Cuz he's 5'5, guy. >> 57 and a half. >> Let's have you do the spicy dill pickle versus Takis. >> Okay. >> I think I know the answer, too. I mean, they're both spicy. You don't like spicy. >> Uhhuh. Exactly. I never eat Takis, and I don't know how I feel about spicy dill pickles. >> I think I don't know. I have a feeling I know which one you're going to like. [Music] All right, feel free. >> Okay, be our guest. We'll start with the spicy dill pickle. >> Okay, not bad. Not bad at all. >> All right, limited edition versus OG Takis. >> Too hot. >> Takis are pretty hot. >> Spicy. >> All right, I already have my answer. Okay, what did you think I was going to choose? >> The goldfish. >> Mhm. You thought so, too? >> Yeah. Okay. Well, you guys were right. I'm going to need you to grab that. Oh, good job. >> Perfect. >> Kaylin, back to the green side. >> All right. >> CocaCola versus sour Skittles. Come on. >> Fun fact, I don't really care for either of these. I never grab either. >> Ooh. >> So, this should be a good round. >> Yeah, this is a really good round. But my taste buds are burnt off from the Takis. So, all right, let's try it. I'm going to go for the red one. >> I feel like these used to be so much more sour. >> I feel like it depends on the batch you get. >> Yeah. >> Oh, do you dip your pizza crust in that? >> I tell Jessica this all the time. That's a strange combination. >> Oh, we could go on my strange addiction. >> Dude, I'd be so mad if people make fun of me for that. >> Dude, I hope you guys are nice to us. >> I don't really have an answer, but I'm going to have to make a a choice. Game time. >> Yeah, let's do a game time decision. >> This one's a hard one. >> Which one is making it, though? I feel like out of these two, I would grab this one. >> I kind of agree with you >> more often than I would grab those. >> It's a classic Coke. >> But now the best round. >> Oh, this is going to be interesting. Cheeits versus Dr. Pepper. >> This is going to be really hard. >> My two favorite snacks. >> Mhm. >> What's my two favorite people? >> A lot. >> Do you ever eat these together or like eat Cheezits while drinking Dr. Pepper. >> Mhm. M m. >> Okay, guys. This one's a real easy one for me. Let's go. >> Huh? >> I'm just going to cut to the chase. Dr. Pepper making it to the end. >> I knew it. >> Dr. Pepper versus Goldfish Spicy Dill pickle. >> Wait, we kind of got a similarish. We got a OG drink versus limited edition. >> OG drink versus limited edition. >> You can't make this up. That is actually crazy. >> Okay. Well, Kaitlin, thank you. Thank you for getting us. Thank you for getting us to the semifinals. Appreciate it. >> Thank you. >> What do we do now? We got two more rounds, guys. The semifinals and then the ultimate 1v one. >> Oh my gosh. I think we need to call in another person. >> I think I have just the person. [Music] >> Papa run. Dad, we need you to come over to try some snacks. >> Where? >> At my house. >> That's dope. >> All right, we'll see you soon. [Music] >> All right, Dad. [Music] Papa Rug, come on in. The grand entrance. >> Woo! Woo! Woo! >> Take the floor. Take the floor. >> Good to see you. >> Floor or the chair? >> Oh, the chair. Take the chair. >> Okay. >> All right. Pop a rug. So, we're doing a video. Limited edition snacks versus the original snacks. And it's a tournament. And right now, we're in the semifinals. So, the limited edition Swedish Fish made it this far and the original Coke made it this far. Now, they're going up against each other. So, we want you to try both and you have to pick a winner out of both of them. So, whenever you're ready, we want your opinion to take us to the finals, cuz then me and Jessica will come back for the finals. >> Okay. >> What do you think, B? >> It's good. >> Okay. >> It's good. >> That's why it's in the semi-finals. >> Sour and sweet. >> Yeah. >> Original Coke, huh? >> It's original Coke. >> Don't make the decision yet. >> No decision. Okay. >> All right. Let's go. Follow us. All right. Pop a rug. If you have your answer, you could go ahead and grab the sticky and place it right over there. Okay, I'm going to finish. I'm going to finish. >> Oh, I love Coke, but I mean I drink Coke all the time, but then for this new item, it's honestly tastes very good. >> You like it, right? Do you like it? >> Imagine we didn't swap it with the original. I wonder if Swedish Fish would have been eliminated earlier on. This has now made it to the finals. >> And now you have this side, which is what you're going to try next. You're going to try Dr. Pepper versus spicy dill pickle goldfish. >> Okay. Do you like pickles >> sometime? Not all the time. >> If I know you as well as I do, cuz you're my dad. You usually don't like Dr. Pepper. >> That's another thing. >> Okay. You ready? >> Yeah. >> This is up against each other, Dad. >> Ooh. >> Spicy dill pickle, goldfish, and Dr. Pepper. >> I'm not fan of both of these. >> That's fair. >> All right. D pickle. >> What? >> Like really enjoy it. Like I'm taking a bite on the pickles. >> That's the point. >> I like the spicy. >> Okay. >> As long as has a little spicy, I'm I'm I'm I love spices. The pickles goes away after like few like chew. But um it's good. All right. >> Dr. Pepper. Dr. Pepper. >> This is such a moment right now. >> Why is he acting like it's a punishment? >> I know. >> Yeah. This is the greatest soda of all time. So good. >> I know it's a lot of people love Dr. Pepper, but I don't know what's what they love about it. All right. Okay, just tell does that has cinnamon or what is it? >> Not cherry, but like a >> cherry. It's not. But I do know what you mean. Like more flavor than a coconut. It just has flavor a little bit. >> Cherry cinnamon. >> Well, they have like cherry >> bacon powder. >> Bacon. >> I don't know. But you know what? >> Bacon powder. >> It's so cold. It's It's so good. >> But please don't say your answer here. Yeah. >> Do you have a good idea from both of them? >> Yes. >> Go to the wall. >> The moment of truth. >> Oh my gosh. Pop a rug. >> I'm so nervous. Pop a rug. >> He's like unpredictable right now. >> Yeah. Especially after the Swedish fish. I thought he was going for Coke, but >> make your pick. >> All right. So, I'm going to go right into it. >> Oh, you might be shocked. >> Should we turn around? >> Yeah. Yeah. We're going to turn around while you do it, Dad. >> Okay. nervous. >> Tell us when to look. >> All right, you can look now. >> Dr. Pepper, >> you like Dr. Pepper? >> You know what? I'm going to give Dr. Pepper a chance. >> Yes. >> Yes. >> When it's cold and fresh, it's like it's it's good. It has that crispy taste. >> Did you like the dill pickle or not? >> I did because it has the little spice. I like that the spicy, but I'm not a fan of dill pickle. >> But let's take a look at the finals. Here we have the limited edition glowinthe-dark Swedish fish. >> Wow. >> Versus original Dr. Pepper. >> Wow. >> So, it made it to original versus limited. And Jessica, this one is going to be on us. >> This one's hard because I I love both things. >> I know. All right, it's time for the finals. >> Are you ready? >> Let's go. Yes, >> I'm ready. Okay, it's come down to these two for the finals. Let's do a deep dive analysis on each product. >> Okay, >> with the Swedish fish, the flavor, they nailed it. >> Nailed it. >> That's why it's here. >> The creativity, they nailed it. And their minis compared to like the regular Swedish fish. So, it's bite-siz. >> Yeah, they put a lot of effort. >> They did put a lot of effort. Dr. Pepper. >> Dr. prepare on the other hand. >> It's just classic since 1885. They never switched up. >> Mhm. >> When it's ice cold, it hits different. I mean, >> this is probably the hardest decision ever. That's why they're both in the finals. And I knew this was going to happen that when we go headtohead for the finals, it's going to be a tough decision. I think I got my answer. >> Do you Okay. >> Do you? >> Yeah. You ready? >> I'm ready. >> I'm actually nervous. >> Let's go. >> All that. Here we are. >> Oh, here we are. Moment of truth. >> I'm going to cut straight to the chase. >> Okay, >> this Swedish fish, the flavor was delicious. It has two flavors, strawberry and watermelon. >> It's bite-siz. It was delicious. >> The glow-in-the-dark adds the cool factor to it. >> But on the other hand, Dr. Pepper has a blend of 23 flavors, and 23 is better than two. >> Dr. Pepper is the winner. Jessica, would you agree? >> Yes. Yes. >> Yes. I'm more likely to drink Dr. Pepper all the time over than like snacking on gummies. >> Look, Dr. Pepper, I know you want to do it. I promise you, I didn't like make you go all the way just for the sponsorship. I know there's a possibility that it just doesn't happen, but Dr. Pepper is >> Yes. >> phenomenal. >> And you weren't the only one that chose it. I chose it. Kaylin chose it. Your dad chose it. >> There we go. Thank you guys so much for watching today's video. Huge shout out to Jessica. >> Thank you. >> Please make sure you drop a like. Hit that subscribe button to get me to 30 million subs. We are getting closer and closer each day. Also, comment down below your favorite snack of all time. I'm going to be reading a bunch of comments. >> We might discover a new snack we like. >> Mhm. Love you guys so much. Hope you have a great rest of your day. And other than that, it's been Faze Run >> and Jessica >> and we're out. Peace. face.",
    "start_time": 0.16,
    "end_time": 2449.52
}