{
    "video_id": "FUXLwn8_9R4",
    "channel_url": "@rug",
    "transcript": "This item in my hands is so rare and so exclusive, it only exists on the other side of the world. But today, I bought and imported items that you can't get in America to see how the rest of the world lives. And I'll be ranking them on a tier list with S being the best and F being the absolute worst. And in the end, I'll be picking my favorite item, the one that I think deserves to go global. Let's call it Mr. Worldwide. I have been traveling a lot lately, so I think it's time to bring the world to me. Starting with edible slime. Yes, slime that you can eat. This is a DIY candy kit from Japan, which is also called dashi, meaning cheap, fun, and playful snacks made for kids and collectors. Some reviews say it feels like boogers. So, uh, let's test it out. All right, starting off with a very interesting product. We have the DIY candy kit to make edible slime. And this is straight out of Japan. This is giving cotton candy vibes. So, let's see what it actually tastes like. All right, so we have all the instructions on the back in Japanese, which we already translated to English, so I know what to do. So, let's take a look. Oh, that smells like bubble gum. So, we got three pouches. And you got your little spoon right here or shovel. Step one, fill with water to the line. And it shouldn't be too too much. All right. And then this one as well. And now we pour the pink one into this square right here. And the blue one into the little rectangle. All right. So, this right here is supposed to be grape. And this one looks like a blue flavor. On the bag, it shows here grape. And then I don't know. Let me translate this. All right. After translating, it said that this is soda flavor. Not a specific soda flavor. It just says soda flavor, but it also said it tastes like that ramoon soda, the Japanese Raoon. And I've had that before. I think that's the one with like the ball that you press into the soda. So, I'm excited to taste it. This smells incredible. So, we're going to pour this in here. Okay. And now it says you mix for 3 minutes. All right. So, this pink one that I'm mixing is supposed to be fluffy once you're done. And the blue one is actually supposed to be stretchy. So fluffy and stretchy candy. And just have to do a disclaimer. Do not eat regular slime. Don't eat non-edible slime. Forgot to add the rocks as well here. [Music] All right. I think I'm going to start with the fluffy pink. We're going to take some sprinkles. I don't like the texture, but we're going to see how it tastes. That is sweet. Oh my. I don't know about the texture though. It makes it cool cuz it's like you're eating slime and you can eat it. That's really good. I like that one. All right. Now we try the stretchy soda flavor. Oh yeah. M. Complete different texture than the pink one. That's what it's supposed to be like. It's crazy. This actually tastes like bubble gum. I smelled bubble gum when I first opened the box. I think it was this one. It's also a little citrusy, like a little sour. When it hits the tongue, you feel that sourness. And now we mix them both together. And you know, you get the best of both worlds. Fluffy Xstretchy collab. Yeah, I wouldn't recommend mixing them. Not bad, though. I could see a kid having fun making their own edible slime. So, this is a W product. Pretty fun way of eating candy, and it was tasty. But I'm putting this at a C because I wasn't a huge fan of the texture. Next is the Dulla coffee machine. This Arabic coffee maker is a popular item in the Middle East. And what makes this one unique is that it's a modernized and electric version of a traditional Dulla, which uses no electricity at all. Many households, including my parents, still stick to the old-fashioned way. But let's see how my parents feel about the electric version. Does it still feel traditional? And does it still taste the same? Let's find out. All right. I'm here with my beautiful parents, Mama Rug and >> Papa Rug. Wait, Mom. Do you have a slogan, too? Like, you know, Papa Rug is Papa Rug. >> I know. How come he get all the >> Well, say something. >> Mama Rug. >> There we go. All right. We're here with >> Mama >> and Papa. >> See, there we go. They go together well. But guys, so here we have a Middle Eastern product. I had to do it with my parents, of course. So, we have a Della right here. >> You said it right. which is where uh you know you make Arabic coffee and you guys drink that all the time. >> It's a huge tradition uh in the Middle East and the difference with this product than how we usually make Arabic coffee is this is what you guys usually use, right? >> The della. >> The dala and then you put it on the stove >> the oldfashioned way. >> So this is actually the electric version of that where you don't have to use the stove. >> The fake. >> So do you like oldfashioned way? Okay, I have to try this to see the difference if there is any different because they say this make a different than >> Oh my god. >> Wait a minute. This is the dala. >> Wow. This is for more people like not for two. >> This is like a party. >> This is a And then this for tea. >> Yeah, I think you can make tea. >> Okay. All right, guys. So, this is a 4in plug right here. So, we can't put it into the outlet. So, I had to get like a converter for it. But it says it's 250 volts. Damn, it's gonna burn the coffee. >> No, 250 volts is crazy. So, we had to buy >> the smoke machine. >> Oh, the fog machine. >> Fog machine. >> Wait, it looks like a fog machine. So, this lowers the voltage of stuff. So, we're going to plug this in. >> Run. Rescue. >> Okay, so we're going to No, no, no. I got this. >> Okay, >> Angie, I got this. >> Angie, please. >> I got this. >> I got a big George Lopez. Hey, plug it in. >> Thank you. Thank you. >> So, I plug this into this. >> Okay. >> Oh, there you go. >> And now we plug this. So, all this to make the coffee. >> I was going to say by now I have my coffee, right? >> So, it's good now. Okay. So, guys, also a traditional way to drink your Arabic coffee is to always serve it with dates. >> Dates. >> And these I actually got from Saudi Arabia when I just went a month ago. We're getting the full experience here. >> Okay. >> What the heck do we do? I've never made Arabic coffee. >> Okay, we add water to the pot. >> All right. >> Okay, we'll make make four. Make four >> because this pot you can't make too. >> And this is the actual Arabic coffee. >> Yeah, I threw it in this. >> That's another Middle Eastern thing. Yes, it is. >> This jar is probably from like 50 years ago or something or like when we were kids, we put random stuff in jars cuz we don't want to waste it. >> Yeah. If you guys measure like I did, five cups, you put two full. >> I like a strong a little bit more. I always add more. >> She always adds more. >> Some people like it. Yeah, we do. But not too much >> because we're too old. We don't >> We don't sugar. >> Oh, you should see how dad used to use sugar more than coffee. >> Yes. >> Okay. >> All right. We're going to turn this on. Whatever. >> I'm not touching this because it's so multiple blocks over here. >> There's so much voltage going on in one area. >> You're my son. You're still young. You still have a full ladder ahead of you. >> No. >> Let me take care of this. Oh, >> look. It turned on. So, the universal plug worked. Now, um >> press. Okay. >> Is it working? >> All right. We had some difficulties with the fog machine or whatever that is. We brought this out with an extra attachment. I placed it on there right now. Do I press this? This is what heats it. >> Straight to the heat. >> Here we go. We didn't get that last time. 5 minutes. 5 minutes on the clock. >> Okay, I'm going to serve. >> Is that what it's supposed to look like? >> It looks like this. Yeah, >> exactly. >> Oh my gosh. Wait, I'm actually not excited for this cuz I don't like Arabic. >> I know you don't. >> You have to eat it with the date, though. >> No. >> All right. Ready? >> Cheers. >> Let's try it. >> Cheers, Ron. >> Cheers. It's light. It's light. Little light. I would put more coffee. >> No, it's good with the date. >> It is. It's really good. >> Isn't it like something like you get coffee from outside? >> I would let it boil more and I would put more coffee. But it's drinkable. >> Mhm. Yeah. No, it's good. You know, it's not the same as this one. >> No, I would prefer that one, but I would drink this one. This is almost done. You leave this much when you get to this part. If you like, if you believe in fortune, you put your plate like this. If you will stir, >> then you flip it. >> Flip it. >> This is the coolest thing ever. >> Wait like 2 3 minutes till everything. >> Dad, >> that's all right. >> See, right away, right away. >> That's where you're going to raid your fortune. >> And when people This >> That's what I thought. Like she comes and say, \"Oh, hey Brian.\" >> Do you see that right here? That looks like a turtle. >> See, >> it does look like a turtle, right? But you always have to wait for it. Oh, this one is say you're going to have you're going to lose money. >> I don't know. Let me hold on. >> What? >> That That's the way they say. You see that mountain here? That's something is going to be like open road for you. You're going to be like something in the future. >> Cool. Cool. >> Well, that was good. >> I enjoyed this coffee session with you guys. >> But the coffee is good. I like the coffee. >> No, seriously. It's >> Is it the same? >> It's almost 90%. You would just make it a little different. >> A little bit. Yeah. Now I because it was the first time. So next time I know to put more coffee, less water, and let it boil more. >> My parents and I enjoyed the Arabic coffee made by this electric dulla. Especially pairing it with the dates and the company of my parents. I'm throwing this in at a tier. Next up, we have a flying sword. Yes, you heard me, a flying sword. This item is from China and is a toy drone shaped like a sword. It is inspired by Wooa stories and Chinese mythology where heroes would often be seen riding on swords or blades. I'm so excited for this one. I really hope it flies. This one is going to be interesting. We got our flying sword drone right here. And it's made completely out of foam. And we have this controller where you put on your wrist. So, I'm going to fly it with my wrist. And as you can see, we have the plastic blades that's going to make it fly. If I were to guess if it's going to work well or not, I'm going to say no. But you never know. Let's try it. Okay, so we'll turn it on. Ooh, that's promising. And just for safety purposes, it is made out of foam and the blades are plastic, so you can't get hurt. Okay, so does this go on a finger, >> I think. What the heck? Okay, bombs away. Oh. Oh. Oh my gosh, my bones are cracking. Look, it's the lights are flashing. [Music] Well, come back. Oh, wait. This is Oh my god. Come over here. This way. No, no, no, no. Please. Oh, hold on. Hold on. Hold on. Wait. That actually looked sick in the air, right? >> Yeah. I saw you controlling it with your wrist. >> Yeah, I was actually controlling it, but I didn't know how to like turn it this way cuz I wanted to take it up there. [Music] Wait, wait. [Music] Come this way. That wasn't bad. Okay, look. Look. So, I know that's to go forward and then this is to come back. Maybe if I look, it's not turning right. >> Uh-huh. Oh, it turned a little bit. Oh, it's turning. But how? [Applause] [Music] Oh god. Oh god. It stuck. All right, we're going to try to fly this as high as possible. [Music] Come to me. [Music] >> That was sick. >> Oh, that was sick. That was Aura. >> Thank you. Oh. Oh. Oh. Oh, wait. Look. Look. Oh, no. Where's it going? Watch this. Dang it. Okay. Wait. This is kind of cool. If I learn how to control it and take the time to learn, I think this looks sick. It's not your ordinary drone. It's literally a sword flying. I love this one. The way the sword looks flying in the air looks straight out of an anime, but it was pretty hard to control. I am putting this at C until I can learn how to fly it better. then I'll move it up on the list. This is raindrop cake, a Japanese dessert that's meant to look like a giant drop of water and is mostly made of water and agar. This fun treat is more of an experience rather than an everyday common dessert and is sought after for the texture and appearance. I'm excited to try this. All right, so here we have the raindrop cake, which is a Japanese dessert, and it looks like a giant drop of water. >> That's insane. >> Yeah. I wonder how it's going to turn out. But of course, I needed Kayn with me because I don't know how to do this. >> And I don't either, but we're going to figure it out together. >> It's weird because it's a cake, but then this has absolutely no baking involved. So, I wonder how it's going to work. Well, let's open this up. Ooh, wait. This looks like a car freshener. So, this is the kanakaco. >> Okay. >> Don't know what that is, but we're going to find out. Ooh, and this is like the little boat. >> Yeah, it's like the boat that you put the raindrop in when it's done. And a gar here is like a plant-based gelatin. It's going to be like a jell- consistency. I feel like >> brown sugar. Yum. >> Nope. No. Dark brown sugar. >> Yum. >> Look at it. It's like crystally. Okay. And then you have the mold right here. Perfect. >> So, this is going to be our little raindrop. >> Mhm. >> So, first things first, you have to prepare the brown sugar syrup. So, we need the dark brown sugar with a four cup of water. >> Perfect. >> And we need to boil it. So, let's go over there. >> Here's our water. Oh, that's it. >> We said 1/4, right? >> 1/4. >> Yeah, that's not a lot. >> Oh, and then we put it in right now, right? >> Yeah. Go ahead and put it in. >> This seems like a lot, but >> I know. I'm shocked that >> Oh, look. It's starting to dissolve already. >> Then you just keep mixing. >> So, do you think this is going to be good? >> Yeah. >> I feel like with the dark brown sugar, then you >> This is how I make like homemade coffee syrups. >> Really? >> Basically. Yeah. >> Just water and the sugar. >> Water and sugar and then like whatever fruit you want. >> So, yeah. Guys, this it looks like you have to let cool after and then you pour it onto the raindrop cake at the very end. >> So, we have to leave that there until it's boiled. >> Okay, now we start on the other instructions. So, we're going to boil the agar. You need a half teaspoon of agar and moisten with a little water to allow it to bloom. Says, boil two cups of water. Add agar. Stir and boil till clear. Okay, so this is what the agar looks like. [Music] Then a little bit of water. >> This is done. This >> Oh, it is. >> Yeah. >> Can we just let it cool in the pan or you think take it out of the pot? That'll be fine, I guess. Yeah. Doesn't really give you much instructions. >> Says boil two cups of water and then you add that and then you stir and boil till clear. So, it's interesting cuz step three says scrub the mold, which is that with a steel wool brillo pad or something similar. This is the secret to keep it from sticking. Oh, >> this is our something similar. >> All right. She'll do that while the water boils and then we'll add this and stir it till it's clear. >> Mhm. >> All right. Now that the water is boiling, we have our agar right here, which I'm hoping that's what it's supposed to look like. It's like a little paste. You add this to here, and then you stir until it's all clear. Perfect. >> So now I guess this is supposed to turn clear. Okay, it is now ready to remove it from the heat. And it says let cool in a measuring cup for 5 to 10 minutes. >> Perfect. >> That's clear. All right, that's pretty much our cake right there. Okay, now we let it cool for 5 to 10 minutes. >> Perfect. [Music] All right, we let it sit for about 5 to 10 minutes. We're going to pour it back into the pot cuz it's easier to pour into the mold. >> Yeah. >> I don't know how much I should pour. And I don't think to the top. And guys, it comes with like six boats right here. So, I think with all the ingredients, it makes six of them. Okay. Now, it says you can set at room temperature or in the refrigerator for 2 hours. I think we'll do the refrigerator cuz it might speed up the process. I agree. >> Oh god. >> Oh no. No. It's not going to close. Reconstructive surgery, guys. >> Perfect. >> Okay, 2 hours is going on the clock. All right, perfect. We will check back. In the meantime, I have another product that I'm very excited about, but I got to go out in public for this. So, let's go. Next up, we have this DIY card dispenser. This gadget from Japan is a fun way to create your own version of something similar to a vending machine. You assemble it yourself, and after you're able to add any cards you want, and with a simple turn of the handle, you can now dispense the cards one at a time. With my obsession of Pokémon growing, I think I know what I'm going to do with this after I build it. I am so hyped for this. All right, guys. Here we have the card dispensing machine and we pulled up to the mall cuz we wanted to go to the Pokémon card store and buy an expensive Pokémon pack to test our luck with this. So, as you can see, it has a Nintendo 64 controller on it. That was an OG console. I don't know if many of you guys even know what that console is, but I used to play Super Smash Bros. on that. But, let's open this up and see how to put it together. Oh, there looks like a lot of pieces to it. Supposedly, it's easy to assemble, but we'll give it a try. Hold on. And then these are the instructions. Oh, easy. Oh my gosh. We might have to do this off camera. [Music] All right, guys. After about an hour, we are on our final step. Here we go. Put it over like that. And then you connect it. I'm not going to lie, this was like a Lego set, but a cardboard one. And it was really, really fun and easy to assemble. Just take some time. And we are locked and loaded. Look at that. What? This is fire. And then you got the dispenser right here. And I think the cards come out from right there. And it comes with little coins as well. So if you want to have some fun with it, put a little token in there and crank it. All right. Now the fun part. Taking this to a Pokémon card shop, getting an expensive pack, and ripping it through this. Let's do it. All right, guys. We just pulled up to my favorite Pokémon card store in San Diego, Jenkey's Co., where I actually pulled the Umbreon in my 20th pack. So, this is my lucky store. But, we want to test our luck with our new card dispenser. Hopefully, it doesn't bend the card, too, cuz if you bend a Pokémon card, a nice one, it loses value right away. So, we're going to test the bend on this thing, too. Hello, Sabrina. >> How are you? >> Good to see you. >> It's nice to see you again. >> Yeah, of course. Of course. So, um, I got this card dispenser and I wanted to test it out with a a nice little Pokémon pack. >> Okay. So, what are we thinking? >> So, I wanted the Ancient Origins one, but I don't know if you guys have that. >> So, unfortunately, I don't have that on me at the moment, but I do have a a few other ones if you are interested. If you want me to pull them out right now. >> Yeah, I'm down. I'm down. >> So, I have all of these. These just came in recently, too. >> I've heard of Roaring Skies before. >> Mhm. Yeah. There's a nice ray card in there that I personally really like. The more expensive ones are probably these two, but they have bigger hits, so it's really up to you. >> We'll get one of these. You pick. >> Okay. >> And then Roaring Skies. Which one do you think? Which one? >> I think you should go this one. >> Okay. >> I think there's a lot of really nice cards in. >> So guys, I'm learning a lot about Pokémon. I know what full art cards are. >> Yes, sir. >> Right. Full art. Um, I now know like the number on the bottom left. Like you can look up to comp it. >> Oh my gosh, you're learning so fast. I actually met your sister here like last week and she was teaching me a little bit about it as well. And yeah, if if a card just looks cool, it's for your own collection if you want. >> Kyogre and Groud are both in the set. So hopefully we can pull one of them. >> They're very expensive cards, too. >> Okay, here we go, guys. Okay, so we got one, two, three. Okay, now we're going to figure out this contraption here. I think you just Oh my gosh, I see a nice card in the back. Like, do you kind of see it? Do you see it? like like a hollow. Okay. Okay. I think it's good. I think it's good. Now, put this on the top. Okay. So, we got the pack in here. Let's go. Okay. Hopefully, it doesn't come out bent because I want a PSA 10. What was the name? Kroger. Like the >> Rayquaza. It has a Rayquaza. This one has Rayquaza cards. The other one is Kyogre and Gra. >> Oh, Kyogre, not Kroger. Okay. Okay. Here we go. Please work. Please work. Oh, wait a minute. Wait. Why is this cool? >> And it only just goes to one card. >> Yeah, one at a time. Okay. Oh, that is so cool. Oh, okay. So, I think once it stops like that, we have to pull it because then it'll dispense the other card under. >> Wait, I feel like it's or is it bending or >> No, not so. It actually looks good. The quality of this is sick. Oh, so this is the holo. Yeah, >> the reverse holo. Reverse holo swabloo. >> That was cute. >> Whoa. Whoa. >> What? >> We're chasing this. >> What? >> What? >> No. No. No. You're actually lying. You're actually lying. Hold on. Hold on. Let me not touch. >> Are you Wait, hold on. Are you trolling me? Are that's Are you trolling? >> No. I'm being so serious. >> What? Yo. Yo. It's either I have the best luck in the world or this is the greatest Pokémon card store of all time. >> Remember when I said that there's a Rayquaza in there? That's it. >> What? >> That's the one in the back of my phone. >> Dude, wait. >> Is it okay if I >> Of course. Of course. Let's sleeve it. Let's do what we can. >> Oh my god. >> I can't believe my eyes. Wait, so how much is this worth? Like if it's like PSA 10. >> 11,000. >> What did What? >> Yeah. Yeah, it it's it's 11,000 in a PSA 10. >> Wait. Yeah. Can you check out the condition, please? >> Dude, this is Oh, >> no. >> The bottom part right here. You see those little dots? >> Yeah, that >> that's going to affect it. It won't 10, but >> it won't 10. Maybe >> I don't care. I got that. That's insane. What? Thank you so much. And these dots come more from like manufacturing, right? It's not even from that or anything. >> I don't think it was that. >> You stole that, too? >> No. Oh, someone gave this to me. >> Really? Wait, can I can I show them? >> Of course. I can't believe >> that's the one up there. >> Yeah, exactly. >> That's what you were just talking about. >> No, no, no. Poke. I love Pokémon. Yo, >> sale yesterday for this card at Near Mint for $383. >> Okay, >> that's crazy. >> Wait, so it went from 11,000 PSA 10 to 380? >> Yeah. So, near mint, it's 383, but then in a PSA 10 it is. >> I'm going to keep it above. I don't even care about the price. This is the coolest thing. >> I might put it in the back of my phone case. I can't believe this. >> I can't either, >> guys. This is like no paid promo, no nothing. This has to be the luckiest store of all time. Shout out Jinkies Co. in North County Fair Escandido. Not only was I lucky with like trick shots cuz if I didn't hit trick shots in Call of Duty, I wouldn't have joined FaZe. I would say blowing up on YouTube definitely has a little bit of luck in it as well. And then I got into blind boxes and Pokémon and I got a chase car two weeks ago. I pulled another rare from a blind box. >> Teletubby. >> Yeah, Teletubby, Skull Panda, Harry Potter, Care Bear. And then like to top it off, my mom told me this recently, but when I was like a baby, I already talked about this, but I was crying in a stroller and a psychic lady like went up to her and she like stopped her and her sister at the park and she's like, \"Oh, can I do a reading?\" And my mom's like, \"No, we don't want to do that and then like as she's walking away she's like oh I just want to say like that baby right there is going to be something big in the future like that gave me like bro it gives me chills every time I talk about it but all that ties to the Rayquaza guys we had um some supporters also give me two packs as well I'm telling you the Pokémon community is super loving welcoming with open arms so I appreciate you guys Sabrina where do you want me to leave this want to have it on display or anything >> we could just leave it up here would you be down to sign the box >> of Of course. Of course. >> Oh, that was my worst signature. Oh, that was my worst signature yet. What do you think? >> That looks good. >> You can still read, bro. >> Guys, Luke was on his way out and he wants to give me this. Are you 100% sure? >> 100%. >> Dude, Luke, >> you said you were getting into Pokémon. Yeah. >> Thank you so much. What the heck? And I like your car, bro. I like the the Snorlax right here. >> Big Pokemon guy. I love that, >> dude. 100%. You sure? >> 100%. Yeah, it's all yours. That one has the Pikachu in it. >> Luke, thank you so much, bro. I really appreciate that. Have a good rest of your day. Okay. Thank you. >> Now, this is an automatic S tier. Do I even need to explain why? Okay, I'll do it anyways. We really pulled the Rayquaza from one pack, and I'm just going to say the card dispenser was part of the reason for that. It's that card dispenser look that was absolutely insane. I I genuinely am speechless after that. Next product, we have the Balmuda bread steamer. This high-end toaster originated in Japan in 2015 and has since grown in popularity. It uses water to steam slices of bread, making it soft on the inside and perfectly crisp on the outside. In general, Japan likes making luxury versions of everyday items such as a toaster. And I love that. All right, let's test it out. All right, here we have the Balmuda, which is a high-end Japanese toaster that uses steam to make bread crisp on the outside but soft on the inside. >> And let me just say, we've been to Japan. We had their toast. >> It was unbelievable. >> Oh, the bread is so soft. This is actually like a cloud. >> Oh my gosh, it's actually good. So, you put one teaspoon of water into here, which looks like a coin dispenser for an arcade machine, and that produces the steam and makes the bread. Look, it also has like a bunch of other stuff. So, it tells you add water, but there's like the sandwich bread mode. You could go English muffin, sourdough bread, rye bread. You can even go pizza, bagel, toast with toppings, and pastries. >> Oh my gosh, I'm excited. >> Okay, so let's get our bread. I'll put the water in here. All right. And then throw our toast in. >> Yep. Close it. And now you turn it on. We got 2 and 1/2 minutes cuz it says sandwich bread mode. 2.5 to 3.5 minutes. >> 6 seconds. >> Oh, look. It's steaming. Now, this is going to be crazy. This is going to be a crazy product. I know it. >> Throw that in there. Let's see how long that takes. Take I can't even speak. Guys, this is crazy because everyone knows I'm obsessed with my touchscreen toaster. I mean, this is next level stuff. You literally click a level and it shows you a picture of how your toast is going to come out. We're going to go at number four. >> Now, I think that's what crisp. >> It's crisping it. >> Oh, it is. You see the edges? >> Yeah. >> Wait, the edges are looking crispy. >> Oh, they're going to be done at the same time. >> Oh, >> okay. So, this is touchscreen toaster. >> Okay. >> Oh, no. >> That looks better than our toast. >> Okay. Okay. Hold up. Now, wait. But this looks so good. So, it's supposed to be crispy on the outside, soft on the inside. Okay. Let's try this together at the same time. >> Okay. Wow. That's delicious. [Applause] >> That's a perfect amount of toast. Now, come let's try this one. Oh, I'm not even saying it just to say it. I'm not. I promise, guys. I think I know you guys might think I'm trolling. This was better. >> Mhm. I kind of agree. >> And it's not just like a mental thing like, \"Oh, yeah, cuz it's like Japanese toast.\" Like, this genuinely just tasted better. >> This one is for the win. I might be using this all the time now. >> I mean, this was probably the best tasting bread I've had since I went to Japan. It was quite literally perfect. I believe this is an S tier product without a doubt. On the topic of bread, >> we got some canned bread from Japan as well. >> What? >> Look at this. There's a panda can. >> Why am I kind of nervous? Like, is it going to come out slimy or something? >> No. So, these are usually found in Japanese vending machines or convenience stores. >> Okay. >> Basically, it's emergency storage bread with strawberry flavor that can last a long time in the can. >> I want to open this one cuz it looks like it's chocolate. >> Oh, >> I'm just guessing. [Music] Mine smells like coffee. >> It is coffee. >> Mine. >> Okay. You want me to try it first? >> Yeah. Go. [Music] >> Remember, this is emergency food. >> Yeah. Yours is soggy. Mine is normal. And it just tastes like bread. >> Going back into the panda can. Okay, that was pretty interesting. The texture was a little weird for me, but after reading that it's like an emergency food, like it makes sense that it's not going to be like a top tier gourmet bread, >> I think my expectations were set high after that one right there. >> Agreed. >> I personally did not enjoy the canned bread. It is meant for emergency food, so it's understandable that it's not going to taste like gourmet bread, but I'm going to be putting this bread at a D tier. Next up, we have mystery bags or fuku bukuro, which translates to lucky bags. This is a Japanese New Year tradition where stores will create bags of mystery items where the value is usually higher than the price of the actual bag. They can range from a variety of things such as fun toys, anime, clothes, electronics, and even snacks. So, let's see what we got in our mystery bag straight from Japan. Here we have our fuku bukuros, which translates to lucky bags in Japanese. And stores usually sell these around New Year's. >> Wa. Okay, >> so you pay a set price for the bag, but what's inside is a total surprise. And the value in here is usually more than what you pay for. >> Wo. Okay, I'm ready to see what's in here. >> You know, I love my mystery boxes. >> Now he's doing mystery bags. >> Mystery bags, Japanese style. All right, let's go. Let's see what's inside. First thing. Oh, Kirby. What? Wait, this is like I think a school thing. Wo! Wo! What is this? >> Oh yeah, like a folder. I think >> it's like a nice little folder. Okay, >> next. More Kirby. Oh my gosh. You got the San Marino edition. >> This reminds me of the blind boxes I've been opening. Hold on. Hold on. Kirby. >> I got a Kirby. >> Wait. And you like hold it up. >> Oh, it's like a like a decoration. Like a balloon, I think. >> In the meantime. Wo. Is this a blind box? Oh my gosh. This is a blind box. It's like a little Kirby collectible. Are you okay? >> Okay. Don't infl Are you sure? >> Yeah. >> So, there is a secret you can get and it's the top left one right there. >> Oh, no. It's not the secret, but it's still really cool. I >> got the first one. >> Let's go. To any viewers out there that have been to Japan or that live in Japan currently, are blind boxes popular out there? Cuz I've been really into them. >> Oh my gosh. Wait, this is the best ever. >> But Hello Kitty chopsticks. >> You love Hello Kitty. >> I do. >> Oh, I think this is like snacks. >> Ooh, >> like candy. That's probably what Lola was smelling. Hold on. That's what it looks like. >> Looks like Skittles. >> M. Wait, it tells you what you can combine and what it would taste like. >> Wo. Oh my gosh. So cute. >> A watch. >> A coin purse. >> Hello Kitty chopsticks, too. >> Yes. Kirby socks. No way. A fan. We got it inflated. Oh, it's one. Oh, sorry. >> Oh my gosh. A hairbrush. What's that? >> I don't know. But I feel like I've seen this. Like, this looks familiar. Exotic Kit Kat. More Kit Kat. Apple Kit Kat. >> This is the best bag ever. >> Wait, what is that? A purse. >> Like you could put your pencils or stuff in there. I got a Kirby bath bomb. >> Super Mario candy. >> We got these at the airport. Remember? >> They're chocolate. What? A Red Bull. A Red Bull. This is the coolest thing ever. Summer edition. Oh my gosh. >> What's that? >> I don't know. >> Okay, I'm going to grab something from your back now. >> Yeah. Yeah. >> Ooh, some more candy. >> It's Lego. It's a Lego Kirby, dude. No. And it comes with a little instructions. >> This was great. >> This was a good one. This was a good one because it was a mystery and there were so many things in the bag. >> Good items. >> Very, very good items. I love this. Yeah, this might be my favorite one. >> Oh, should we check on the raindrop cake? >> Yeah, >> it is 1 minute left. Perfect timing. >> Let's go. >> I love anything mystery. And with all the goodies we found inside, I think this is a solid A tier due to how much variety of items there were. >> Are we ready to see the raindrop cake? >> We're ready. We're ready. We're ready. Let's go. >> Oh, here we go. Oh, the texture. >> Are they jello me? >> Yeah. >> Do they look like they're fully done? >> Yeah, 100%. Oh my gosh. Why am I rushing? >> Part of it stayed. Ah. >> I mean, it stayed a little bit. >> Watch this. >> Yes. Yes, we got it. But we're not done. What do you think? We work on this one together. Yeah, >> cuz it's already looking like that. >> Let's do it. >> Gently place the cake on a wooden boat with half a tablespoon of kinaco powder. >> Kakaco. And then let's not forget about what we started with our brown sugar syrup. So it looks like the syrup will be like on the top. That would be at the bottom. >> Okay, this goes down here. >> Yeah, I think >> Yeah, that's it. >> How did we do? How did we do? >> I think we did great. >> Get some kanakaco. >> Let's try it. >> Right. So, it has like a nutty taste, which I'm not a huge fan of nuts. >> It's good, but not for me. >> Okay. >> It's fire, though. If you like nuts, do you like nuts? >> Sometimes, >> right? Like it's like a cashew/al. >> Yeah. I'm just not a fan of the texture of it. >> It's the texture. It kind of like breaks in your mouth right away. >> Yeah. >> It was cool though. It was like a fun little food experiment. >> A science experiment. >> Mhm. Mhm. I am locking this in at B ultimately because I didn't really enjoy the taste of it, but I did enjoy the process of making it and how the finished product looked. What an amazing day it's been. So many cool products today. I just wish it wasn't over. I just wish there was one more product that we can include in this video. >> It's crazy you say that cuz we actually have one more. >> What What is this? We got some anime bath bombs, but not just any ordinary bath bombs. Blind bath bombs. So, bath bombs are a fun and trendy way to have a relaxing bath. But in Japan, they've taken it one step further. There are bath bombs that contain cool collectibles, usually anime characters. And this brings in the popular blind box aspect and mixes it with relaxation, turning your bath into a mini treasure hunt. Let's see which character I get. a One Piece bath bomb, blind box style. I don't know if blind boxes are taking over the world or if they've already been popular in different countries. We have the anime One Piece styled bath bomb where you don't know which character you're going to get until it dissolves in the water. And on the back, you can get six different characters. I want Luffy. Let's see what it looks like. Oh my gosh. So, we have no idea what it is. This is the coolest thing ever. The little details you notice from products that aren't in America is crazy. Like Japan has some of the coolest products of all time. But I think you can even just put it like this that I think the character is just going to come out. Oh, it smells so good. I'm not going to lie though, today has been such a fun day, guys. Like just testing new products, especially ones that don't really exist in America. You're just getting a taste of different cultures, which is awesome. Okay, it's shrinking. Please be Luffy. Three, two, one. Oh my gosh. Wait, that is the coolest thing ever. So, we ended up getting Luffy. I think you place him on the barrel just like that. Oh, I see. I see. It also comes with a wanted sign right here. Okay, now I'm going to put it on the front. And just like that, you got your one piece blind box bath bomb. This is incredible. Are you kidding me? I've been obsessed with blind boxes lately, and I'm starting to take baths more often now that I'm becoming unc. So, this bath bomb really added to the already relaxing bath. I'm going A tier. All right, now I'm satisfied after getting the last product. I hope you guys did enjoy this video. If you did, please be sure to drop a like. I think my all-time favorite product from this video had to be the card dispenser. mainly because I got the Rayquaza off my first pack. So, I think that is the luckiest thing of all time. I let Sabrina keep it for her store cuz they have taken care of me and I opened the Umbreon there 2 weeks ago as well, so it's the least that I could do. Please make sure you hit that subscribe button to get me to I was going to say 20 mil 30 million subscribers, guys. We are so close. Love you guys so much. And other than that, it has been your boy Faze Rug and I'm out. Peace.",
    "start_time": 0.32,
    "end_time": 2346.96
}