{
    "video_id": "4lUVARqIx10",
    "channel_url": "@dianaromaen",
    "transcript": "Diana and family. Hello la. No parking. Oh [Music] no. It is a parking violation. [Music] Attention. [Music] Huh? The garbage truck needs to be taken to the towyard. Okay, let's go. Woohoo. Huh? Hey. Oh no, my garbage truck. Uh, your truck was taken to the towyard. Here is your fine. Oops. Oh no. Have a nice day. La. Oh no. [Music] Toeard. Hi. Hello. I would like to pay this fine to get my garbage truck back. 300, please. Here you go. Thank you. Over there. My garbage truck. Wow, it is beautiful. Yay. Next. [Music] Done. 1 2 3 4 5. Great job. [Music] [Applause] I am ready to go. Let's go. Yay! [Music] Ooh! Oh no! Out of gas. [Music] Uh-oh. Huh? [Music] Oops. Wo! Wo! Wo! Wow! [Music] What is wrong? I am out of gas. H I know what to do. Washing time. Wheel. Wait. Officers are on the scene. Oliver, please take the forklift to the gas station. Okay. Just wait here. Okay. Bye. [Music] Oh, let's [Music] go. Thank you. Yay. Cool. Thank you. But can you please help me to fill up my truck? Yeah. Please push the button. [Music] Yay. Yes. Bye-bye. Thank you. Bye-bye. Now I'm ready to work. La. It is a beautiful day. Don't you think so? [Music] [Applause] Aha. Yay. [Music] La my baby. Help. Help. Yay. [Music] Do you know that your baby must have a car seat? I did not know that. Tow truck will take you to the kid shop. Thank you. Officers are on scene. Oliver, we need your help. [Music] Okay, let's go. [Music] Hello. [Music] Thank you. Yay. [Music] Great job, Oliver. Bye-bye. Kids shop. Nice. Welcome to the kids shop. [Music] [Applause] Now you are safely secured. Yay. [Music] My wheels. Uh-oh. Hey, my [Music] fruits. What happened? My tractor is broken. You need to go to the car service. I have a flat tire. Oliver, can you come here? Okay. Bye-bye. Let's [Music] go. Yay. Thank you. Fire [Applause] service. Done. Hello. How may I help you? Can you fix the wheel on my tractor? Of course. [Music] Wow. Which wheel? This one. [Music] Okay. Done. Thank you very [Music] much. Hey, here. Bye-bye. Bye-bye. See you later. Welcome to the car wash. Wow. Tractor. Hello. Hi. My tractor is dirty. Only you. We can wash it. Come on. Tam. Welcome. Hi. H. What do you have in your trailer? These are my eggs from my farm. Cool. Queen. Well, let's start. Wow. Bye-bye. Ooh. Done. [Music] Look. Chicken. Wow. They're hat. Uhhuh. They run away. Oh no. One. Great job, Oliver. I have to bring my chicks back to my farm. Okay, bye-bye. Nice car. Stop. Stop. Stop. Oh no. Sorry, but I used to drive fast. How can I help you? I have to prepare my car for the race. We will take care of it. Come on. Oh, idea. Yellow. Oh no, all of my stickers washed away. Oopsie. Do not worry. We will fix it. Please hurry up. My race will start in 10 minutes. Okay. Uh-huh. Cool. One, two, three. Good to go. Thank you. Bye. Yay. Yay. Yay. Yay. Yay. Car wash is available. Come on. Please. Police. Car. Can you wash my car, please? Please. Yes, sir. Come on. Welcome. Is it safe? Nothing will happen. Pig. Let's start. [Music] Oh no. Huh? Uh-oh. How am I supposed to catch criminals in a car like this? Oh. Now we will wash all the makeup off. Yes. Okay, let's go. [Music] Wow, son. My car is back to door. Bye. Bye-bye. Bye-bye. [Music] [Music] Chuck. Hi. I was in a construction site. That is why my car is dusty. We can easily deal with it. Come on. [Music] Okay. Go. Come [Music] [Laughter] [Music] on. Huh? What? Where is my truck? Oopsie. [Music] Something went wrong. But we can make it right. Come on. Okay. Look. [Music] Tada. Wow. Thank you. You are welcome. Let's go. Bye-bye, Oliver. It is done for today. Yay! Yay! Bye-bye.",
    "start_time": 1.04,
    "end_time": 688.519
}