{
    "video_id": "w65Ienn_xUc",
    "channel_url": "@dianaromaen",
    "transcript": "Diana and family. Guys, we are in a cardboard prison. Oh no. How are we supposed to escape? H look guys, there is a key behind the door. Let's check. I cannot. Let me try. Yeah. [Music] No. Look, the guard is coming. Come on, prisoners. I have something for you. This is for you. This is for you. Thank you. And for you. Behave yourself. M. What is this? I am so hungry. Oh, there's something inside. Cool. It is a saw. We can escape from the prison. Yay. Yay! I will try to cut the door. Come on. Uh-oh. Oh no, my saw is broken. H, there's something inside. It is a magnet. This magnet. I will get the key. Good idea. Yay. Go. [Music] Yes, we got it. Yay. Let me take over the handcuffs. Come on. One. You are next. Two. Three. Yes, finally free. Great job. Now I will open the door. I hope it works. Let's go. Yay. But what about my envelope? It is a way to escape the prison. Cool. According to the plan, we need to go through the vent. H look this way. Yeah. Come on. Ouch. Thank you. My pleasure. How are we supposed to get through this? H um [Music] idea this. Ooh. What is this? This one. Just [Music] watch. Let's go. Hurry up. Oh, yes. Go, go, go. Wow. Oh. So, the planet says there are three ways we need to split up. Oh, no. I think I think you should be. Wow. Are we going to drink soda? No. No. Soda is really bad for your health. I think it's for communication. Hello. Hi. I will go first. Blue. I am going to go with the green one. Good choice. And I'm going to go to the pink one. Cool. No. Are you okay? Spiders. Be quiet. They can find us. Okay. Sorry. I will try not to scream. Wow. Wow. Wow. Wow. Wow. What about you? Are you okay? Yeah, I am okay. But it is really rocky here. Okay. What a strange place. It looks like a lab. Huh? Oh no, I am in trap. H I have an idea. Open. [Music] Open. Red. I think this will work. Yes, it is ready. Come on, you can do it. Yeah, I did it. Yay. Great job. Where are the other guys? Oh no. Only you. [Music] Huh? What is on my head? Ha! Huh? Normal spiders. Oh no. It is locked. I think I need a key. A Where could it be? Look. Maybe it is inside the pot. Yes. Slime. Wow. Well, not here inside. H. What about this one? Noodles. I love noodles. So weird. No key inside. Wow. What is this? It is jelly. Yay. Yum. Yum. I think something is inside the key. What is that smell? Huh? Wow. Pizza. Yum. Yum. Yeah. Let's go. It is you. Pizza. I am so hungry. No, it is for our plan. Oh, no, no, no, no, no. Wow. Wow. What is this? Let's check. Look, it is a police uniform. Time to change. Yay. Cool. Now I look like a real policeman. This will help us to escape. Yeah. Oh no. Please do not arrest us again. Come on. It is me guys. Roma. So now we need to get the pizza to Roma and you need to distract the guards with it. We all need to take the elevator. Are you ready, guys? 1 2 3 [Music] go. Go. So, I think we need to go to the fifth floor in order to meet the guards. Now, it is your turn, Roma, to distract the guards by using the pizza. Good luck. Bye-bye. [Music] Hi. Who are you? I am a policeman just like you. And I brought you pizza. Enjoy. Thank you. I am hungry. [Applause] [Music] Guys, come on. Let's go. [Music] Huh? What is this? Uh, I have pizza. Uh-huh. We did it. Yay! Huh? Guys, look. Oh, no. Blazers. Okay, guys. We can handle it. Yes. Let's go. Come on. Yay. Great job. I see the exit. Let's go. Woohoo! [Applause] Oh, we are free. Yay! Yay! Wait! Where did you get this yummy pizza? Wow! Welcome to the cardboard hotel. Hello. Today we will have a vacation at the Cardboard Hotel. Yeah. Let's go. Come on. Hi. Hi. Three rooms, please. Okay, let me check. H. Only luxury, standard, and pet rooms are available. Which room will we get? 1 2 3. That is what we need. Try your luck. Okay, let's check it out. Great idea. I have a standard. Wow. Wow. I have a luxury. Yeah. Yay. I have a pet room. Oh, please use the elevator. Let's [Music] go. It looks so cool. Eight. Woohoo. like it. [Music] Oh no, the elevator's stuck. Do not [Music] worry. How can I help you? The elevator is stuck. Help us. Huh? Help is coming. Oh yeah. Oliver, there is work for you. Okay, let's go. It is broken. Open. [Music] [Applause] Pink, purple, blue, yellow, [Music] orange. Done. Yay. Great job. You are welcome. Yes. My room is number one. Where is my room? My room is number two. My room is number three. Is this a fingerprint? Wo. Wow. Wow, what a beautiful [Music] view. Uh, wow. I have a PlayStation. [Music] Yeah, I won. Wow, a safe. Money. Cool. Huh? It is chocolate. [Music] Yes. Uh I like my room. What is [Music] next? Wow. Nice room. cardboard slippers. Cool. So beautiful. Oh, I have a mini bar. Let's check inside. Yes. Huh? How much? It's too expensive. Huh? What is this? Ooh. There's construction [Music] outside. My [Music] turn. Oh, what? How am I supposed to live here? Does someone live here? Hello. No. Oh no, it is a scratch. Who did this? What is this? It's a cat. Oh, I think she is hungry. Yes. Lunch [Music] time. So hot. AC this so [Music] cold. Oh no. So hot. Perfect. Yay. H idea. Hello. Hey guys, let's have lunch at my place. Okay, I am coming. I'm in. Yay. Yay. Come on. Come on. Okay. Wow. You have the best room. Do you have a PlayStation? Yes. Cool. Look. Yeah. Wow. Could I have one coin, please? Yes. Catch it. Thank you. Wow. Do you have a mini bar? Yes. You can take whatever you want. Thank you. [Music] Guys, I'm going to order some snacks. Yay. [Music] What can I do for you? Can I order some snacks right away? Oliver, the guests are hungry. Okay. [Music] Hey. Hello. The snacks are here. Yay. Fun appetite. Thank you. Enjoy the food. Yummy [Music] yummy. Oopsies. I think we need some music. Yes. Woohoo. [Music] Guys, let's drive the cars. Yay. [Music] [Music] Wow. Let's go. Wow. Yay. [Music] [Applause] Go, go, go. Ah. Come on. It's smooth. Ah, it is okay. Yoohoo. Let's check this. H you. Oh no. Vroom vroom vroom. Uh-oh. Yay. It is so fun. Hm. Thank you for the perfect vacation. Not so fast. First, you need to pay for the destroyed rooms and broken cars. But we do not have any money. Then fix what you have done. Okay. Oh my god. Let's start the cleaning. [Music] Yum. [Music] Wow. Finish. Yay. [Music] Oh no. Let's start. Yes. Come on. H. Uh-oh. Done. Yay. Look at my hair. It's giving me another We fixed everything. Great. Next time, behave yourselves. Bye. Bye. Goodbye.",
    "start_time": 1.04,
    "end_time": 1087.4
}