{
    "video_id": "z2RKHzFQEVo",
    "channel_url": "@dianaromaen",
    "transcript": "Diana and >> family. >> We're going to the cinema. >> Yeah. >> Come on, stop. >> Candies are not allowed in the cinema. >> Oh no. Oopsie. Give me your candies. >> Okay, you can go. Thank you. Come on, Oliver. Come on. Done. Let's go. >> Welcome. >> Yeah. Woohoo. >> I cannot wait to see the movie. Me, too. Let's go. >> Yay. Stop right there. >> Huh? >> No candies in the cinema. Put the candies inside the bin. What is happening? >> Okay. >> I do not want to. >> Bye-bye. >> Oh no. >> Great job. [Applause] >> Idea. >> What? >> Huh? We are going to sneak candies into the cinema. >> Yay. [Music] >> You look fabulous. You too. Come on. Yay. >> Wow. >> Yo-yo. Hello. Hi. What a strange hairstyle. Let me scan you. >> No need for that. We can just um sing for you. >> Yeah. >> Uhoh. >> Stop. Stop. Stop. You can go. You can go. >> Yeah. >> Goodbye. Goodbye. Goodbye. They were so loud. Welcome. Cotton candy. Do you want some? Yeah. Okay. Thank you. Um yum yum yum yum yum yum yum. Um um yum yum yum yum yum yum yum yum yum yum yum. Awesome. Um, yum, yum, yum, yum, yum, yum, yum. Um, I love candies. Now, let's try this costume. Dentist. >> Um, yum, yum, yum, yum, yum. >> Oh, hello. Let me check your teeth. Oh, no. The dentist. >> Come on, guys. Woohoo! Wow! Yum! Yum! Yeah! Great job! >> Yay! [Music] Idea! Let's go! This one! Open! Open. [Music] Let's bring the Santa Fanta. Oh, done. Cool. Damn to damn. Now I am a cleaner. Huh? Hello. Where are you going? Um, I am going to go clean the cinema. Oh, okay. You can go. Oh, yeah. What? Where is my cleaning stuff? Hey. Huh? It is mine. Mine? >> Mine? >> I know what you're talking about. I've been a command. You didn't even know that. >> What? >> You are an impostor. >> Hey, a no. >> I have to go clean the floor there. Okay. La. Huh? Lollipop. Yummy. I'm going to stay here for a while. Cool. >> Chewing gum. Yum. Yum. Cool. Security will never find out. >> Ouch. >> Huh? What happened to you? My hand got stuck at a vending machine. What? That is crazy. [Music] I'm sorry. Please come in. Ouch. So sad. [Music] >> Wow. Um, yum, yum, yum, yum, yum, yum, yum, la. [Music] Hi. >> Hello. >> Smells like candies. Let me scan you. What? Oh no, >> I am busted. >> Give me your headband. [Music] Um, yummy. I knew it was candy. Now give me your bracelet. Fine. Take it. Oh no. Marshmallow. Not allowed. And now show me what is inside of your purse. Okay. Huh? Candy again. [Music] Now you can go. Thank you. I know my job. Wow. [Music] So delicious. Wait, I need to scan you. What if I just show you a trick? Okay, here. Hold it. Wow. Tam. Yay. What is this? Um, nothing. Uh-oh. Yeah. Oh no. [Music] candies. Not during my watch. Oh. Um, I remember I uh I have to go do something. [Music] >> Hi. What do you have there? Let me scan it. It is just my baby. Anyways, your baby is too suspicious. I need to scan her. Oh no. [Music] [Laughter] >> She beat on me. >> You are funny. It was just juice. Let's begin. Sh. Cool. >> Bye-bye. >> We are going to the cinema. >> Yay. >> Go. Next. Hello. What would you like? Um, yummy, yummy, yummy. Yum, yum. I cannot wait anymore. I want the biggest popcorn you have. Huh? What? I just want to place my order. No, no, no, no, no, no, no. Respect others and do not skip the line. Okay, I am sorry. Uh-huh. Done. Thank you. Enjoy the movie. Come on. Hi. May I see your tickets, please? Here you go. 1 2 3. Welcome. Yay. Let's go. Hello. Oh no. Wait. Hi. Here's my ticket. Bye-bye. >> What? H. >> Welcome. >> Guys, take our seat. Yay. >> Wow. Yum. Yum. Yum. Yum. Yum. [Music] The movie has already started. >> Oh no. Please keep waiting. >> Ow. Watch your step, please. >> Sorry. >> Oh no. >> Hey. Hey. What are you doing? >> Excuse me. I I also want to see her, too. No. No. No. No. No. [Music] Huh? >> Come to the movies a little early. Next time I will be on time. Okay. >> Huh? What? Whose phone is that? Oh, wait. It is mine. H. It is in my backpack. Ooh, what is this? Hold this. Oh, ducks. This >> oops. >> Found it. >> Yeah, >> finally it is over. >> Hello. >> Hi. >> Yes, I am in the cinema. >> Wow. >> And it is so fun. Next time you have to go with me. Sh. >> Quiet, please. >> Thank you. Huh? Be silent. You were in the movie, please. >> Okay, I will call you later. Bye-bye. Sorry. [Music] [Laughter] Ow. Ow. Ow. Stop. Stop. Stop. Stop. Stop hitting me. >> Attention, please. >> Huh? >> What? Do not disturb other people during the movie. I got it. Okay. >> Yay. Yum. Yum. Yum. Yum. Yum. Yum. [Music] Wow. Wow. Wow. H. Oh, what is this? Um, yummy yum yummy. Hey, what is happening? >> Huh? >> Oh, no. No lettering in the cinema. >> Uh-oh. It is not me. >> Huh? Goodbye. >> Yay. Yay! Let's go. Yes, this was fun. >> Wow. Thank you for cleaning up after yourself. Bye.",
    "start_time": 1.04,
    "end_time": 756.0
}