{
    "video_id": "dqca0SYhXvc",
    "channel_url": "@dianaromaen",
    "transcript": "Diana and family. Hi. Thank you. Welcome everyone. Come on. Come on. Yes. Let's go. Wow. Hi there. Hello. What is this? Lollipops were made 1,000 years ago. I did not know. [Applause] Wow, so beautiful. [Music] Hello. Hey. Um, this is a lollipop. Ah, come on. Red. This. Okay. Strawberry. Thank you. Yum. Yum. Yum. Yum. Oliver. Do you like it? Yeah. M him. Interesting. What is next? Wow. [Music] What is your favorite candy? Chocolate. Okay. [Music] Oh, first. Cool. Great job. Yay. Uh-oh. It is easy. Yes. Fantastic. Finish. [Applause] [Music] Wow. Do you want to play? Yeah. [Music] Aha. Yay. [Laughter] [Music] Yay. Roma. Roma. [Music] [Applause] [Music] Yay. Yeah. Oliver. Oh, come on. Wow. Banana. Yes. [Music] Yay. Yeah. [Applause] Yay. Welcome. H. Come on. Okay. Wow, interesting. Thank you. Yep. Take a look at this. Uh-oh. Let's check. [Music] Aha. [Music] Wow. Yum. Yum. Yum. Yum. Yum. Yum. Yummy. Lunch time. [Laughter] [Music] So [Music] cool. Thank you. You are welcome. M. So yummy. I like [Music] it. Um, yummy. Yummy. Wow. Yum. Yum. What is this? [Laughter] Wow. [Applause] Hi there. Yay. Cool. [Music] Peekaboo. Come on, Oliver. Okay, Mommy. A next stop. It looks so cool. Let's start. [Music] Hy. [Music] Yay. [Music] Ooh. No. No. No. No. No. Oh no. [Music] Yay. [Music] [Applause] Wow. Much better. Yeah. Money. Wow. H. It's Yeah. Very niceum yum yum. Huh? [Music] Wow. Time to dance. Uh-oh. Time to play. Wow. Come on. Come on, Oliver. [Laughter] Okay. Um, yummy, yummy. Help a petite. Wow. So yummy. It is spicy. Oopsie. Bye-bye. Wow. Yay. Come on. Need to find the candles. Let's go. Hello. Yay. Yay! Peekaboo! Did the deal! Oliver! [Music] Yay! Surprise! Wow! Come on! Yay! [Music] A! Ah! Oh! Bye-bye. Bye-bye. [Music] Hello. Wow. Yeah. Hey. Hey. Cool. So beautiful. Come on. Okay. Wow. [Music] Look. Yeah. [Music] Yeah. Yes. Let's go. Come on. Yay. Help me. Bye-bye. [Music] Wow. [Music] Wow. Cool. Yay. Let's begin. Super high five. Yes, we are going to the zipline. Yes. [Applause] Go. Go. Wow. Ready. It's so fun. [Music] Wow, yeah, it looks so cool. Let's take it. Come on, let's start. Finish. Yay. Yay. Yay! Wow! [Music] Much better. I like it. Mhm. Born [Music] apple. Yummy. Goodbye.",
    "start_time": 1.04,
    "end_time": 588.04
}