{
    "video_id": "e6GPb7mJgMY",
    "channel_url": "@dianaromaen",
    "transcript": "Lana and family, welcome to the cardboard hotel. Wow. H, it is closed. First, we need to buy the keys. Cool. I only have $1. Okay. Blue, I have $10. [Music] Yellow. I have $100. Cool. Red. Let's move in. Yay. [Music] This H. Please. My room is so dirty. I need to clean it. [Laughter] It is too much dust. Please. One, [Music] two, three. This is your new home now. [Music] [Applause] [Music] Huh? What is this? Uh, pink with pink, orange, and green with green. Yes. Hello. Huh? Are you hungry? Give me a moment. Okay. Cheese. Yum. Thank you. Cool. It is so cute. Wow. Now my room is clean and tidy. Interesting. What is next? It looks so cool. Wow. It is pretty cozy here. Yay. Let's watch TV. Yes. Huh? Huh? H cool. Super. Wow. Wow, what a nice room do I have. Oh, what is [Laughter] this? Amazing. Wow. [Music] Cool. This is the best service of my life. [Music] [Applause] Huh? The water's leaking. [Applause] Huh? There's water dripping from the [Music] ceiling. What is going on? Help. Roma, you are flooding my room. I room is flooding too. Roma, what should we do? I have an idea. Wow. I will fix everything. Yay. [Music] [Music] [Music] Yeah. Let's try everything. Come [Applause] [Music] on. Finish. [Laughter] Yay! I want to dance. Yay! Louder. Oh no. Uh, you broke the ceiling. Yeah, it is fine. I can order the bricks and we can fix everything. Hello. I need a lot of bricks. Okay, thank you. [Music] The bricks are here. Wow. Wait, I'm coming. I am here to help. Okay. Give me the bricks. [Music] [Applause] [Music] Yay. Cool. Wow. Oh, my stomach is grumbling. Roma. [Applause] [Music] [Applause] [Music] Hey, Roma. Roma. [Music] Roma. I am hungry. Me, too. I have an idea. [Music] This [Music] cool la. Yes. What happened? Do you have something to eat? I can cook something for you. H. What should I cook? Eggs. [Music] La. Tomato. M. Spaghetti. Yum. Yum. Yum. Yum. Yum. Yum. The food is ready. La. Roma. This is for you. Thank you. Wow. Catch. Woah. Woah. Woah. Woah. Yay. Thank you. Ah, yummy. Um, yum. [Music] Cool. Fire. Oh [Applause] no. Fire. Fire. Fire. Help. Fire. Firefighter. Come quick. My room is on fire. Help. Fire. Fire. Fire. Do not worry. Done. Yay. Oh no. I guess you need a new house, huh? La. Huh? What is this? cardboard school. Let's check. Huh? Hi. Hi. Good morning, students. Time to study. Let's start chemistry lesson. Okay. Repeat after me. Uh-huh. [Music] It is fake. That is how we do it in cardboard school. I could try a real experiment. [Music] Huh? Ready? Ice. Wow. What is this? Is it cold? Yes, very cold. Oo, I have never seen anything like this before. This is the best chemistry lesson. Yay! [Music] Amazing. Next lesson. Let's have physical education. Let's go. 1 2 3 Your imagination. Yay! [Applause] Yay! Huh? Y! This is a box. I can show you a real ball. Yay! Come on. Wow! Oh, soccer ball. Ooh, yeah. Can I try? Of [Music] course. Cool. Let's play. Come on. Yep. Oh, yes. Yay. Let's play basketball. Yes. [Music] Yay. Uh-oh. Round ball is so strange but so cool. Yes. Math lesson. Who knows how much is 2 + 2? H six. Uh no it is wrong. 1 incorrect. 22. Sorry but you are not right. H idea. I have only one apple. I need more guys. Do you have more apples? Yes. Yes. Tam. Yeah. So, two apples plus two apples equals 1 2 3 4. Four apples. Yay. [Applause] Thank you, Roma. You are welcome. [Music] Caterpillar lunchtime. Hello. Hi. What do you want today? What do you have? Well, we have some pasta today. Cucumbers, tomatoes, and broccoli. I want everything. Great choice. [Music] Have a nice meal. Yum, yum, yum, yum, yum, yum. Okay. Can I join you? Of course. [Music] [Applause] Super. It is cardboard. Of course, we are in the cardboard school. Yum. Yum. Yum. Yum. Yum. Yum. Yum. Yum. La. Guys, I have real food. [Music] Wow. What is this? Fruits, nuts, and cookies. What? You can try. Okay. Bonus. Huh? Yummy. Yummy. Yummy. Yummy. Um. Um. Yum. Yum. There's nothing better than cardboard food. Yum, yum. Biology. Have you brought your plants? Uh-huh. Yes. Do you know how to take care of them? Flowers need to be trimmed. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. We need to wash the leaves. They need to be watered. Yes. Flowers need real water. What? Huh? [Music] Do you want me to water your flowers? Okay. [Music] Oh no, my flower. Oopsie. Water is bad for cardboard plants. Roma, principal wants to see you. Oh no. Come in. Hello. Hi, Roma. I've heard so much about your recent achievements in our school. Want you to stay with us a bit more. I still have a lot of stuff in my world, so I have to [Music] go. H. Yes, it is enough for today.",
    "start_time": 1.04,
    "end_time": 856.56
}