{
    "video_id": "_W09JMeN2J8",
    "channel_url": "@dianaromaen",
    "transcript": "Lana and Noah family. Time to play. Granny, come play with us. I cannot. I have so much work to do. Put away the leaves, set up the scarecrow, paint the fence, and collect the eggs. [Music] Oh, so tired. idea. Let's help her. Yeah. A Don't worry. We'll do everything for you. You just take a rest. It will be great. Come on. Down, Granny. It is my to-do list for you to do. Let's do this. Yeah. Let's get to work. is easy. [Music] This is going to take forever. Huh? Where are you going? Wow. Check it out. [Music] [Applause] Yeah. [Laughter] Oh. Woo! Look at yourself. I am going to catch you. I'm not even there. Great job. Oh, yes. Next step. Oh, no. All the crows will eat grandma's plants. What do we do? You're not going away. Um, we can make a scarecrow. Yeah. Oh, look at that. Oh, cool. Let's do the face. Okay. Much better. Yay. Good. Huh? It does not work. We need another scarecrow. H I have an idea. Delivery. Uhhuh. Delivery is here. Yay. Open. Open. [Music] Oh no. Wow. [Music] Yeah. Yeah. [Applause] Very well. Oh, they need to paint the fence. Let's go. Red, purple. Ooh, this is a nice massage. Anyways, [Applause] wow. Let's paint. Lao [Music] [Applause] H. I have an idea. La, what is this? I can wait till she is done. Okay. Wo! Wow! One more. So beautiful. Huh? La. [Music] Oh no. Hey, that is not fair. So, all right. H. Let's do it faster. Damn the dam. Cool. Wow. Wow. It is easy. Whoever collects all the eggs first wins. Let's go. Yay! Done. Hey. Uh. Um. [Music] Huh? Who do you think is the winner now? [Music] [Music] Oh, poor chicken. Better set her free. [Music] Oh dear. Guess one. Wow. You're a cheater. Finished. A I am so tired. Me too. Damn. Kids, let's play. Maybe later. We just want to chillax for now. Uh-huh. Hello. Hello. Welcome to superhero school. Cool. What traits do superheroes have? Come on. Speed, courage, power. You are right, Oliver. What do you think? Kindness. Great. Now it's time to practice. Yay. Wow. [Applause] Kindness test. Oliver, come on. Okay. Okay. [Music] Wow. [Music] Green. Hi. Red. Oh no. I will help. Yeah. Super hero. Come on, [Music] green light. Let's go. La [Music] done. Yay. Thank you, my dear. You are welcome. High five. I am back. You passed. Yay. Yay! Super power test. Are you ready? Yes. Come on. Let's go. [Music] Cash drop. Oh. Oh. Oh no. The rocks are blocking my way. Help. Help. Time to check my strength. One. Wow. Two. Three. Done. Good job. Thank you. You're so strong. You are welcome. Let's begin. Open. Open. Done. Cool. [Music] You succeed. Yay. Speed test. Come on. Come on. Okay. I am ready. Hello. Hello. Hey, [Music] lava. Oh no. Help me. My baby is in danger. Help me. Help. Somebody help me. Do not worry. I will rescue him. Yay. Woohoo. Wow. Adam, hold on. Okay. Wow. Wow, here's your baby, Adam. Yay. Thank you for saving Adam. I am always here to help. Bye-bye. You did it. Next is the courage test. Yes. Yes. Yes. Let's start. [Music] See you. I miss you so much. Huh? Hello. What happened? My lovely puppy is missing. I will help you find your dog. Yay. Wait, here. I will check [Music] crocodile. We superheroes are not afraid of anything. Yay. [Music] Yay. [Music] Wow. Here is your puppy. Thank you. Yay. A Yay! You are so brave. Yay! [Applause] Great job! You proved that you are real superheroes. Bye.",
    "start_time": 1.04,
    "end_time": 687.56
}