{
    "video_id": "7ZolBFO_iZ4",
    "channel_url": "@likenastyaofficial",
    "transcript": "like Fast Jack. >> This video is an ad for Mattel. >> This is a boutique hotel from Monster High. >> Look, it's Draculaura. [Music] Spooky. [Music] Monster. [Music] >> Wow, we're like in the real boutique hotel. >> I told you it was easy. Now, let's get ready for the adventure. >> Welcome to Boutique Hotel. You need to complete my tasks and get a doll as a reward. This is the only way you can go further here. It will be Frankie Stein. Find four keys. >> Let's get to work. [Music] There's definitely nothing in here except bats. [Music] I found the first one. The first key. [Music] Ew. Yuck. [Music] I think I found it. [Music] >> Not the key. >> These weird pool noodle cutup things. Wait, I think I see something. I found the key with the spider. We found two and two more to go. I found the third one. Only one more to find. [Music] We did it. >> Hooray. >> Well done. Take Frankie. [Music] >> Dry Laura's room. Where's the scallet? >> You woke me up. I can't fall asleep without my plush bear. Find it and fix it. For this, you will get Dracula. >> Let's find the bear. >> Wait, I already found it. That was an easy challenge. Wait, >> I found one, too. Okay, we need to find the other parts. >> Yeah, >> I found one of the hands. >> Nothing there. Wait, I found the hand. [Music] This is the final piece. [Music] Thank you. Now I can fall asleep tightly. Take Dracula. [Music] >> The adventure is just starting. [Music] >> I was very hungry. feed me and then you will get Claudine Wolf. >> Okay. [Music] >> What kind of sandwich is this? I want a sandwich in the Monster High style. [Music] Let's make a Monster High sandwich. [Music] >> Done. >> This is a completely different matter. Very tasty. Claudine is your one. >> Yay. Okay, let's get it. Let's go to the next room. >> This video is an ad for Mattel. [Music] >> Wa. >> It's so cozy in here. >> This is the last room. Fold the magical puzzle and find yourself at home and the reward will be clear denial. >> Let's find the puzzle pieces. [Music] Yay! >> These are very strange book covers. H I've got an idea. [Music] Let's find more. [Music] [Music] No, no, no, no. Wait. Put it right there. >> Yeah. >> No. Wait. >> Wait. Got it. Wait. Where's the last one? >> Wait. Try to find it. Okay. I checked everywhere. Do you have it? Maybe. >> Wait. Is this I found it. >> Yes. Come on. Oh, yeah. I found it. Wait. Put it here. [Music] We solved it. High five. >> You did it. Clear is yours. See you later in Monster High. >> Yay. Monster High. Monster High. Monster. >> With imagination. Everything works out. >> Thank you, Nastia. What was that song that was playing all the time? >> Come on, I'll show you. This is the bright song from Cat Eye. Let's watch it. [Music] High monster high she can fly high the party [Music] monsters. >> I love the caliberation with tad eye and monster high monster. [Music] >> This video is an ad for Mattel. He's got spirits.",
    "start_time": 0.16,
    "end_time": 453.52
}