{
    "video_id": "G4MdcbZQGRI",
    "channel_url": "@likenastyaofficial",
    "transcript": "like master. Yeah. Yeah. Trackman. [Music] Hey, give it back. [Music] [Applause] [Music] Let's go in. Wow. Wow. Wow. [Music] We need to find a key. Hey. Hey. >> The key is hidden behind one of the ropes. >> Okay, I'll go first. Okay. >> Hey, you got me so wet. Ew. Ew. You You can go first. Okay, fine. [Music] Not that bad. Um, I guess I have no choice. >> Wait, that wasn't that bad. I like this. I think this one. What can be worse? [Music] Why is everything bad going to me? [Music] Yeah, we can escape now. Wow, so fluffy. [Music] [Music] Much better. [Music] [Music] It's locked. Let's find a way out. Mhm. [Music] Hey guys, look. >> To go further, you must find these four items. >> Okay guys, let's find it. >> Uh-uh. >> Uh-uh. [Music] Good job. >> Now find three more. H >> I found it. >> Wrong. >> Mhm. >> Guys, I found it. >> Now just two more. Yay! Okay, two more to go. Let's go, guys. >> Guys, I found it. >> Great job. Now the last one. >> Okay, one more to go, guys. [Music] H. Mhm. Aha. [Music] Ah. Ah. [Music] >> Guys, look. We found the last one. >> Yay. Yay. >> Yay. >> Congratulations. You can go now. Wow. [Applause] [Music] Wow. Aha. [Music] [Music] Yeah, it's locked. >> Look, there's a button. >> Wow, there's a bucket, too. Look, [Music] I know what to do. [Music] [Applause] [Music] [Applause] [Music] Yay! Yay! Huh? [Music] Alex, it was you, thank you. like pasta. >> Happy Halloween, [Music] [Applause] >> guys. It's Halloween. Go faster. [Music] Can I help you? [Music] [Music] Yay! [Music] >> I know. We need a vampire mirror. [Music] I know. [Music] [Music] >> Mhm. I like it. [Music] Um, how can I help? Wow. [Music] Wow. [Music] Mhm. [Music] Why are you [Music] ah Ah, [Music] [Music] [Applause] >> delivery. Wo! Wow. [Music] >> Um, maybe I have something for you. [Music] >> Time for a fashion show. [Music] Huh? [Music] [Music] Here. Use this. [Music] Good job. [Music] How can I help you? >> No problem. [Music] [Music] Rob, which one do you want? [Music] Look at that. [Music] How can I help you? [Music] M idea. [Music] [Music] M. [Music] Good choice. What? Wait, one more thing. [Music] >> Now you look great. Bye. [Music] [Applause] >> How can I help you? H I think I might have something for you. [Music] Pick one. [Music] Aha. [Music] [Music] [Music] [Music] I think I have something for you. Just wait here. Bye-bye. [Music] [Applause] [Music] It's time to go home. [Applause] like fast. >> Hi guys. Today we're in a haunted house. Time starts now. Let's go. [Music] What's this? Oh my god. [Music] I don't want it. Where is the head? What is he? [Music] >> Okay. Zombie. [Music] [Music] Now I feel [Applause] better. Now >> I think it's not really scary here. Yeah, it's all not real. Let's pour it in. It's some kind of witchcraft. How do we get out of here? We should like check the water off the walls. >> Oh, magic tea. I think we have to make the magic tea. >> Yeah, it says step 1 2 3. So, water plus a color, then it turns pink. Let's find the tea first. Mhm. >> Wow. Maybe the tea is in here. Spider legs special potion. What is this? Yeah, it's the tea. Let's go. >> Ew. Ew. >> It smells so bad. It's not turning pink. Maybe we add this. Ew. Not working. >> It looks glue. >> Blue. Maybe we can find something. [Music] Lemon Evelyn say it's turning pink. Oh my god. >> Good lemon [Music] cameraman. Do you want some? >> Nope. >> Ready? Yeah. >> M. That is so good. Everyone, let's go inside. Okay. >> Oh my god. [Music] >> One eternity later. >> I can barely fit. I have to crawl. >> Welcome, >> Evelyn. Come here. Come here. Come here. It looks so cool here. Time is running out. We have to hurry. >> Yes. Fast. Look. Poster. I think we have to make a Halloween snowman. Look. >> Okay, let's start. Yeah, you got it. Flip it. Good job. Okay. >> No. >> Oh, the head. >> Help me. Help me. >> Final touches. On you go. What? >> What is this? >> I like money. Maybe we have to get him >> $10. I got one. I think we need to find 10. Yeah, I found one. Look, the next one. Look. Do you find one? Emily, he ate my hand. He ate my hand. >> I'm just kidding. H the fifth coin. This the sixth coin. And the seventh coin. The ninth coin. Yay. We have to find the 10th coin. Yeah. Times are running out. Darts. We should play. [Music] >> Yay. 10 coin. [Applause] There be treasure there. [Music] Wait a minute. Okay, we need a key. Look, here. Nothing's here. [Music] Look. Not there are missing pieces, though. Let's find all the missing pieces. Look, the first piece. What is this? It's so sticky. Put it down. [Music] >> Look, we found the other piece. Look, the next one. [Music] Look, a gold coin. Yes, there's one more item left. Evelyn, come here. I found it. [Music] Wow. [Music] >> Wo. We have to go through without touching it. >> Yeah. We have barely any sand left. We have to hurry. >> Yes. Come on. Oh no. Look. The spider is coming. [Music] >> Evelyn, the spider is not real. It's a toy. Look. >> Bad spider. >> Yes. Okay, we made it. Come on, Sky. Oh, no. Time's up. Now we have to stay here overnight. >> Lonely. We're so lonely. >> I think we can sleep here. >> Yeah, it could be comfy, right? >> Look, this can be as Okay, wait. Grab this. >> It's a blanket. We're not going to be that cold tonight. We're not going to make it out. I know. Who designed this escape room? What should we do? I don't know. I'll lay here. Who is that? I hear something. What's happening? I hear something. What's happening? What? I hear something. >> Dad, you're here. [Music] >> But what are you doing here? >> We were just playing. >> Go clean up your room. >> Bye. [Music]",
    "start_time": 0.24,
    "end_time": 1369.859
}