{
    "video_id": "siSkwrbp8uM",
    "channel_url": "@likenastyaofficial",
    "transcript": "light and fast Jack. >> Oh my gosh, we're going to be late. Yeah, we are going on the cruise store at 50. We can't be late. We have the coolest. >> Yeah, it's called Ultimate Family Townhouse. We are so late. We cannot miss this. Oh no, we can't lose our >> We made it. Thank god we're not late. >> Um Nia, I think I found your nails. >> Oh, thank you. >> Hey, Nasia, welcome. Welcome to your family suite. Please come in. This looks so cool. Look, >> there's a slide. We are going to be here all night. >> It's time for a room tour. These three floors are for us. And look, there's musical thingies, my jiggies. There's so much fun stuff to do here. Look at our beds. They're so cute. There's two different rooms. And look. Okay, let's go inside. Bye. It's the master bedroom. Look, there's three hats. I think I'm going to steal this one. Look at it. Cute. Okay, look at the view. The ocean and the bathroom. Woohoo! Cute bathroom. Go move on to Evelyn. Wow, look at this cool room. All the cute little sea turtles. And there's two beds. Hello. Look at the clouds. This is such a cool room. Look at this little cute bathroom. There's a teddy bear. Nasha, I think we're going to sleep in here. This is so cool. Look, there's a slide. Wow. >> Do you want me to go down it? >> Yeah. I don't think we're allowed. >> We're definitely allowed. This is all for us. Oh, >> hopefully we make it out. [Music] [Applause] I'm super terrier. >> Do not attempt this at home. We are professionals. Trained Pringles. Okay, let's see the game room. This is such a cool table. >> Shut the Wow, you can play all kinds of different games. Evelyn, I think I see your favorite thing in the world. A snow cone machine. I know her. Guys, we're going to make a lot of snow pounds tonight at 1:00 a.m. There's a jacuzzi. Look how cool this little balcony is. It is hot on a hot weather. Oh, this is so cool. We're so lucky we're here. >> Yeah. Thank you, Royal Caribbean. Wait, what is this? Or a mini water park. This is so cool. >> I know. We will look at it shortly, guys. I think that's Jojo FA. Let's say hi. Absolutely you can. We've been watching your show. >> Oh, hi. >> She was so nice. Let's take a ride. [Music] >> Getting ready for a party with the fun challenge. [Music] [Applause] [Music] Okay, my turn. [Music] >> I choose to skip it. >> Huh? [Applause] [Music] >> Matching. I like it. Ready for the party? Let's go. [Music] Yeah. [Music] Heat. [Applause] [Music] Hi. We're going to the water park. >> It's so cool that our room leads straight to the water park. Yeah, we're going to have so much fun. Let's get closer. >> That water park is too small. Let's go to the adult one. >> Yeah, come on. >> Look at those fun treats. Let's get some ice cream. >> We need a lot of sprinkles. >> Thank you. Strawberries. Ice cream is so good. Mhm. [Music] >> Let's go. This is going to be so cool. I'm going to make it first. Go here. [Music] Wo! [Music] [Music] That's so fun. Woo! Is it the end already? Oh my god, that's so cool. 3 2 1 I can go on. I'm really scared. This is my biggest fear. I You can do it. It's fine. That was so fast. [Music] Wow, I'm so tired from all these rides. Yeah, let's get some milkshakes. >> I want this one. I want this one. >> Cheers. >> Cheers. >> That's so good. So good. [Music] Hi guys, we are going to a fancy dinner. We got your stuff and tell us if you like our outfit. >> Right now we're doing something really fun. We're doing our first glam boss with Cole Weren. [Music] Your video was so good. You turned out amazing. Yeah, yours was really good. Oh, look. That's our restaurant. >> This drink is so good. >> Wo! >> I love red sauce on pasta. White sauce is definitely better. No, I think red sauce is better. I think white. Well, guys, comment what is better. That smells really good. >> It's never too late for dessert. >> And now it's showtime. [Applause] [Music] [Applause] [Music] [Applause] [Music] I'm so excited to go to the water park. >> Same. It was so fun. Wait, it's literally raining. >> Rain. This is actually good. Now we can play games. >> Finally. This is so fun. I can be here for a while. I know. We never want to leave this amazing room. Look at my cute little dinosaur. >> Wo! This is so cool. I love this place. [Music] >> We made it to the island. Let's go explore. >> Yeah, let's go. [Music] >> So cool. you right in this room. So cool. This is our private island for the rest of 3 hours. This is so amazing. I can't wait to look at all the slide. >> Yeah. Did you see the long one? >> Yeah. It's going to be so cool. Look, it's a whole beach club for us. >> Thank you. This is so amazing. >> Look at these drinks. >> Cheers. Now we're going to our cabana. >> There's a shark. >> Nastest party. >> Let's go down the slide. Yeah. >> 3 2 1 Now me [Music] Wow, we definitely have to visit all of them if we have time. Here we go. Right there. Right here. [Music] Don't let me say I'm so scary. Wait, let's go with that one. Let's go with that. [Music] Oh my god, it's so >> This is the best day ever. >> Yes. I had so much fun with you. Oh, we had so fun in this incredible place. >> I'm so sad we have to leave. Mhm. >> Guys, we are leaving right now and I'm so sad. I want to never leave. I know. Star of the Seas Royal Caribbean cruise was my favorite cruise ever. Yeah. Thank you for inviting us here. Bye. We have to like hurry. Go.",
    "start_time": 0.16,
    "end_time": 714.959
}