{
    "video_id": "LNcSTiEUxsA",
    "channel_url": "@babybus",
    "transcript": "Baby Bus, [Music] welcome to the Halloween Hotel. Which room would you like? Time to think big. [Music] Do you like the white ghost? Baby, >> do you like the purple broom? Oh, what about the orange pumpkin? Yeah. Yeah. H happy Halloween. Let's go trickor treat. Go orange room. Go. Baby pumpkin puts on an orange hat. Orange hat. Baby pumpkin puts on an orange coat. Orange coat. Baby pumpkin knocks on a creaky door. Creaky door. Trick door treat. I'm a baby pumpkin. [Music] Baby, >> do you like the black bat? Baby, do you like the orange pumpkin? What about the white goat? B happy Halloween. Let's go trickor treat. Go white room. Go. Baby ghost puts on a white hat. White hat. Baby ghost puts on a white sheet. White sheet. Baby ghost says boohoo. Boohoo. Treat or treat. I'm a baby goat. Go. Baby, do you like the purple broom? Baby, do you like the white ghost? Uh-huh. What about the black bat? [Music] Happy Halloween. Let's go trickor treat. Go black girl. Go. [Music] Baby vampire puts on a black hat. Black hat. Baby vampire puts on a black cloak. Black cloak. Baby vampire hides in a scary coffin. Scary coffin. Trick or treat. I'm a baby vampire. [Music] Do you like the orange pumpkin? Ba baby. >> Do you like a black bat? Aha. What about the purple broom? >> Yeah. Yeah. B. Happy Halloween. Let's go trickor treat. Go purple. Go. Baby witch puts on a purple hat. Purple hat. Baby witch puts on a purple cloak. Purple cloak. Baby witch rides on her broom. Her broom. Trick or treat. I'm a baby witch. Haha. Time to get the party started. Haha. Happy happy happy Halloween. [Music] Your checket is all done. Little monsters, are you ready? Time to go get some candy. >> Yes, Neo. [Music] >> My crayons are missing. [Music] Oh, hey Zuzu. Stop. Neo, time to think big. Red, blue, green, yellow. Four little thieves. Red, blue, green, and yellow. In the city there, sneaky little fellows. And the little cop says, \"Please, don't you go.\" So all of the thieves run to and go. Loopy loopy loopy loopy. Oh. Red, blue, green, and yellow. Loopy loopy loopy loopy. Oh. Little feet go high where no one knows. Loopy loopy loopy loopy. Oh. And the little cop said, where they go. Loopy loopy loopy loopy. Oh. Red red sheep got caught. Wo! Go! Three little thieves, blue, green, and yellow. In the city there, sneaky little fellows. And the little cop says, \"Please, don't you go.\" So all of the thieves run to and go. Bluey loopy loopy. Red, blue, green, and yellow. Loopy loopy loopy loopy. Oh. Little thieves go hide where no one knows. Loopy loopy loopy loopy. Oh. And the little cop says where they go. Loopy loopy loopy loopy. Oo. Blue be caught. Wo. Yeah. Two little thieves, green and yellow, in the city. There are sneaky little fellows. And the little cop said, \"Please, don't you go.\" So all of the thieves run to and fro. Loopy loopy loopy loopy. Oh. Red, blue, green, and yellow. Loopy loopy loopy loopy. Oh. Little feet go high where no one knows. Loopy loopy loopy loopy oh. And the little cop said, \"Where they go?\" Loopy loopy loopy loopy. Green feet got caught. Wo! [Music] Yeah! [Music] One little one is yellow. In the city there's a sneaky little fellow. And the little cop said, \"Freeze, don't you go.\" Now the little yellow bean to go. Wy loopy loopy loopy. Oh, red, blue, green, and yellow. Wy loopy loopy loopy. Oh. Little be hide where no one knows. Woopy loopy loopy loopy. Oh. And the little cop say, \"Where the bees go?\" Loopy loopy loopy loopy. Oh, yellow yellow bec. [Music] >> Yes, Neo. If you want to borrow my crayons, ask me first. You shouldn't just take them. >> Zuzu, do you want to play with the moraca? What about Teddy? [Music] >> Susie, don't cry. Daddy, I know what Susie wants. Leo, time to think big. [Music] The magic babysitter is here. I know exactly what you want. Be bubbles. Are you hungry, baby? Pick your milk, sweetie. Red, yellow, blue, orange. Tell me what you want. Red milk. Red loves it. Loves it. [Music] Bunnels. [Music] Bath time, baby. Pick your toy, sweetie. Red, yellow, blue, orange. Tell me what you want. Yellow toy, yellow, yellow loves it. Be loves it. Oh away. [Music] Time to dress up, baby. Pick your diaper, sweetie. Red, yellow, blue, or green. Tell me what you want. Blue diaper. Blue blue [Music] away. [Music] Baby wants candy. Ice pop. Binky. Pick your binky, sweetie. Red, yellow, blue, orange, what you want. Green stinky green loves it. Mwah. [Music] B away. [Music] Look, Daddy >> Zuzu loves Neo so much. >> Of course, I'm the best big brother. >> Yes, Neo. [Music] >> Yoohoo. [Music] Oh, [Music] Red Shark. Doo doo doo doo doo doo doo doo doo. Red Shark. Doo doo doo doo doo doo doo doo doo. Red Shark. Doo doo doo doo doo doo doo doo doo. Red shark. Doo doo doo doo. Doo doo doo doo doo. Red shark. Doo doo doo doo. Doo doo doo doo doo. Red shark. Doo doo doo doo doo doo doo doo doo. Red shark. Doo doo doo doo. Run away. [Music] [Music] [Music] Blue shark. Doo doo doo doo doo doo doo doo doo. Lou shark. Doo doo doo doo doo doo doo doo. Lou shark. Doo doo doo doo doo doo doo doo doo. Lou shark. Doo doo doo doo. Doo doo doo doo doo. Lou shark. Doo doo doo doo. Doo doo doo doo doo. Lou shark. Doo doo doo doo doo doo doo doo doo. Lou shark. Doo doo doo doo. Run away. [Music] Goo gaga. >> Yellow shark. Doo doo doo doo doo doo doo doo doo. Yellow shark. Doo doo doo doo doo doo doo doo doo. Yellow shark. Doo doo doo doo doo doo doo doo doo. Yellow shark. Doo doo doo doo doo doo doo doo doo. Yellow shark. Doo doo doo doo doo doo doo doo doo. Yellow shark. Doo doo doo doo doo doo doo doo doo. Yellow shark. Doo doo doo doo. Run away. [Music] Wow. I'll be guarding these donuts. [Music] [Music] Little police officer guarding the donuts. [Music] A donut's missing. I look all around. Where could the beef be? La. Hush. Hiding right here. [Music] Baby, baby. Goo gaga. You took the donuts. Goo gaga. Telling lies. Goo gaga. Open your mouth. No. You are not the donut thief. Huh? [Music] Little police officer guarding the donuts. Wo! A donut's missing. I look all around. Where could the bee be? La. Hush. Hiding right here. [Applause] [Music] Bumbleing, bumbling. You took the donut. Telling lies. Open your mouth. Hop hop hop. You are not the donut thief. [Music] Little police officer guarding the donuts. Oh, a donut mixing. Let's search together. I look all around. Where could the beef be? La. Hush. [Music] Hiding right here. Grace. Grace. Yes, officer. You took the donut. No, officer. Telling lies. No, officer. Open your mouth. Ha. You are not the donut thief either. [Applause] >> Little police officer guarding the donuts. Oh, a donut missing. I look all around. Where could the beep be? La. The donuts are right here. The donuts were here all along. [Music] Wash your hands before eating. Oh, okay.",
    "start_time": 1.36,
    "end_time": 1080.16
}