{
    "video_id": "dPRZfuxeoPQ",
    "channel_url": "@babybus",
    "transcript": "Baby bus. Mysterious vibration. >> Infrared sensors are ready. >> All right, >> we'll head out on patrol now. >> Okay. >> Huh? >> Pap Antel will probably try to steal the crystal again. Are you guys ready? >> Don't worry. We set up a super trap in the museum. If anything comes close, the alarm will go off right away. Huh? >> Where's Angel? [Music] >> Don't worry, it's just a mosquito. >> It can even sense the mosquito. >> That's amazing, >> sir. >> Doby, how's it going over there? All good. >> Yay. Our castle fell. >> Huh? Was it my fault? Sorry. I'll help you build it again. >> All done. What? It's going to fall again. >> I got it. >> Now it won't fall. >> Wow. So cool. Thank you, officers. [Music] Huh? The water is shaking. >> What's going on? My fish. >> Oh no. Wa wa wa wa wa wa wa. Hey. Ouch. Got it. What's wrong with these fish? The falling blocks, shaking tanks, all because of vibrations. But from where? [Music] Huh? Something's under here. The cops will never guess we're coming through a tunnel. Time to move the dirt. Got it. Shovelbot, go. [Music] Ouch. That really hurts. Can't you even do a simple job, right? I'll move the dirt. You dig. Okay. Take this. It's so heavy. Uh-oh. Stop it. I can't stop. It sounds hollow under here. There must be a tunnel. And it's heading to the museum. >> Sheriff Connie Corso. Papon. I think Antel is digging a tunnel to steal the crystal. >> What? >> Oh no. Quick, check the crystal. It finally stopped. Huh? [Music] H the deep sea crystal. Wow. Let's grab it. Whatever. >> Not a chance. >> The cops. I knew it was you. And >> stop. [Applause] You're under arrest. >> No, >> sir. Antel were digging a tunnel to steal the crystal. >> We caught one, but the other got away. >> She won't escape. We already found the entrance of the tunnel. Whoa, such a long tunnel. >> Antel. The cops again. You'll never catch Dr. Antel. [Music] didn't know I'm so good at this. >> Stop right there. [Music] >> Danger, stop. The tunnel is collapsing. No, I can't stop. >> Watch me. [Music] >> It finally stopped. >> Oh no, the tunnel's going to fall. >> Run. Mission failed again. >> Sheriff's note. >> Things to keep in mind. >> Kids Antel were secretly digging a tunnel. But how did the police find out? They found out because digging makes the ground shake a little. Just like when you hit a drum, you hear the boom and feel it shake. There are many more cool things like that in life just waiting for you to discover. Antel's rescue mission. [Music] >> The antels are very sneaky. We need to stay alert. [Music] Ouch. Huh? Wake up. We got to move. [Music] We must complete this mission tonight. We're getting our girls out. Where did she go? My climbing skills have finally come in handy. [Music] So many crocodile traps. Piece of cake. [Music] The traps are moving. [Music] out. [Applause] >> Don't mess with my traps. I better set up a few more. >> Got caught already. We'd better think of another plan. >> If not by ground, then I'll go by air. Great idea. [Music] Girls, I'm here to save you. Hey, it's laser. Huh? Easy peasy. Warm up's over. Now the real fun begins. [Music] You'll never hit me. I'm still playing. A ouch. Got another one. >> You got caught, too. I failed, too. Everyone got caught. I'll have to do it myself. I came prepared. Time to work. Digging robot. Go. Dig. Dig. Dig a tunnel to the police station. Dig. Big. [Music] Oh no. No. It's so hot. Dig down that way. Got it. Dig. [Applause] Oh, so scary. Take this way. [Music] [Music] I won't give up. Take this way. Take what did we hit now? Water. [Music] Oh no. Wrong way again. Goodness. Where are they locked up? >> Doby, >> are the antels locked up in the right cell? >> That's right. All the way on the right. >> So, they're on the right. Dig now. Oh, I'm exhausted. I made it. Finally found you. I'm here to save you. Well, we're saved. I'll get you out. Then we can get back to causing trouble. >> Not a chance. >> How did you find me? >> We were watching you all along. >> We told you about this place on purpose. >> What? >> It was a trap. We failed again. Robot Hotel. The police are watching closely. Got to be more careful. My wanted poster. [Music] The police. >> Let's split up and search for Rant. >> Got it. >> Wa! It's the robot hotel. >> I'll sneak inside. Welcome to the robot hotel. >> Oh, so cool. [Music] >> Kids, get your ID ready so we can check in. >> Okay. >> Oh, no. I don't have an ID. Gotcha. [Music] What a perfect disguise. I'd like to check in. >> Sure. Your ID, please. [Music] >> ID error. Is it because of my hairstyle? [Music] ID error. Huh? Maybe it's my mouth. ID error. Huh? My eye >> ID error. Nose ID error. >> Face shape. >> ID error. What's wrong with it? Oops. >> Welcome to the robot hotel. >> Oh no. Why are they here, too? That's it. I'll disguise as a robot. They'll never know. Let's stay at the hotel tonight and keep searching tomorrow. >> Welcome. Please check in. >> ID confirmed. ID confirmed. >> My turn. >> ID confirmed. >> These are robot butlers. Please choose one to serve you during your stay. Wow. Let me choose. [Music] Not me. Not me. H. Which one should I choose? Awesome. This robot can dance. I'll take this one. >> What? >> Leave all your luggage with me. >> Wow. Amazing. >> I'll take you to your room. >> Let's go. >> Wow. The robot can carry our luggage, too. >> Thanks a lot. Follow me, please. >> This is nice. >> Here we are. >> Wow. >> Wow. >> Robot Butler, please activate the room system. >> I've got it. [Music] Oo, so comfy. >> Wow, it's so soft. >> Antel is wanted across the city. >> Watch out for Antel. >> Antel. >> Antel. >> Super burger. The ultimate taste. >> Wow, I'm starving. Let's go eat. >> Okay. Hey, this way. [Music] >> So cool. >> Wow, the robot butler can even cook. I'd like some pineapple. >> Okay. [Music] That hurt. What's going on? >> Almost done. Here you are. >> Why is there only skin? [Music] Wow, smells so good. >> Please enjoy. >> We want some skewers, too. >> Okay. [Music] Huh? Why is the robot coughing? This robot's acting strange. >> Oh no. I need to find a way to sneak out. Got it. Error. Error. Out of service. Need repairs. >> Wait. >> Repairs. I'm good at that. [Music] >> It's handel. >> You found out. Ouch. Out of my way. [Music] Ouch. Ow. Oh, that hurts. [Music] Wanted criminal intel detected. Capture the criminal. Capture the criminal. >> Oh no. >> You'll never catch Dr. Antel. [Music] Ow. Let me down. >> We got you. Antel got again. [Music] >> Sheriff's note. >> Things to keep in mind. >> Kids, when you check into a hotel, you need to have your ID to show who you are. [Music] And when checking out, make sure to take all your belongings so nothing gets left behind. Woof.",
    "start_time": 1.36,
    "end_time": 1196.72
}