{
    "video_id": "tAMeFosNDA4",
    "channel_url": "@babybus",
    "transcript": "Baby bus. [Music] The phone on the desk goes ring ring ring ring ring ring ring ring ring. The phone on the desk goes ring ring ring. The mission is on. The excavator on the side goes clink clink clink clink clink clink. The excavator on the side goes clank. Digging in the ground. The phone on the desk goes ring ring ring ring ring ring ring ring ring. The phone on the desk goes ring ring ring. The mission is on. Doubled dozer on the sign goes push push push push push push push push push. Doubled dozer on the sign goes push push push clearing all the dirt. The phone on the desk goes ring ring ring ring ring ring ring ring ring. The phone on the desk goes ring ring ring. The mission is on. The crane on the site goes lift lift lift lift lift lift lip lift lift. The crane on the site goes lift lift lift. Raising things up high. The phone on the desk goes ring ring ring ring ring ring ring ring ring. The phone on the desk goes ring ring ring. The mission is on. The dump truck on the bike goes dump dump dump dump dump dump dump dump dump. The dump truck on the bike goes dump dump dump. dropping heavy load. [Music] The phone on the desk goes ring ring ring ring ring ring ring ring ring. The phone on the desk goes ring ring ring. The mission is on. The motor on the bike goes scoop scoop scoop scoop scoop scoop scoop scoop scoop. The loader on the bike goes scoop scoop scoop lifting off the sand. The phone on the desk goes ring ring ring ring ring ring ring ring ring. The phone on the desk goes ring ring ring. The mission is on. The mixer on the side goes spin spin spin spin spin spin spin spin spin. The mixer on the side goes spin spin spin pouring out the mix. The truck on the shine go work work. [Music] The truck on the shine go work work. We're building up the home. [Music] Neo, time to think big. Let's assemble a car. What kind of car should we make? >> Go. Go. Assemble a car. Case by piece. 1 2 3 go. What's that round shape? It's a wheel. It's a wheel. Think heart. It's assemble time. Let's give it a try. >> Yeah. Yes. What's that long shape? It's a letter. It's a letter. Think heart. It's assemble time. Let's give it a try. Yes. Yes. Picking up the firefighter. Vroom. Vroom. Time to roll out. Put it together. Fire truck. Let's save the day. Nina red fire truck. Nina coming to help out. Water goes splash. Putting on the fire. Great job fire truck. >> Yes. Yes. Fire truck. Go. Go. Assemble the car piece by piece. One 2 3 go. What's that round shape? It's a wheel. It's a wheel. Think heart. It's assemble time. Let's give it a try. Yes. What's that long shape? Flashing lights. Flashing lights. Think heart. It's assemble time. Let's give it a try. >> Yes. Yes. Picking up the medic. Vroom. Time to roll out. Put it together. Ambulance. Let's save the day. We Why am we coming to help out? Boom. Zoom. Boom. Taking care of the patient. Great job. Ambulance. >> Yes. Yes. [Applause] Yay. Ambulance. Go. Go. Assemble the car piece by piece. One, two, three, go. What's that round shape? It's a wheel. It's a wheel. Think heart. It's assemble time. Let's give it a try. Yes. What's that long shape? It's a door. It's a door. Think heart. It's assemble time. Let's give it a try. >> Yes. Yes. Picking up the driver. Vroom. Time to roll out. Put it together. Big bus onto the town. Beep beep big yellow bus. Beep beep. Coming to help out. The door goes whoosh. Picking up the passengers. Great job. Big bus. Yes. Yes. Big bus. I assembled so many cars. Yay! >> Round wheels go here. Hey, the big bus is done. Beep beep. >> Yes, Neo. >> Neo didn't put away his parking garage, so he can't find it now. >> Huh? It's under the bed. >> Oh, the cars are missing. meal. Time to think big. >> Colorful, colorful toy car. When you're done playing, put them away. Colorful, colorful toy car. No more hide and seek problems today. Red car, red car, where are you? Come out now. I'm looking for you. Red car, red car, don't you go. I'll put you back where you belong. My red red toy car. Toy car. Toy car. Don't you go. My red red toy car. Toy car. Toy car. Don't you go. [Music] When I'm done, I put it away. No more hiding secrets today. Yay! Yellow car, yellow car, where are you? Come out now. I'm looking for you. Yellow car, yellow car, don't you go. I'll put you back where you belong. My yellow toy car. Toy car. Toy car. Don't you go. My yellow yellow toy car. Toy car. Toy car. Don't you go. When I'm done, I put it away. No more hide and seeks today. Green car. Green car. Where are you? Come out now. I'm looking for you. Green car. Green car. Don't you go. I'll put you back where you belong. My green toy car. Toy car. Toy car. Don't you go. My green toy car. Toy car. Toy car. Don't you go. Yay. When I'm done, I put it away. No more hide and seeks today. [Music] Blue car, blue car, where are you? Come out now. I'm looking for you. Blue car, blue car, don't you go. I'll put you back where you belong. [Music] My blue toy car. Toy car. Toy car. Don't you go. My blue blue car car toy car toy car. Don't you go. My blue toy car. Toy car. Toy car. Don't you go. My blue toy car. Toy car. Toy car. Don't you go. Then I'm going to turn away. No more hide and seek today. Yes, Neo. >> Neo found all the cars. >> Neo, when you're done playing, I put my toys away. [Music] >> Wow, good job, Neil. I won't have to look for them anymore. Go Neil. Time to think big. [Music] Yum. Ew. My throat is sore. Ow. Ew. Ambulance, please help. [Music] My throat is feeling scratchy. >> Tell me, what food did you eat? >> Maybe some yummy cookies. >> But too many is not healthy. Yummy cookies. What a big treat. But eating too many cookies, it can make you sick. Ambulance will help you. Don't you ever worry. [Music] [Applause] [Music] Ow. Ew. My tummyy's hurting now. Ow. Ew. Ambulance, please be help. [Music] My tummy is rumbling. Tell me, what food did you eat? >> Maybe some yummy ice cream. But too much is not healthy. Yummy ice cream. What a big treat. But eating too much ice cream, it could make you sick. Ambulance will help you. Don't you ever worry. [Music] Ew. Our teeth are aching now. Ow. Ew. Ambulance, please help. [Music] Our teeth are sore and aching. Tell me what food did you eat? Maybe some yummy candy, but too much is not healthy. Yummy candy. What a big tree. But eating too much candy, it could make you sick. Ambulance will help you. Don't you ever worry. We all love sweet treats. Yummy indeed. But eating fruits and veggies gives you energy you need. Ambulance will help you to be healthy and happy. >> Yeah. Wow. >> Yes. Neil, eating more fruits and veggies is good for you. [Music] Aha! Wow! [Music] Five toy cars. 1 2 3 4 5 [Music] Little cars. Let's go. Five little cars on a mission together. One of them is moving now. Danger. Danger. Who can help me now? Little fire trucks here to help. Four little guys on a mission together. One of them is moving out. Wo! I'm hurt. I'm hurt. Who can help me now? Little ambulance is here to help you. Three little parties on a mission together. One of them is moving out. Danger. Little police cars here to help you. [Music] Two little cars on a mission together. is moving out. [Music] Danger, danger, can help me now. Little trucks here to help you. One little car on a mission and it is moving out. [Music] Danger, danger. Who can help me now? [Music] Little tow trucks here to help you. Little tow trucks here to help you. [Music] Five little cars. Mission complete. Vroom. Vroom. 1 2 3 4 five. Yeah, >> you put your toys away. Good job. >> Five. [Music] Oh, triangle wheel. [Music] The police car wheels go round and round, round and round, round and round. The police car wheels go round and round all through the town. 4 [Music] Square wheel. The police car wheels go round and round. Round and round. Round and round. The police car wheels go round and round all through the town. 3. [Music] Oh, cartwheel. The police car wheels go round and round. Round and round. Round and round. The police car wheels go round and round all through the town. [Music] 2 1 [Music] star wheel. [Music] The police car wheels go round and round, round and round, round and round. The police car will go round and round all through the town. One circle wheel. Woohoo. Yay. The police car wheels go round and round. Round and round. Round and round. The police car wheels go round and round all through the town. [Music] Why aren't we there yet? [Music] >> Eeny meeny miny mo. Wiggle your fingers. Here we go. Neil, time to think big. Eeny meenie miny mo. City helpers. Here we go. Let's go. Fire truck. Fire truck. Where are you? Here I am. Here I am. How do you do? Fire truck. Fire truck. What are you doing? We we we rushing through the city. Eeny meeny miny mo. Fire truck. Help us out. [Music] Excavator. Excavator. Where are you? Here I am. Here I am. How do you do? Excavator. Excavator, what are you doing? Click, click, click, click, click, click. Working in the city. Eeny, meeny, miny, mo. Excavators, help us all. [Music] Garbage truck, garbage truck, where are you? Here I am. Here I am. How do you do? Garbage truck. Garbage truck. What are you doing? Quack quack quacks quack quack quack. Collecting trash in the city. Eeny meeny miny mo. Garbage trucks. Help us all. [Music] Helicopter. Helicopter. Where are you? Here I am. Here I am. How do you do? Helicopter. Helicopter. What are you doing? Chop chop chop chop chop chop. Soaring above the city. Miny helicopters help us all. [Music] Carrier. Carrier. Where are you? Here I am. Here I am. How do you do? Carrier. Carrier. What are you doing? Honk. Carrying cars across the city. Eeny meeny miny mo. Carriers help us all. Hi. Eeny meeny miny mo. City helpers. Here we go. Zooming faster, moving slow in the city. They make lights. Fire truck. Excavator, garbage truck, helicopter, and carrier. [Music] Yes, Neo. Eeny meeny miny mo. >> The traffic's clear. >> Here we go.",
    "start_time": 1.36,
    "end_time": 1403.0
}