{
    "video_id": "-ag2-cgDpMU",
    "channel_url": "@babybus",
    "transcript": "Baby bus. Fake school boat. Time for school. Daddy, hurry. [Music] >> The school boat is coming. >> Good morning. >> Good morning. >> What happened to Mr. Seal. >> Mr. Seal is sick. I'm the captain today. >> Oh, I see. >> Hop on quick. You don't want to be late, buddy. >> Bye, Daddy. >> Bye-bye. >> Sorry I'm late, Mr. Capiara. But the captain said you were sick today. >> Huh? I'm not sick. The school boat ran out of gas. I went to fill it up. >> What? >> Good thing I'm clever. I drained the real boat's gas. H guys. Time to trick more kids. [Music] >> This is Sheriff Connie Corso. A fake school boat showed up on Crabclaw Street. It took all the kids. >> What? Let's head to Crabclaw Street la so many kids. >> Huh? There are two more kids over there. >> Hey kids, come on in. We're waiting for you. >> Okay. >> Huh? Huh? Where are the warning lights on the boat? >> Oh, warning lights. Oh, yes. Yes. I'll put them on right now. [Music] >> All done. >> Aren't they on the roof? My mistake. All fixed. Come aboard. >> Okay. Come on. The paint's coming off. >> Oh, my bad. This boat's really weird. We're not getting on. >> The boat's weird. We're getting off. >> Nobody move. >> You, too. Get on the boat. Stop right there. Huh? >> Huh? >> You're in. >> So, you found out now. Come with me nicely. >> Stop. >> What? >> Antel's taking kids with a fake school boat after her. >> The cops. I got to go. [Music] >> Go, officers. [Music] Ouch. [Music] >> So many school boats. Not this one. Not this one. Not this either. Which one's the fake school boat? >> H school boats have a speed limit. That one's going too fast. It's the fake one. After it la. [Music] >> It's blocked up ahead. Move out of my way. >> Oh, it's a school boat. Let's make space. >> School boats are the best. Everyone's moving for me. My boat's moving strangely. Ouch. >> Watch out. We can't get through. >> Try and catch me. I'm out of here. You're not getting away. Ultimate long leg. >> Wa [Music] wa. [Music] Finally lost the cuff. No way. Ouch. [Music] >> Hey, Antel, you're under arrest. >> Mission failed again. It's all good. Everyone hop off. >> But it's fine. I've still got my backup plan to steal the boat. [Music] Sheriff Labrador's safety talk. Kids, it's important to know if your school bus is yours. Remember its color and signs and the driver's face and uniform. If a stranger's driving a strange bus and says it's your school bus, never get on. Tell your teacher or your parents right away. Please remember that. >> Two sheriff Labradors. [Music] >> Mom, Dad, look at this. >> Wow. [Music] >> This stop is water market. W little Mango. Look at all the people here. These glasses are so cool. So pretty. >> Ribbon Pop Rocks. Welcome. >> Sheriff Labrador, try our new spicy pop rocks. >> Little Mango doesn't like spicy things. >> Let us try. Wow. [Music] [Laughter] >> Watch out. >> Thank you, Sheriff Labrador. You helped me again today. >> I didn't help you today, though. >> You picked up my things on Dolphin Street. Oh, and you were wearing your uniform. >> Uh, strange. How can that be? >> Look over here. >> Mom, Dad, browse around first. I'll be right back. >> All right. >> All right. See you. [Music] >> Hello, Sheriff Labrador. >> Hello. >> Good morning, Sheriff Labrador. >> Good morning. >> Hello. Good morning. Great. No one knows I'm Antel. Now I can trick all the kids. Wanted posters. Rip it up. Rip it up. >> Oh, Sheriff Labrador. >> Please watch my baby. My tummy. >> Why would I help you? >> Huh? >> A baby? I >> a baby came right to me. Pretending to be Sheriff Labrador was a great idea. Let's go. [Applause] Hello. >> Hello. >> Huh? Why is he here? I got to hide. [Music] >> Oh, why is this baby alone? Bear, there. Don't cry. >> Peekaboo. Peekaboo. Hey, >> Ph. >> Peekab-boo. >> Thank you for watching my baby, sir. Wait, weren't you wearing your uniform? >> Huh? I get it now. That was a fake cop pretending to be me. >> What? I got to find him. Ph. Good thing no one saw me. A caterpillar. Got to find a place to change. That's it. [Music] Oh, perfect. A kid alone. Who is it? >> Little Mango, you're back. >> Two Labradors. >> What's wrong, little Mango? They look just like Sheriff Labrador. Could they be his dad? Mom, what are you staring at? I got you a new hat. Try it on. >> A little mango. Still just as cute. >> Ouch. Don't pinch. >> Phew. My disguise is still holding up. That's weird. You've never done that before. >> Well, I'm older now. [Music] Hi. >> Come on. Let's play the dancing game. >> I'll take pictures. [Music] >> Are you ready? >> Here we go. Hey. [Applause] [Music] >> This is easy. >> It's speeding up. [Music] Ouch. >> Yay. [Music] >> What's with little Mango's dancing? >> Just a little mistake. >> Strange. Little Mango's never that clumsy. Could he not be Little Mango? >> Spicy seaweed burgers. Try one now. >> Come on. You must be hungry. One spicy seaweed burger, please. >> Oh, but >> little Mango loves spicy food. >> Here you go. >> This is for you. >> All right. >> This is so good. [Music] >> Well, is it yummy? >> M. So yummy. >> You're nuts, little mango. I know my son. He can't eat spicy food. >> Uh, I I am your son. No, you're not. >> Hey, little Mango. >> Who are you? >> You found out. >> Hey, [Laughter] stop. You sure? Hey, >> you're not getting away. >> Surrender now. >> You'll never catch me. >> Hey, stop right there. Hey, >> why are there two sheriffs? Which one's real? >> Me, of course. >> Stop pretending. >> You still got hot sauce on your mouth. Busted. Got to run. >> Stop. >> Let's see who you really are. >> Ouch. >> It's you, Antel. >> I shouldn't have dressed up like Sheriff Labrador. >> Good teamwork. [Music] Another one got caught. >> Who's going this time? >> Pick me, boss. Pick me. >> Let me go. [Music] >> Sheriff's note. Things to keep in mind. >> Kids, your mom and dad love you more than anyone. >> They're always around you, taking care of you, and loving you. They know what you like to eat, what you don't like, and when you're happy or sad. So, let's give them a thank you and a big hug. The campground ghost. [Music] >> This tent is hard to put up. >> Watch this. Automatic tent. >> Wa! So cool. When night falls, deep in the forest, a scary shadow appears. [Music] >> Look, the little rhino behind you. >> Don't be afraid. It's just me, Miss Grizzly Bear. I came to remind you, go to bed early. We got to see the sunrise tomorrow. >> Oh, right. It's getting late. Let's go to bed. >> Let's go. [Music] >> Our stuff is outside. Will it be okay? >> Should be fine. Don't worry. Mommy, I'm scared of ghosts. >> Ghosts are not real. >> It's okay. Mommy's here. Let's leave. [Music] [Music] [Applause] [Music] What's going on? >> Something's up. Let's go check. [Music] >> What happened? >> There's a ghost. So scary. Ghost. >> Little rhino. There's no such thing as ghosts. >> But I saw it. It ate the things outside and put its claws inside our tent. [Music] >> Our bags. They're all gone. [Music] >> Our bags are gone, too. Looks like what little Rhino saw wasn't a ghost, but a thief. >> When we weren't paying attention, the thief came and stole the things we left outside. >> So that's what it was. >> We'll be more careful. >> Sheriff Labrador, please catch the thief. >> Don't worry, there's no case that I can't solve. Uh-huh. >> The thief just finished stealing here and we'll probably go to the next campsite. I've got a plan. Doby Papon, follow me. [Music] We're all ready. With these traps, we'll catch the thief as soon as they step into this campsite. >> The thief won't get away. [Music] >> So sleepy. When is the thief coming? >> Let's keep waiting. [Music] [Applause] [Music] Everything's outside. Easy pickings. Huh? I hear something. Oops. [Applause] It's the thief. >> Oh, the thief. >> Wake up, everyone. >> The thief is here. Did you catch the thief? >> Miss Grizzly Bear. She's the thief. >> No, no, I'm not a thief. I just heard a noise and came to check. Why did my purse fall out? These are my kids toys. [Music] My purse, >> my bone, >> my toy. >> Goodness, she even took my dentures. >> I I got to run. >> Stop right there. [Music] She's pretty fast. It's >> You'll never catch me. I'm a running champion. [Music] >> Wa! Papium, your tank is awesome. Wolf, you're coming with us. >> I'll never steal again. [Music] >> Sheriff Labrador's safety talk. Kids, when you're out camping, make sure to keep your things safe, especially valuable items. Don't leave them lying around so that they don't go missing. Take good care of your things so you can have more fun and enjoy camping. Please remember that.",
    "start_time": 1.439,
    "end_time": 1289.24
}