{
    "video_id": "Kkf33XfO4og",
    "channel_url": "@babybus",
    "transcript": "Baby bus. Security check. >> Whoosh. Whoosh. Yay. This is fun. >> Welcome to the aquarium. Please go through security first. >> Hey, daddy. Let's go in. >> All right. [Music] Huh? >> What's going on? >> Please open your bag. >> Little Capibara, this toy might bother the animals. You can't bring it in here. Just put it in a locker and come back. >> I got it. Oh, my tummy hurts. Sweetie, I need to go to the bathroom. Wait here. Okay, [Applause] [Music] now's my chance. Tada! Off you go. Huh? What a cool toy car. Gotcha. Come back, toy car. >> Yay. >> Welcome to the Water City Aquarium. >> Wow, it's so pretty. >> Oh no, the cops. I got to hide. I'm out of here. You can't see me. You can't see me. >> All clear. Come on in. >> Put your bag on the belt, please. >> Oh, yeah. Sure. >> Oh, no. The thing's in my bag. [Music] >> Huh? Oh no, the cops saw me. Huh? >> Ma'am, you can't bring them in. >> Let go. >> Out. [Music] >> My disguise. >> Antel. >> We got to run. >> Stop. >> Please leave this to us. >> Papon and I got this. You go catch Anel. >> Got it. Oh no. Where do I hide? [Music] A >> I got an idea. >> Where's Anel? >> Wa! >> The mermaid show is starting. Doby, look at that mermaid. >> It's hold on. Let's sneak up so she doesn't notice us. >> Mhm. >> Wow. Two more mermaids. >> Gotcha. >> Come dance with us. >> The cops. I'm out of here. after her. >> Wow, look. The mermaid swings so fast. Wow. >> Stop it, Tail. >> You go after her. >> Okay. You can't catch me. Huh? It's blocked. There's a door. Ank again. >> Stop right there. You can't get away. Gotcha. Huh? It's a shark. Sh. Go. swim. [Music] [Applause] [Applause] [Music] Huh? [Music] Bye-bye. Stop. Ow. Somebody help. >> Is there a Labrador? [Applause] >> Papion. Sheriff Kane Corso. Did you see Antel? >> No, I didn't. They'll never find me here. >> Come visit us again. >> Oops, I forgot something in the aquarium. [Music] >> Huh? Why is that suitcase dripping water? >> You'll need to go through security again. Okay. Phew. Why is it so heavy? [Music] Huh? Huh? I've got it. Huh? >> Antel, you're coming with us. >> Mission failed again. >> Sheriff Labrador's safety talk. >> Kids, places like train stations, airports, and amusement parks check bags to keep everyone safe. So, let's line up, follow rules, and not bring banned items. If the scanner turns red and goes beep beep, it means something unusual is found. Tell a grown-up right away. Don't sneak past or run off. >> Lie detector hat. [Music] >> Wow. Happy birthday. Want to have some cake? Yay! A cake. >> Wow, such a beautiful cake. [Music] What happened? Why is the cake empty inside? Who did this to my cake? >> Let's go check. >> Okay. Is everything all right? >> Sheriff Labrador. >> Someone ruined the birthday cake I prepared for my daughter. [Music] >> A big piece is missing. Bite marks. Someone snuck in and ate a chunk. >> What? >> Sir, there's no sign of anyone coming in. >> Then someone inside the house ate the cake. >> Huh? No, it wasn't me. >> H Someone must be lying. I think we need a lie detector. Fabio always has a way. Look, the lie detector. They can tell what's true or lie. >> Wo! >> Dobby, you go first. >> Oh, >> Dolby, are you hiding these snacks in your pockets? >> What? No. No. Fly light. Wa. That get close. All right. All right. I lied. No. Please stop. Phew. This one is really something. Who's next? How about you, little chick? [Music] >> Little chick, did you ruin the birthday cake? >> No, I didn't ruin the cake. >> Fly. Fly. It's so late. So, it was you. It really wasn't me, let me tell you. [Music] Oops. Oh no. What do I do? [Music] It got a little squished, but I fixed it. >> Truth. Truth. >> Oh, >> wow. Looks like he's telling the truth. >> I'll go next. >> Okay, let her try it. >> Got it. [Music] Tell them I didn't eat the cake. >> Huh? Huh? >> Why? [Music] It was you. No way. It wasn't me. Wait, I remember now. Well, it's a cake. [Music] No, it's Little Rabbit's birthday cake. I can't eat it yet. Yes, I can have these now. [Music] So, I only ate the cupcakes next to it. >> Truth. Truth. >> Sister Monkey didn't ruin the cake either. >> Then who could it be? >> Oh, Brother Rabbit, did you touch the cake? I didn't. >> It can't be him. >> Brother, tell the hat yourself. >> Well, I took just one bite. [Music] >> I took two bites. Okay, I took three bites. >> Please stop. I'll tell the truth. I took just one bite at first, but it was so delicious. I couldn't stop eating. Wow. [Music] I was afraid of getting caught, so I covered it up. >> Oh, so that's what happened. >> Sorry, little sister. I shouldn't have done that. >> Everyone does something wrong. As long as you try to fix things right, it will be all right. >> Right. That's what the kids do. I got it. >> Little sister, let me make another cake for you. >> Okay, >> we'll help you. [Music] Smells great. [Music] >> Sheriff's nose. >> Things to keep in mind. >> Kids, if you make a mistake, be brave and admit it. Don't tell lies. Everyone does something wrong, but as long as you admit it and fix things right, it will be all right. Please remember that. >> Who stole the birthday cake? [Music] Huh? [Music] Huh? Why won't it open? >> It's a fingerprint lock. Use your fingerprint. [Music] Oops, I forgot. >> Let's go. [Music] H Why are they sneaking around? [Music] >> Luckily, Sheriff Labrador didn't notice us. >> Yeah, he'll be surprised when he sees the birthday cake we ordered for him. >> Oh, the cake's out. [Music] Doesn't that dino look strange? >> Oh. Oh, you're here for the cake. >> I made it with the most delicious 10 fruits. Sheriff Labrador will love it. >> Look. Isn't it beautiful? >> The showcase is empty. >> No way. I put it here myself. Where's the cake and all the other cakes? >> Mr. Hickle, my pudding. >> My chocolate cake, please. >> Bye. Someone stole them all. >> What? >> Please help me find the thief. >> No problem. We'll do it. [Music] Mr. Hippo, did you see anyone near the showcase? >> Mr. Lion, he was hanging around the showcase. >> It wasn't me. >> I can't eat cakes because of my teeth. I was just looking. >> If it wasn't you, then who? >> It wasn't me. >> You, not me. >> Stop arguing. [Music] What brings you here? >> You were being sneaky, so I followed. >> Look at this. >> Sesame seeds. >> Look here. >> Oh, fingerprints. >> Yes, everyone has fingerprints on their fingers, and each of them is unique. We can find out who took the cakes by matching fingerprints. >> Mr. Hippo wore gloves, so he didn't leave any. >> So, they must belong to the thief. >> Let me collect them. [Music] >> Fingerprints collected. >> Please help with the matching. >> I'll go first. Hello. >> Match not found. So it really wasn't Mr. Lion. >> Told you it wasn't me. >> Oh, I I remember now. He, she, and he were near the showcase, too. >> Not me. I'll go next. >> Match not found. >> See, not me. >> My turn. Match not found. Match not found. Match not found. >> No fingerprints match. Everyone is cleared. [Applause] >> Sorry for suspecting you all. >> Did we miss anyone? >> Who did we miss? The dino. [Music] This is so nice. If I take it to the boss, he'll surely like it. Wait. Cops. I'm going to run. [Music] Oh no. Got to take off my gloves. Ferrris, >> you're the one who stole the cakes. Stop running. Nobody can run away from me. [Music] It's a cat again. Let's get him. Here's [Music] your king. Arcade. [Music] I'll succeed next time. Bye-bye. Yo, [Music] >> you're coming with us. >> Oh, wow. Such a beautiful cake, huh? >> Happy birthday, >> thank you guys. So, you were all sneaky today for the surprise for me. Let's all eat together. >> Yay! >> Sheriff's notes. >> Things to keep in mind. >> Kids, look closely at your fingertips. You'll see lots of tiny lines which are called fingerprints. Everyone's fingerprints are unique. Even twins have different patterns. Fingerprints are used in many ways like unlocking phones, logging into tablets, and home smart locks. Police also use them to find and catch bad people. [Music] Where else are fingerprints used? Keep an eye out in your daily life.",
    "start_time": 1.36,
    "end_time": 1266.3600000000001
}