{
    "video_id": "G-35p_6zrh4",
    "channel_url": "@babybus",
    "transcript": "Baby bus. Daddy, hurry up. [Music] >> Neo, slow down. Wait for daddy. >> Neo, time to think big. Yay! Ah! Oh! Ah! Oh! Ow! Gee! Ow! Ah! Oh! Ah! Oh! Ow! Gee! Ow! Boo! Boo! Boo! Feeling sore! Help me! Help me! Pain no more! [Music] I'm coming. [Music] >> Baby, baby, don't you cry. Baby, baby, don't you cry. Boo boo. Clean it right there. There. Dab some cream. Bandage. Bandage. Wrap it tight. Ouchie. Ouchie. Say bye-bye. [Music] oo boo. Feeling sore. Help me no more. I'm coming. >> Baby, baby, don't you cry. Baby, baby, don't you cry. Leave it right there. Here some cream bandage bandage tight. [Applause] Ah ah oh ouch ow ouch ow booing sore. Help me help me no more. Ah, it's time. >> Baby, baby, don't you cry. Baby, baby, don't you cry. Boo boo. Clean it right there. There there some cream. Bandage. Bandage. Wrap it tight. I'll say bye-bye. [Music] Yeah. O- ouch ow. Ah ah oh ouch ow. Boo boo. Feeling sore. Help me. Help me. Pain no more. Uh-huh. Baby baby don't you cry. Baby baby don't you cry. Boo boo. Clean it right. There some cream. Bandage. Bandage. Wrap it tight. Ouchie. Ouchie. Say bye-bye. [Music] Baby baby he he baby he he he. Come on let's play gently. Take good care and don't get hurt. Safety first for you and me. Happy happy play with me. [Music] Wow. Go [Music] my lollipop. [Music] [Music] Red baby, red baby, where are you? Here I am. Here I am. Can you find me? [Music] No. [Music] Red baby, red baby, where are you? Here I am. Here I am. Can you find me? [Music] No. [Music] Red baby, red baby, where are you? Here I am. Here I am. Can you find me? [Music] Got you. [Music] Yellow baby. Yellow baby. Where are you? Here I am. Here I am. Can you find me? No. >> Yellow baby. Yellow baby. Where are you? Here I am. Here I am. Can you find me? No. Yellow baby. Yellow baby. Where are you? Here I am. Here I am. Can you find me? [Music] Got you. [Music] Blue baby. Blue baby, where are you? Here I am. Here I am. Can you find me? [Music] No. [Music] Blue baby. Blue baby, where are you? Here I am. Here I am. Can you find me? No. [Music] Blue baby, blue baby, where are you? Here I am. Here I am. Can you find me? [Music] Got you. [Music] Huh? [Music] Neo. Time to think big. [Music] Do you like to share with me? Share with me. Share with me. No, no. It's mine. It's mine. Only I can eat this treat. Did you drop a little tear? Little tear. Little dear. Fine. Fine. Just one small bite. Sharing makes us happy, right? [Music] Do you like to share your toy? Share your toy. Share your toy. No, no. It's mine. It's mine. Only I can make that noise. Did you drop a little tear? Little tear. Little tear. Fine. Fine. Just one short ride. Sharing makes us happy, right? [Music] Do you like to share the slide? Share the slide. Share the slide. No. No. It's mine. It's mine. Only I can take this ride. Did you drop a little tear? Little tear. Little tear. Fine. Fine. Just one quick slide. Sharing makes us happy, right? [Music] Do you like to share your things? Dino toys or dragon wings? No. No. It's mine. It's mine. Only I can make it swing. Did you want my dragon wings? Dragon wings. Dragon wings. Fine. Fine. You take a swing. Sharing makes us happy. [Music] You got karaoke. [Music] [Music] Wow. No, no. You can only use a bandage when you're hurt. [Music] Ouchie. Ouchie. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] Lie. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] Ouchie. Ouchie. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] LT. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] [Music] Ouchie. Ouchie. Yes, babies. We got boooos. Yes, babies. Telling lies. Let me check them. Haha. [Music] Use a bandage only when you're really hurt. No lying, no wasting. [Music] Wow. [Music] Someone is hurt. Call the ambulance. Oh. Oh. Oh. Oh. Come and help us. It's an emergency. Hurry up and please. Hey, baby. I'm doing [Music] rushing to the hospital. [Music] Rushing to the hospital. Run wheel run. Rushing to the hospital. Go run wheel run. [Applause] [Music] Call the ambulance. Oh. Oh. It's an emergency. Hurry up, please. Hey. Hey. Hey. Monster ambulance. [Applause] Wow. [Music] To the go wheel run wheel run to the go go go wheel run wheel run. To the hospital wheel run wheel run. Yay! Hey, someone is hurt. Call the ambulance. Oh. Oh. Oh. Come and help us. It's an emergency. Hurry up, please. Hey, we need air ambulance. Hey. Hey. Hey. [Music] Rushing to the hospital. Go go go zoom wheel zoom. Rushing to the hospital. Go go go go go zoom wheel zoom. Rushing to the hospital. Go go go zoom zoom. Yeah. [Music] [Music] I got hurt. Call the ambulance. [Music] Neil, time to think big. Seat belt hero. Ready, set, buckle up, everyone. Go, go, go. Seat belt hero. Neo is on a mission. >> He'll help those not wearing seat belts. >> Remember, when you're inside the car, buckle up. That's what you should do. >> Buckle up. It will keep you from getting hurt. Safety first me. >> Danger. The mircats didn't put on their seat belts. Seat belt hero. Hurry up. Super here says buckle up. Hero said buckle up. Buckle up. Buckle up. Let's all buckle up in the car. Mission complete. >> Oh, got a new mission now. >> Remember when you play on the swing? Buckle up. That's what you should do. Buckle up. It will keep you from getting hurt. Safety first for me and you. Oh, Bong Bong didn't put on her seat belt. Seat belt hero, hurry up. >> Superhero says buckle up. Super her says buckle up. Buck up. Buckle up. Buckle up. Let's all buckle up on the swing. Mission complete. [Music] Pokey didn't put on his seat belt either. Super her says buckle up. Super her says buckle up. Buckle up. Buckle up. Let's all buckle up. Buckle up. Seat belt hero. Mission complete. Remember, when you're in your stroller, buckle up. That's what you should do. Buckle up. It will keep you from getting hurt. Safety first for me and you. >> Uh-oh. Danger. Seat belt hero. Hurry up. Super her says, \"Buckle up.\" Super her says, \"Buckle up. Buckle up. Buckle up. Buckle up. Let's all buckle up. Buckle up.\" [Music] >> Seat belt hero. Mission complete. >> Neo, >> come in. Go. Make sure to buckle up. >> Yes, Neo. Thanks for the reminder. Good job. >> Well, Mommy, I want some ice cream. >> All right, let's get in line. >> Okay, [Music] Neo, time to think big. Line up everybody. Be nice and ready. You will get your turn soon. Hurry, hurry, hurry. I can't wait. I want to be the first one. Hurry, hurry, hurry. I can't wait. I want my shirt right away. Can I hide? Is that okay? >> Uh-oh. No way. >> Wait in line. That's the way. Hurry, hurry, hurry. Line up now. In a line, one by one. Hurry, hurry, hurry. Line up now. You will get your turn soon. Be nice and ready, everyone. Sure. Let's line up. Wait in line. That's the way. [Music] Oh. Oh no. The bus didn't stop right. The line got all messy. Hurry, hurry, hurry. I can't wait. I want to be the first one. Hurry, hurry, hurry. I can't wait. I want my turn right away. Can I Is that okay? Uh-oh. No way. Wait in line. That's the way. Hurry, hurry, hurry. Line up now. In a line, one by one. Hurry, hurry, hurry. Line up now. You will get your turn soon. Be nice and ready, everyone. Sure. Let's line up. Wait in line. That's the way. Wow, there's a robot giving out balloons. Everyone, line up and take turns. Hurry, hurry, hurry. I can't wait. I want to be the first one. Hurry, hurry, hurry. I can't wait. I want my turn right away. Can I cut? Is that okay? [Music] >> Uh-oh. No way. >> Wait in line. That's the way. Hurry, hurry, hurry. Line up now. In a line, one by one. Hurry, hurry, hurry. Line up now. You will get your turn soon. Be nice and ready, everyone. Sure. Let's line up. Wait in line. That's the way. Line up everybody. Be nice and ready. Waiting in line is full of bite. [Music] >> Hello. One ice cream cone, please. >> You waited so nicely, kid. Here's an extra scoop for you. >> Wow. Thank you so much. [Music] >> Mommy, look. >> Yes, Neil. Good things come to kids who wait patiently.",
    "start_time": 1.36,
    "end_time": 1326.0
}