{
    "video_id": "_QXaph65144",
    "channel_url": "@babybus",
    "transcript": "Baby bus. Neo, time to think big. >> Great. No one wants to play with me. >> Let me help you remember. [Music] First or last, it doesn't matter. Everybody gets a turn. Take turns. Take turns on the swing. Cuz everybody gets a turn. >> It's my turn. My turn. >> My turn. It's my turn. My turn. >> My turn. It's my turn. My turn. >> My turn. It's my turn. My turn. >> My turn. No rush. There's another way. Or your friend might walk away. >> Now is next to play. >> See, you didn't wait your turn. >> First or last, it doesn't matter. Everybody gets a turn. >> Take turns. Take turns on the slide. >> Cuz everybody gets a turn. It's my turn. My turn. My turn. It's my turn. My turn. My turn. My turn. My turn. My turn. It's my turn. My turn. >> No rush. There's another way. Or your friends might walk away. Go now. Who is next to play? >> You're still the only one playing. What about Pokey? >> First or last, it doesn't matter. Everybody gets a turn. >> Take turns. Take turns. I'm the climber. >> Everybody gets a turn. >> It's my turn. My turn. My turn. It's my turn. My turn. My turn. It's my turn. My turn. My turn. It's my turn. My turn. My turn. >> No rush. There's another way. Or your friends might walk away. >> Who is next to play? Do you understand now? >> It's all my fault. I didn't wait my turn. >> It's okay. You can do it from now on. [Music] It's your turn. Your turn. It's your turn. Your turn. My turn. It's your turn. Your turn. It's your turn. Your turn. My turn. Cuz everybody gets a turn. Take a turn. >> Everybody gets a turn. >> Your turn. My turn. It's your turn. It's your turn. >> It's my turn. >> It's my turn. It's your turn. It's your turn. >> It's my turn. >> It's my turn. It's your turn. It's your turn. >> It's my turn. >> It's my turn. It's your turn. It's your turn. >> It's my turn. It's my turn. >> It's your turn. >> It's your turn. >> It's my turn. >> It's my turn. >> Take turns. Take turns. Everybody gets a turn. >> Yay. Who wants to play with me? >> Me. Me. Me. Zoo. Zoo. Turn. Zoo. Zoo. Turn. Okay, it's your turn, Zoo. >> Yes, Neo. Good job. >> Oh, something smells great. >> Wow. It's Neil's favorite pizza. >> Neil, time to think big. [Music] Pizza. Pizza. Yummy pizza with tomatoes. Melted cheese. Pizza. Pizza. Yummy pizza. My Tommy's ready to eat. Can you share it? Share your pizza. Everyone loves a slice. Yum, yum, yum. I'll share it. Share my pizza cuz sharing is caring. [Music] [Music] Pizza. Yummy pizza with tomatoes, melted cheese. Pizza, pizza, yummy pizza. My tmy's ready to eat. Can you share it? Share your pizza. Everyone loves a slice. Yum, yum, yum. I'll share it. Share my pizza cuz sharing is caring. [Music] [Applause] [Music] Pizza. Yummy pizza with tomatoes, melted cheese. Pizza. Yummy pizza. My tmy's ready to eat. Can you share it? Share your pizza. Everyone loves a slice. Yum, yum, yum. I'll share it. Share my pizza cuz sharing is caring. [Music] Can you share it? Share your pizza. Everyone loves a slice. Yum, yum, yum. I'll share it. Share my pizza. Cuz sharing is caring. Can you share it? Share your pizza. Everyone loves a slice. Yum, yum, yum. The more I share, the less I have. But sharing is caring. Kind Neo shared his pizza with everyone. [Music] And in the end, Neil had just one small slice left. But don't be sad, Neil. Look. Pizza. Pizza. Share a pizza. Sharing pizza is so much fun. Pizza. Pizza. Share the pizza. Let's all share this yummy one. I'll share mine, you'll share yours. Everyone loves a slice. Yum, yum, yum. I'll share mine, you'll share yours. Cuz sharing is caring. Sharing pizza makes us happy. [Music] One for each of us. A shared pizza is a delicious pizza. >> Yes, Neil, you did a good job. [Music] No, no. You can only use a bandage when you're hurt. [Music] Ouchie. Ouchie. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] LT. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] Ouchie. Ouchie. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] Lie. Yes, baby. I got a boo boo. Yes, baby. Give me a bandage. Are you sure? Put it on, please. Okay, done. [Music] [Music] Ouchie. Ouchie. Yes, babies. We got boo boos. Yes, babies. Telling lies. Let me check them. Haha. [Music] Use a bandage only when you're really hurt. No lying, no wasting. Neo, time to think big. It's so hot. [Music] Today, Neo is playing Animal Daddy and making ice pops with the baby animals. [Music] Be patient. Wait until they freeze. No sneaking by. [Music] Baby. Baby. Yes, papa. Ice pops. Ready? No, papa. Are you sneaking by? No, papa. Open your mouth. Haha. No rush, Bong. The ice pops need more time. Let's wait a bit, then we can eat. Huh? What's Pokey up to? Baby. Baby. Yes, Papa. Ice pops. Ready? Gnome papa. Are you sneaking by? No, papa. Open your mouth. Haha. >> Pokey also couldn't wait. The ice pops aren't ready yet. Let's take a break and wait a little longer. [Music] >> Oh, Daddy Neil, looks like the little mice are heading to the fridge, too. [Music] Babies. Babies. Yes, Papa. Ice pops. Ready? No, papa. Are you sneaking by? No, papa. Open your mouth. Oh, that's just too cute. But yummy things take time. Little mice, get some rest, too. [Music] It's Biggy. Will he patiently wait? Baby, baby, papa. Ice pops. Ready? No. Bubba, are you sneaking by? No, Bubba. Open your mouth. H. Be patient, my big little babies. Daddy Neo, are you ready? [Music] I pass [Music] papa papa your babies Ice pops ready you didn't wait no bra open the fridge where are the ice pops couldn't Eight. Haha. [Music] Wow. Yay. This time, wait until the ice pops free. >> You too, Daddy. Neo. >> Neo, are the ice pops ready? >> Yes, Daddy. Yes, Neil learned that waiting can be special and fun, too. >> Neil, time to think big. [Music] Do you like to share with me? Share with me? Share with me? No. No. It's mine. It's mine. Only I can't eat this treat. Did you drop a little tear? Little tear. Little tear. Fine. Fine. Just one small bite. Sharing makes us happy, right? [Music] Do you like to share your toy? Share your toy. Share your toy. No. No. It's mine. It's mine. Only I can make that noise. Did you drop a little tear? Little tear, little tear. Fine, fine. Just one short ride. Sharing makes us happy, right? [Music] Do you like to share the slide? Share the slide. Share the slide. No. No. It's mine. It's mine. Only I can take this ride. Did you drop a little tear? Little tear. Little tear. Fine. Fine. Just one quick slide. Sharing makes us happy, right? [Music] Do you like to share your things? Dino toys or dragon wings? No. You know it's mine. It's mine. Only I can make it swing. Did you want my dragon wings? Dragon wings. Dragon wings. Fine. Fine. You take a swing. Sharing makes us happy. Wow. [Music] You go. You go.",
    "start_time": 1.36,
    "end_time": 955.8000000000001
}