{
    "video_id": "u0lsn31wLNE",
    "channel_url": "@babybus",
    "transcript": "Baby Bus video call. [Music] >> Hey, >> Uncle Look, >> my new superdog toy is so cool. >> Wow, that's awesome. >> I want to video call Uncle Dolby. So I can show him my toy. Can I use your phone? >> Of course, but only for 15 minutes. Okay. I need it after that. >> Okay. >> Sheriff Kane Corso's Heihi noodles are so yummy. Mom, I'm going to make them for you. >> Ooh, I can't wait. Doby, your phone's ringing. >> Coming. [Music] >> Hi, Uncle Dolby. >> Huh? Oh, it's you, Dodo. Hi. I can only see your nostrils. >> Huh? >> Just hold the phone farther away. >> Oh, >> now I can see you. Hi, >> Uncle Dolby. Look, my new super dog toy. >> Wa, that's cool. Huh? I've got one, too. Check this out, Dodo. I can turn into Superdog. Hey. >> Wa. Awesome. How did you do that? I want to try it, too. >> Just tap the button under the screen. [Music] You look like a big balloon. >> I'm changing mine. >> Baby dodo. >> This is so fun. >> I can even change my whole body. >> Really? >> Watch this. I am Doby the copy robot. Wa! I want to do that, too. >> Huh? Why am I in the sea? >> Uh-oh. Wrong button. >> Dodo, there's a shark behind you. >> It's a shark. >> Dodo, don't be scared. Stop running. >> I can't. The shark's after me. Help me. Ha! >> Don't worry, Dodo. That's your uncle Shark. >> I'm going to get you. >> Hey. >> Hey, Dodo. [Music] What's this button? Wa! The snow. It's freezing cold. >> Let me try. Wa! I'm in the desert. Oh, it's so hot. >> Now me. Wow, there are so many stars. >> Watch me. >> Ooh, a garden. Smells so good. >> I'm changing again. It's a candy castle. >> Look at all that candy. >> Yummy, yummy. >> Look, I'm at the top of a mountain. So windy. Uncle Dolby, where are you? >> These effects are so much fun. >> Your uncle's back. Oh, Dodo, time's up. >> Okay, >> good job, Dodo. >> Doby, I'm hungry. >> Got it. Time for HeiHi Noodles. Let's say bye to Uncle Dolby. Uncle Dolby. Bye-bye. I'll call you next time. Mhm. Superhero. [Music] >> Well, Superdog is awesome. >> I want to be Superdog's friend. He can help me all the time. [Music] >> Let's play a super dog game. What do you say? >> Sounds fun. How do we play? >> If there's trouble, just push the button. Super dog will come to help. >> Okay. >> Hey, I am so cool. Why hasn't Dodo called me yet? >> I'm a big dino. Boom. Boom. Boom. Oh, I kicked my robot. What do I do? Wait, I better not. My arm might get stuck. [Music] Finally, it's my show time. Help me, Super Dog. Red super dog on the way. >> What's going on, Dodo? >> My robot fell under the couch. It's so tight that I can't reach it. >> Good job, Dodo. Calling a grown-up was the right thing to do. Now, let's think of a way to fix it. >> H, we can use a long ruler. >> So smart. Let's do it. Hey, >> I got the ruler. Yay! We did it! >> Red Superdog mission complete. >> Thank you, Red Super Dog. >> No problem. But you did even better. You knew what to do and asked for help like a real hero. >> Oh, I'm driving my car. [Music] Oops. The wheel came off. I got an idea. Help me, Super Dog. >> Huh? Where is he? Help me, Super Dog. >> Got it. I'm coming. >> Blue Super Dog on the way. How can I help you, Dodo? >> A wheel fell off my car. I don't know how to fix it. >> Don't worry. The screw came loose. Let's tighten it together. >> Okay. >> I'll hold the wheel for you. >> You're holding it super steady. Great job, Dodo. >> I'm a little fix it superhero now. >> All done. Let's give it a try. Okay, >> it's working. >> Blue super dog. Mission complete. >> Thank you, Blue Super Dog. Anytime with an awesome teammate like you, it was super easy peasy. Phew. Finished another superdog mission. >> Oh no. How do I draw this? >> Uh-oh. Dodo's going to press the green button soon. I can't remember what Super Dog's cape looks like. [Music] >> Help me, Super Dog. >> Green Superdog, ready to help. What's going on? >> I want to draw a Super Dog Squad picture, but I forgot what the cape looks like. Ha! Just look at mine. >> Oh, so that's what it looks like. I'm drawing it now. Come on, let's draw together. >> Okay, [Music] this hand looks kind of weird. >> I'll help you draw it. >> Really? Thank you, Dodo. All done. >> Wow. Thanks. >> Finished. >> With your help, Green Superdog's mission was a big success. >> Yay. Thank you, Green Superdog. >> Uncle Dolby, today you were just like the real super dog. [Music] >> I don't actually have superpowers. I just showed up right when you needed me. >> Then I'll do the same. I'll show up when someone needs help. >> That's amazing, Dodo. You know, in real life, anyone can be a superhero. >> Really? How do I do that? >> If you stay aware and try your best to help others, you're already a shining little hero. Ice cream truck. >> Wow. Uncle, where are we going? >> Dodo, we're going to Papon's house. >> That means I can see Pudding and Puff. Yay. Let's go. >> Huh? Who's there? >> Hello, guys. Cutting doo. >> What are we going to play today? What should we play? >> Big sis made something new. Tada. Hey. [Music] >> Awesome. Let's play ice cream truck. >> Yeah, let's do it. Who's going to sell the ice cream? >> I don't want to. Huh? Me neither. Let's have Uncle and Papon do it. >> Uh-huh. >> Can you play ice cream truck with us? >> All right, sounds great. >> Yay. >> Welcome to our shop. >> What flavor of ice cream would you like? >> Let's go look. >> You go first. >> I want strawberry ice cream. >> Okay. There are no strawberries left. Huh? >> Let's check my garden room. I grow lots of stuff in there. >> Let's go. >> Wow, you even have a little greenhouse. >> Yep, you can grow anything. It keeps the temperature right and tracks plant growth. Strawberries are over there. Wa! [Music] So sour. >> That one's still green. It's not ripe yet. >> This red one must be ready. >> Mhm. >> Right. The really red ones are the sweetest. >> Let's pick this one. [Music] Ha! [Music] >> Your strawberry ice cream's ready. [Music] So yummy. >> It's my turn. I want super cool mint ice cream. >> Huh? We're out of mint leaves. >> Mint? What's that? It's a plant. It smells fresh. I grow it in the garden room. I'll go. I can find it. It's all yours. [Music] >> It smells nice. This must be it. Found it. >> Here you go. >> This is rosemary, not mint. Mint leaves are round and bumpy on the edges. They smell fresh and cool. Got it. Aha, this one's right. Got the mint. >> Here you go. >> Yep, that's mint. Good job, Dodo. [Music] All done. Here you go. >> Thanks. Whoa. [Music] Woohoo. Yeah. Wow. So cool and fresh. Hey, >> my turn. One Superdog ice cream, please. Super dog ice cream. What does that look like? It's an ice cream that looks just like Superdog. [Music] [Applause] >> Let's give it a try. >> That's it. [Music] Is this Superdog's alien cousin or something? >> Yeah, not really. Oh, I can make a mold with a 3D printer. Making mode on. >> Got it. >> Wo! >> Drawing done. Wow. [Music] >> Kids, want to make your own ice cream? [Music] Here [Music] [Applause] you go. >> Thanks. Wo! This is exactly what I wanted. >> Let's make more ice cream. >> Okay. [Music] Wo, >> this is awesome.",
    "start_time": 1.36,
    "end_time": 983.44
}