{
    "video_id": "dFymnFvazUI",
    "channel_url": "@sssniperwolf",
    "transcript": "Today we're checking out some of the weirdest inventions on the internet. Like this little guy who is actually a piggy bank who eats your coins. Yes, you literally feed him coins and he starts chewing on it like it's a little snack and it just encourages you to keep feeding him money. He has an insatiable greed for your quarters. It's just so creepy how realistic this thing is. Like it literally looks like it's munching on your pennies. Bro, they made an invisible boat. Like you could barely see this thing. It's basically a boat that has clear plastic walls. But wait a second. All you could see is the motor. So when this guy sets sail from far away, you can't even see it. You just see this dude riding the invisible boat mobile. It's literally like the one from Spongebob where Merman and Bible Boy do that challenge where they go skirt. This looks very cool, but I would be so scared. of boats hitting my boat because you can't see the invisible boat. You just see a person like, \"Excuse me, sir. Are you sitting on water?\" Like, what if they don't see you and come flying at like 50 m an hour? What if they like hit your boat? The insurance company be like, \"Oh, it was invisible. It never existed. Sorry, we can't cover you.\" Bro, who made this? It's literally a roach plate. Roach bowl. They got a whole collection of roach ceramics and it looks like a roach in your bowl. A roach in your plate. I don't know how I feel about this. I don't want to eat off of something that has a roach. I don't care if it's fake. It's like 3D, too. The roach has some definition to it. Uh-uh. This is a no for me. Smash like no. This is one of the coolest plushy toys I've ever seen. It's a carrot in a blender. You know, I never thought the day would come where I would see a plushie blender, but like you pull the string and then he just spins. Like, woohoo. Blend him up. Except not actually. Just take him for a spin. You know, this would be 10 times cooler if it actually made this sound. You know, I've always wondered what a carrot being blended sounds like. This company made a butt lamp and you smack it to turn it on and off. Oh, lip cheeks are jiggly. I got to turn on the lights and then you just touch it and the cheeks illuminate the room. Wow. You could do a whole yuck wall out of it. You basically like smack it on, smack it off. And they come in many ambient lights. Wow. I would 100% buy one of those, put it behind me, and then smack it for ambient lighting purposes. Try not to get demonetized challenge with some cheeks right behind me. Now, this is what I call some technologia. Oh, wow. I thought this was a gaming tool. Like, can you press extra buttons with it? No. But you could take a potato chip and eat it with not a sight of Dorito dust on your fingers. This is actually genius for the cereal snackers who are also germaphobes. and don't like a crusty musty keyboard. It's like having two extra fingers for the sole purpose of taking a chip and putting it into your mouth. I love this. This is a cup that is actually an egg separator that separates the snot from the yolk. That is a huge snot. I don't like how it just comes out of his nose. You pour your eggs in it and it will separate the whites from the yolks. But at what cost? having to bear witness to this atrocious scene of snot pouring down this guy's nostrils. I just hate seeing this. It's just the texture and viscosity of the egg white is just it sickens me. You know, I'll do it the good oldfashioned way where you just like boop boop boop boop egg separated from the whites. It takes like 2 seconds. Is this guy really necessary? Not in my book. Not in my life. This is the coolest thing ever. It's a waterfall swing that has a built-in waterfall. So when you swing, it's like a try not to get wet challenge. I feel like there would be a really good chance to get wet. Or maybe there's a sensor that could tell when you swing through it, the water drops, so it times it perfectly. I don't know. If I'm getting on this swing, I'm going to get off soaking wet. It's like half the fun. Where was this when I was a kid? Unnecessary adult purchases. No regrets. It looks like a picture frame. And you put candy in it. Candy in a picture frame. Hang up some fond memories of these M&M's. But wait a second. It's a candy dispenser that actually dispenses candy from the picture frame. Wait a second. This is actually genius. So, if you're worried about your coworker stealing your candy, literally just hang this up on your wall. Me stuffing my face with M&M's. Like, I ain't got any M&M's. What are you talking about? Nobody has M&M's around here. Definitely didn't just come out of my wall. This is the kind of things that you buy when you have adult money. Art that you can eat. And I'm not talking about this $100,000 banana. What does this look like? It looks like a little box of chocolates, right? Wrong. Is it slime? Is it a squishy toy? Can you smush the chocolates? No. But you can click them. And it sounds like the most satisfying keyboard sound I've ever heard. Wow. Now they should make a keychain out of this. You put it onto your back anytime you're like anxious. Just like Hold on. Unto pavore. I need click my chocolate box until I feel better. Oh, music to my ears. The tea set. my friend gave me. Oh, what you got in there? Oh, are those bobas? Bobas coming out of the pig's nostrils. Bro, I don't know about you guys, but I wouldn't want to drink tea out of Peppa's nostrils. Yeah, that's a no for me. Kind of reminds me of trying to breathe when you're sick and your nose is stuffy and you can't get the snot out. Oh, bad times. Horrible times. I don't want to think about those times. This is another cool little gadget. It's No Face from Spirited Away. But look what happens when you offer him money. like, \"Oh, sir, some gold for you.\" He literally opens up his mouth and then eats it. This is just basically another very fancy piggy bank. And if you've seen Spirited Away, No Face will eat anything. You could literally put like a pencil eraser in there. He's going to shove it down his gullet. Whatever you offer me, I will eat. What is this stretchy thing they put over their phone? It turned their iPhone light into a little lamp. I thought those were these little coffee creamers that they have at the gas station. But no, it's like a little eye patch for your iPhone that turns into a lamp, you know. Is this necessary? Yeah, I don't think so. But it's fun. If it makes you smile, it might be necessary. This robot keeps your lollipops clean. So, he will feed it to you and then put it inside his little clinker head. I don't know why I would say that. That was so rude. So, he's basically taking it from his mouth to yours. That seems a little intimate. Are we dating or something? I don't want to share my lollipop with anybody, especially not this guy, which his sole purpose in life is to sheath my used lollipop. So, you get a lick of the lollipop and then when you let go, it goes immediately back into his mouth. So, he gets way more lollipop time than you do. You know what, little guy? Just keep it. I don't even want it anymore. You know, for all you girlies who do an eyeliner wing every single day, how much time are we wasting when you could just buy an eyeliner stamp? It's literally a pen with an eyeliner stamp. So instead of drawing on the perfect wing every time, you literally just take it and then stamp it on your eye and then fill it in. And then you have a perfect wing every single day. Not, oh, this side is way longer than this side. I'm going to have to fill in this side to make it just as long as this side. And then you keep filling in until you look like a raccoon. I mean, I feel like this is going to take just as long because you have to stamp and then you have to fill in. You know, it's the filling in that makes it take a long time. This is an ice cream ball. How do you make ice cream in a ball? You put all the ingredients that you need for the ice cream and then salt in the other section and then you play around with the ball until it makes ice cream. So just kick it around for a while and then it like mixes all the ingredients together. It's basically a super fun way to make ice cream. Where was this when I was a child? You know, we use the plastic baggie method to make ice cream where you have salt and ice in one bag and then cream and sugar in one bag and you just shake it vigorously until you have ice cream. You know, you got to work for your cream. A new Croc attachment just dropped. I don't know how long this has been around, but it's basically a flashlight for your Crocs. So, whenever you're going for a walk or patrolling the dark hallways of your home or walk into the bathroom and you're scared of the dark, you know, just turn your Croc light on. This would actually be so smart if you wear your Crocs and you go for a walk at night and you got like a little flashlights on your feets. I think this is actually very necessary. Bro got some giant claws to scoop up the crunchy leaves and put them in the trash. Wait, this would actually be so useful cuz it's like what you do. You rake them up and then put them in the trash. But like if you could just do everything with your hands. A big scoop. Like let me bust out my leaf scoopers. Raking takes so much time and then you got to like scoop it up. Ain't nobody got time for that. There's also a leaf lifter which clamps up leaves and then puts them in. And then these mega leaf scoopers. I feel like this would be the most efficient way to do it, especially if you got some moisty leaves in there. GH, nobody want to touch those. Let the leafer do it. That is not a real stomach. This guy made a dad bod fanny pack. You can put things in it. This is literally a fanny pack attachment. It's called the dad bag. You know, I didn't know dad bods were in such high demand. I feel like most people can just like whip out their own stomach. Oh, but does your stomach have a bag in a secret compartment? Yeah, I didn't think so. So maybe this would be pretty useful. But wait a second, there are many other variations. You got the Allen, the Daring, the Sherman extra hairy edition. You know, the Magnus if you're a man of many roles. A very interesting fashion statement. There was this ad that Nes Cafe did that was like, \"New relationships are harder than you might think.\" So they made a bench just for this commercial called the Hello Bench. And it's not just any bench. It's a bench that when two people sit on either edge, it slides them closer together so that they are forced to make conversation. Bro, this would be my worst nightmare. If a stranger is sitting on one side of the bench, I'm going to sit on the other side. I don't want to get closer, but it forces people to get closer together and they actually like bonded and made some new friends. So, this is kind of like a social experiment slashinvention and it's supposed to bring people closer together, but also buy your coffee. It's really good. We have a very high marketing budget, so we made this bench. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button and the and make sure you turn on notifications. Click click and subscribe to the Wolf Pack. I love you guys so much. Thanks for watching. Bye guys.",
    "start_time": 0.16,
    "end_time": 641.279
}