{
    "video_id": "AxcG00ZNOf8",
    "channel_url": "@sssniperwolf",
    "transcript": "Today we're checking out some very lucky people. This cop found thousands of dollars hidden inside somebody's tire. How did he know it was in there? Okay, he must be at least 99.9% sure that they were hiding something in this car for him to bring a drill and start drilling inside the car. Like, bro, this would be so awkward if there was nothing there. So, he took a camera, dropped it inside there, and saw the money like, \"Oh, okay. My hunch was correct.\" started cutting open the car. You know, if you're hiding that much money in the tires, what else are you hiding in there? What is that? Tobacco. Is that illegal? If anybody can find Bedazzler's secret room, it's this guy. I don't know why a cheese pull reminded me of Spider-Man, but here we are. If you've been on the internet, you've probably seen one of these money chambers where you're in a glass box and there is money flying around everywhere and you have to catch as much money as you possibly can. Well, what's the correct way to do this? to catch as much money as possible. You have to stay calm. And then you see what she just did right there. She literally held her hand in one spot since the money is going in a tornado. So, she just like catches the money and then puts it in. This is probably the most money I've seen somebody get in one of these because the money is like spinning everywhere and they're just like, \"Ah, ah, where?\" End up getting like $3 because they panic. She stayed calm. You know, work smarter, not harder. They got this bunch of bananas that were merged together, you know. Please be one giant banana. Please be one giant banana. Let me see. Man, you can't even rip the thing off. You have to cut it off. Oh, wow. It really is one mega banana. I didn't know they grow like that. I thought every banana was their own individual thing, but apparently they could just grow into one mega nana. Uh, banana nana nana nana nana nana nana. That's what you would call one of those. It's a whole lot of banana, bro. It's just like the banana how they all merged together when they were growing. It's like conjoined twins, but as fruit. Oh, I really hope that's a crunchy grape. Come on, cut it in half. Take a bite. Let me hear this crunch. Oh, that thing is juicy. I mean, if you wash your fruit, it's fine. It's not like they specifically sprayed that one grape full of chemicals while it was a wee grape seed to turn it into this hexa grape monstrosity. I think you're good. I think you'll be all right. My lemon tree produced a very unique lemon. Wow. So, I've seen these before. They're called Buddha hands. And usually they don't have any juice inside them. But I'm very curious to know what the inside of this one looks like cuz sometimes they just use them for zest cuz they're so zesty. Oh, let me see. Oh, it's juicing. Oh, wow. That's literally like a piece of art. Man, the lemon tree did that. I would be so in awe. I wouldn't even want to juice that. I wouldn't want to eat it. It's so beautiful. It's like a lemon mosaic. Wow. Oh, it's so beautiful. I would want to like preserve it forever. You might have seen these in your grocery store before. They look like a mutated lemon, but they call it a Buddha hand. And it doesn't have any juice on the inside. So, people usually just use it for the zest. It's a whole lot of lemon zest. Bro, hit the banana jackpot. Oh, that's weird. I thought it was going to be like stuck together, but they like separated. Does it taste twice as good as a regular banana? I hope it does. Like, how do you look at this banana and not be like sus? That's way larger than a regular banana. He might not have hit the Megaillion jackpot, but he did hit the banana jackpot, which isn't even close. But it's still a win. You know, you've probably seen videos where they crack open an egg and they get a double egg yolk. But what about a triple egg yolk? What are the chances? The chances of a triple egg yolk are 1 in 25 million. Okay, Bro got two in there. Okay, Bro opened up this egg. Got two yolks. Oh, wait, wait. There's a third one in there. Oh, no. But he realized after he had boiled the egg already. It would have been so cool to crack this egg and be like, \"Wo, three egg yolks.\" You know, it's not that satisfying when they're boiled. You know, that is three times the protein. That is a 21 g of protein egg. This ice cream stand lets you scoop all you can. So, whatever you could scoop and put in your cone, you get to keep. So, bro literally scooped up the entire ice cream and put it in his cone. Like, can you even do that? I mean, they said scoop all you can. If you scoop it, you score it. He paid for that cone fair and square. Bro dropped his box of Popeye's chicken at the table and the shelf said, \"No, don't worry. We got you.\" And saved it midair and it's just hanging there. Like, bro, hurry up and collect your chicken before it actually falls on the ground. Like, you get one chance and that's it. You know, it's a lucky day not to be eating chicken off the carpet. This guy got so lucky. Watch this closely. You know, everybody's standing over here waiting to record something and he got on top of a sign and then this giant wave comes crashing everybody. Were they waiting for a wave? This is like a 200 IQ play. Like, oh, all of you people are waiting for a tsunami, a wave, whatever. Y'all are going to get washed away. Not me. 10 ft on the sign. My grandma told me she left a pear on the table for me. Don't tell me that's a giant pear. Oh my goodness. That is the biggest pear I have ever seen. Man, some of y'all's gardens growing Hulk fruit. Cuz what is this? How does a tree grow a pair this big? I've never even seen a pair this big. This is the perfect shape. And it is also the perfect shape. I love puns. I don't even work here, but I saw free food and became a temporary employee. I'm not going to lie, I've done this before. I see a gathering in the hotel lobby with a buffet spread of food. Like, yes, I am part of the function. Let me get a free grape. I love free food. When you misread the menu and ordered the wrong size. Yo, is that a beaker of Coke? I didn't even know they make drinks that size. It's like what? A 200ml flask. And then this is a regular cup for comparison. Man, I thought America had the biggest drinks. You know, we got a big gulp this size. And then Japan was like, \"Nope, we can serve your Coke in a Breaking Bad beaker.\" Like, how do you even drink from this thing? The next bite going to be crazy, bro. Oh, when you get that perfect middle piece slathered in Nutella. Oh, that's going to be the best bite. That is the kind of bite that you save for last. You know, eat the crust first and then you take that middle bite. It doesn't get much better than that. That is a pretty large ranch. Not an America, though. That is a large America ranch, you know. Of course, it's Wings Stop where they give you an entire bottle of ranch poured into a cup for just the 20 piece wings that you're eating for lunch. Here is also a tub of ranch. Like, who's eating that much ranch? Like, would you like some wing with your ranch? I've seen the way some people dip the wings into the ranch. It's like the main attraction is the ranch with a side of wings. I don't even think ranch is that good. I have not seen a burrito that large. You know, I thought Chipotle was like the biggest you can get, but that's like newborn baby size, but this is like small dog size burrito right there. I'm pretty sure that burrito weighs more than my dog. Yo, some restaurants have these enormous burritos. I feel like this was meant to feed a family of four at least. McDonald's after sending me 60 nuggets and 30 burgers when I only asked for six nuggets. 30 burgers. Bro, accidentally got the daycare's Uber Eats order. >> Oh, this was supposed to feed 30 children. >> Nope. Give it to the girl who only ordered six nuggets. Like, oh, I wasn't that hungry today. Bro, this is way too much food. Usually, this would be like jackpot. But what are you going to do with all that? Put it in the freezer and then reheat up McDonald's? I wouldn't imagine someone to reheat McDonald's leftovers. I hope they donated this food. This happened to me a few weeks ago. I ordered one thing of sushi and then they delivered my order and it was like two huge bags of like Wagu steak, a bunch of sushi, like literally everything off the menu. And I was like, \"Wo, I didn't order this.\" But it didn't have the one sushi roll that I ordered. But I had Wagu steak leftovers for the rest of the week. I wasn't going to complain. And I got to keep all that food. And they gave me a refund. So that was kind of crazy. Omg, they found the forbidden seasoning chunk in their Takis. Oh, girl, you better save that. Put it in a bottle. Oh, wait. There's not only one, but there's two inside there. Oh, man. You know, people pay for Taki seasoning. You hit the jackpot. You got a bag of chips and a whole bottle of seasoning. Put them in a little empty seasoning bottle and you got that Taki seasoning on the go. Can someone explain this to me? There's a bag of fun. And then this thing, she got a giant mega uncut funion. Like they forgot to slice that into little rings. That's the biggest one I've seen. Some people have gotten some of these uncut funions. I believe it is the butt piece of the funion. When the machine stops cutting them into rings, it leaves a giant long chunk as a surprise. And here is a regular funion. It's like an about an inch and a half. And then this thing is a whopping 9 in 9 in of fun. Amazing. A lot of girls would be real happy with 9 in of fun. This guy got so lucky that he walked away from this video with his life. And there is nothing more valuable than that. He was just washing his windshield at a gas station. He's just minding his own business, right? And he has no idea what's about to happen. This car came straight out of a car accident. Hit his car. Almost got him. No. Oh my goodness. I cannot believe how lucky this guy got. Like this is insane that it was captured on camera. Like he's so lucky that he heard that and then acted immediately. Got out of the way. And did it hit his car though? Oh yeah, it did hit his car, but not him. That was a close one. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button in the face and subscribe. Join the wolf pack. I love you guys so much. Thanks for watching. Bye guys.",
    "start_time": 0.16,
    "end_time": 612.48
}