{
    "video_id": "qx-yGazVFAU",
    "channel_url": "@sssniperwolf",
    "transcript": "People have discovered some crazy things on Google Maps. There's this page on Tik Tok called Hidden on Google Earth, and they keep zooming in to these random locations that have hidden secrets like this one. They keep zooming into this island, and they keep zooming in to the coast of the island. But wait, you have to keep watching to see what they're going to find. Okay, so there is a bunch of street view cameras that you can see on there. And at first glance, it might look like a regular tropical island. You know, just a family on vacation. Oh, there's somebody behind him that kind of glitched out, but that's not what we're looking at today. If you turn around, there's this giant cave that looks like a dinosaur is coming out of it. Like, bro, wait a second. Like, all these people are just casually walking past this. Like, is this a natural formation? I'm sure the cave was, but maybe not the dinosaur living inside. Now, we're going to be investigating most of these sightings to see if they're real or if any information is known about these. Like, if you zoom into this, it says Gia Play 3D and a Tik Tok sign. What is that? So, I Googled it. Gia Play 3D is the social media account of a virtual street view artist who specializes in creating 3D Street View art. I'm confused. Is the art in real life or this artist made this 3D art of Godzilla poking his head out of a cave? That's my guess. I'd like to believe that there is a dinosaur poking his head out of a cave. That would be very cool. That'd be a very cool thing to put on an island in the middle of nowhere. You know, people travel thousands of miles to go to an island that has a bunch of random stone heads. Easter Island. So, why wouldn't they go see Godzilla in his natural habitat in this cave? I used to live here, but left cuz my neighbor wouldn't leave my mailbox alone. >> I'm sure it weren't that bad. Maybe he was just confused. >> No, I'm confused. What the >> Well, he isn't lying. We have photographic evidence of your neighbor planking on your mailbox. You know, every time somebody spots one of the Google Maps vehicles out in the wild, they're going to pose for some crazy things. Like this guy who pretended to be dead in front of the Google Maps car like, \"Oh, Tom, it's going to take a picture.\" And then a few months later checked his house on Google images to see if it actually took a picture. And it did. Pro is there lying on the ground. No. Mission accomplished. This must have been so satisfying to check your house and see it there. Like, wow, mother. I've really made it. I've made it onto the Google Maps. And if you've made it to this point in this video, make sure you smash that like button. This one is one of the creepiest Google Maps sightings that I found on Tik Tok. It had millions of views. So, they zoom into this one spot and when it looks like the desert in Nevada, let me tell you, it's a whole lot of desert. They found this one section of the desert in the middle of nowhere with a house, a couple of cars, and what appears to be a spiral in the sand. Okay, let's see if there's a street view. Oh, there is. Okay, so it looks like a bunch of rocks. Wait, what is that, bro? Is that a ghost? >> That's it. I'm out of here. >> Caught on camera. Oh, I've seen this before. It's not actually ghosts. This is like an art installation in the middle of the desert which looks like a bunch of ghosts having a party doing ghost things. So I did some digging. I actually drove past this before and saw these statues and was like >> wait a minute >> what is that? Are those ghosts? Like what is that? So this is in Nevada. It's called Rioly and it's a ghost town and these statues are in an open air museum called the labyrinth. You know this might be a little creepy at night but during the day you can go out there walk and take pictures. You know, the spiral from the Google Maps looks creepy, but up close, it's just a bunch of rocks in a circular formation. You know, nothing creepy about that. A human definitely put this together. And then the ghosts riding the bike. It's just an art installation. You know, it's way less creepy when you actually have an explanation. And I believe most creepy things actually have an explanation to them, making it a little less creepy. Okay, I don't think you guys are ready for this. Okay, they are zooming in which looks like the southern ocean which is off the coast of the Antarctic peninsula. Yep, look, that's Antarctica. That looks a whole lot like Antarctica. But wait, they're just chilling in their boat, right? And then behind them, bro, there's literally a kraken in the water. They actually exist. Yeah, they're all holding like sticks. I can't tell if it's for the boat, like rowing the boat or if they're selfie sticks. It looks like they're all holding selfie sticks, you know. How did they get a Google Maps car out there? Are they the Google Maps guys? Ro was looking directly at the camera. Like, is this a drone shot? Anyways, don't let that distract you from the fact that there is literally an enormous kraken in the water. So, I did some research on this to see if there's actually a sea monster in the water or like what is this? How do you possibly explain this? Somebody's theory was that it's just a rock. You know, I've seen some pretty suspicious looking rocks. No, not that rock. There are a bunch of really weird rock formations around the world. Like this one kind of looks like a skull. This one looks like the Cookie Monster. And maybe this one looks like a kraken. Like I can't tell. Like maybe it's a rock. Maybe it's a sea monster. Like this video if you think it's a sea monster. So they found this school on Google Maps. It's just a normal school, right? Me? >> Nope. >> No, it's not a normal school. Oh, wait a second. Does that look familiar to you? Because it's the high school from Gumbball. It's based on a real school in real life. So apparently all of the locations in the amazing world of Gumball are real locations in real life. Like the house from Gumball is also a real life house. That would make a sick Airbnb. It's like a little Easter egg. If you guys have heard of the Bermuda Triangle, which is also called the Devil's Triangle. You've probably heard some crazy things go on over Bermuda, like aliens. I've heard planes flew over Bermuda and went missing. So they zoomed in and like, bro, what is this? We got planes. Oh my god. >> What is in the air? And then this, which looks like the cover of a video game. Bro, we got the new Fortnite update in Bermuda. Now, where are we landing? The Bermuda barn. Okay, this has got to be fake. Some people think there's like a parallel universe in the Bermuda Triangle that causes a time or space warp when you fly over it, or it'll just like suck you in. I don't know. Deep in the middle of Virginia is one of the creepiest things on Google Maps. There are over 40 abandoned statues of previous presidents with no explanation. Some statues are over 20 feet tall. There are so many of them. It's like every previous president gets a statue. Like, sorry, buddy. You couldn't make it on Mount Everest. Let's just put you in Williamsburg, Virginia, where old presidents go to die. Wa! This is actually so weird from an aerial view. Like, look at all of them, bro. There's so many president statues just sitting in a random park. Who's making all of these? You know, how do they even make these? Man, the back of Abraham Lincoln's head is falling apart. You know, these things are like 20 ft tall. Somebody could definitely like crawl in there and control him from his brain center. So, do you guys want to hear the truth? The truth isn't as crazy as you would think. So, this is actually called President's Park. It's an abandoned park in Williamsburg, Virginia that went bankrupt. So, they thought it was going to be like a super cool tourist attraction. Like, oh yeah, we're going to make this president theme park. We'll put roller coaster, ferris wheel, George Washington's head. Kids love George Washington's head. People will fly in from all over the world to go see George Washington's head, but I guess it wasn't that popular, so they just abandoned it. And if you want to see it, you have to go on a private tour. I found this on the Google Earth. So, where are they zooming in? It looks like I think that was Australia, an island to the east of Australia. Oh, it's a tropical island. Wait, that's that's a boat. >> Oh my god. >> Is that the Titanic? There's no way that's a Titanic. It looks like a tropical island where a boat crashed. Man, that's not just any boat. That kind of looks like a cruise ship and they just left that thing there. Okay, I had to do some digging because like how did this get there? We just abandoned an entire cruise ship off an island. So, this cruise ship was actually the MS World Discoverer. It was a German expedition cruise ship from 1974. So, it struck an uncharted reef in the Solomon Islands on April 2000. You know, the ship didn't make it, but all the passengers were thankfully safe and they were able to escape. You know, good thing there's like an island right next to it. You could basically jump off the ship and swim to the island. It might look creepy, but thankfully nobody died there and they just use it as a tourist attraction and you can go diving in that water. So, I think that's actually some pretty cool lore. Like, it's just an abandoned ship. We're like, \"Okay, you know what? It's perfect here. Maybe more people will come to the Solomon Islands to see the abandoned cruise ship. But we'll just make a creepy Tik Tok out of it to make it seem like hundreds of people died here. Pretty good marketing on their part. When the Google car is coming. Quick, pose for the Google car. Oh, they dressed up and everything. Spider-Man taking out a bad guy. So when you zoom into it, it's somewhere in Mexico. Zoom in. And some guy is in a Spider-Man suit hugging a tree. Oh, wait. But when when you zoom into it and then he's grabbing a guy in a mask, you know, some kid is probably searching up their hometown and they stumble upon Spider-Man on the Google Maps and he's going to think it's real. Like, oh my goodness, mama, papa, ls real. You know, whenever somebody sees the Google Maps car coming, they know that there's a good chance it's probably going to be posted. So, I think there's like a lot more Easter eggs on the Google Maps than you guys think. Okay, zoom into these coordinates in Mexico and wait a second. Just wait for it. There's this one guy who's caught riding his bike. Yeah, normal. Nothing to see here. When the car is driving down the road, bro falls. Like, oh, I hope my future wife doesn't see this video. Like, this must be so embarrassing. The Google Maps car saw it all. An accident happened in real time. Okay, that's Antarctica right there. And then, wait, what is that island? There's just this random island. Oh, it's a tiny little thing. Oh, wait. Not even that tiny island. the the smaller one, you know, even smaller. Bro, zoom in. How do they take pictures of this tiny little island? How did they get the Google Maps car out there? You got a street view of this thing. Wait a second. That wasn't the island we were just on. This is literally the back rooms. What? It's just a room with a bunch of doors, man. Whose island is this? And what they got going on here? Nah, this is suspicious. Maybe it's the entrance to the Squid Games island. Maybe they got one in real life. I don't know. But you know what the craziest part about this is? If you go right now and zoom into this island, it will not show this. They removed it. For some reason, they had this removed. I don't know if it was a mistake. I don't think it was a mistake. These doors are shut. How did they get inside this building? Why is there the back rooms on this island? I don't know. I guess we'll never find out. Somebody mentioned this was the SCP Foundation. If you didn't know, the SCP is a foundation that's responsible for locating and containing individuals that seems to like break natural laws. So, aliens, anything that would scare the general public, the SCP takes and then hides. And it's like, don't worry, world. I will protect you from the horrors that are in my hand. I don't know. I would love to know what's on that island, though. Like, what what secrets are you hiding? Somebody found this really suspicious place off the coast of Florida. Okay, zoom in. and zoom into one of the islands. And wait, wait. We can go inside the water. Here is snapper ledge reef. You know what's suspicious about a underwater reef? Okay. Isn't this weird that you can go in the water? Why are we in the water? How do they have footage of this? It looks like a reef farm, like a man-made reef farm. But why do they have underwater footage on Google Maps? Isn't that weird? Imagine if you could explore the entire ocean on Google Maps. Like, think of all the crazy things you would find. So, I looked it up. It's called Snapper Ledge Reef. It's basically a coral nursery to keep them from going extinct. Basically, they're helping them grow on those poles and then they'll take them off and they will replant them. That's also what those cinder blocks are for because the coral reefs grow off the cinder blocks. Somebody found the entrance to hell on the Google maps. Wait a second. I got to see where this is. Are you zooming into Cabo? Somewhere in Mexico off the coast. Okay, zoom in. It looks like a a port. you know where ships go in. All right, let's see that street view. It's off the side of a cliff and then you can see a hole which looks like a cave. You know which is it? You know, come on. Where is this so-called entrance? Oh, wait. There's a gate. It basically says Diablo and it's just a red gate that says Diablo. Diablo means devil. Is it the devil's gate? Just that could be the entrance to somebody's house. What exactly is behind that cave? Only Diablo knows. Maybe he lives there. You know, it ain't got no guards, no security. You know, technically anybody can just like, if they're skinny enough, go through the bars. I don't know. You guys are making this seem a lot creepier than it actually is. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button and subscribe. Join the wolf pack. I love you guys so much. Thanks for watching. Bye guys.",
    "start_time": 0.0,
    "end_time": 801.12
}