{
    "video_id": "bQD5ImXoCm4",
    "channel_url": "@sssniperwolf",
    "transcript": "Hello friends, it's me. Today we got another Darmman Monday about a rich family who goes undercover at a poor school. Are rich people not allowed to go to a regular school? They'll show up with their new iPhone and flex on all the other kids too hard that it causes a distraction for the same reason you can't wear sleeveless shirts in school cuz shoulders are so distracting. Let's watch. Come on, guys. We got to be out of here in the next 90 seconds. >> This is crazy. Middle of night. What did you get us into? I didn't think that this would be happening. >> I want to leave. >> Where are we even going? >> To my safe, baby. I promise. >> Safe from who? >> Don't make this harder on yourself than it needs to be. Jennifer, I just want to talk. >> Go. Is that the police? Oh, no. That's not the police. >> I don't know about you guys, but I wouldn't want to just talk with somebody holding up a gun. Bullets are much louder than a word. Bro, you said talk. Low key, this was my worst nightmare as a child. I was so scared of this happening and then I grew up very thankful that my parents were not involved in illegal activities. You know, this usually happens when your parents deal with some sus people. >> It's me. They're gone. The whole family. Don't worry. I know how to find them. >> I need all your devices. >> Give me one second before I send them one last so they can let me know. What you >> What are you doing? If I don't send it, I'm going to forget it. >> Use this. Nothing with Wi-Fi, GPS, or any of that. We're all going old school till this over. >> No way. I I I need my phone. >> What do you mean? I can't have Snapchat location for all my friends to see. I'd rather put my entire family's life in danger than not be able to scroll on Tik Tok. >> I have a life. I have friends who need to be able to reach me. And what about Clay? My boyfriend. I can't go off the grid. If you want to stay alive, you got to say goodbye to your old life. >> You're ruining my life. And for what? She won't even tell us what's going on. >> Come on. All right. The clock is ticking and we still got to build radio identities. >> Let's move. Why does she have to take her headband off for her new identity? That seems unnecessary. Like nobody's going to recognize you without the headband on. Learning your new names and histories is crucial to keeping you. [Music] Welcome to your new home. Ew, this place is horrid. Please don't tell me we have to stay here. It's just for a little while. >> Look, I know it's not much, but it's safe. Well, how long are we stuck here? Because Klay bought us two front row seats to see Taylor Swift, and I cannot miss that. >> You're going to be here until your mother testifies at the trial. >> But that can take months, and trials against big companies take even longer. I have a career. I have deadlines. >> I'm sorry about this, Le, but it'll be easier if you start using your new names. I'm sorry, Frank. I know that this is a lot, and it's not how I planned it. >> Oh, you you had a plan. >> I think they're in the witness protection program. like she witnessed the crime and then that's why the bad guys are after her and her family because they want to get rid of her so she can't testify in court against the crime that she witnessed. Okay, it's starting to make sense now. So when your life is in danger like that, they put you in a witness protection program where they give you a new identity, a new place to live, a whole new life where nobody knows you unless you're famous on Instagram. Then you're screwed. >> Really? Because it sure doesn't look like it to me. >> Louis, this is important. Easy for you to say when you actually know what's going on because telling either of you will only put your lives in greater danger. >> This isn't fair. >> Look, just give them time to adjust. They'll come around. >> The US marshals have the family stashed in a safe house somewhere. >> Your job was to find them before that happened. >> Don't worry, we'll find out before she testifies. You'd better hope so. >> We got a Darmman Crimelord episode before GTA 6. >> Don't drop me off in front of the school. Are you nuts? I am trying to make a good first impression on these people. >> No one's happy about this sudden change in our lives. Sweetie, look at me. Just two days ago, I was a CFO of one of the country's most successful financial firms. And now today, my name is Frank, who's in charge of mopping floors. >> I'm sorry, you two. I really am. >> Why would they downgrade him so much? A CFO at one of the country's biggest financial firms. Her dad is making millions a year. How are they just going to be like, \"The only thing we can offer you is janitor. Like, what about all their money? Where is it? They're not allowed to use it.\" It's no picnic for me either. But this is just so important. >> Not to me and Dad. Don't we matter at all, >> Faith? That's not fair. >> Of course you do, honey. More than anything. Ridiculous. Hit that car. It looks straight out of the8s. What do you expect? Her dad's a janitor. Pathetic. >> It's the first day of school. How does she know that? She doesn't even know this girl. How does she know so much about her already? Dad's wearing blue and they're in a beat up car. Must be a janitor. >> They're asking a lot from her. >> This can't be right. >> I didn't expect to see you here on the weekend. >> Have you seen these reports on our downtown plants? They're unbelievable. No, I haven't. >> Am I crazy? Or was that the guy who was in the dark giving orders to the assassin? >> Wait, these are >> That might be him. >> These are employee complaints, not OSHA reports. >> Sorry. >> So, disgruntled employees will say just about anything to make a quick buck. >> They're disgruntled because the working conditions of our plants are making them sick. >> So, they say. Our experts say differently. Listen, I wouldn't waste any more time on this. This is the flash. >> Already got a pretty full plate. >> It is him. >> The CEO of the company she used to work for hired a hit out on her and her family. You know, because she knows something she's not supposed to. >> I can't stop now. >> And welcome. We have a new student today class. Kimberly, why don't you tell everyone something about yourself? >> I'm Faith. Uh, wait, no. Uh, I'm Kimberly. >> She forgot her name. How embarrassing. >> That wasn't >> I'm from Kentucky. I I mean, wait, no. Columbus, Ohio. Columbus, Ohio. She finally caught it. >> Uh, yeah. That girl with a full face beat on a Monday morning. She's definitely in the witness protection program. I feel like nobody's going to laugh at a baddie like that. Sorry. >> Have a nice day. Mhm. [Music] >> Darm man checking out at the local Target was not on my bingo card. There he is. >> The man behind the videos. >> Good for that whistleblower doing the right thing. [Music] It's like he knows. [Music] This is not it. [Music] You've got no idea how horrible it was. Everyone was laughing at me. >> It'll get easier. >> How do you see where we're living? We might as well live in a homeless shelter. >> Fake. >> No, I'm serious. Mom, >> they were laughing at you because you didn't remember your new identity. Maybe learn your new identity so you're not like I'm from uh uh um Columbus, Kentucky. No. Um Washington DC. Uh, no, no, no, no, no. Wait, wait, wait. I'm from Mexico City. Yeah, that's the one. Also, my name is Kevin. And then what was my name again? Samantha, Aaron, Kimberly. Yeah, maybe that one. Yeah, people are going to think you're insane. This whole situation is the worst. People took one look at these hideous clothes and they called me a loser. Me. I used to be the most popular girl at Bookside. >> I know that this is difficult, but I promise we'll get through this together like a family. What was that for? >> I don't know. I just think it's funny that you're saying that we're going to get through this together as a family when you force us on us without even asking us how we feel about it. >> Exactly. Thank you, Dad. >> Babe, if you can just tell us what this is really about, okay, maybe we can try to >> Trust me, if you knew the full story, both of you would have done the same thing as I did. I wish I could tell you more, but you heard what the Marshall said. >> This is the worst. Hate it. Why wouldn't you tell your family? >> Babe, >> at least your husband >> talk a lot about trust. Trust is supposed to go both ways. [Music] They use any of their money or their cards. I'm fine. [Music] All their accounts, they they're frozen. Time is ticking. Find them or >> can you find them or not? >> Everyone makes a mistake sooner or later. >> I'll find them. >> Hey, what are you doing? I know it doesn't look like it based off this horrific outfit. But I belong at the popular table with >> um No, you don't. Am I old school? I was the most popular girl. >> I like the confidence. You know that kind of confidence will land you at the popular table and wherever you want to be in life. >> Don't make me sit with the nerds. >> You were the coolest girl in school. Isn't your dad a janitor with a busted car? Yeah. Nobody believes that. >> Bro, why would you get up? Be like, \"This is my table. Why is everyone laughing? Why was that so funny?\" Oh, I slammed my books down on the table. That was the funniest thing I've ever seen. Your dad's a janitor. You can't be popular, stupid. >> This can't be right. >> No, we allocated that to quarter two. >> Oh, you forgot to carry over the dividends from the first quarter. See? >> Okay. >> Who's this guy think he is? Goodwill Hunting or something? We don't need a janitor trying to do our jobs. You get it? >> Bro just casually exposed himself. >> I promise you there is >> Don't take his advice. >> True claims. >> Hey, too much TV rots the brain. >> He's dragging me through the mud in the press. And my family hate me for uprooting their lives without even being able to tell them why. Look, I know how hard this is, okay? But if you tell them, it will only put their lives in danger. Two nights ago, somebody broke into your husband's office, >> knocked out the security guard, and ransacked the entire place. So, >> these are serious people, okay? And they're hunting you. But I can keep you safe so long as you trust the process. The trial will be here soon enough, >> bro. For a trial like that, it takes months, if not years. So, they going to be living like this for a while. >> What's the matter? >> Everything's the matter. Your crusade is ruining my life, and you don't even care. >> That's not true. I do care. >> I've tried everything to fit in in school, but nothing is working. I get bullied every day. I miss my real friends. I miss Clay. I know, sweetie. I know. But I didn't plan on any of this happening. >> Neither did we. And now we're stuck trying to understand why you've chosen a lawsuit and money over your own family. >> What? This is not about money. >> Oh, stop. We saw the news. There's no evidence against the company. >> They're lying. And I'm going to prove it in court for the whole world to see. I watch this video on the news. That means it has to be true. It has to. average idiot on the internet. Oh, this headline says the CEO has nothing to hide. I believe it because it said so in big bold letters on the internet. >> Why this is so important? >> And what? We're not important. Is that what you're saying? >> I promise both of you will understand when this is all over. >> I will never understand why my own mother is so self. >> Don't you ever think about anyone other than yourself. You cannot be raising your voice at your mother like that. I don't care how angry you are. Louis, I am just trying. Wait, if anybody should be mad, it should be him. Bro had like one of the highest positions in a huge company and then just got demoted to janitor. Like, how are they going to do that to him? Like, at least make him work at an office. No, we're going to make this guy a janitor. Come on. That's just disrespectful. >> The doctors tell me it's some sort of turbo cancer. It started in my lungs, but they say it spread. [Music] Mask we were using weren't the right kind. The fumes at the old plant, but no one told us, sicker I got, the more time I missed at work for treatment. So eventually they fired me. This is unbelievable. >> They gave her cancer and fired her. >> I am so sorry. I had no idea. There are dozens of us over 55 so far. All sick with with tumors, autoimmune diseases, miscarriages. I can't let them get away with this. I want to help. [Music] M our lawyers say we need official correspondence from the executives admitting they knew about the faulty safety equipment. With your access, you can get that for us. >> They would never admit it. >> Promise me, even if I don't make it to trial, I shall make them pay for what they did to us. I promise. [Music] Just go keep going, man. Who knew helping other people would cost you your life? Like, oh yeah, this employee who tried to expose us and help all the other workers. Let's hunt her down and her family, bro. Put that CEO in jail. >> What do you mean? You still haven't found her. No one's more upset about this than me, sir. >> I knew it. See, I told you. You smash that like button if you believe me. >> They'll make a mistake soon. They always do. >> I want her silenced by the end of the week. Got it. >> Okay. See, this is where he went wrong. The CEO doesn't have a middleman barking out the orders. The CEO of the company can't be talking to the bounty hunter. There's no chain of command here. >> The Taylor Swift concert is tomorrow and it's going to be amazing. I literally can't wait. Are you going to the concert, too? Me, too. I literally got so lucky. My boyfriend's dad is a music agent and he got us great seats. I know that you're desperate to be our friends or whatever, but it's like weird to lie about something like that. Totally cringe. >> This would be so embarrassing. I'd be like, \"Bro, who do you guys think you are?\" Like, we're going to believe you have a boyfriend. That's cool. Let's go. >> They don't even believe that she has a boyfriend. Bro, she's literally a baddie. What are you talking about? Another bad day, huh? >> There are all bad days here. I hate it. Why is mom punishing us like this? >> Come here. I'm >> just as confused as you are, Goose. But I promise you, I'll get us back to our old lives way. tell our family. >> Like it's love. >> Look at what has happened to our employees. There are over 300 of them so far. All with one horrific disease after the other. >> There's no evidence of those illnesses having anything to do with what our employees are doing at the plants. >> Don't give me that, Bill. I've been doing my own investigation and I have all the evidence they need to prove their case. >> You what? >> I gave those people my word. I looked them in the eye and I promised them that I would help. Come on, Bill. You know what you're doing is wrong. And you still have enough time to do the right thing here. >> That's not going to happen. You're either with me or you're against me, Jennifer. And trust me, you do not want to be against someone like me. >> Yeah, bro. Literally hired a bounty hunter. You don't want to be against him. He's insane. >> Oh, yeah. Why is that? >> You have a family, right? little faith in Lewis. You need to make a choice between some high necks employees making up fairy tales or your family. [Music] >> I wonder if this is based on a true story. >> You got something? >> The daughter sent a DM to her boyfriend today. >> I checked the IP address to a school in the suburbs. They found them. >> Perfect. >> Oh no. She going to get them all caught. >> Everything right now. We got to move your family tonight. Why? What happened? Your daughter sent a DM to somebody named Clay on her computer at school, which means they know exactly where you are, which means we got to leave immediately. Let's go. >> But how do they track that? They got access to all of his media. >> Is she here? >> Yeah. Yeah. She wasn't feeling too well. She went to bed early. Wait, what's going on? >> Uh-oh. [Music] Uh, >> she's gone. >> What do you mean she's gone? Taylor put a call in for the other marshals to come and assist. All right. >> The Taylor Swift concert is tonight, right? How's he going to find her there? >> Security is lovely daughter. So spirited and full of life. >> I'll give you whatever you need. Just don't hurt my daughter. >> You know what we want. >> Fine. You can have it. Me and the evidence for my daughter. Well, you cannot just give up right now. >> This is my daughter we're talking about. I will give my life for her if that's what it takes. >> Your terms are acceptable. 1 hour. Come along. No tracking devices or cops. I'll call back with the details. >> There has to be another way. >> This is the only way. I got us into this mess. I need to be the one to get us out of it. I know you don't understand why I did this, but you need to trust me. I think I have a plan. Hello. Hello. They have >> not until we make sure you following the rules. >> He even brought the hacker with him. Why would he bring the hacker? You know, they're not supposed to leave their house. >> She's clean. No. Huh? Cry. Where's the evidence? >> Oh, now the CEO is here. >> Yeah, just hand it to him. Just give him the USB drive. It's not like the FBI doesn't already have all the evidence. They definitely made a copy. Man, these people are amateurs. [Music] I'm so sorry. I'm so sorry. Why would the CEO be at the crime scene where they kidnapped the daughter? Like, bro's dumber than I thought. Brol should end up on world's dumbest criminals. >> I'm not leaving a spider. >> I never wanted it to end this way, Jennifer. I always thought you were a team player. >> Before you do this, there's something I need to know. How much money is enough? Really? I mean, you're already rich enough for 10 lifetimes. How can you justify letting all those people people that work for you die? Huh? >> Was it because you were too cheap with buying proper safety equipment? >> Grow up, Jennifer. >> No, actually, I'd rather pay a bounty hunter and a hacker to take you out than pay for proper safety equipment and paying all of their medical bills. Yeah, it's actually cheaper. Bro, this is what I don't get. There's >> never enough money. It is my job to make the company and the shareholders as much money as possible, and I'm very good at my job. But all those people, >> forget about them. They're collateral damage. So what? Boohoo. I just wish they'd shut up. They're irrelevant. >> Thanks for answering that. >> You're thanking me. >> FBI, everybody free. >> Oh, they got the FBI on here. >> I would have never been able to get you on tape confessing if you hadn't gone after my family. And now, good luck ever getting out of jail. >> This won't change anything. My lawyers will help me out in a day. >> I don't know about that. They got you on kidnapping charges. They got you admitted to a whole bunch of other crimes. Like, they got you on the same charge as a Tiger King. And he's still in jail. Nah, it's for him. RIP. >> Yay. We don't even have to testify anymore. We could go back to being >> the court finds for the plaintiff and awards her $150 million in damages. >> Oh, >> court is adjourned. >> She got cancer from her workplace, but then also got awarded $150 million. >> Can't thank you enough. >> I hope that helps. >> What you've done for me and my little girl. Now we can get the care we deserve and a new lease on life. We owe you more than we can ever repay you. I hope you know how brave and amazing she is. >> Trust us. We do. >> Well, now y'all trust your mom. What did we learn today? Listen to your parents. Trust your parents. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button and the and make sure you turn on notifications. Click click and subscribe to the Wolf Pack. I love you guys so much. Thanks for watching. Bye guys.",
    "start_time": 0.16,
    "end_time": 1469.9189999999999
}