{
    "video_id": "OQd5VNkYRgU",
    "channel_url": "@sssniperwolf",
    "transcript": "If you go to Venice, Italy, and you feed a pigeon, you can get arrested. Feeding pigeons is illegal. In the United Arab Emirates, you must make sure your car is clean all the time. You can get a fine for having a dirty car. So, make sure your Lambo is clean. In the Caribbean, including Barbados and Jamaica, it is illegal for civilians to wear camouflage clothing. That man, he has no legs. Send him to jail. So, only the military is allowed to wear camouflage clothing. not regular people. Today we are checking out dumb laws around the world that will get you a fine or put you in jail. In California, it is illegal to have your Christmas lights up after January. Like, boo, it's the new year. Take them down. We've had enough Christmas. I feel like this is a law in a lot of random cities where you can't have lights up after January. Yay, Christmas lights during Thanksgiving. Yay, Christmas lights during Christmas. Yay, Christmas lights during New Year. But if you don't take them down in January, you're going to jail. Not really, but you will get fined. You know, most places the law protects humans and animals. In Arizona, we also protect the cacti. I fully 100% support this. The Suarro cactus, that big, beautiful cactus that has been around for hundreds of years. It's endangered. You can get up to 25 years in prison if you cut one of these down, as you should. I love the Saharro cactus so much. It's so beautiful. Every time I drive past one of them, I'm like, \"Wow, he was here longer than me and my parents.\" They've been here longer than us, guys. They got pickle laws now. And by they, I mean Connecticut. This is a really old law. There is a law made in 1948 that pickles must bounce to be considered a pickle. And you can't sell pickles unless they bounce. If you drop a pickle and it doesn't bounce, then it is unfit for human consumption. You know, in the ' 40s when they put this law into place, a man actually got arrested and fined $500, the maximum penalty for trying to sell pickles that didn't bounce. In Alaska, it is illegal to be drunk in a bar. Isn't that the whole point of a bar? To go and have a drink. Oh, you can have one drink, but you cannot get drunk. If you do go to a bar and end up getting drunk, you got to pay $500. Most places in the world, you can go to any gas station, convenience store, buy a pack of gum and chew it. Not Singapore. Singapore, it's actually illegal to chew gum unless you are chewing it for medical purposes. Is chewing gum to get a Chad jaw considered a medical purpose? Probably not. Everywhere they got signs that gum is banned. Why is gum illegal in Singapore? So, they made this a law to prevent people from chewing their gum and spitting it out in public. Used gum is so disgusting and hard to clean up off the sidewalks, the streets, so they just banned it. People who litter ruin everything. In Oregon, it is illegal to go hunting in a cemetery. I don't think you're going to find anything alive there. Like, why would you want to go hunting? What are you hunting? Ghosts. Dumb law. Smash that like button if you think that is a dumb law. Canada, it is illegal to kill Bigfoot. So, did you just confirm that Bigfoot does in fact exist and he does live in Canada? But if you find him, you cannot kill him. That is very illegal. The government is protecting Bigfoot. Isn't that weird? Arizona law protects cacti. And Canada law protects Bigfoot. Here's another really weird and specific law from Alaska. It is illegal to whisper in someone's ear while they are moose hunting. So, you can hunt moose. You can't whisper in that person's ear who is hunting the moose. Who's going to know? Who's going to find out like, \"Wow, look at that creature. I have to be.\" What if you need to communicate to the person next to you who's on the moose hunt? Why is this a law? It implies the significance of maintaining silence and concentration during a fruitful hunting expedition. And moose have exceptional hearing. So, you're allowed to hunt the moose, but you're not allowed to disturb the moose with your annoying whispering. In most places, you can't drink and drive. That's obvious. But in North Carolina, you cannot operate or participate in a game of bingo while being under the influence of a substance because you must maintain the integrity of the bingo game. You know, they take their bingo very seriously in North Carolina. You got to be locked in. There will be no funny business. In Germany, it is illegal to run out of gas for your car. So, if you're driving on the autobond, oh well, I need to stop at a gas station. Well, you should have thought about that before you left the house because there is no stopping on the autobond. So, if you do run out of gas and you end up stopping, you get fined and you can go to jail. So, make sure you got enough gas in your car before you leave your house. I can't believe that's an actual law. You must be more responsible. In certain beaches in Spain, building sand castles is prohibited. It's to preserve the natural beauty of the beach. We don't want your three-year-old to ruin it with their stupid sand castle. Okay, so what is considered a sand castle? If I mold some sand in secret, what will happen? Will I go to jail? The beach police going to find me and be like, \"Stop it. You can't do that.\" In Denmark, it is illegal to name your baby something weird. I thought you could name your kid whatever you wanted to. Like, this is Ashley Ray mashed potato. No, you can't do that. Name denied. Choose a new one. Like, what am I picking out of the license plate or naming my child? There's actually a list of the 7,000 approved names in Denmark that you can name your child. Sorry, Northwest. Denmark said no. I've heard Switzerland is a beautiful, beautiful, gorgeous country. And the mountains, the hiking, insane. But what's the catch? You are not allowed to hike naked. They actually ask you kindly to put some clothes on and not hike naked. In all my years of hiking, I have never seen a naked hiker before. I don't know why you would want to hike naked. If I ever came across a naked hiker, I would think you live in a nudist cult in the middle of the forest. Aren't you worried about like flies and things biting you? The places where they shouldn't bite you. So why did they have to make this a law? It's cuz a naked German man hiked past a family that was having a picnic in the Alps in 2009. Shield your eyes from the naked German man. Our picnic ruined. They must make a law to protect picnickers. Okay, you know what? That's probably a valid law. I don't want to see no naked people while I'm hiking. It's probably for the best. This has got to be the stupidest law ever. In Arkansas, I hope I'm saying that right. This dumb law was created in 1881 where it is illegal to mispronounce the state's name. Make sure you say it right. So, it's three syllables. Are Kansas or is it Arkansas? I don't know. But it's a good thing that they don't enforce this law anymore cuz they realized it was dumb. Whoa, whoa, whoa, whoa, whoa, whoa. If you are in Petetroia, Canada right now, you would have to pay a fine cuz whistling is illegal. There's actually a rule that says no shouting, whistling, singing, or loud noises are allowed at any time. Oh man, what's the city called again? I'm trying to move there. I'll love me some peace and quiet where loud noises are banned. Let me go on vacation there. You should take all of the Karens in the world who complain about loud noises and then just put them in this city. Problem solved. Why did the chicken cross the road? I'm going to have to stop you right there, ma'am. Why? If you own any chickens in Quitman, Georgia, it is illegal for them to cross the road. Isn't that the whole point of being a chicken? Isn't that their life goal? To cross the road? Like, no. Illegal. Please have your chickens under control and on your property at all times. They are not allowed to cross the road. Now, this next one is a little weird, but it is illegal to wear high heels in certain places in Greece. So, if you're sightseeing around historic cities like Athens, high heels are illegal. You're not allowed to wear them because they could damage ancient monuments. What if the ancient monuments damage your heels? Well, you probably shouldn't be wearing them in the first place, especially if you're walking to all these monuments and stuff. Why would you be wearing heels in the first place? I will make sure to bring my flats. In Portugal, peeing in the ocean is illegal. How do they know if you peed in the ocean? They don't. So, you can do it. You just can't get caught, which is pretty easy. This should be a law everywhere because unfortunately, I feel like many, many people pee in the ocean. I don't like it and I can't control it. That's why I don't like like really crowded beaches. I could like make contact from somebody like 5t away from me and they they could be peeing in the ocean while just standing next to me. I don't know if they are or not. And it just grosses me out. In Thailand, stepping on money is illegal. So, it's like if you're walking in the street and you accidentally step on some money, you might go to jail because the currency has a picture of the king on it. And if you step on a picture of the king, it's considered disrespectful and they can put you in jail. It is also technically illegal to leave the house without putting on underwear first. How would they know? No one's going to know. In the state of Washington, you can get a misdemeanor charge to expose somebody to a contagious disease, even a common cold. So, if you're as soon as you get onto a plane, man, I swear people go on planes in airports just so they can cough. Like, finally, I got to the airport. I can let it all out. Yeah, not in Washington. Good on them. It drives me insane how inconsiderate people are when they're just coughing in a crowd of people. Like, oh, I'm sick. I don't care. I'm just going to cough on everybody and spread all my germs. What I have, everybody's going to get. Are you not worried about like making other people sick? Those people are the real villains. If I'm on a plane and I have a cough, like sick or not, like I will do everything I can to just like like clear my throat away from people. This is literally my biggest pet peeve in the world. When people cough with their mouth open all over people and things, especially buffets. When people cough on food in a buffet. Like, you are disgusting. You should go to jail. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button in the face and make sure you turn on notifications. Click click and subscribe. Join the Wolf Pack. I love you guys so much. Thanks for watching. Bye guys.",
    "start_time": 0.08,
    "end_time": 613.839
}