{
    "video_id": "6a60mDYPtz4",
    "channel_url": "@sssniperwolf",
    "transcript": "What would you do if you were adopted into an evil family who instead of gave you a nice little bedroom kept you locked up in the attic? That's what today's Darm Man episode is about. An evil stepmom who keeps her kid in the attic. Ma'am, that's literally illegal. Grab a drinky drink and let's watch. Let me out of here, please. This is what you get for not listening. >> Come on. Don't do this to me. Good behavior is the key to my heart. [Music] I don't know why I was expecting like a seven-year-old. She's like a teenager and she's still going to get locked in an attic. You're probably strong enough to bust down the door. What do you think happened? Sweet rock and Robin. >> Oh, this is awkward. [Music] She's clearly been taken hostage. Is she just going to run away? >> Oh, just kidding. What do you want? We're in the middle of dinner. >> Sorry. I'm just checking in to make sure that everything's okay. >> It was until our meal was interrupted. >> I'm sorry. It's just I saw a girl in the window and it looked like she needed help. >> Oh, that's just my kooky daughter. She's always clowning around trying to get her eyes out of people. Don't worry, I'll have a word with her. Oh, but uh >> bro, I would literally call the cops immediately. I mean, it could be worse. At least the attic has a window and no rats. >> Why are they taking pictures of her? >> You stay away from that window or I'll board it up. You hear me? >> Oh, at least she has a little bed. And the photo of her and her real parents right here. Ready? One, two, three. >> All right. I promise you'll print that out for him. >> I promise. I know you're old school. And you can frame them next to your CD collection. >> Jeez. All right. This is going to be the most incredible year ever. Not just because of the new house or the new family, but my baby girl is turning 18. >> She's 18. Yeah, I was gonna say she does not look like a kid. >> Can't wait. I love you. >> I love you. >> Don't you ever think about pulling a stunt like that again. Nobody believed you the last time you called for help, and nobody believed you today. I saw to that. >> I'm sure you did. Don't you get smart with me, young lady, or you'll be out on the street. Just be thankful for a roof over your head. Now get up and do the boys laundry. I want them looking their best for school. She literally adopted them to be her live-in maid. Like, oh, we don't have an extra bedroom. You can just sit in the attic. I mean, from what I've seen thus far, the attic does not seem that bad. This was nicer than my childhood bedroom. I'm not going to lie. >> I had to wash them twice. I mean, you have a huge window. >> Ew. Oh, they just dumped their dirty laundry all over her bed. Bro, that would make me crash out. >> Do I have Cindy Clark? >> Oh, wait. Wait a second. Oh, that is a crazy coincidence. Like, oh, I'm your teacher. Weren't you the kid in the window? I hate giving you bad news, Julian. especially when you were nice enough to invite me along. But you're spending money at a rate your finances can't handle. Your account is draining fast. And between all the mortgage payments on that huge house, gifts for the twins, lavish parties, and all these spa treatments. You're welcome. And don't tell me I don't have enough money. My dearly departed ex-husband amassed a fortune. That's true, but not all of it belongs to you. >> There's Cindy's trust. As you know, most of the money was put into the trust account for Cindy once she turns 18. >> No, I didn't know. >> So, the child that's in the attic is going to get all the money. Okay, this is so type B. Like, I cannot imagine spending all your money. Some people just do not have a savings. Oh, I got my paycheck. I'm just going to spend all of it. That makes me so anxious. You got to save your money. The only way to gain access to the account is if Cindy signs over the funds once she's 18. >> Oh, is that all? >> Oh, don't worry. I'll just forge her signature. She doesn't even have to know that she has money coming. Cindy, may I have a word with you? You know, I saw you in the window yesterday and you looked really distressed. Your mother said that you were just joking, but was that true? Yeah, it was just a joke. I was playing around. Why are you lying? >> Cindy, is there anything you want to share with me? You don't have to worry. This is a safe space. >> Yeah, actually, my evil stepmom locks me in the attic and makes me do everyone's laundry. >> Actually, what happened was I saw a mouse in the attic and I freaked out. My mom was probably embarrassed that we have mice in the attic and I guess I am, too. I'm sorry I didn't tell you the truth. >> Oh, she's a good liar. Okay. Well, just remember I'm here if you ever want to talk about anything. Rodents or anything else. >> No way. The teacher actually believed that. >> Come on, keep up. We've got snacks waiting for us at home. >> Yeah, like five kinds of cool ranch. >> Oh, yeah. >> It's my stepmom triplets. >> She's like their personal servant, bro. Who is this person? >> She's not even discreet about it. We see you. I see you. >> Yo, cringe cadet. What are you doing? Worst valet service ever. I mean, seriously, what are you doing? Got to be something in here. Thank you, honey. Oh, so she didn't adopt her. She's the stepmom of the girl's dad who just passed away. Okay, I'm putting two and two together. It makes sense now. >> This should tide me over until I get my hands on that trust. And you can trust that I'll be fully funded. >> I mean, yeah, it's in the title, evil stepmom. >> Speak of the devil. >> How are my boys doing today? >> Hungry? Yeah. What he said? Come on. >> Wait, are they supposed to be twins? They look nothing alike. Why you keep calling them twins? Unless you mean by like twin like hey twin. >> Cindy >> what the children are saying. >> Just who I wanted to see. I've been thinking a lot about you lately. >> You've been thinking about me. >> Of course. You're a senior this year and college is right around the corner. >> Oh, I see. You want to get rid of me. >> I want to pay your tuition. Say what now? >> Look, Cindy, I know how good of a student you are, and your dad told me all about your career ambitions. So, I want to reward that hard work by covering the cost of your degree. >> No, all you got to do is sign. >> You don't need to say anything. >> You just need to sign this document. Just some boring paperwork my financial advisor gave me. When you're 18, it allows me to fund your tuition and your housing costs through the family trust. Just a bunch of legal mumbo jumbo. >> Yeah, just it's a bunch of stuff like don't read it though. There's nothing to see here. See you. >> Why don't you trust me? You know, you try to do something nice, something from the heart, and this is the thanks I get. >> No, no, no, no. I didn't mean to offend you. I just wanted to see the Never mind. It's okay. I'm sorry. >> That's my college girl. >> You'll just need to sign it on your birthday in a few days. It'll be my present to you. Who signs something without reading it and it's only two pages? Like, at least skip through it. Hm. This evil monster who's been tormenting me. She treats me like a servant and keeps me in the attic. Oh, yeah. Also, don't read it. Just sign it. I'm totally going to trust this person. She's so trustworthy. Never sign anything without reading it. >> I know, Dad. There's so many choices. Oh, look. It's your old law school. Maybe now I'll be able to >> follow in my footsteps. Honey, I'd be honored. >> No, I'd be honored to be a lawyer like you and stand up for people who need help. Well, it can be a very noble profession for a very noble person. [Music] >> I'm so proud of you, honey. >> Her dad's literally a lawyer. Lawyers teach you to never sign anything without reading it. There's no way she's that stupid. >> Sorry, honey. You've got nothing left on your lunch card. >> But my stepmom was supposed to put money on it. >> I don't know what to tell you. There's no such thing as a >> a free lunch. Sure there is. Put it on my tab. >> You don't have to do that. >> I want to. Plus, you look like you could use a good meal. Also, I'm concerned about you. Are you sure there's nothing going on at home? Home? That's what we're going to make here. And a new life. >> Come on, let's check out your bedroom. I bet they're in Wyoming and they just got a new house in Wyoming because his shirt says Wyoming. >> What do you think? >> Oh my gosh. >> Context clues. >> Dad, I don't know what to say. >> Just say you'll try your best to make it your home. >> Wow. We just moved into a house and my room is already furnished with all my things in it. Woo. >> And to give our new family a chance. I understand you're going through a lot since your father's death, but that's no reason to make up false accusations about your stepmother. >> It's all right. We can't blame Cindy for this. If anyone should take the blame, it's me. Your father had some big shoes to fill, and I'm just trying my best to be there for you as a mother. That's great. And don't beat yourself up. Children at this age are prone to lashing out in situations like this. >> Her mom bigger than the flowers in the Michael's floral department. >> I'm telling the truth, >> Cindy. Your mind is clouded with grief. You really should try some self-awareness. Try putting yourself in other people's perspective. Can you try that for us, Cindy? >> Yeah. Uh, your dad just died. Have you tried putting yourself in other people's shoes? Like maybe you should try that even though your dad just died. Bro, what? Who trained this therapist? >> Are you okay? >> Yeah, I'm good. Uh, thank you so much for lunch. Really? It's so nice of you, but I got to go. Next. [Music] >> The lunch lady like, I'm just trying to do my job. >> Here. >> Go on. Fill them up. And uh, we want Gatorade. Can I? >> Yeah. and snacks. >> Let's actually realize that we got to recharge for practice. >> It's basic science. >> Hey yo, boys, we back. Hit me. >> Hey, you're that creep from the street. Get away from me. >> Just listen. Not until we talk, Sydney. >> How do you know my name? Who are you? >> I'll explain everything. Just take this. >> He's your biggest fan. >> I mean it. >> That's why he's taking pictures of her, right? >> Practice isn't over yet. Where are the boys? >> On the court. Well, make yourself useful. Get them some Gatorade or some snacks, >> bro. >> We need to talk. This is serious. That's a creative way to get your crush's number. Like, call me. This is serious. >> Hi. Sorry to bother. I was wondering if you could help me pull a student's file. Her name is Cindy Clark. >> What do you need Cindy's file for? Oh. Um, she asked me for a college recommendation and so I wanted to make sure that she was a good student before I give her my seal of approval. >> Oh, makes sense. >> Thank you. >> What is that teacher asking about Cindy? I don't know, but we better tell mom. >> Yeah, and she won't be mad at us for getting in trouble today. Score. Uh-oh. A report was filed alleging abusive behavior by the student stepmother. Yep, there it is. That's all I needed to see. >> You were speaking up, but nobody listened. >> Ooh, that's why she's not telling anybody. She's like, \"Nobody's going to believe me if I say anything.\" So, she lied about it. Man, that sucks. If something horrible is happening to you, you have to tell somebody. You have to tell an adult. You can't just be like, \"Oh, nobody's going to believe me.\" Because somebody will believe you and they'll actually do something about it. Oh, >> there's my soon to be college freshman. Are you looking at schools? >> Uh, yeah. Sure was. >> Good, because your birthday's in a few days, and I'm excited for you to sign the paperwork. >> Me, too. Um, but don't you think I should look over it first? I mean, my dad always said to read stuff over carefully. >> Yeah, >> you never know what could be in the fine print. >> Cindy, what are you implying? That I would deceive you? >> Oh, brother, this guy stinks. What do you mean my abusive stepmom would try to scam me out of my dad's money? No, I would never do that. That's actually where she draws the line. At this point, you would think something is suspicious. I mean, there could be a mistake somewhere. >> The only mistake was making you this offer in the first place. If you're going to be this ungrateful, >> I'm sorry. I'm not being ungrateful. >> Too late. The deal is off. >> No. No. Please. I'll do anything >> except for read. >> All you need to do is sign. >> Okay. Okay. I'll sign whatever you need me to sign >> without reading it. Tonight's Tonight, boys. At the stroke of midnight, I'll get Cindy to sign the document. And once she does, our nightmare will be over. >> Wait, what about that teacher checking out Cindy's files? >> What teacher? >> Dude, you didn't tell her. >> I thought you did. >> Now we're going to be in even more trouble than before. >> Dude, shut up, man. >> Enough. >> Now, if there's a teacher snooping around at school, that changes things. We're only 16 hours away. We can't risk Cindy leaving the house. >> So, lock her in the attic. >> Hey, I'm locked in. >> That's right, honey. You're staying home today. >> But I've got school >> and I've got big plans for your birthday. But I can't let you see or it'll spoil the surprise. >> Come on, let me out. I'll keep my eyes closed. >> You're not 18 yet, my dear. You still need to do what you're told. That's crazy, bro. I'm going to lock you in your room so you can't go to school and you can't snitch. By the way, I'm taking your phone, too. Like, does she not have a phone? >> Okay, I think that's everyone. >> Uh-oh. Wait, except the student I'm investigating. >> Has anyone seen her? >> How was everything at school? >> Fine. >> And what about Cindy's teacher? >> She was just teaching. Yeah, we didn't see anything strange. >> Okay, good. Just a few more hours to go. >> Yeah, let's go. Let's go. >> There he is again. >> Have you seen Cindy? >> Who are you? What do you want? >> I know. Have you seen Cindy? Have you seen her? >> No, she didn't come to class. >> What is this about? >> Why is he freaking out? Look, >> we can't talk here. Just meet me at the late night diner. 11:00, okay? I'll explain everything. >> The late night diner at 11:00 p.m. That's my bedtime. She's a teacher. She got to be at 5:00 in the morning. What do you mean meet me at 11:00 p.m.? Random stranger. >> This will do the trick. >> What is that? Her favorite skinare served up in here all day. We were trying to get your birthday surprise ready. >> Where is it? Well, it's not your birthday yet, silly, but it will be soon. That's why we're staying up till midnight. >> Can't we do this tomorrow? I'm tired. >> I make coffee for everyone here. Come on. It's pumpkin spice. Your favorite. How'd you know? I'm your mother, aren't I? I'm supposed to know these things. There's no way a lawyer's daughter is going to be this dumb. >> Hey, thank you for meeting me here. >> Of course. So, what do you know about Cindy? >> Nothing good, I could tell you that. 5 years ago, Cydney's stepmom, Julianne, met my father. I never liked Julianne, but she got her closet to my dad and they got married quickly. A few months later, dad got really sick, >> which was strange because he always took such good care of himself. He died not long after that. >> She's the rich old man killer. >> Me and Julianne tricked me into signing away my inheritance. Then she just disappeared. >> Thinking back, I remembered how every morning served my dad coffee. >> He never liked it. He said it tasted funny. But she insisted every morning. >> Yeah, I put my Teimu skin serum in it. That'll do the trick. Slowly, anything from teeu you put in your mouth and swallow. You might be un alive in a few months. >> Sorry, this is >> You think your father was poisoned? >> She literally poisoned. >> No, he was. >> But the police, they didn't believe me. And she's going to do it again. >> Don't ask me how I got that. Sydney's father's medical file. >> Yeah. The same symptoms as my mom. And now, just like me, Julianne's going to steal Sydney's inheritance at her 18th birthday. >> Her 18th birthday. >> That's tomorrow. >> That's tomorrow. That's That's in 20 minutes. We have to get to Cindy before it's too late. >> Let's go. Cindy, how do you like your coffee? >> I feel funny. >> See, boys, she's under my spell. And soon we'll have her inheritance. >> That pumpkin spice latte was so good, it's got me feeling silly, >> dude. Mom, she can hear you. >> It doesn't matter. I slipped her something new. She's completely susceptible to suggestion. >> Mom, you just dropped something. raise your hand. >> Oh yeah, man. That's so cool. My mom's a criminal. So cool. >> Just a few more minutes and then it's happy birthday to us. >> Hello. Yes. Can you please send officers to 172 Arbor Lane? Of course, it's urgent. There's no time to waste. Okay, Cindy, the time has come. Just sign the dotted line. What are you waiting for? Just sign it, [Music] bro. Which dotted line? There's so many lines on this paper. >> Hold it right there. You're under arrest. >> Oh, man. No questions asked. They literally busted the door down. No, I think this idiot left it unlocked and they just walked right in. >> What are you doing here? >> Hey, hold on. >> Stopping you from hurting anyone else. Okay, this girl has been drugged. >> You repugnant child. I'll get you for this. If it's the last thing I do, then what is >> you already got him for this? >> Everything's going to be all right, Sydney. Okay, you're safe now. And so is your fortune. >> Fortune? What fortune? >> Oh, what do you mean? Your dad's a lawyer. He floated. >> Yeah, your dad left you everything. >> But who are you? How do you not know if your parents are rich? [Music] >> Evil stepmom goes to the slammer. Another banger. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button and the face and make sure you turn on notifications. Click click and subscribe to the Wolf Pack. I love you guys so much. Thanks for watching. Biggest.",
    "start_time": 0.08,
    "end_time": 1329.9189999999999
}