{
    "video_id": "G2vk7wtW-cs",
    "channel_url": "@sssniperwolf",
    "transcript": "Today we are watching some of the creepiest Tik Toks I could find on the internet. When you go into your house, you have to immediately lock your door. Why? Cuz you never know what might be following you. Like this family just got home, gone to their door, broke. Close the door. Why is it taking so long? Hurry up. Like this guy was following them home and then just made it to their house and tried to break in. Good thing they locked it. Bro, step back. Step away from the camera. >> Who is that? Get out of here. >> What does he want? >> Get out of here, >> bro. Looking for some snacks. Like, this is so creepy. And this guy is the reason you should always lock your door. You never know if somebody's following you. And if they didn't lock their door, who knows what would have happened to them. Personally, I am so paranoid about people following me. So, like, as soon as I get in my car, lock the doors. As soon as I pull up to my house, close the garage, lock the door. This girl posted a Tik Tok terrified inside her own home and that it's time to move out. Why? What's over there? Flip the camera. Let me see. Bro, that's literally a face. Did you see that from like far away? I was like, \"Wait a second. Is that somebody there?\" And then she zoomed in. >> Not today, Satan. >> Bro, that's definitely a face. Our grandma wanted to show you her new makeup tutorial. Grandma's been dead for 7 years, by the way. >> There was another one caught on camera. There's definitely somebody up there. There's something. I don't know. It's in the shower. Bro, I would have freaked out, but there's nothing there. What do you mean there's nothing there? We saw it on camera. Those are some hands. Those are some fingers. You're telling me that thing disappeared, >> bro? Yeah. It's time to get out of this house. No, I'd rather sleep outside than be in the same building as whatever this thing is. It's literally telling me to come closer. Yeah, I would be crying and hiding too cuz girl, what is that? That's somebody's shadow. That's a shadow. Wait, I thought it was a shadow at first, but no. No, it moved. Uh-uh. No way. Nobody's safe in their own house. There are some crazy things that get caught on camera. Like, I don't know if it's real. Like, I can't even tell if it's real or not. Smash like if you think it's real. Some of these look really real. This next video is from footage found on a playground in Michigan on May 7th, 2007. So, it's pretty old, maybe older than some of you guys, and it is very disturbing. So, it looks like there's like a a filter going on. And then, whoa, what was that? What did he just do? What just happened? He like scared her. I don't know if he like transformed into something. Showed his true self, but basically it scared her so bad that she started running away immediately. [Music] And then, wait a second. Are those more kids at the playground? Why are they at the playground at night? Okay, she went in the slide. The other kids ran away and he's like chasing them. Okay. Well, he showed his hand. Maybe he's in human form, but we still haven't seen his face. They were never able to find this cameraman. But this weirdo is hiding in the slime. [Music] [Music] What the heck is that, >> bro? That is definitely a demon straight out of jiu-jitsu kaizen. >> Hey, man. Over here. >> This has got to be one of the scariest videos I've seen on the internet. He looks old, but he's dressed like a baby. And he's covered in stuffed animals. You know, it could just be a costume. Bro, looks so creepy. This whatever creature this is is definitely going to give me nightmares. You know, whatever that is, the demon slayer's got to slay it. Hey, when the tall people become creepy, you bros just casually 12t tall. He's height mogging you. Step away. Don't worry. I don't think he can fit through the door frame. You have nothing to worry about. Oh, there's another one. Oh, this one knows who how to bend over when she says she likes tall and skinny guys. Then this thing spawns in your living room. And then this isn't even the same guy. You know, they're just hype moggers. You know, I have a feeling if you close your door, they wouldn't be able to get in. POV running to your room at night and you look back. >> What is that? >> What is that? >> Uhhuh. Uh uh. This is why we close our door. Close it. Lock it. Slam it into space. You know when you're asleep at night and it gets a little too warm, so you kick the covers off your feet? This is the guy who's going to wait for you to slide your feet slightly off the bed so you can yank them. Yeah. New fear unlocked. Throw back to when I was recording my neighborhood cat and saw this. What did you see? Who's there? Oh, is there a person standing there? It looks like a shadow. Oh, they're running. Maybe they were just as scared to see you as you were to see them. Oh, maybe bro was going for a nighttime stroll. I was like, \"Oh, no. The Tik Tockers, they out here recording me once again. Let me go hide behind this tree.\" You know, not every scary Tik Tok has a scary story behind it. And I don't think this one was. I think this dude was just running away from the camera flash in the distance. Oh, my back, bro. Oh, how are they so bendy? Okay, at this point I'm I'm lowkey more impressed than I am scared. I think this is like a contortionist. They're basically an acrobat with extreme flexibility and basically move themselves in ways that seem impossible. Like, bro, when they pulled that back crack, they folded in half. Oh man, I can't imagine being able to touch your to your head without breaking your back. Oh, goodness gracious, bro. when they hit the Oh, I need to crack my back. Oh, did you hear that? That was a good crack. Like head to the back of the knees. Bro, if I saw this at the end of a hallway, I'm I'm laying down. I'm giving up. You know, realistically, I don't think they would do any damage. You know, it's harmless. It doesn't attack. It just makes Tik Tok videos. It cannot hurt you. Ma'am, what was that behind you? Oh. Oh, there it is. There's the face. Don't worry, it's just the neighbors. [Music] I'm never cleaning my windows again. Yo, where is he? Where did he go? Oh, there he is. Yeah, judging by the fingers, it's it's definitely human. [Music] Where did he go? He has to be in here. The window's open. [Music] I don't know why that scared me so bad. I wasn't expecting him to be there. Like, as soon as you turn the corner, there he is. Dorito chip head waiting for you. Dang, he got some long arms, bro. He got arms down to his feet. >> The woman was too stunned to speak. >> You know, in the beginning, maybe he was just wondering how you wash the windows. Like, bro, teach me. I want to know how to clean the windows, too. And at the end, he's still wondering what solution mixture you use to clean the windows. I don't think he's a bad Dorito chip. I think he's he's just curious. Bro, what is that? Ew. What is that? E. Me checking into the cheapest Airbnb I could find. Like, they got roaches. No, it's not. It's not a roach. That's our pet lizard, Danny. He lives there. That's his bed. Now, find another bed. That thing is so creepy. I do not like it. Do not claim this negative energy. I would hate to see Danny out of Airbnb. This guy had a haunted doll in his closet. Is she going to move? Oh, wait, wait, wait, wait. Why is the shadow behind her moving? [Music] Please don't tell me she's going to start running. Wait a second. No, it's not even the doll itself. Did you see that? Zoom in. There was somebody behind her. There is something behind the doll. Also, come on. 2 seconds to look at this doll right here. Why? Why do you own one of these? If you have this in your house, you are asking for creepy paranormal things to happen. Like, oh yes, a lovely haunted doll from the 1920s at a vintage shop. I'm going to bring her home with me. Yeah, and whatever 1920s demon that owned her is also coming into your home. Yep. It's a two for one. Like, I refuse to believe that these things don't have like haunted spirits living inside them or that are attached to the dolls. Like, bro, close that door. Lock that door. Lock that thing in there. This is so creepy. Not only is it creepy, is it unacceptable. Like, that thing got to go. I would never buy a haunted doll. Now, I know some people collect them, but when you start hearing crazy things at night, pots being thrown around, somebody breathing on your toes while you're asleep. Oh, yeah. That cute little doll you have in the closet, that might be the reason why. Oh, look at this snowman. It has teeth. You can't mess around with Frosty like that. Like, what were you doing? Give him a little belly rub. Oh. Whoa. He made the human. Now, what kind of alternate universe is this? The humans are supposed to make the snowmen, but this snowman makes the humans and then flings them into the abyss. You know, good thing he's AI generated and he can't really hurt you. They found a crack in their wall and then stuck a flashlight to it. That is definitely an eyeball. Did you see it move? Y smash that like button if you saw it move. Like that kind of looks like a cat. Like is there a cat stuck in the wall or is there a werewolf living in there? It's just so creepy. Like bro, what do you do in this situation? There is clearly something alive and hiding behind that wall. How do you get it out? Do you even want to get it out? If it's a cat, yes. If it's a werewolf or something. No. You know what? I'm I'm I'mma patch it up and give you the good old landlord special. Now close up that hole. Never want to see you again. This other person found a tiny hole inside their wall and they're like, \"Oo, I wonder what's in it.\" You can't really stick your eyeball in there. So, they stuck their phone camera inside the tiny little hole. No way. There's an eyeball in there. There is somebody looking back at you. Did you see that? That's definitely an eyeball. Who's on the other side of this wall? Okay, let's take a deep breath. Calm down. Think of a logical explanation. It could be your nosy nextdoor neighbor. Especially if you share a wall with your neighbor. They could have just made that tiny hole to spy on you. Like patch that thing up. Man, you decided to look through this hole at the wrong time because that's when he was doing his peeping. Bro got caught. Call the cops on this guy. Call the cops on this eye that belongs to this guy. Bro, again with the tall people. Yo, just because you're tall doesn't mean you're creepy. Maybe mother is just making dinner in the kitchen, man. Why do you hide it from her? Unless that is in fact not your mother and a giant lady is making a sandwich in your kitchen, you know, then you can be afraid. Wait, let's get a better look. Come on. I want to see. What is she doing? Wait, she's gone. You know, I will say the tallest and the biggest people have the quietest footsteps, and I can't explain it. It's like an elephant. You know how large an elephant is, but their footsteps are so gentle and quiet. It's like they're not even there. Me, I'm a little guy, but I got the loudest footsteps in the room. Okay, where did she go? Let's go see what she made. Did she make dinner? What's in the pot? Don't be her face. Don't feed her face. Oh yeah, I'm not going to eat any of those cockroaches. Bro, put the lid back on before her dinner gets cold. Oh. Oh. Oh, Grandma, what you going to do with that carrot? Don't worry. I didn't touch your cockroach pot. Like, girl, that's all you. No, let her have it. Yeah, I'm very afraid to see what she does with that giant carrot. Okay. Is there something in the cabinet? Something weird going on? Oh no. I hate a jump scare, bro. That one got me. Hold on. Did you see that? There was nothing in there. There was nothing in the cabinet. Look, he opened it up. He literally opened it up. And then, bro, what was that? Like, where did that come from? That was somebody's head. A whole head pee out. Uh-uh. Absolutely not. How does the mirror know what's behind it? So, she held up a towel so that she is completely covered and cannot see her reflection at all and then put a lemon in front of the towel. And then when you turn the camera, how does it know? How does it know that there is a lemon behind the towel? How does the mirror know what's behind it when it doesn't even see it? So, this is called the angle of incidence. This is an angle that you learn about in physics. So, this Tik Tok explains it very well. Light will reflect off an object and into the mirror and you'll be able to see it. As long as your viewing position >> and they use a laser pointer to reflect the rays of light off of a mirror. So if there's something behind >> themselves, they are wondering how the mirror >> you'll be able to see it. >> This is due to the angle of incidence. So in the simplest way possible, light will reflect off an object and into the mirror and you'll be able to see it. >> Well, you'll learn something new every day. But anyways, that's all for today. I hope you guys enjoyed this video. Comment below which one was the creepiest one. And if you guys enjoyed, make sure to hit that like button in the face and subscribe to the wolf pack. I love you guys so much. Thanks for watching. Hi guys.",
    "start_time": 0.32,
    "end_time": 878.1600000000001
}