{
    "video_id": "5K97S6kYlJU",
    "channel_url": "@sssniperwolf",
    "transcript": "Today we are checking out some people who got very lucky. This guy is just very lucky to be alive. There was a floaty on an infinity pool. He just jumped on it and it started slipping away and then got up at the perfect moment when he realized that the floaty is going to fly over the edge. You see that moment when he realized like, hey, maybe I should get off because this might float over the edge. You know that infinity pool seems very high up. Our infinity pools safe. Yeah, maybe not for the floaty. they can just roll off the side. But for some infinity pools, it looks like it goes straight down. But there's actually a safety edge, which is called a catch basin, where the water dumps into. So if you accidentally fall off an infinity pool edge, you go into the little catch basin. So no, you won't fall off the edge. You will enter the mini infinity pool. This guy was on a cliff and it just like broke off into pieces. Oh my goodness. He picked the perfect time to just like roll over. One sec, I'm getting comfy on this edge that is about to break off of the earth. And then literally 1 second later, holding over the edge like bro just barely made it. Yeah, you got to be more careful. Bro, this whale picked up an iPhone from the bottom of the ocean and then brought it to this boat. Like, bro, get your electronics out of our ocean. Here, take it. Like, you dropped something. I know it belongs to you humans. Like, how is it so smart that it found an iPhone and then brought it to the humans? Like, stupid idiots here. I don't even have a lightning charger. I use USBC. I don't need this garbage. Take it back, man. Imagine being that person. Like, oops, I dropped my iPhone in the ocean. Like, there's no way you'll ever get it back. And then a freaking whale comes like, I brought you this. Like, what are the chances, bro? We don't deserve animals like this. You know those arcade games with all of the coins and then you put in another coin and then it like pushes the other coins if you get lucky. Well, this video is literally my childhood dream. You see this fat stack of coins. That is literal thousands of coins stacked up in this arcade game and they knocked them over. How many tickets is that going to make? A whole lot of tickets, bro. After a win this big, you got to retire. No more arcades. This is like winning the jackpot at a casino, but like you win the jackpot at the arcade. you can get any of the prizes. All the tickets in this machine are now yours. You know, the last time I went to an arcade, they didn't have physical tickets anymore. They give you a receipt that says the number of tickets that you have. Instead of spitting out thousands of tickets like this, it gives you a piece of paper that says like 725 tickets. What? That's so lame. How will anybody know I got the jackpot on my way to the prize counter? There's no glory in that. This truck was carrying some boxes, but the back was open. But wait, it dropped the box and then it bounced and went back into the car. How is that even possible? But wait a second. You thought that was lucky? It did it again, though. It literally dropped out of the box and went in again. It's playing a game at this point. But wait a second. What if I just again? Nah. I I like it in here. I like this truck. I'm going to go home with them. This waiter drops a $5,000 wedding cake in front of the couple who's about to get married. like, \"Oh, I'm about to bring the cake.\" But wait a second. It drops perfectly onto the plate on the floor. Bro almost had a heart attack. Like, no, no, no, no, no. He was fighting for his life, trying to save that cake, and then he got so lucky that it just landed perfectly in the plate. Well, I guess we're eating off the floor. The couple unbothered. They don't even care. That was a crazy save. Also, how does that boring sheet cake cost $5,000? That doesn't make any sense. This is probably like one of the most extravagant cakes ever made for a wedding that cost thousands of dollars. But like, how do you even eat that? The answer is you don't. It's just for display. Like, oh, we paid all this money for this cake that's barely even edible. It's just for display. But here, enjoy a slice of this almost fallen on the ground vanilla cake. Like, this is what the guests are actually eating because at the end of the night, you don't even care. You're just like, cake is cake. It all looks the same when it's being digested in your stomach. I love claw machine videos. But wait, this is one of them like huge claw machine games. And she got a hold of Scooby-Doo's Pale, right? Oh, and then picked up two of them. Not just one, two. Is it going to make it down the hole? Man, I've seen some crazy things happen up until this moment. And it made it down the hole. Okay, she actually got two for the price of one. Wow, this is like insanely lucky. It is so insanely hard to win these like huge plush toys in the claw machines. I feel like it never grabs them up. I feel the smaller ones are easier to pick up. It's crazy. She wasn't even expecting to get one of them, but like accidentally got two. It's crazy how they were just like stuck together. Wow. Insanely lucky. Wait, maybe I'm wrong. Maybe the bigger plushies are easier to get. She got this giant Stitch plushy. Oh, it got a little stuck. Is it going to make it? Oh, it made it through the hole. Wow, bro. That thing is massive. Look at that thing. What are you going to do with all that stitch, man? The real life stitch ain't even that big. Man, they almost had me there when they put his head through. Like, it wasn't going through. I would have shoved my entire arm in. I pulled him out if need be. Wow. I love watching claw machine wins. You know, you would think I would learn a thing or two, but I feel like every claw is different. And most of them, it's like grasping stuff like gets your hopes up and then it doesn't even try to pick up. So, she got locked outside of her apartment. and how she got back in is kind of crazy. >> I got locked on my roof and nobody's available to come help me out. So, I ordered Uber Eats. Um, I put in the instructions that you have to just buzz every apartment until someone lets you in and then come up to the roof and let me out. >> Okay, that's a lot of instructions that I feel like a lot of people wouldn't follow. So, he has to somehow get into the building and then go all the way up to the roof and then unlock the door. >> Thank you. >> He actually made it up. Safe in my apartment. Plus, I have a burrito now. I call that a win. Bro, that is so lucky. I would have caused such a ruckus. This was so smart. Like, oh yeah, I can order food and the person who brings me my food can also unlock me from this rooftop dungeon. Bro, I would have caused such a ruckus. Like, there's some windows right behind her on the roof. Like, bro, please help. I'm stranded up on this roof. And then I would look down and see like if I could survive the fall. Probably not. And then try to kick down the door. Oh, wait. That door doesn't even have a handle. So, you have to have somebody from the inside come let you in. That's honestly such a design fail for that building. Please enjoy the roof, but if you come on the roof, you might be stuck up on the roof forever until somebody shows you a kindness to let you down. I think I just experienced a glitch in the matrix. I don't own two pairs of headphones. There's another one right there. There's no way. Now, I guess you own two pairs of headphones to alternate you who left her headphones there and dipped into another universe. Is that how it works? I don't know. But this has happened to me before with a scrunchie. I'm like, I only have this one scrunchie. And then another one spawned in my room. I was like, I definitely don't have two of these, but now I do. I don't know. Sometimes things just like multiply. Or did you really buy two and then forget about it? H I dropped my iPhone. Bro, did you at least catch it? You know, you got to be careful on these grates. And this guy did the exact opposite. Like, oh my goodness. Well, his iPhone is down there now. And it looks like a bunch of other iPhones are down there, too. You not the first guy who lost his phone to one of these drains, but he might be one of the first to get it back. He got string and a very strong magnet and spent his entire day trying to reel it back in like it is a fish. Oh my goodness. He actually got it back. He actually fished it back out of the drain. I didn't think this was possible, but like all you need is some string and a really strong magnet and apparently you could drop it on your phone and then pull it back up. Reel it in. Catch of the day. iPhone 16 Pro Max. Wow. Wonderful. Has PS5 survived a house fire? Nah, that thing is literally toast. It looks like it's been through an explosion. And you had the nerve to run Minecraft on this thing. And it works perfectly fine. Bro, that is crazy. I didn't know PS5s were built like that. Built to survive an apocalypse. You know, get out of an explosion just to play Minecraft. Meanwhile, my iPhone can barely survive a 5-ft drop onto some tile floors without breaking the screen. You got so lucky. You know, we lost it all when our house burnt down, except the PS5. The PS5 made it. This arcade was having a going out of business sale in Japan. Each play was 69. But wait a second. The employees were giving us a bunch of plushies. So, if you won, if you lose, it didn't matter. They're going out of business. So, they just literally gave you a ton of plushies that were left over in the machines. I remember this arcade. This arcade was so amazing the first time I went to Japan and then the second time I went, it closed down. But I wasn't here for this going out of business sale. You know how much money I wasted trying to get that Netzuko plushy at the bottom over there? And you telling me they gave this person literally bagfuls of plushies? Like here, take it. Just take everything. We're going out of business. We have 1 hour left to empty this entire place. They got all of those plushies for only 69. Okay, that is insane. Okay, this must be one of the luckiest ones besides getting away with your life. You know, the next mess thing might be the bag fulls of Demon Slayer plushies that you that those people got for free. This is what nightmares are made of because my friend is like deathly afraid of whales. This is actually her biggest fear is getting swallowed by a whale. Like they were on a boat. They got swallowed by a whale but jumped out just before it swallowed their boat. Like how do you explain surviving this? like they were on their boat and then the whale just comes up like, \"Ooh, lunch. I didn't know they like ate plastic boats like that. Sorry, Mr. Whale. I was not familiar with your game.\" Like, look at those people. You think in that second they realized that they were about to get ate up by Mr. Whale over here? They jumped off of the edge the perfect time, bro. There's a whale hiding over here and bro is like casually on a What? What is that? What is that? Like a swimming board. I forget what it's called. A surfboard. Yeah. just casually watching the people next to me get eaten by a whale when he's paddling his surfboard. This guy was sledding down this mountain and then these two cars crossed by, but he made it out at the perfect time. He was so lucky he didn't get hit by those cars. When the streets are snowy like that, there's not much you could do to stop. You can't just stop break. Like those cars are going to go. He was literally like 2 seconds away from getting run over. Yeah, what a beautiful hill to sled down the next second. Yeah, what a beautiful day to be alive. That is actually insane. This would be my last day sledding ever. Like, you're not supposed to sled or ski onto streets like this. And if you do, you need to like make sure there's no cars coming or going. You know, his car jack was lifting up his truck so he can work on it. And then just like moved out of the way. Bro is so lucky that the entire truck didn't just like slam on him. This is crazy to watch. Like it just slipped out of the way like, \"Nope, I'm not going to hold up your car anymore.\" car and somehow it stayed. So, it's like when you're working on your car, you use a car jack to like raise it up so you can work on the bottom of it, but like how does it just slip out of the way? So, if the car jack is on a sloped surface, it can just slip out of the way. So, to prevent this from happening to you, you got to make sure the carjack is set up on a flat surface. These people got so insanely lucky to get out of this alive. They're on a boat and they're trying to get away from a volcano that is actively erupting right in front of them. Wait till you see the smoke, the explosion. Oh my goodness. Like, can you even outrun that? So, like playing the floor is lava except it's literally lava. It doesn't matter if you're in the ocean, it can still get you. Like, imagine being out in the ocean like, \"Oh, what a beautiful day to set sail.\" Yeah, the volcano agrees. What a beautiful day to erupt. I never want to be near an erupting volcano. One of my many fears. The time I nearly died. Bro walked into this house and then wait a second. There's a ledge over there. Oh my goodness. Why would you step over there? Like you could clearly see that it's dark. Well, I guess that's the end of the hallway there. It just drops down who knows how far. It's like an endless pit. Bro, why would you even mess around like that? Why would you even put your foot down that? Okay. Something similar happened in Europe. Me and my sister went to France. We were in this convenience store and they basically had a big hole in the ground that led to the basement, but the stairs were on this side and then this side had no stairs. And they had it open, which they weren't supposed to do because there was customers in the store. And my sister literally almost walked into it. Like from the top it just looks like a hole in the ground. There's no like latch that opens up. And she almost walked into it and then I heard the woman in the back like scream like no like at the top of her lungs. Like I'll never forget that scream. They were literally terrified that she almost dropped down there. When we went to go check out, they were just like, \"Just take it. Just take it. Take it for free.\" And then they closed their little trap door. I hope nobody has ever fallen down that. I don't even want to think about it. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button in the face and subscribe to the little fack. I love you guys so much. Thanks for watching. Bye guys.",
    "start_time": 0.24,
    "end_time": 805.36
}