{
    "video_id": "iXuJokXZmfM",
    "channel_url": "@sssniperwolf",
    "transcript": "Y'all remember this girl from Darmian who was allergic to everything? Well, she is back, but this time she's getting bullied for bringing a laboo to school. I told you no one is safe in the Darmian man universe. You got bullied for existing and now you get bullied for a laboo. Okay, grab a drinky drink and let's see what we're getting ourselves into today. >> What's the matter, freak? Don't you like donuts? How about a crunchy granola? >> Look at her tasting. Oh, this left off from the last episode. >> Look what you did. it. What a spaz. >> Miss Stone, Fafy, Piper, and Jenny are bullying the new girl again about their weird food thingy. >> Good for them. Okay, show's over. Everybody settle down, >> man. Everybody, the whole class is out to get her. Man, what she do to deserve this? >> Where do you think you're going? Hannah, I did not give you permission to leave the classroom. But but >> she's about to throw up on you. You know, since we're in a classroom, we're going to do a multiplechoice test. Miss Teacher, should she A throw up in the bathroom? B throw up on the floor. C throw up on your Amazon wig. Hm. I wonder what she'll do. >> You're not fooling anyone with your little madeup fruit phobia. Take a seat like the rest of the class. You can't just tell her that in front of the rest of the class >> right now. >> She chose me. >> Threw up on the floor. >> It's like, why would you bully this kid? Like, she might throw up on you. >> How you doing, Hannah? It's been a month. Are you feeling any more comfortable in your new school? >> It's fine, I guess. Not any different than what I'm used to. >> Well, you know I'm here to help. So, if it's anything wrong, you have to tell me so that we can work on fixing it together. >> I'm okay. I don't want to bother anyone. >> Anna, you're not bothering anyone. We're lucky to have you here. >> If you say so. >> Y'all don't act like she's lucky to be there. >> For today's new food challenge, I'll be having pancakes for the first time. [Music] >> What kind of a person trolls a 9-year-old girl? Hey sweetie. How was school? >> It was okay. >> How did Operation make new friends go? Any progress? Hey, I know it's really tough starting over, but you made it work at your last school, right? I mean, you won everyone over there, even Tyler. Cuz you're an amazing girl. You'll win everyone over here, too. Just give it some time. I don't know about this school. This ain't no regular school. This is bookside. People will bully you for having chipped nail polish. A stray hair bullied. Anything besides the newest iPhone bullied. You just don't win. >> I can't teach my class this way, Joe. I just can't. And frankly, it is ridiculous for you to expect me to do so. >> Hannah's condition does bring with it some complications, but it shouldn't impact on how you teach your other students. >> Oh, but it does. I spend half of my day coddling a little girl with a fake condition instead of teaching. The rest of my students are falling behind all because of her. >> If you hate kids so much, like why are you a teacher? You're definitely not doing it for the money. >> Emily, our is not a fake condition. It's very real. And if you think you have it tough, how do you think poor Hannah feels every day? >> All we do is worry how Hannah feels. What about the rest of my students? Be that as it may, I'm afraid you're just going to have to learn to live with it. We're very lucky to have Hannah at our school. She's quite brilliant. But if you would just >> Let's move on to the next item on the agenda. >> Yeah. Shut up and sit down, Amazon wig. >> That was so dry. I don't think scones are making it on my safe list. >> Dry. Hold on. Hold on. Hold on a second. Let's take a look at the safe list. Pretzels, crackers, and toast. Literally, the driest foods imaginable are on the safe lists. How is Esone not going to make the safe list for being too dry? You know, I thought moist foods were like evil, unsafe foods. Hey honey, I got a surprise for you. Ta. I heard these laboo things are the hot new toy. with this little guy >> or girl would cheer you up a bit. >> Bro, that'd be like the coolest thing ever. Like, wow, my mom is really keeping up with the trends. Like, I I didn't even have to ask for a Laboo and I got one. >> Oh my gosh, it's so weird looking. I love it. Thanks. >> You're welcome, honey. Maybe it'll help you fit in more at school. Yeah, honestly, like you show up with a rare lab boooo, like everybody's going to want to be your friend. >> I'm so bad in geometry today. Oh my god, I know you were cheating. Wa! Check it. Is that a real Aub? >> How did you get one? They're like impossible to find. >> I want one so bad. >> Yep, that's loyalty. We didn't know you were cool like that. Hannah Banana. We had no idea. And that's a great nickname. Hannah banana. Love it. Just as much as I love that lab boooo. >> Nah, I see the way she looking at her like I'mma steal that thing. That's how the kids were at my school. The kids at my high school straight up thieves. >> Do you have any more of those? >> No. >> Ew. Never mind. Let's go. Such trash. >> Wait, I can get you guys some. >> That is so rude. Like, have you got any more liaboos? No. Ew, my hands disgusting. I regret touching you. >> Really? >> Can you though? >> You can. If you get me one, then I might let you sit with us at lunch. Who knows? If enough people see you with us, they might think you're as cool as we are. >> Yeah, I can totally get you guys some lioooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooos. >> She's going to get him a little fufu. Do you know how much Laboo's cost? What do you mean? Yeah, I can get you some. She the school laboo dealer like on the download. Like, yeah, I got I got you. Meet me in the playground after school. I can't believe a child is getting hate. Like, somebody literally made a fake account to hate on a child. Nothing says unemployed like making a fake account to hate on somebody, bro. Just delete them. Block them. Did y'all watch that Netflix documentary about that high school girl who's getting a bunch of hate over text? Hundreds of hate messages a day. And then the mom found out and they didn't block the person. When you block somebody, they don't exist anymore. That's why I love the block button so much. Like you block, poof, you're gone. You don't exist in my world anymore. I've seen specs of dirt bigger than you. If you're truly concerned, call the police. Yeah, the police isn't going to do anything. >> This one really takes the cake through. This Hannah is a total disaster. I don't care if she's smart. Her constant need for attention is proof she does not belong in the seventh grade. >> That teacher is a hater. I think she might be the one behind that hate account. >> Inappropriate for you to talk. >> She looks like she got time. Since when is it a sin to speak the truth? That little girl is a liar who's thirsty for attention? I mean, Arth, really? It's ridiculous. >> Hannah's not doing it for the attention. It's a real struggle for her. And even if you don't like her, she's still your student. >> Exactly. She's one of my students. And yet I'm supposed to treat her differently just because she has a madeup illness. It's nuts. >> What do you mean treat her differently? She's literally asking to be treated like a normal person. >> And that therein is the reason for the problem right there. >> Bro, this teacher thinks she's uncancellable. >> Oh my gosh, he's so pretty. >> Uh, what were you doing? You said I could sit with you guys. Not until after you give me that labu. That was the deal. >> Okay, bye. Ain't nobody wasting their time or their money on fake friends. Like, oh, you can only be our friend if you get us a labu lie. I ain't getting you nothing. If somebody has like a condition for you to be their friend, like that's that's not your friend and that will never be your friend. >> Shoo. Shoo. >> Mhm. >> Yeah. Time to get some other friends. There's at least two other people at that school. >> I'm sorry. You want us to do what? >> I want you to find out who this person is that's leaving these horrible comments on my daughter's page. [Laughter] Come on, Caster. Cer, come here. This woman is here to report that someone's being mean online. >> I mean, low key, there's not much they could do. I mean, the person isn't sending threats. It's like lukewarm hate comments. Can't really do much about that. Literally, just block the person. Poof, they're gone. >> Look, lady, we have real crimes to solve here, okay? We don't have the time or resources to track down every teenage sav. >> No, no, you don't understand. My daughter's only 9 years old, and this person is becoming increasingly unhinged. I'm I'm actually worried for her safety. If your daughter's so thin skinned but just from some mean comments that she should just stop posting altogether. See there? Problem solved. >> I don't think a 9-year-old should have a social media account, especially not Instagram. I think you have to be like 13 to use Instagram. >> Thanks for nothing. >> You're welcome. >> Mom, can I please get a few more Laboos? Pretty, please. >> I mean, sure, but why? >> What? Are they rich? Have you seen people on the internet with labuboos? Like one laboo simply isn't enough. Not going to cut it. It becomes an obsession. You get one and then a week later your bank account has hit zero. But you have an entire family of labu. Congratulations. You're broke. [Music] >> I'm finally starting to fit in. But I really need three more laboo. >> Girl, are you sure about that? >> I'll see what I can do. Let me buy the friendship of the three most horrible girls in the school. >> They made a meme on it, though. >> Insane. I got a great idea. I was so embarrassed. >> What did I say yesterday? >> You actually got one? It's adorable. >> Not just one. >> Oh my gosh. >> They don't deserve it. >> They're so cute. Get a photo of them. >> Ew. What are you doing? And you're going to make fun of her after she just got you a labua. What's wrong with you >> eating lunch with you? >> If you want to eat lunch with us, you have to eat like a normal person. >> Bro, the way I would just like snatch that loou back like >> But my armpit. >> Oh, my armpit. You mean barfin? >> Don't tell me you're really afraid of this pizza. >> Take a bite. It's literally the three worst girls in the school. >> I thought if you're three, she can't even handle a pizza. >> Like, girl, why would you be friends with that? Why would you want to be friends with that? >> No. Maybe if I give them a liaboo, they'll like me. No, that's crazy. The labu didn't even work. Like, they couldn't even pretend. >> Hannah, are you okay in there? Uh-huh. You know you don't have to sit with Piper and those other girls if you don't want to, right? >> I know, but I like sitting with them. Really? You do? >> It's hard for me to make friends, and I've never been popular, but Piper is giving me a chance to change that, and I do not want to blow it. >> Definitely a 9-year-old mindset. >> What happened to the rest of your life? >> Uh, I gave them to my new friends >> as gifts. >> Yeah, they're my friends. That's what you do. >> Yeah. Yeah. I mean, it's good to give your friends gifts, but remember, real friends don't require anything from you other than your friendship. >> I know. I'm just speeding things up to fit in. >> Yeah. I'm just speedrunning this new school popularity contest. You got to take advantage of having rich parents. >> You got me the little boo boos in the first place, right? >> Uh, yeah, I guess so. Man, how much money did she spend on those little boo boos? Oh, and she got a iPad. Hey, I got the ring light in the train. >> Maybe they're just rich. >> Is everything okay? Where are you going? I thought you said you wanted to record another video. >> Not anymore. I just want to be alone. >> I just want to be alone. No 9-year-old should ever feel like that. Like, that's terrible. Clearly, there's something going on in school. >> Though, the booby you have is so much cooler than mine's. >> Maybe, but mine's not as cool as Hannah's. >> Really? You think that? Thank you. >> Yep. In fact, why don't you let me have that one? >> No, I can't do that. My mom gave this one to me. It's special. >> She gave all of them to you. >> I care. >> Hand it over. >> That wasn't a request. >> I told you. I told you. >> Hand it over. >> They're going to steal it from her. >> Thank you. >> And push her. >> Wait. No. Stop. Stop. M >> if you ever want to sit with us at lunch again, you'll stop being such a baby and just let me have it. >> Trash. >> Yeah, >> bro. Literally, why would you want to be friends with these demons? I hate to see I saw it coming, but I saw it coming. I really hope kids these days are not this stupid. Like, bro, if somebody doesn't like you and makes it clear to you, like, you move on. You don't keep trying, keep trying, maybe one day they'll like me. No. You give somebody a chance, they ruined that chance. You move on. >> Hannah, I just saw what Piper did to you. >> Then why did you do nothing about it? You just saw them bully this kid, push her, and steal her lab boo. And you're just like, \"Oh, I just saw what they did to you. Bro, you useless. Call their parents. Discipline them.\" >> You want to talk about it? >> No. You want to talk about it? >> I'm going to have to tell the principal what Piper did so I can help you get your dial back. >> True. >> No, don't. No, you better do it to me again. >> Hannah, they're bullying you. You have to say something. >> You don't get it. Piper's popular and she's helping me make friends. >> Popular amongst whomst the two other mean girls. >> I won't tell the principal what Piper did if you don't want me to. But I have to tell your mother. >> Oh, even worse. >> Thank you so much for calling me. >> Oh, it's gonna be so embarrassing. I know something has been bothering Hannah at school, but she won't talk to me about it, and I don't know how to help her if I don't know what's wrong. >> Well, Hannah is really trying to fit in here, and she's putting a lot of pressure on herself. >> I know. I You see, Hannah had a really tough time at her old school before she made friends. And I know that she'll eventually make friends here. I just wish I could convince her of that. Well, I believe she's being used by a particularly difficult group of girls. And apparently they forced her to buy all of them the boooos in exchange for her to sit with them at lunch. But apparently that didn't work. So they last. >> They did what? Who are these girls? I want to talk to their parents. >> Well, actually one of the parents is right up the hall. >> Wait, is the teacher the stone, please? >> No way. Uh-oh. >> Why is Piper outside your office? >> Well, well, well. The apple sure doesn't fall far from the tree. The bad apple tree, that is. >> We are having a problem with Hannah and your daughter, Piper. >> Your daughter stole my daughter's laboo. True. And this is after she bullied her into buying her one and ones for her friends. >> That's not what I heard. Piper told me Hannah gifted the laboo to her as a token of their friendship. >> There is no friendship. Not friendship. >> Please tell me you're not taking this woman seriously, Catherine. >> Excuse me. What's that supposed to mean? >> It means that no person should trust a woman who allows their own daughter to believe she has a fake condition. >> It is not fake. Does she really work here? What can you put a 9-year-old like that? >> Why argue? Why don't we just call the girls in here and ask them what happened? >> Please send Hannah and Piper in. >> Imagine your own teacher being your biggest hater. This is crazy. >> Hi, mama. >> Oh, dear. Hannah, can you please settle something for us? >> Did you give Piper your little boo boo or did she take it from you? >> It's okay, sweetie. Just tell us what happened. >> The fakest person in the room. >> I gave it to her. >> Oh, >> well, there you have it then. That's all settled. >> Come, Piper. >> Coming, mama. [Music] I can't believe you just did that. I'd be like, \"No more loou for you.\" Like, bro, have some self-respect. How you going to let them walk all over you? Ow, bro. I got mosquito bite on my butt. Oh, Hannah. Honey, I know you want to fit in. But true friends don't require anything from you other than your friendship. >> That's true. And those girls are not your true friends. >> The best kind of friends are ones that you just enjoy being around. Like you have nothing to benefit from each other. >> I don't know how else to make friends, Mom. Being new is so hard. Especially with my arid. They call me a freak. I hate not having friends. >> Oh, sweetie, you don't have to do anything except just be yourself. Just be the beautiful, funny, outgoing little girl that you are. And I promise everyone will love you for it. Not because you gave them dolls, but because of what's inside here. >> Piper, I want my little boooo back. Please. >> No. >> She took both of them. >> It's mine. And you're not ever getting it back. There's nothing you can do about it. Little freak. You >> girls. Anna told me the truth about what happened to her le boooos. Give them back right now. >> Oh, now you told her. You're more of a loser than I thought. >> Oh, >> there is no way you could just pop pop his head off like that. It doesn't work that way. Uh-uh. That thing is surgically attached. Unless she got some superhuman strength. >> Good luck making friends now, freak. Well, >> it's not like you guys were her friends in the first place. Hey, she started at zero and now she's still at zero. Are you going to be okay, Hannah? >> Oh, actually, she up cuz she got the little back. >> They're bullies, not my friends. >> Mhm. >> Now she could just be flexing on all the other kids, but she got four of the boooos on one backpack. >> What kind of person leaves a 9-year-old this many hateful messages? I mean, you'd think the police would at least be curious. >> Yeah. Well, you made the right decision by texting me on Chrissy. I'll find out who did this faster than the cops ever could. >> Really? >> Yeah. People think that they can just hide behind a fake account. What >> IP addresses? >> The teacher. The teacher. Mom. >> You see, I found out. >> Wait. >> No way. Are you sure that's the right address? >> Wait, that's the school. >> Looks like they're actively commenting right now. >> Okay, we need to go. Bring that. Come on. >> Equals C square. >> Mrs. Stone. >> Oh, >> can I talk to you in the hall for a minute? >> Here it is. >> No, you may not. It is the middle of my class. What is this all about? >> This is about you cyberbullying my daughter. >> Oh, you know the the bullying in the classroom wasn't enough. Like, let's take it online on her social media account, too. That is weird. An adult bullying a child is crazy. Let Hannah see the comments online in order to protect her from people who just hate just to hate. And then I find out that her own teacher is one of them. >> How? >> I can't believe the teacher ended up being the biggest hater. >> I traced the IP address of the person cyber bullying Hannah back to the computer lab at this school. >> So hundreds of people use those computers every day. >> Yeah, but your computer, you know what? Somebody bullies you for months on end. Sometimes you just got to confront them in person. >> Not the teacher's computer. Every post was made while you were supervising study hall in the computer lab. You were the only one that had access to that computer. >> So fine. So what if I did it? I have free speech and a little freak deserved it. I am sick and tired of everyone rewarding literally a child lying >> like your students. You can't just like this would be crazy if this was real life. Like somebody was leaving hate comments on an anonymous account and ends up being my teacher. Bro, >> got a fake illness. It's just not right. >> What do you do? Is she going to lose her job? I think she should lose her. >> The way you've been treating little Hannah, it's unacceptable and I'm not going to stand for it any longer. You're fired, Emily. >> No, you cannot do this to me. >> You absolutely can do this. You can't be a teacher or bully your students. >> What's going on? No, I have free speech in this class in America. >> Yeah, in this class, not outside of the class. >> Forget mommy's first. >> Get her out of here. >> This is the first amendment issue. I'm coming. >> Get her, too. >> Is it really true? Did Miss Stone get fired because of you? >> I guess you could say that. >> That's amazing. >> She's so nauseous. >> She was the worst. >> Everyone was scared of her. >> Yeah. The only reason why anyone put up with Piper is cuz they're terrified of her mom. You literally saved the school, >> man. I thought she was the most popular girl in school. Yeah. Apparently not. Nobody likes her. She's just popular cuz everybody hates her. >> Hey, we're having lunch. Want to sit with us? Really? You want me to sit with you? Sure. Why wouldn't we? You're awesome. >> You want me to sit with you? Why does she keep secondguessing herself, bro? Just be like, \"Yeah, finally some people will actually like me for me.\" Yes. Hey, Dar Man fam. Make sure you like and subscribe. I love you guys so much. Thanks for watching. Bye, guys.",
    "start_time": 0.08,
    "end_time": 1392.72
}