{
    "video_id": "_LGi06AGK-U",
    "channel_url": "@sssniperwolf",
    "transcript": "Today we are checking out creative people on the internet. This is one of the most impressive painting videos I've ever seen. Okay, so first step one, slather your face in paint. You have to trust the process. It's all part of the process. And then that's not a normal canvas. It's like slanted. It kind of looks like blinds. But like, wait a second. Wait, how did he do that? It looks exactly like him. I don't see a mirror there. How does he know what the paint looked like on his face? Bro went from a blank canvas finger painting, flipped it over, and then did a self-portrait. Like, how is this even possible? Oh, wait, what? And then he flips it over and then the second side is him. How does he know what each side looks like? Maybe he's done this like 37 other times and he guessed right this time. Either way, smash that like button if you think this is insane talent. What kind of cake do you want for your birthday this year? I want the crusty white dog with flaming diarrhea. What do you mean? Oh no. Ew. I hope that's caramel. Wo. What kind of birthday cake is this? Like happy birthday. Some backdoor fireworks. Woohoo. Yay. Sing your happy birthday song until it starts doodooing out there. Okay, this is concerning. I don't know if I want to eat it anymore. This is Oh, who came up with this cake idea? Like, bro, what was the inspiration? My dog after eating Taco Bell. This cake got to go. Cake is supposed to be delicious, not disgusting. Have you seen anybody make art with a ruler? You know, there are a lot of tools that you can use, but look, it's already made a face. That is somebody's face, but like from a ruler. Wait a second. How is this even possible? Usually when people draw a face, it's like eyeball, eyeball, nose, mouth. Wow. But this is a whole different animal. This is like, okay, the top of your head to your forehead to the bridge of your nose in every line. But like what is one line thicker than the other and then it goes around counterclockwise to make somebody's face? Like it does not make sense to me how somebody's doing this. It's like, \"Oh, your brain works like 1 2 3 ABC. Well, maybe this guy's brain works like 03b 468.\" Like, what? I thought they could only do it with a ruler. No, that's clearly a lie. They can also draw with two hands. Like, oh, I'm a righty. Oh, I'm a lefty. No, both. And equally as talented with both hands. Do you know how rare this is to just have talent in both hands? This just blowed my mind. Whenever my Pomeranians look like this, it's time to take them to the groomer. They need a fresh cut. Pomeranians, they have a specific fur. It's not like other dogs. You can shape them and have the end result look like a marshmallow. I don't know how the groomers do it. It's all in the scissors. And the scissors are like curved. I have a pair. I tried to do it myself. I can't get it this good. So, I take them to a groomer to do it. But basically, when I get them cut, I'm like, make them round as round as possible, even rounder. Grooming a Pomeranian is an art form. It's not like other dogs like, oh, you get a trim right here and a trim right there. No, they literally can shape them with these special scissors. There's like thinning scissors and then there's the curve scissors, which lets you get that like that HD 3D BBL. Like, what he doing with all that gat? Look at the finished product. Like, okay, before. This thing looks homeless. And then after. Wow. A proper marshmallow. A good shape. 10 out of 10. Wow. And then they brought it home. It doesn't even look real. Bro, Pomeranians are literally the best dog. I don't care what nobody says. They're the cutest. They have the best personalities, too. Like, look at this thing. It doesn't even look real. Now, I got to keep my voice down. I feel like I'm cheating on my dogs because they're right there. This groomer did another video, but except focused on the back. Like, cut so good. It gave the dog a BBL. Like, this feels illegal. Like, who is asking for this? Why does it look like a KFC drumstick? Okay, this is a little excessive. You know, a Pomeranian does not need that much booty. Our favorite Tik Tok petitioner chef, the Amari Guichon. I don't know how to say his name. I know I'm not saying it right, but what is he up to today? It looks like he's making a sort of macaroon. Yes, I recognize macaroon making because my sister is a master macaroon maker and she takes a lot of pride in making her macaroons. Oh, he's making a little burger. He's making a burger out of a macaroon. I saw the sesame seeds on that bun. Sesame seeds do not usually belong on a macaroon shell. Unless we Wait, we got to trust this process. Okay, some chocolate patties and then the mango puree. He made mango puree sheets that look like American cheese slices. Okay, that is genius. And then don't forget the pickles. Bro, my taste buds would be so confused. It's a burger, but it's literally a pastry. It's sweet. It's a macaroon burger. I don't think this has ever been made before. It's like those little gummy Krabby Patties we used to get for Halloween, but the fancy gourmet version. Anyways, when I was in Paris, I waited outside in the blistering heat for an hour waiting to get into this guy's bakery. And I know it wasn't him making the pastries. I hate to say it, but I was not impressed. They make beautiful pastries. It was like $20 for a pastry. It tasted very expensive. Like, you could tell there was so much vanilla bean that went into this cupcake. >> I flew all the way to Paris just to try Cedric Growlet's pastries. >> Guys, we are here with Cedric Gr. I don't see the man Cedric himself, but I do see some gorgeous croissants. >> Oh my god. Wait, I am an idiot. I went to go look up the vanilla cupcake that I had. Thinking it was from this pastry chef, Amorei Guchon is not responsible for Cedric Gro's pastries. I got them mixed up for a second. I went to Cedric Role in Paris. I had this and a $20 vanilla bean cupcake. They were good, but not I would cut off my arm to have a lick of this good. Like I've been exaggerating in these videos. I've had a taste that I will say it was not worth a limb for. What happens when a billionaire has a wedding? They spend thousands of dollars on a cake. And this is the most extravagant wedding cake I have ever seen in my life. It is literally a castle. That's like several full-size men pushing this castle cake. Wow. That thing is insane. It's like a mini castle. It's like a 1 to,000 scale replica of a real castle. But still, like look at this thing. It is massive. You telling me that's made out of cake? You know, sometimes they'd be cheating and putting styrofoam or cardboard and then putting fondant and frosting over the styrofoam. It's too beautiful to eat. I wouldn't even want to cut that. Like, this is art. Leave it. Have it preserved forever. Like, your love may be. I heard the more you spend on a wedding, the shorter the marriage lasts. Is it true? So, I asked Chachi BT and there is a correlation. There are several studies that show that expensive weddings actually have a higher risk of divorce. Yikes. This guy, Nick Painting, squeezed out an entire tube of acrylic paint to make this little guy. Wow. But wait a second. That amount of an acrylic blob would take weeks to dry. Like, you can't just squeeze out paint, put some eyeballs in it, and be like, \"Oh, he's a forever friend. He's ready to go. He's not going to dry that quickly.\" A week later, maybe the outside layer is dry. But what about the inside? He's full of wet paint. So, you know what this guy did? He literally scooped out the insides of white paint. Please make another friend. Please make another friend. He's going to make another friend out of his insides. Undried paint makes me so anxious. >> Teeth and eyes. >> Oh, yes. >> And there you go. Now the paint blob has a friend and they can both dry faster. >> What's its name? Now the paint blob has a friend and they can both dry faster. >> Hear me out. I think this is a great idea. Technically with all of this wet paint, you can definitely take advantage of an infinite friend glitch where you let the outside of the second friend dry and then you scoop out his insides to make a new friend. And then you keep doing that until you have a family of them. You just keep scooping them until they get smaller and smaller and smaller. And then I think it's a great idea. I really hope he does it. I need somebody to come over and do my nails like this. Oh, really scrape them dry. This is like what a good manicure feels like. So, they're making a sculpture, you know? I really love how it's like it starts off as wire and then clay on top of it. And wait, wait, wait, wait, wait a second. What just happened? I thought we were sculpted a sculpture, but they transformed the sculpture into like half 3D art. Half of that is a painting, and then the hands like come out of the painting because they're a sculpture. Bro, this is like blowing my mind. You know, this is the kind of art you want to walk up to in a museum and touch. You shouldn't, but it makes you want to touch it because look, half of the painting is a sculpture. It like comes out. Okay, that one comes out a little too far for my liking. It's literally a hand outside of the frame. Like, this is where I draw the line with you. Put those paws inside of your frame. I can appreciate the artistic value, but personally, I would not want to have that hanging in my house. Jeez, it literally looks like her hands are outside of the frame and she's just sleeping inside there. Whatever this art style is called is insanely cool. Okay. And then you show me the tongues. I don't know how I feel about the tongues. You know, when it's hands, it's okay, but when it's a tongue, I hope you don't show me any other body parts hanging out of the frame. Bro, like the hands look so real. It's literally like real hands gripping the frame. Like I cannot believe this is a sculpture. Ah, that was kind of creepy. Imagine staying over at your friend's house, going to the bathroom at night and seeing this in the hallway or even worse in the bathroom in front of the toilet like as you sit down, eyes halflitted, and then you see this woman like, [Music] is that a little microphone? I don't like it. I I don't know how I feel about this. Oh, why would you do that? Are those real teeth? Yeah. Mom, can I borrow all of my baby teeth? I need them for a project. The project. Man, those things are on there pretty good. You know, teeth belong in your mouth for a reason. I really don't like them on the eyelid. Not very efficient. Your eyeballs do not need teeth, even if they're a worldclass talented singer. My frame experiments. Don't crack it. Oh, wait. That was a very aesthetic crack. How did you know that was going to happen? Bro's been practicing the art of frame cracking. Oh. Oh. Whoa. Wait a second. That's actually perfect because Bro's like punching the screen. So, let's find the point of impact and then crack the screen like the guy in the art did it. Let's break the frame where he's hammering. Wow. Okay, this is actually very creative. And then this one, they cut the corner and set it a flame just so she can roast her marshmallow. Wow, this is like very creative. Oh, I like the needle one. Like, let's cut the pages, sew them back together, and put the needle through this guy's hand. Like, he did it. He's the real artist. Pour some paint on an umbrella. Okay. Wow. These are so cool. Ro swung so hard he broke the glass. Okay. What else you got? A candle flame to keep you warm. And then the paint dripping bucket. Bro, put paint in a painted bucket and then it started dripping. Like, how do you explain this? It's on the floor now in real life. How do you even explain that? Like, the guy in the painting did it. He made the mess. These are so creative. It's like insane to me. The little characters are doing too much. Like, bro, literally climbed out of the frame. You cannot contain him or his art. She's about to turn a laboo into the Baba. That feels illegal. Wait, you could just pop out their eyeballs like that? Why does it feel like I' I've witnessed a crime? Like the labu has little feelings. Okay, you succeeded in making the eyes extra creepy. And then she took the entire labuoo and put him in black dye. Oh, he's going on the stove. He's simmering into a laboooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo stew. Oh, why does this feel so illegal? Like I lowkey feel bad for the labubu, but Oh, this is the finished product. And he is terrifying. The lababa doodoo. No, I think the lababa duke that sounds more fitting. The baba duke is terrifying. I think it's still a little too cute. Now, speaking of labuoo, she is going to transform herself into a laboo. Makeup tutorials that have gone too far. What is that? Slime. She puts slime in some tights. Put it around her face to make the face shape. And then some kind of clay all over her face. How are you doing this in real time? Like, how is she breathing? You have these two eyeholes. I mean, I guess she could breathe through the eyeholes and then fur on top of it. I feel like there's two kind of people. like the Jenna Ortega makeup tutorial kind of people and then the lab boou makeup tutorial like how do I transform myself into a lab boou for my child so that they will love me. Okay, well this is it. And then just put a blanket around you and then congratulations you've been labuified. Okay, that thing is terrifying. It's so easy to make a laboo look cursed. I feel like this entire tutorial could have been done like as a project on a desk, but she was like, \"Nope, I'll make it as I put it on.\" Like, that is the most impressive part of this. Like barely being able to breathe while cutting out some teeth to stick on your clay face mask. But anyways, that's all for today. I hope you guys enjoyed this video. If you did, make sure to hit that like button in the subscribe to the Wolf Pack. I love you guys so much. Thanks for watching. Bye guys.",
    "start_time": 0.16,
    "end_time": 826.399
}