{
    "video_id": "gJlwNKEdH-U",
    "channel_url": "@royaltyfam",
    "transcript": "So, this is my 15-year-old son, Ferrron. And today, we're going to attempt to find his twin brother. Here's what's going on. Fun already has a brother, and he's 5 years old. But Feron has always wanted a brother closer to his age. So, that's why today we're going to find him a brother. But not just any brother. We're going to find him a twin that looks just like Fon. Hey, >> I'm Feron's twin. >> I'm Fon's twin. >> I'm Fon's twin. >> Let's see who can pass as Fon's twin. >> First twin. Come on out. You kind of look like Fon. How tall are you? >> 410. >> Fan's 5'7. Come back in a couple years. Next. Wait. Wait. Hold up. You guys are brothers. >> No. We're twins. You need a triplet. >> No. No. No. That's way too many fans. I'm good. You guys are good. Oh my god. Can you imagine Ferrron triplets? Okay. What's your name? >> Samuel. I mean Fon. Exactly. You kind of look like him. >> I know I do. >> All right, you make it to the next round. >> By the way, I know that kid didn't look exactly like Feron, but once we find the perfect twin, we're going to give him a makeover so they can look identical to Fon. Next. Next. Next. >> Hi, I'm just a huge fan. I would love to meet Fon. >> You're here to meet Fon? >> Yeah. >> Next. >> Yeah, I'm Fon. >> You kind of look like him, bro. Uh, you make it to the next round. Next. Next. Next. Next. Uh, Funron is 15. I thought you said 50. Next. Hey. >> Hey, I'm Fun. >> All right. You kind of look like him. >> Yeah. >> You could be his twin. >> I think so. >> All right. You make it to the next round. >> All right. Three Fun look alikes made it to the final round. But whichever one knows Ferrane best will become his twin. >> Welcome to the final round, boys. >> I'm Veron. We'll see about that. Question number one, what is Ferrron's favorite car? >> Lambo. >> Lambo. Of course, Lambo. >> Question number two, what is Fon's favorite video game? >> Fortnite. >> Contestant number two, >> Fortnite. >> Contestant number three, >> Fortnite. >> All right, y'all. This is getting tricky. Last question. What is Fon's favorite fast food restaurant? Go, go, go. >> Taco Bell. >> Contestant number two, >> Taco Bell. >> Contestant number three, >> Taco Bell. Oh my gosh. >> All three contestants tied. So, I decided to bring in a special guest and let them decide who's going to be Fon's twin. >> All right, you guys. So, Gucci has the best relationship with Fon. >> Ever since Fon got Gucci 7 years ago, they've been inseparable. Gucci knows Fon better than anyone. Today, he'll be placed in the middle of the contestants, and whoever he goes to first will be chosen as Fon's twin. All right, Gucci, you're going to sit right here. Are you boys ready? >> Yes. >> Get out of the way. Get out of the way. Go. Gucci, come here. Gucci, come on, Gucci. You know, right? Come here. Gucci, come here. Gucci. >> He doesn't like you guys. >> Come on, Gucci. Come here. Come on. Three more. You got this, Gucci. Let's go. Right. Come on, Gucci. Come on. Gucci. >> Oh my gosh. >> Oh my gosh. Now, before we go surprise Fon, let's make the twin look identical to him. >> So, we're going to do a makeover. >> What? A makeover? [Music] >> Let's go, baby. That's what I'm talking about. All right, the haircuts on point. We match his skin complexion, and we even changed his eye color. >> I feel like Fon. >> Now, it's time to go home. And I cannot wait to see Fun's reaction when he sees his twin. >> All right, let's go, Dad. >> All right, he's already playing his character. He called me dad. >> All right, fake Fon. Let's go find the real Fon inside the house and then surprise him. >> You got this. Let's go. All right, let's go. >> So, I checked the security cameras in the house and I saw that Fon was downstairs in the movie theater. All right, go to Fon's bedroom upstairs and then I'll call Fun up and they will surprise them in his bedroom. >> I bet. >> Hopefully I don't get caught. >> Go go go go go upstairs. Go upstairs. Hurry, hurry. Go upstairs. Upstairs. Upstairs. Upstairs. Go go go go go. Go inside. All the way inside. Hold on. It's the door. It's the door. Yo, this room's sick. >> All right, fake Fon. Here's what we're going to do. We're going to bring the real Ferrron upstairs to his bedroom, and then he's going to see you sitting on his gaming chair, and then we're going to see what happens. >> I'm so excited for his reaction. >> All right, have a seat. Go. Go. Go. Can I turn on the PC? >> Bro, you're for all. You can do whatever you want. Go for it. That's all you, bro. Hey. >> All right, I'll be back. >> I bet. By the way, after we're done pranking Fon, we have five more people to prank using Fon's twin. It's going to be a crazy day, y'all. Yo, Fon, can you come upstairs to your bedroom? >> Yo, what? >> Hurry. >> Okay. >> We got to hurry up, you guys. We got to hurry up. He's coming. Okay. All right. FZ about to come upstairs. >> He's coming. Yeah, he's coming. All you stay here. I'm going to hide in his closet. All right. >> All right. I got you. >> You got this. All right, you guys. I'm going to hide in the closet. He's coming in. >> Yo. Hello. >> Oh, what's up, >> bro? Who are you? >> I'm f no. Don't Don't dab me up, bro. What do you mean you're fraud? Hold on. Nah. >> Yo, Ali, is this some type of joke? >> He's looking for me, >> bro. Are you serious? Like, who are you and what are you doing in my room? Like, bro, like, are you trying to be funny? This is my polo. These are my Jord. And those are my shoes because I wear those shoes every single day. >> What? These are all my clothes. Wait, who are you? >> I'm Far. Hey, bro. You have to leave my room. >> Nah, you know what? Why don't you leave my room? >> All right, bro. Like, this is not funny. I'm going to go get my dad, bro. Like, what? Like, I don't even know you, bro. You're in my room. >> Fan met his twin, but he had no idea what was planned for the rest of the day. >> All right, Fon, meet your twin brother, Fon. >> Let's get ready. >> All right. So, why are you guys doing this? >> So, today we're going to be pranking five different people and making them think that's the real Fon. >> Yep. And each level is going to get harder and harder. >> Bro, that is not going to work. >> Bro, you want to bet that these pranks are going to work and these people are going to fall for it? If all of them fall for it, you give me 500 bucks. If it doesn't work, I'll give you 500 bucks. >> 500 bucks? >> Yep. >> All right. You know what? Deal. >> Deal. >> Let's go. >> It's on. Let's see who we're going to prank first. >> Level one. Let's go. >> All right. Reveal it. Bro, there's no way you're going to be able to convince our fans that that's the real Fun. >> There's only one way to find out. You guys ready? >> Yeah. >> Now, let's head out and see if our fans catch the fake Fon. >> All right, you guys. We have arrived to the location. This is the spot where we usually see fans. Fake Fun. Are you ready to take some photos? >> Are you sure this is going to work? >> Yeah, it's going to work, bro. You got to believe in yourself. You're Fon. Say it. >> I'm Fan. >> There you go. Art Fun. You wait here. Okay. >> Wait, wait. I thought I was coming with you guys. >> No. If you and him come, it's going to be obvious. There can't be two fors. >> Hold on. Hold on. I have an idea. You see? Now I'm in disguise. No one's going to recognize me. Let's go see if this works. >> All right, you guys. We are here. You stay behind. All right. >> All right. I'm going to be watching you guys. And if one person realizes that that's not the real FON, I win and I get the 500 bucks. >> All right. Say no more. We got this. Let's go, baby. >> All right, you guys. Honestly, I really don't think this is going to work. I mean, he has the same outfit as me, but he's not me. He's not Fer on. [Music] >> Are you? >> Yeah, we're the royalty family. >> Well, I love you videos. Can we take a picture? >> Yeah, take a picture for us. >> Ain't no way. Ain't no way. Hey, bye. Thank you guys. >> Bye. >> Bye. >> Bye. >> Ain't no way that worked. All right, so they got one person, but I don't think it's going to keep working. >> Are you Are we family? [Applause] >> Wait, there's a whole entire family talking to them. >> Where you guys from? >> Hold on. May Maybe they're just asking a question. >> All right, let's take some photos. >> Oh, yeah. >> Get in. Get in. Get in. >> Get in. Cheers. >> They're taking a picture. >> Nice meeting you. Thank you. Honor. >> The prank worked and people kept asking us for photos. >> Oh my gosh, that's a lot of people that thought you were Fon. >> I know. Even I'm starting to think I'm the real Fon. >> You are the real Fon. Let's go. Let's go. >> Let's head back home and see who we're going to prank next because the fake Ferrar was starting to feel confident. >> All right, level one was a success for me, but not for you. Bro, you guys got lucky on the first level, but there's still four more left. >> All right, let's see what level number two is. >> Let's go. >> Reveal it. Reveal it. Teacher. Bro, we got to convince your teacher that that's Fon, >> bro. Hold on. No, my teacher literally sees me every single day. There's no way they're going to believe that that's me. >> All right, here's what's happening. Real Fon, you have a one-on-one online class with your history teacher. I want you to take the first couple of minutes and then ask if you can go use the restroom. Then fake Fon, you're going to take real Fon's spot in the class. Answer all the questions in the session and then if the teacher doesn't realize he's fake Fon, I win that level. >> Bro, obviously that's not going to work. I mean, my teacher knows exactly what I look like. >> Are you just mad because you don't look like this Fon? >> Bro, what? >> It's chill. We're twins. >> I am not your twin. Do you guys think we'll be able to prank Fon's teacher? >> Let's see what happens. Hi. >> Hi. Hi, Fon. How are you? >> I'm good. How are you? It's nice to see you again. >> Are you prepared for the quiz today? >> I'm going to that bathroom. >> Quiz? Uh, yeah, I am prepared. Uh, just I have to go to the bathroom really quick. Is that okay? >> Oh, okay. No problem. >> Okay, cool. Just give me like 2 minutes >> for sure. [Music] Now real Fern has to crawl out the bathroom and then fake Fern has to take the class. Veron, are you there? Hello. Hey, I'm back. Sorry. >> Hey, I was worried about you. >> I'm telling you, the teacher's going to think that's the real Fon. >> Bro, I promise you, she's going to catch on and I'm going to get in trouble for this. >> All right, Fon, are you ready for your quiz? >> Um, yeah. >> Hopefully, fake Fon is able to answer all of these questions, right? And the teacher doesn't notice he's not the real Fon. >> All right, here we go. First question. What year was World War I? You know what? I'm going to Google it. Ron, >> did you study? >> Yeah, of course. Let I'm I'm just thinking. >> Hey, hey, hey. 1914. >> Uh, 1914. >> Good job. All right, >> I told you I knew the answers. >> When did World War II end? >> Yo, >> you got this. >> 1945. I think it's 1945. >> Good job. That was great. >> Bro, your teachers and I better realize that's not you. >> All right, Bronn. Next question. Children in Britain had to carry these items to school during World War II. >> You're not going to know this. >> An axe. >> No. Well, that's that's incorrect. Veron Brown, that's strange. We went over these last week. >> I must just be having an off day. >> Next question. What was a nickname for the Cold War? >> Oh, the space race. >> Good job. Excellent. Good job. >> Hey. Hey, your twin knows more than you. >> Fake Feron finished an entire hourong session with the teacher and she never even realized. >> All right. Good job, Fon. Class is done. Thank you. I'll see you next time. >> Fake Fon was able to pass level two, but these next levels are only going to get harder and harder. Level two was a success, baby. You know what? He's starting to become more fer than you are. >> Bro, calm down. Let's see what the next one is. All right. >> All right. Are you ready to see who we're going to prank for level number three? >> Let's see. All right. Go ahead. Reveal it. >> Wait, hold on. Hold on. Hold up. Yo, Gucci. >> Man, what you want? >> Who do you think is more feron? Man, both for ons are dumb. >> Really, bro? Okay, let's see number three. >> All right. All right. >> All right, bro. We got to convince your trainer that you've known for over 5 years that that's you, >> bro. My trainer is not going to believe that's me. >> Fun has been working out with his trainer for several years. So, fake Fun is going to have to lock in in order to prank the trainer. >> All right, boys. The trainer is outside. Here's the challenge. You got to catch three balls from your trainer. >> All right. >> And after that, you're going to ask for a water break. And then fake Fon is going to come and take your spot. If fake Fon can catch three balls without your trainer realizing it's not you, then we pass this level. Yo, what's up, Salar? Are you ready to have a good session with Fon? Oh, I'm ready. I hope Fon's ready, though. >> Oh, he's ready. All right, you guys. The trainer is getting ready. Put on the hats and sunglasses. Put them on. All right, now you guys look way more identical. All right, fake Fun, go wait inside. Hide inside. All right, for real for stay here. Stay here. All right, Patrick, Patrick. All right, when the real Fun comes here and gets water, you're going to swap with him and go outside and try to prank the trainer that you're real for. >> All right, Ben. >> Cool. >> Cool. >> What's good, bro? You ready? >> I'm ready. >> Let's go. You ready to get this working? >> Oh, he's got this, bro. >> Let's go. Zero drops. All right. >> No drops. Hey, no drops. >> No drops. Set, ready, go. [Music] That's what I'm talking about. Let's go. All right. Number two. Set. Ready, go. >> Two for two. Let's go, baby. Set. Ready. Go. [Music] Hey, let's go. Woo. That's three for three. >> Let's go. >> Right here. [Applause] Oh my gosh. All right. You know what? I'm getting kind of thirsty. Can I go get water? All right. You earned it. Make it quick, though. All right. All right. I got you. Let's go. >> He's in the pantry. Go get him. >> Yo. Yo. Yo. You ready, bro? I'm ready. >> Let's go. It's your time, bro. >> All right. All right. Go. Go. Go. Go. Go. Go. Go. >> Hey, let's go, man. Long water break. If the trainer realizes this is a prank, then I lose this bet with Ferrron and I owe him $500. >> Let's do it. Same thing. Come on. >> Let's go, Fon. You got this. >> All right. He's about to throw the ball. I bet you he's going to drop it. >> Set. Ready to go. >> What was that? You just called three in a row. >> He stumbled on the way there. >> Now Solar is definitely going to realize that that's not the real Ferraron. >> All right, let's run it back. Let's go. Let's go. Let's go. Let's go. Set. Ready. Go. [Music] What's going on, man? >> Honestly, bro, that that was a bad pass, >> bro. It was a bad pass. He dropped backto back passes. The real Ferrron doesn't do that. >> Hey, bro. That was your second miss. Come on. Let's lock in. Let's go, man. My bad. Come on. You got it. >> Set. Ready. Go. >> There it is. All right. Let's go, bro. >> Ah, he caught one. All right, he got lucky. >> Set. Ready, go. >> There it is. Let's go, man. Make three in a row now. Okay, >> you got this, Fon. Let's go, baby. Set. Ready, go. Nice. Let's go. How many passes did he catch in a row? Three in a row. All right, give me a second. Just hold on. Don't do anything. Wait. Okay. Yo, Fate Fon caught three passes in a row. So before we go to the next level, let's go tell your trainer Solar this was all a prank. >> All right, let's go. >> Let's see his reaction. Let's go. >> Yo, Solar, what's good? >> Wait, hold on. >> What's up, bro? >> Wait, wait. Who's this guy? >> What? >> That's my twin F on bro. >> No. Who is this guy? >> What? No. Freaking fun. It worked again. >> All right, we pranked your trainer and that worked. Now, let's see who we got to prank for level four. This is the level where you're going to fail. The challenge is going to be over. You lose. I win 500 bucks. >> Not really. Reveal level four. We're going to convince your best friends that that's you. >> There's no way they're going to fall for that. I mean, I literally see them every single day at school. All right, this route is going to be difficult. Fan, your friends are almost here. And after he brings his friends inside, him and fake Fon will have to swap places. And if fake Faron can last one whole minute with your friends without them realizing it's not you, then we win this level. >> Yo, what's up, guys? Yo, brand new haircut, bro. >> I like it, dude. >> All right, boys. What do you guys want to do today? >> Whatever wants to do. Okay. Okay. You guys, I got better at wheeling and I want to show you guys. >> All right. All right. You guys want to see a wheelie? >> You want to show them a wheelie? >> Yeah. I want to show them my wheelies. >> All right. Show wait. You guys have to stay here and then I'm going to bring the bike. Okay. So, you guys just stay here. >> Yo, yo, yo. What are you doing? >> What am I doing? >> Fun and fake Fun are now swapping. And I don't know if fake Fun knows how to wheelie. This could end up really bad. Well, since I know how to wheelie pretty well, it's time to see a fake pirate over here can also wheelie as good as me and especially in front of my friends because if he doesn't know how to wheelie, then they're going to realize that this is the fake piron. My bike is in the garage. Let's go the helmet on. They're not going to realize it's not you. Okay, believe in yourself. All right, remember all you got to do is last one whole minute with his friends without them realizing that you're not for. All right. All right, you guys. as the timer starts now. They only have 1 minute. >> Come out for There you go, Fun. Let's go, baby. Come on, Fun. You got this. >> Fun, what are you doing, guys? Give him a chance. He just got on. >> All right, F. You got this, bro. Just try Just try to pull it up. You got this. >> There's no way fake FR's going to be able to do a wheelie. >> Let's go. Fan wheelie. You got this, >> you guys. cuz he's cold. He's a little rusty right now. He's got it. >> He's got it, bro. He's got it. Be patient, y'all. >> Do you see him trying to wheelie? It's so obvious that he's not me. >> Hold on real quick. Hold on. Hey, hey, hey. All we need to do is stall for 30 more seconds and we win this level. All right. Just try your best. >> Run. Come here. >> You know what? I'll show you how to give me. >> What are you doing? >> I'm going to show him how to wheelie cuz clearly >> I'll give you your own helmet. That's his helmet. It's sweaty. Hold on. Hold on. Hold on. Hold on. Hold on. Hold on. >> Oh my gosh. There's 20 seconds left. How have my friends not realized that that's not me? >> Here you go. Here you go. >> Thank you. >> All right. For real. Get off real quick. Fun's friend is going to show us how to wheelie, which will buy us some time to win this challenge. >> All right. You ready to wheelie? >> Again. Again. Again. Again. >> 10 seconds left. Come on, you guys. How is fake bra lasted this long? Yo, I can't believe you all fell for it. >> For what? >> Yo, take off your helmet. >> Wait, what? That's not >> That's not Fan, >> bro. How did you guys realize that exactly? >> That's not you. >> I was wondering why you couldn't wheelie. >> Yeah. Yeah. So, >> fake Fon has made it past the first four levels, but the last level is going to be the hardest one yet. >> Are you guys ready? I'm ready. I'm ready. >> If I prank this person, you owe me 500 bucks. However, if it doesn't work, I give you 500. >> No, you're joking. You're joking, bro. My mom gave birth to me. She's been raising me for 15 years. There's no way you're going to be able to prank her. >> Your mom is going to be the final test to make sure that I made the perfect twin. Bro, you are so going to fail this. We'll find out. >> All right, we need Andrea to come home, and I have the perfect way to get her to come. >> How? Watch this. >> Hi, babe. >> Hey, babe. Where are you? >> I'm at the grocery store. >> Babe, I need you I need you to come right now. >> Why? What happened? >> It's really important. Fun got sick. He needs you. >> She got sick? >> He needs medicine. Fun, I'm coming. Babe, can you just come home ASAP? He's really sick. >> Okay. Okay. Okay. Okay. Ali. Ali. I'll be there soon. >> All right. I love you. Bye. Bye. >> This might work. >> Guys, guys, guys. >> Andrea's almost home, so we only got a few minutes to set things up. >> Fan, your mom's on the way home. She thinks you're sick, so fake Fun. I need you to make Andrea think that you're real. Fun. Go get a hoodie. Go in his bed and pretend you're sick. All right. Hey, listen. If Andrea falls for this for three minutes, then we win the challenge and you owe me $500 bucks. >> Or if she realizes that that's fake fraud, then you lose a challenge and then you're going to owe me $500. >> You go hide in the bathroom. You go get a hoodie. Hurry up. Pick a hoodie. Go. Go. Grab the hoodie. Remember, you're sick, right? Put the hoodie on. There you go. There you go. All right. I'm your mom. Fon, what's wrong? >> I'm sick. >> Oh my god. What happened? Quiet. >> All right, you guys. Andrea just got here. Fake Farz in the bed. Real Farz in the bathroom. Let's see what happens. Hey, >> babe. Out of nowhere, Fun got sick. He said he wasn't feeling good. He wanted me to call you and he was even about to pee. >> Are you serious? >> Yeah. >> Where is he? >> He's in his bedroom. >> Wait, he might be sleeping, though. >> She's here. She's here. I hope she doesn't realize that I'm the fake Veron. >> I left for 2 hours and now he's sick. What do you guys do? >> Nothing. We were just having fun. >> Hey, what happened to you? >> Babe, >> he's not feeling well. >> Did you give him medicine? >> No, I don't know what the medicine is. >> All right. So, I have to go find the medicine. Okay. I'll be right back. >> Fan, just hang in there. Okay. >> Yeah, I'll be right back. >> You're going to be okay. If Andrea finds out that's fake Fon, then I lose this entire challenge. >> Hang in there, Fon. All right. >> She literally went to go get medicine. I can't believe she's falling for this. >> All right, you guys. This is the moment. I'm almost there. I got to win this bet. >> I'm coming with the medicine. >> I think my mom's coming back. >> What bothers you? [Music] My throat. >> Wait, but you didn't have sore throat when I left. >> His throat hurts. He doesn't feel like talking. >> Yeah, I need to give him medicine for >> going to give you medicine. You're going to feel better. He's going to rest. >> Fun. Hang in there. Here you go. I got it. >> Fun. You need to drink your medicine. You're going to get better. But you're going to get better. Wait. Who are you? What's happening? >> Let's go. I won. >> What? You won? What? >> I made a bet with Feron that you were going to think that's the real Fon. >> That's not even funny. >> And so you lost. So where's my 500 bucks? >> 500 bucks. >> You guys are ridiculous. I swear >> guys, Andrea's mad. I lost the bet. He won. Stay royalty. We out. Peace. [Music]",
    "start_time": 0.08,
    "end_time": 1578.3899999999999
}