{
    "video_id": "_ZT0pvTb7c0",
    "channel_url": "@royaltyfam",
    "transcript": "All righty, guys. So, I've been hiding something from my parents for a little while now, but I think today is the day that I'm going to be telling them I have a girlfriend. So, she's currently downstairs waiting for me. So, let's go ahead bring her in and introduce her to my parents. Let's go. All right, you guys. I'm honestly kind of nervous. I think my parents are still in that room right there. [Music] That means we have to be extra sneaky, extra quiet. Let's go get my girlfriend. Let's go. Come on. There she is. There she is. Yo, Gucci, bro. Watch out. Watch out. Watch out. She's here. She's here. She's here. All right. Come on in. Come on in. >> Hi. >> All right, you guys. This is my girlfriend Emily. >> Hi, guys. >> So, we've known each other for a couple years now, and after recently reconnecting, we started hanging out, and we're official now. And today we're going to be telling my parents about her. >> I'm really nervous. I'm not going to lie. >> I'm sure they're going to love you. >> I hope so. >> You ready? >> Let's go. >> Let's go. >> Okay, Frod, where are your parents? >> My parents are upstairs in their room. Come on, let's go. >> Okay. I'm so nervous to do this. >> Why are you nervous? They're going to love you. >> You promise? >> I can't promise anything, but I think they're going to love you. Come on, let's go. All right, you guys. So, my parents are in this room. By the way, I told my parents that I have a surprise for them, which is why they're not going to be suspicious that I'm vlogging. Take a deep breath. >> Okay, I'm ready. >> Oh, hey mom and dad. >> Hey. >> Hi. >> How are you? >> How are you? >> I'm good. How are you? I'm good, thank you. What are you doing here? Let's see if my parents approve of my new girlfriend. >> So, me and Emily are official. We're dating. [Music] >> Wait, since when did you guys started like hanging out? >> Uh, maybe like a week ago. See, I told you they were going to love you. >> Oh, wait. You guys, I can finally call you mom and dad. >> No, no, but we know you're mom and dad. >> Guys, come on. Don't be silly. Just just don't give her hug. Silly. Yeah. Come on. Bring it in. >> Okay. >> A >> Speaking of that, you guys, I have a surprise for you. >> She brought you guys a gift. >> A gift? >> Surprise? >> Well, you didn't have to. What is this? >> One for you. Now you can always remember me. >> Okay. Um Okay. >> All right. Thank you. >> Of course. >> Emily, come on. Let's go hang out in my room. >> No, but I need to talk to you first before you >> No, don't worry. Don't worry. I'll see you guys later. Let's go, Emily. Come on. Let's go. Go to my room. Go to my room. >> Do you think your parents were mad? >> No. They love you. They love you. Come on, just go to my room. My mom is so mad. I wonder how she's going to deal with my girlfriend for the whole entire day >> because things are about to get crazy. [Music] >> I guess it's that time, you guys. Fan brought a girl over for the first time and he's saying it's his girlfriend. >> How is this even possible? Ali, why are you okay with this? Babe, relax. >> By the way, what are you shooting right now? >> Babe, it's a big moment in his life. He brought a girl over, which is why he's probably recording, too. >> All right. So, she's a senior. He's a freshman. She's going to college very soon. Do you know that? >> Relax. >> He brought a girl without even asking us. This is unacceptable and so disrespectful. I'm going to go and talk to him and his girlfriend right now. >> Babe, babe, hold on. Babe, babe, babe, babe, what? >> Babe, you're in a bad mood. Let me take care of this. I'll go talk to Faraday and Emily and I'll sort things out. You stay here. >> Okay. Tell him to come here right now. Okay. I need to talk to him. >> Oh boy. What a crazy start to the day. Andrea's really mad. I'm going to go talk to Ferrane and Emily and see what's going on. Hey guys. >> Your mom is so mad. >> Let's go. >> How did I do? >> You did amazing. >> All right. All right. Listen. Here's what's actually going on. Emily is not actually my girlfriend. Instead, I made a bet with Ali that I will make Emily act like such a bad girlfriend that my mom will kick her out of the house because my mom is so strict. But I disagree. I think that Andrea is so nice that no matter how rude Emily is today, Andrea doesn't have the heart to kick her out. Emily, I know you're super sweet in real life, but today you got to be extra sassy. >> I got this. Let's do it. >> Fun had a lot of tricks up his sleeve for the day. >> Are you ready? >> Yes. Let's go do it. >> Let's go. All right, you guys. I honestly do not know what Ferrane and Emily have planned for today, but I cannot let Andrea know that I'm a part of this. >> Andrea had calmed down, but she wasn't ready for Ferrron's first plan of the day. >> I'm hungry. I don't know why you're not offering me any food. You're not feeding me. Fun. >> Do I Wait. Do you hear that? There's so many snacks. Like, do you want me to get you chin? >> Yeah, I heard something downstairs. >> What happened? >> I don't know. >> Who's that? >> I hear some yelling. >> I've been here for 15 minutes, Fran. You haven't offered me anything. What is it? >> Like chips? Like some hot >> Cheetos? I don't even want to hear this from you. >> What's going on? Your son is not being a good boyfriend and he's not feeding me. >> No, no. I was going to get you food. Just like >> Oh, really? But but yeah, but okay. So there is no reason to be screaming in the house. Okay. >> No, no, no. Let's not tell me what to do. I I'm just going to help myself. Okay. >> What? Like Okay. So, let me help you then. If you're hungry, I can help you then. But no screaming. >> I'm hungry. >> Okay. Um babe, she's hungry. Let her see what she wants. She probably hasn't had You haven't had breakfast yet, right? No. >> Okay. Let her let her eat. >> All right. Uh so Emily, you see what you want. >> Okay. >> Yeah. I honestly don't know how much patience Andrea is going to have throughout the day. >> That's expired. >> Um, >> are you guys trying to poison me? I'm allergic to peanuts. >> These have mold on them. >> You know what you do? >> Yeah, they do. Where? >> All over the bottoms. >> Perfect. I love Caesar salad. >> Okay, she found something she likes. That's good. But actually, this is my salad and it has my name on it. >> No, but but mom, come on. It's my girlfriend. She's a guest. Just let her have it. It's okay. >> Don't you think you should share? >> Yeah, mom. You should share it. It's for her. >> Okay. >> Thank you. >> Enjoy. >> You can tell Emily was getting on Andrea's nerves. >> Oh, by the way, Andrea, thank you for the salad. >> And it was only going to get worse. >> Can we have a conversation in private, just the three of us? >> I can't. I'm kind of busy with my girlfriend. Babe, he's he's with his girlfriend right now. >> Babe, we are going to have a conversation, the three of us, right? >> Real quick, let's go. >> Follow me. >> Let's go talk about this. >> Hey, where are you guys going? We are going to have a conversation as a family. >> Oh, okay. Let's go. No, no, you're good. Just finish your salad. The salad is delicious. Just stay here. Have fun. >> Yeah. >> Enjoy. >> We'll be right back. >> Okay. Okay. [Music] What's going on? Are you serious about Emily? >> Yes, that's my girlfriend. >> Oh my god, she's so rude. She's screaming inside the house. She wanted to eat my food without my permission. She's just so rude today. >> Okay, okay, okay. But maybe she was just hungry. You know, people People People get mad when they're hungry. They get They get angry. >> Maybe she was hungry. Maybe she Now that she's eating now, she's going to feel better. Just give her a chance. [Music] Are you jealous of my girlfriend? Is that >> Is that why you're mad? >> No. Oh my god. Farah, I just wanted a good girl for you. >> All right, guys. Let's go back and check up on Emily. >> She's by herself. Let's go. >> Andrea was already so mad, but what Emily was about to do next was going to make it even worse. >> Emily. Emily. She's gone. Emily, >> I'm here. >> Where? >> Where are you? >> I'm in your bedroom. >> Wait, don't tell me she's in my bedroom. Don't tell me that she's in my bedroom. >> Mom, take it easy. Don't Don't panic. >> Why is she doing my bedroom? Go tell her. Go. >> Don't freak out. Go. Go. Go check. Come on. >> Emily, [Music] >> what happened to my clothes? Where are my clothes on the floor? Oh, well, I was just choosing a new outfit. I couldn't really find anything I liked in there. Why are you using my makeup without my permission? We're family. I thought I didn't have to ask for permission. No, you messed up my foundation. >> No, mom. Mom, mom, mom, listen. It's fine. You guys are family. You guys can share. You have a lot of makeup. >> Babe, it's just makeup. It's fine. I know. It's just makeup. >> Sharing is caring. All right. So, next time you ask for my permission. All right. What else do you do? I mean, she made a mess right here. How much clothes did you throw on the floor? >> Not too much. Oh my god. Oh, why did you do that? >> Oh my goodness. >> I think Andrea's mad. >> What's wrong with Emily? You need to control your girlfriend. >> Mom, why don't you tell her she looks pretty? Why don't you compliment her? Because if you keep being mean to her, she's going to leave. >> I'm not being mean. She's the one that is mean, is rude. She came to my bedroom. He's using my stuff. >> Babe, can I be honest with you? >> What? >> You're coming off a little bit jealous. Maybe Fon was right. I'm just saying jealous. And maybe you just can't accept it. >> Guys, are you serious? How am I going to be jealous? I just want a good girl for my song. >> Okay, she can literally hear us. Just stop. >> Babe, come. I need you. >> I I got to go. Okay, she's calling me. I got to go. >> Fan's plan worked, but it wasn't good enough. He's going to have to step it up if he wants Andrea to kick Emily out of the house. All right, >> Coron, are you sure you want me to drive your mom's car? >> Yeah, it's going to make her so mad. >> I don't even know how to drive a Tesla. >> First things first, safety. Put on your seat belt. >> Oh, right. Okay, >> now you just got to move your wheel to the right. That's the left. The right? >> Yeah, but >> the right. >> Uh-huh. There you go. Keep going. Keep going. Keep going. There you go. Now you just reverse. >> You feeling better? >> Yeah. You know what? I was thinking that I had to have a conversation with Emily because at this point I think that she's crossing the line a little bit and if I try to talk to her nice maybe we can become friends. >> Yeah, that's a good way to go about it. >> Okay, >> just be nice. >> All right. >> Oh my god, I'm so nervous. What if your mom sees us? >> That's the point. >> Okay, press the gas. >> Oh my god. >> Okay. Okay. There you go. There you go. There you go. You're good. You're good. Keep going. Keep going. >> Where are they? >> They're in the room over there. >> Do we want >> I don't know. [Music] Who's driving my car? >> Turn it. Turn it. Turn it. There you go. Now go. Go. Okay. Okay. >> She is crossing the line at this point. >> Wait, we don't know it's her, though. >> No. What do you mean? Like, then who? >> I don't know. >> Oh my gosh. >> Uh-huh. There you go. There you go. There you go. >> She's just crossing the line. She's using all my stuff. She wants to get on my nerves. >> Babe, just chill. >> No. Chill. No. She's using my car. >> Go ahead. Go ahead. Keep going. Keep going. Oh, they're here. They're here. >> Stop. Stop it. Please don't move the car. Stop it. Hey. >> Oh my gosh. Okay. Okay. Okay. Stop. Stop the car. Listen. Do not do not put your window down. Okay. >> Pull down the window right now. Hello. >> Babe. Babe. Babe. Babe. >> No. Babe, you please. Please. >> Babe. She's just teaching him how to drive. >> Yeah. Babe, why my car? >> Put it in drive. There you go. Now go very slowly. >> Where are they going? >> All right. Keep going. Keep going. Keep going. >> Can you do something, please? >> They're just cute. They're having fun. Keep going. Just a little bit more. Just a little bit more. Right there. >> Okay. I'm going to be in front of there. So, >> wait, guys. Just wait. Baby, just chill. Just chill. Keep going. Oh my gosh. Oh my gosh. >> All right. Keep going. Keep going. Keep going. >> Roll the window down. Just a little bit. Just a little bit. >> Put the window down. Please. Why are you driving my car without my permission? >> Because I can. I'm family. >> Yeah. Mom. Mom. Mom, it's okay. I gave her permission. She's family. She's my girlfriend. It's fine. >> She's my boyfriend, remember? >> Exactly. It's fine. >> No. Sorry, guys. She's not part of the family. And you need my permission to drive my own car. >> I think you should stop yelling at me. >> Was this the moment that Andrea was going to kick out Emily from the house? >> Turn off the car and step out. All right. Hello. Please step out. Come on. Hello. >> Uh, can you guys just come with me real quick? Everyone come over here. By the way, Emily, amazing driving skills. I'm very impressed. >> Isn't she amazing? >> Thank you. At least one of you guys is nice to me. Okay. So, you're no helping. >> All right, Emily, where were you trying to go in the car? >> I was just trying to go to 7-Eleven to get some snacks. Is that really so bad? >> Exactly. I wanted snacks, too. I was hungry. >> Yes, but you should ask to the owner of the car if it's okay to drive it, right? >> Okay. Well, I asked my boyfriend and he said yes. >> I I did say yeah. So, it's not her fault, it's my fault. I I gave her permission. >> Babe, I have an idea. Why don't you and I drive them to 7-Eleven? That way, they can have fun. See, that's what a good parent does. >> I told you my parents were cool. >> Thanks, Dad. Thanks, Mom, too. I guess >> shotgun. That's my seat. >> Uh, no it's not. I called shotgun. >> No. Come on, get out. >> Mom. Mom, my girlfriend did call shotgun. Just like just come sit in the back with me. >> But this is my seat and I want to go in front. So, get out, please. Babe. Okay. You're not going to say anything? It's very comfortable in the back. You can sit next to Feron. It's going to be okay. >> Yeah, just come sit in the back with me. >> All right, [Music] >> guys. Come on. Don't take too long. I have a photo shoot and I had to make it. So, horri, please. >> It's not about you all the time. Don't you care about your son's girlfriend? >> Yeah, Mom. Trust me, it's not that big of a deal. We're going to make it on time. >> All right. Just go ahead and get what you want. >> Oh, we should get these. >> Oh, yeah. Those are good. >> Can you hand me those? >> I got you. I got you. How many? How many? Two. Three. Perfect. >> Oh, babe. Have you tried out Cheetos? >> Those are actually spicy, Emily. >> Yeah, I think those are pretty good. >> I want to try. >> Wait, wait, wait. What are you doing? This is unacceptable. You supposed to pay and they eat. >> Um, okay. Well, don't snatch it for me. >> That's it. That's it. Grab more. Grab more. No. No. No. No more. Let's go. Let's keep going. Put it in the bag. Guys, guys. We're good. We're good. Let's keep going. Let's keep going, >> you guys. Emily is getting on Andrea's nerves. It's getting crazy. All right. You got everything you need? >> Oh, yeah. Here you go. Here's everything. All right. $223.82. Uh $223. >> You know what, Andrea? Thank you so much for taking care of this. >> Wait, what? >> Thank you, Mom. Thank you, Mom. We love you so much. >> Oh, guys, wait. I didn't agree to pay for all. >> Let's go, Emily. Thank you so much, Mom. >> It's It's only $223. >> Andrea was already mad that she might miss her photo shoot, and paying for all of these snacks just made it worse. All right, we're almost home. >> Babe, you know that I'm late for my photo shoot. >> Okay, no one cares. It's not that important. >> What do you mean? It is important for me. >> Mom. Mom, it's okay. It It's fine. >> No, it's no fine. So, tell her not to say those things. >> Okay, so then just stop having an attitude. >> Oh my god, you stop. >> Can we just get along? Everyone, just relax. You'll do your photo shoot. You guys will enjoy 7-Eleven and we'll all have fun tonight. >> All right. Okay. >> All right. The two of you go to the movie theater. Enjoy your 7-Eleven. Andrea, let's get ready for your photo shoot. >> Good luck with your photo shoot. >> Yeah. Good luck, Mom. >> All right. Thank you. >> All right, beautiful. Are you ready for your photo shoot? We got to leave soon. >> Hey, honestly, I don't feel comfortable leaving knowing that Emily is here. I don't trust her. >> Are you serious? >> Yeah. I'm going to tell her that she needs to leave right now. >> Wait, hold on, hold on, hold on, hold on, hold on. You can't kick her out. >> Yes, I can. >> If Andrea kicks out Emily, that means I lose the bet against Pon. >> What if I get your photographer to come over? He'll take the photos for you here. That way, you can get your photos and we keep an eye on Emily at the same time. >> Are you sure you can do that? Get my photographer to come here? >> Yeah, I'll get him to come. >> Okay, so >> I'm not 100% sure, but I'm pretty sure. Okay, >> just trust me. >> Okay, >> it's going to be a fun night. >> All right. >> All right. You trust me? >> I trust you. I love you. >> All right, you guys. This is getting more difficult than I expected. >> All right, y'all. All right. Um, so your mom is pretty mad. >> Good. >> All right. So, by the way, I'm winning the bet so far because Emily hasn't gotten kicked out yet. >> No. Okay. Wait. Wait. I still got time. >> All right. So, here's the plan. The photographer is coming to our house. Andrea is going to take photos. You guys just do your thing. All right. H. Okay. >> Okay. >> All right. I'll catch you guys soon. >> Bye. >> All right. Remember, we have to get my mom so mad that she kicks you out the house. >> Okay. >> Photographer's here. >> The photographer arrived and Andrea was already feeling better, but Feron was planning something evil. >> All right, my mom's photographer is done setting up. Let's go. >> Hey, you're the photographer, right? >> Yes, I am. How are you? I don't think Andrea's ready yet, so we can just kind of go ahead and start shooting me. >> Okay, that's fine. Yeah, there you go. There you go. Uhhuh. >> Make sure you get my good side over here. >> Yeah, exactly. Get her good side, bro. >> All right, babe. So, I already picked these three outfits. >> Okay. Okay. >> Okay. Which one should I wear first? I like all of them, but >> I know you like all of them. All right, royalty family. Which one should Andrea pick first? I think you're going to look gorgeous in all of them, but I think you should pick. >> Wait, wait, wait, wait, wait. I already have my favorite. >> Let me see. Let me see if I get it right. Okay. All right. >> That one. >> Yay. >> That was your favorite. >> Yes. >> All right. On the count of three, wear it. 1 2 3. Oh my goodness. You are looking drop dead. Gorgeous. >> All right, sweetheart. Are you ready to take some photos? >> I'm ready. >> When my mom comes down and sees this, she's going to be so mad. Keep taking pictures, you guys. Keep going. You look amazing. There you go. Looking good. >> Great. Perfect. >> Oh my god. Hey, >> guys. Hey, chill. Keep going. Keep going. Keep going. Relax. Relax. Relax. Relax. Here you go. >> Excuse me. Hello. Why are you taking pictures? >> Um, we're actually doing my shoot right now. >> No. What do you mean? This is my photo shoot. This is my photographer. This is my house. And >> you got to wait your turn. >> Excuse me. This is This is not for you. >> Okay. Well, normally the prettiest girl in the house does a photo shoot. And look who's shooting. >> Was this going to be the moment Andrea kicks Emily out of the house? >> Okay, I'm going to pretend that I didn't hear that. Um, so please get out. This is my moment. >> Well, we're in the middle of it, so >> Yeah, Mom. Maybe you could wait. >> You need to tell your girlfriend. >> I have a solution. I have a solution. I have a solution. Hey, uh, can you take photos of the both of them together? >> Uh, sure. Do it. >> All right, cool. That's the two of you guys stand together. There you go. That was smart. That was smart. That was smart. Go ahead. Go ahead, sir. Go ahead. Go ahead. >> I told her, \"No, I'm not taking pictures with her. What are you talking about?\" >> Why are you being so mean to her? >> You should do something. >> Girls, one quick photo together. Just the two of you together. >> Okay. Why? Why am I doing this? [Music] >> Get out of my way and let me do my photo shoot, please. >> Fine. I'll just go outside with my boyfriend. >> Perfect. Bye. Good luck. >> I don't even want to shoot anymore. She ruined my photo shoot. >> No, babe. You're already here. Just take some photos. >> Babe, Emily's been so annoying the whole day. She ruined my whole day already. >> Babe, come on. Bring your hand. >> Okay, >> just breathe. >> Andrea, calm down. But what's about to happen next might just push her to the limits. So, my mom hasn't kicked Emily out the house yet, but I got a plan. So, earlier I told Emily to call all of her friends and tell all of them to come over so we can throw a party because I know that'll make my mom so mad. >> And I think that they're here right now at the front gate. So, let's go get them. >> Let's go. Emily grabbed her friends from outside and Andrea had no idea what was about to happen. >> There you go. There you go. Keep taking those pigs. What are y'all doing? >> Andrea, you're paying for this. I'm out. >> Oh my god. >> Who are you guys? >> We're Emily's friends. >> Wait, wait one second. Do you invited your friends to come to my photo shoot? Of course, we're throwing a party. >> Listen to me. Listen to me. Emily's friends out. I want everyone out right now. My friend, right? Everybody. >> Oh my god. >> Hey guys. >> See you guys. >> You can't just kick them out. That's so mean. >> Emily's friends ruined Andrea's photo shoot and she kicked them out of the house. Was Emily gonna be next? >> Okay. So, Emily, for how long are you planning to stay here? Because it's getting like kind of late and I'm tired. >> Well, I actually feel like we've been getting along pretty good and I've decided that I think I'm ready to move in. >> What? >> Yeah, Mom. She's going to move in with me, you know, since I love her so much. >> No. No. This is not going to happen. There is no way. No way, guys. What? Say something. >> I mean, I think it would be amazing if she lived with us. No. >> Are you Are you kidding me? >> Yeah. >> So, are are you guys planning something? Like, are you guys messing around with me at this point or what happened? >> What are you talking about? I'm so serious. >> Yeah, we're serious. >> Babe, it's not the end of the world. >> As a matter of fact, I think my stuff just arrived. >> Yeah, let's go. Let's go. >> What do you mean by your stuff? >> All right, movers. Let's bring all of the stuff up to the master bedroom, please. >> No, no, no, no, no. Movers, this is my house, so go back, please. >> Uh, movers, stay. Just bring it up there. No, movers, you go back. This is my house. I'm the owner of the house. >> Hold on. Hold on. I live here, so come in. Come in. >> No, but I'm the mom here. I'm the one with the rules. Go back. Go back. Go back. Thank you. >> Yeah, I guess. Just take it outside. Yeah, take it. Sorry about that, guys. Sorry. >> You know what I mean? I I like you and everything, but at this point, you need to leave my house right now. >> Wait, wait, wait, wait, wait, wait, wait, wait. Are you kicking her out? >> Yes, she needs to leave my house right now. >> Babe, are you sure you want to do that? >> I'm sure. Come on. Come on. >> Okay, I guess I'm >> You're welcome to come back anytime. >> Leave it. >> Yeah, you can come back tomorrow. >> No, I know tomorrow. Like, never go leave >> next week. It's cool. Oh my god. >> Hold on. You You can't take a joke. >> What do you mean a joke? What? >> What? >> This whole time we set it up as if that was his girlfriend, but it's really not. Just to make you mad. >> I don't have a girlfriend. I don't have a girlfriend. >> No, you kidding me. No. No. You guys, I I knew it. I knew it. >> All right, you guys. They're hugging it out. They know it was a joke. >> I'm so sorry. >> Stay royalty. We out. Peace.",
    "start_time": 0.48,
    "end_time": 1519.559
}