{
    "video_id": "4bMAzJQNMm4",
    "channel_url": "@royaltyfam",
    "transcript": "Today is our son Fan's 15th birthday. >> And since he loves water slides so much, we decide to surprise them by renting out an entire water park just for him and his friends. >> All right, let's wake up the vera boy. >> By the way, we have tons of surprises for Ferrron throughout the whole day. And each surprise is going to get better and better. Starting off with surprise number one. >> Let's go. Ready? >> Go inside. Go inside. Hello. Happy birthday. >> Wakey wakey birthday boy. >> Happy birthday. >> Good morning. >> Are you ready for the first surprise of the day? >> Yeah. Let me open it. Let me open it. >> Open it. >> Open it. Open it. >> Are you ready for your big day? >> I'm ready, bro. I'm so ready. >> Open it. Open it. >> What? You got me a custom jersey with my name and the age I'm turning. >> Keep going. Keep going. Keep going. >> You got shorts, too. >> Okay. I got swimming shorts. These are nice, but why do I need swimming shorts? >> You're going to see exactly why you need those. All right. Put on your outfit. >> Put it on. All right. Let's see how you going. >> All right. Are you ready for the next surprise of the day? >> The next surprise, >> bro. The next surprise is going to be so sick. Wait, I think it's arrived. You want to go check it out? >> Yeah, I want to go check it out. >> Go outside. Go outside. It's outside the front yard. >> This is about to be Faron's best birthday ever. >> Are you ready to see your surprise? >> I'm ready. I'm ready. I'm ready. All right, come outside. Come outside. >> No way. You guys got me a Lamborghini. [Music] What do you think? >> This thing looks so sick. Look at the color. >> Hey, it's your dream car, right? >> This is crazy at Lamborghini. That's my dream car. >> All right. So, we're going to use this car to go to the next special location. All right. >> Next special location. All right. Well, can I drive? >> No. >> Well, you want to drive? >> Let me drive. >> No, that's not going to happen. >> Hold on. Do you think you're ready to drive a Lamborghini? >> No, he's not. >> I'm ready. I'm ready. All right, I'll tell you what. If the royalty fam drops a big thumbs up right now and gets this video to 500,000 likes, then you'll drive. >> Let's go, Roy. Hit the thumbs up button. I want to drive. >> Let's go. >> All right, done deal. You're going to be driving. All right. >> All right. Let's go. Give me the keys. Oh my gosh. Be careful, please. >> Oh, be careful. Let's go. Let's go. Go inside. Go inside. I got to unlock it. Hey, let's go. Let's go. Let's go. Let's go. Oh. Oh my gosh. This thing is so sick. So, Fan is inside the Lamborghini right now, >> and he's super excited to drive it. So, the place that we're taking Fan is a full-on resort. It's got a hotel, restaurants, candy store, and a special indoor water park. >> But what Fan doesn't know is that all his friends are going to surprise him there. >> All right, let's turn on this bad boy. See how loud it is. You guys ready? Oh my goodness, you guys. This thing is insane. I can't wait to drive it. >> All right, Fan and I are going to head out right now. We're going to go to the resort. I want you to gather all of Fon's friends and meet us over there. Okay. >> Okay, >> you got this. >> I don't know because his friends are crazy. >> I mean, how bad can it be? >> Oh my god. You listen to me. >> You got this. Come on. You got this. I love you. I love you. >> I love you. >> Are you ready to do this? Are you ready to do this? Do you know how to drive, >> bro? Yes, I do know how to drive. >> Oh no. Letting Fan drive might just be a bad idea. >> Watch out. Watch out. Whatever you do, do not hit any cars. Okay. Parking brake down. Are you ready? >> Are you ready? >> Okay. >> All right. Don't go too fast. We're in the driveway. >> Oh, it's moving. Oh my gosh. Oh my gosh. This thing is actually kind of fast. >> Go, go, go. I'm scared. scared. I'm scared. >> All right. Don't hit the wall. Don't hit the wall. >> We're good. Calm down. Let's go. >> All right. Go straight. Whatever you do, do not hit my car. >> All right. >> Don't hit the Mercedes, bro. All right. Slide through. Slide through. >> All right. I can't even see anything, bro. >> Bro, you got this. Don't hit the car, bro. More this way. This way. >> That's too close. Too close. What? What do you mean? What do you mean? >> Fan, be careful. >> Fan is growing so fast. He's turning 15 years old, and I feel like it was just yesterday that we celebrated his 10th birthday. I'm looking at him right now. He's driving a car. >> Don't hit my car. >> This way. It's beeping. It's beeping. I don't know what to do. >> Go straight. Go straight. I think you're good. >> We made it out. >> All right. Go. Go straight. >> Let's go. Let's go. Let's go. >> All right. We got to stop right here cuz technically by law you cannot drive past private property. So, you got to stop right here and let's swap. Are you serious, bro? Bro, trust me. We're going to have the best day of your life. >> All right, but you better drive fast. >> Oh my god. >> I got you. Let's go. >> And now Farad and I were on the way to his next special surprise. >> All right, let's go. Cut it. Got it. Got it. >> Are you sure? >> Yeah. Oh my god. >> All right, you guys. Fan's friends are about to arrive. And let me tell you, there are going to be so many of them. That's why we decided to take them to the water park in this bed. >> That's crazy. >> Fan's friends are finally here. >> Happy birthday, Fan. Happy birthday, F. >> Happy birthday, Fon. >> Are you guys ready for Fan's birthday? >> Yeah. We are going to be surprising him at the water park and he has no idea that you guys are coming. >> Yeah. >> All right, everyone. Hop in the van. Go >> for and I were on the way to the water park. But first, he wanted to stop by and get some >> McDonald's. McDonald's. McDonald's. Right there. Right there. Right there. >> Let's go. >> Let's go. >> Thank you. >> Thank you. >> Your ice cream. >> Oh my god. No. Yes. >> Andrea needs to find a way to get all the kids to listen. so she can get to the water park in time. >> All right, guys. You're gonna have assigned seats for this band. So, pay attention for your name. Okay. So, Ryder, seat number one. Jake, seat number two. >> We We don't do assigned seating. We're not at school. >> What do you mean? You guys are not going to listen to me. >> What is my mom doing right now? >> I was really hoping that Andrea was already on her way to the water park with all of Ferrron's friends. >> You need to listen to me, please. Oh my god. Stop. Stop, guys. Stop. Oh my god. No. This is terrible. Oh my god. [Music] >> Please stop. For one's birthday surprise will be ruined if Andrea cannot get to the water park in time. >> Hey, stop. Oh my god. Listen to me. >> Yo, I have a good idea. How about we go to my friend's house and show him the car? >> Oh no. For once, friend is with Andrea. And if he picks up the phone, the whole surprise will be ruined. >> No, your friend's probably busy. >> No, no, no. Let me call him at least. >> All right, you guys. We're taking off. Remain seated and don't go crazy. Please behave. >> You want to call him right now? >> Yeah, >> he's probably busy. >> No, I promise you he's never busy, >> dude. >> Wait, guys. Guys, calling. Everyone be quiet. >> Listen, listen, guys. He cannot realize that you guys are together. >> I'm I'm answer [Applause] time and answer the phone. >> Bro, just hang up. He's probably doing something. He's never busy, bro. >> Yo, what's up? >> Yo, what's up? >> Hey, are you busy right now? Can I come over? I want to show you something. >> Actually, I'm not home. I'm pretty busy. You're busy? What are you doing? Um, I have to go. Bye. >> Why would my friend just hang up on me like that? >> I don't know. He's probably busy. Let's just keep going. >> Bro, what? >> That was close. Now Fon and I are on the way to the water park. [Music] >> All right, we just arrived. Bro, where are we? You ready to do this? Let's go. Let's go. >> All right, boys. We just arrived to the water park. I need you guys to stay here. I'm going to make sure that Fan is in his bedroom and Ali is going to come back and sneak you guys off to your room. Okay. >> All right. Don't move. Okay. >> Okay. Okay. >> Now, Fanama was ready for his next surprise. We just need Andrea to arrive. >> Yo, what are we waiting for? >> We're waiting for your mom to come up. All right. Be patient. >> Mom. All right. >> Hi, guys. I'm here. >> Mom? >> Yes. >> All right. Are you ready to see your room for the night? >> Yes, I'm ready. >> All right. All right. Go ahead. Go ahead. Go ahead. I I can't see. I can't see. >> Open the door. Open the door. Open it. Push it open. Okay. Okay. >> Come on in. >> Come on in. >> All right. Take off the blindfold. >> Okay. In three, two, one. >> Might lose some battles. I get knocked down. I get back up. >> And this is the room that Fan will be staying at all night. >> Oh my gosh. >> What do you think? >> This is insane. Oh, you guys have a basketball hoop. >> Yes, sir. >> And you guys have a cake with my face on it. >> Look at that, bro. >> That's crazy. Oh my gosh. And there's so many snacks. You guys did all of this for me. >> We did all of this for you because we love you so much. We want you to have the best birthday ever. And we have more surprises coming up. >> Come here. Come here. I want to show you something. Another surprise. >> Go in this room. Go in this room. >> In this room. Gucci. Gucci. >> For once's friends were in the van getting bored. >> We're bored. What's taking so long? >> What's taking so long? >> So, I need to hurry up and bring them inside the hotel. But first, I had another special surprise for Ferrron. >> All right. So, the reason that we're here is because we're going to take you to a special indoor water park. >> But before we do that, we have another surprise from someone very special. Yep. >> All right. Let Let me see it. >> You want to see it >> from someone very special? >> Very, very special. >> All right, let me see it. >> Hey, Fon, I heard it's your 15th birthday and so I want to reach out and just say happy birthday. Your parents told me you're fans, so I just wanted to say that you guys have been crushing it. Big fan of your videos and um yeah, happy birthday, man. Hope it's an amazing day and maybe we film something together one day and we can meet in person. >> You're kidding. No way. So far, Ferran has loved all of his surprises, but the best has yet to come. >> All right, you ready for your next surprise? >> Another surprise. >> Another surprise. >> All right, bet. I'm ready. >> All right, you and your mom stay in this room. I'm going to go get the surprise ready, but stay here. All right, >> I'll be back. I'll be back. I'll be back. >> Where is he going? >> It's okay. No worries. Let's have fun. Let's go. >> All right, you guys. Let's grab the kids from the van, sneak them all the way up to their room, and then surprise birthday boy. Let's grab the boys. Let's go, boys. Come on. >> Hold on, guys. Come on, guys. Guys, guys, guys, guys, guys, guys. All right, we got to be stealth mode. You guys cannot get caught. Fun cannot see you guys. All right. >> All right, let's go to your rooms. >> Now, let's go. >> Good job. Good job. Good job. Good job. >> I want to go to the water park. >> No, it's okay. We still need to be here. Let's eat some papa. Hopefully, I'm able to bring all of Ferrron's friends up to their room without Ferrron noticing. >> Mom, why is Ali taking so long? >> I think that he's probably in the restroom. >> That way. No. No. This way. This way. This way. This way. This way. Exit. Exit. Exit. Exit. >> Are you guys ready? >> Yeah. All right. Stealth mode. >> Activated. There's a door. There's a door, guys. There's a door. >> For one's room is on this level. You guys cannot be loud. All right. >> All right. Cool. No one's going to be loud. >> All right. Do you guys promise? >> What part of not being loud was confusing? You guys cannot be loud. All right. All right. >> Cool. >> The room's right here. The room's right here. Right here. Right here. Right here. Right here. The room's right here. Right here. Right here. Right here. All right. You guys ready? >> Yeah. >> It's open. >> Now, all of Fon's friends were in the room right next to his. >> All right. I'm about to bring in Fun inside this room and we're going to surprise them. >> Yeah. But before we do that, I got each one of them custom jerseys for Fan's birthday. Let's put them on. >> Let's go. Let's go. Let's go. Let's go. Let's go. Let's go. Take her jersey. Take her jersey. >> Realize she ain't never talking lies. She just being nice. >> All right. I'm going to go grab Fon. Bring him in this room. I need you guys to hide. The moment he comes in, yell surprise. All right. >> I'll be back. I'll be back. >> All right. All right. >> All right. All right, you guys. >> Stop. Stop. Stop. >> The next surprise is ready. It's in the other room, but I need you to get blindfolded. >> Blindfolded again. >> Again. >> All right. >> Why is it blindfolded, >> bro? Wait, hold on. No, come back. Come back. We've been waiting for so long. >> For what? >> For you. Cuz you said to for us to wait here. >> I was doing stuff. >> All right, let's go. >> All right. All right. Next surprise. Come on. All right. Your next surprise is in this room. All right. >> Okay. >> Hold on. Hold on. Hold on. Let me go first. All right. Come on in. Come on in. Come on in. Come on in. Keep your blindfold on. Keep it on. All right. Hold on. Stop right there. Are you ready for your next surprise? >> I'm ready. >> Three, two, one. [Applause] Yeah. >> And Fan was about to have the best birthday party of his life with all of his friends. >> All right. We literally had the whole water park shut down for just you and your friends. >> Wait, what? You got the whole water park for me and my friends? >> Let's go. >> But but before that, who wants to get candy? >> Candy. Yeah, >> let's go. [Music] >> All right, we are at the Greywolf Lodge candy store. >> All right, the rule is simple. Whatever you guys can carry, you can take. And you guys only have 1 minute to grab whatever you want. >> One minute. >> 1 minute. The timer starts [Music] >> now. Go go go go go. What are you guys getting? What are you guys getting? >> Oh crap. >> Oh my gosh. I'm trying to get as much as I can. >> Oh my god. Go, go, go, go, go, go. >> Where's the good candy? >> Oh my god. Oh my Bro, you can't drop anything. >> I'm not going to drop anything. >> Oh my god. You guys are making a mess. >> You guys are making a mess. >> These kids are going wild, bro. Are Are you serious right now? >> What? >> You're making a mess everywhere. >> 10 9 8 7 6 5 4 3 2 1 Stop. Stop. Stop. Stop. Stop. Everyone stop. Uh you're not you're not part of the challenge. >> Why not? You say everyone can get whatever they can. You dropped. You dropped. >> You dropped everything. >> The kids made a mess and they grabbed as much candy as they could. And now it was time to head to the water park. But first, let's say hi to some fans. Oh my god. [Applause] All right. Are you guys ready for a private water park experience? >> All right. All right. You ready to come in? >> Come on. >> Step into my circle with the opposite of her. And when I pull a flying purple, people eaters could invite me. I feel the fate of hers and I just leave them on the limit. >> To test Fon and his friends unity and brotherhood, they will have to compete in five water park challenges as a team for Fon to win his final special prize. For the first challenge, Fon and his friends have to race against the lifeguards. >> Let's bring in the lifeguard. >> All right, Veron, pick two of your fastest teammates. go. Oh my god. This right here. This right here. >> If or one of his friends gets to the bottom of the water slide before the lifeguard, then they will win their first challenge. [Music] >> I got this, guys. On your mark. Get set. They got this. Far. Oh my gosh. I think we won. >> We won. We won. We won. >> For once. Team won that challenge. But the next challenge is going to be a lot more difficult. Somewhere in this area, there's a selfie stick. >> And Feron and his friends will need to find that selfie stick, stand all together in that red circle, and take a selfie. >> But you have to do all of this before the water bucket drops. >> Go find that selfie stick. >> All right, let's go. Let's go. Let's go. We're going up. >> They got to find the stick, y'all. They got to find this stick. Fane and his friends only have 30 seconds left to find that selfie stick before the bucket drops or else they lose this challenge. >> Hurry up. Find it. Find it. >> Guys, the water park is going to drop soon. >> Yo, the bucket is going to fall. Everybody's checking upstairs. It has to be downstairs. There's no way. There's no way. I can't see anything, guys. Oh my gosh. I can't see anything. I can't see anything. Where? Where? Oh. Oh, he's right there. No way. We got it. We got it, everybody. We found it, >> guys. We found it. Go, go, go. >> Now, Fun and his friends only have 15 seconds to get in that circle and take that selfie before the bucket drops. >> Hey guys, get in. Get in the circle. Hurry up. Hurry up. Hurry up. All you guys, >> everybody come back. >> Hurry up, you guys. Everyone. Everyone. You guys stay in the circle. In the circle. Hurry up, >> guys. Stay in the temple, everyone. >> Go. [Music] >> The boys completed two out of five challenges. And now it was time for challenge number three. >> Who here is good at basketball? >> Me. If one of you guys makes a shot from 40 ft away, then you guys all win together. Okay, >> you guys have 90 seconds. Only one person has to make it. Go >> guys, you have 90 seconds. Go. >> 3 2 1 go. >> All right. Go go go go. >> I got this. Oh no. >> Come on, guys. Come on. Come on. No. Go, go, go. Let's go, baby. >> If Fun and his friends lose any of their five challenges, he will not get his final special prize. >> Come on. Hurry up, you guys. We got to go. >> All right, let me try. Oh, go go go go. That's it. That's it. 10 9 go. >> Yes, you made it. For challenge number four, Fan needs to balance on the surfboard for an entire minute without falling. >> All right, let's go. >> One whole minute. >> I'm ready. >> Are you sure? >> Hey, hey, hey. You like surfing, right? >> I love surfing. >> You got this. You got this. >> You got this for one minute straight. >> All right. Go, go, go, go, go. One more chance. >> Yeah. >> One more try. One more try. This is your last chance. All right. All right. >> Rock in. >> Let's go. >> You got this. All right. I love you. >> Love you. >> Come on. Come on. You can do it. >> Fan gets one last chance to stay on the surfboard for 60 seconds in order to complete this challenge. >> There we go. >> Keep going, daddy. Keep going. Keep going. There you go. You got 20 seconds left. 6 9 8 7 6 5 4 3 2 1 [Music] >> Let's go. Let's go. >> Peran and his friends were so happy, but this last challenge was going to be the toughest one of them all. >> I hope you guys are not scared of heights, cuz we're doing the wool tail. I'm not doing that. >> Everyone's doing it. >> Fun and his friends all have to go on this ride in order for Ferrron to get his final special prize. >> Hey, you going first? >> Yeah. I don't know about this. I'm scared. >> You got this, bro. >> Thank you. Thank you. >> Hey, how you feeling? >> I'm scared, bro. >> Let's go. Let's go. Let's go. Oh my goodness. >> Crazy. You're next. You're next. You're next. >> And each one of Fon's friends went one by one. >> But Feron was getting more and more nervous. >> Oh, do I have to go? >> If you want to win that final prize, you guys all got to do it. And now Ferrron was the last person that needed to go down this slide. >> Are you ready? >> Come on. Come on. >> I really don't want to do this. >> Come on. You got this. >> Come on. You swear on. You got to cheer. >> Come on. If you do this, you get your final birthday present. Welcome. And now that Ferrar went down the slide, he will now receive his final special prize. >> Oh my goodness. All right, birthday boy. You have officially earned this. This is for you. Open it up. >> All right, help him out. Help him out, guys. Help him out. Open it. Open it. Help him out. >> My fingers. Easy. Easy. Come on. Come on. Come on. Other side. Other side. Other side. Open it. Open it. Open it. >> Open it. Open it. Open it. Open it. >> Oh my gosh. >> Oh my gosh. surfboard. >> Flip it. Hey, flip it over. Flip it over. >> Happy birthday, Royalty. We out. Peace. Royalty.",
    "start_time": 0.32,
    "end_time": 1642.039
}