{
    "video_id": "hQfESv-zDD0",
    "channel_url": "@royaltyfam",
    "transcript": "So, today I'm going to be surprising my whole entire family by taking them to the coolest, most expensive Airbnb. Let's see if the family is ready for the trip. >> You ready? I'm so excited. >> I can't wait. >> Yeah. Yeah. >> Yes. >> Man, you talked too much. Let's go already. >> So, my family is currently packing and they're super excited right now. But here's what they don't know. I will only take them to the most expensive Airbnb if and only if they can survive one hour in the tiniest, cheapest Airbnb in our city. So, I bought the nicest, most luxury Sprinter van that I can find so that when my family sees it, they won't suspect that we're going to the cheapest Airbnb first. >> All right, come out. Come out. Come out. Come out. >> Oh my goodness. Oh my gosh. Yo, this thing is massive. >> This is amazing. >> You guys want to check it out inside? >> Yeah. Can I open it? >> Open it. Can I open it? Open it. >> Open it. Open it. [Music] My gosh. Come here, guys. Come in. Come in. May go to the back. May, go to the back. Come on, Gucci. Come on. Come here. Come on, Blue. Come on, Blue. Come on, grandma. >> All right. Come on, babe. >> Everybody loved the van, but they had no idea where we were actually going. >> Yo, we have so much snacks. Oh my goodness. >> Sharon. Sharon is carrying it. Can I open it? Not yet. Not yet. For the road. Not yet. Not yet. Not yet. >> Wait. This van is amazing. We have Starlights. >> Yep. We got Starlight, ladies and gentlemen. >> That's so sick. >> That's amazing. And we have a TV. >> Hold on. Hold on. Hold up, hold up, hold up. >> Who's that? Who's that pretty girl right there? >> Me, >> bro. What? Are you seriously taking up the whole bench, >> bro? Yes, me and Gucci are taking up the whole bench. >> The kids got their drinks and snacks. >> But what my family doesn't know is that we're going to the smallest Airbnb first. >> All right, you guys, we have arrived. Are you guys ready to see the Airbnb? >> We're here. >> Let's go. Let's go. Let's go. >> Bro, I'm so excited. >> You guys ready to see the Airbnb? >> Bro, where are we? >> Well, they were about to find out. >> Hey there. How's it going? >> Hey, we're here for the Airbnb. >> Oh, nice. Well, yeah. Whenever you guys want, you can just go ahead and take your stuff and make your way to the back. Uh, we can't go to the inside. >> Oh, no, no, no. Uh, I don't know if you guys noticed, but you only paid $19 for the booking. It's actually a place around the back. >> So, you got the nicest Airbnb for $19 a night. >> I wouldn't say it's uh the nicest Airbnb. >> Uh, we're good. We're good. Yeah, it's really nice. >> Okay, thank you. Let's go to the back. >> Oh boy, my wife is going to kill me. I go through here. >> Yeah, go through the back. Right here. Okay. >> Trust me, it's really nice. Let's go. There you go. Watch your step, you guys. Watch your step. Come on in, guys. >> Uh, where are we going? >> Come on in, bro. Come on. Right here. Ta. >> It's right there, bro. Look, our Airbnb. >> Is that a dog house? >> It's so small. >> The six of us is going to spend the night in that tiny house. >> Here's the challenge, guys. I have a challenge. If we can last one hour surviving this tiny home all together, >> all six of us. >> All six of us. None of us leave. Then I will take you to the most luxurious, expensive Airbnb for several nights. Let's do it. Let's do as a family. >> I thought you were planning something. I knew. >> Okay. I knew you were planning something as well. >> But listen, I'm down. But remember, it's not six of us. It's seven. >> Oh, yeah. It's seven. >> That makes it worse. >> All right. Come on, guys. Come on in. >> Let's go check it out. This thing is small. >> Do you even fit in there? >> All right, we'll see. We'll see. It's a tight squeeze, but we'll make it. >> All right, let's go. >> Come on in. >> What do you think? >> This place is tiny. >> And then my wife started to get nervous. >> I don't even want to go in here. >> Come on. Come on. Grab it. >> It's so hot. It's so small and hot, >> you guys. All we got to do is last an hour. Come on. >> Huh? >> Wait, guys. Come on. We got this. >> Oh, man. >> Get in here. What? >> Smells bad in here. >> It smells bad in here. Did you fart? >> I I think I did fart. >> All right, come on. >> No coming inside, babe. >> Come on. You guys got to come in. Come on, Grandma. Watch your head. Watch your head. Watch your head. Come on in. Come on in. >> There you go. We're officially in here. >> Now that the family was inside the smallest Airbnb, let the complaining begin. >> So, how long do we have to stay in here for? All we got to do is last 1 hour and then we'll go to the most luxurious expensive Airbnb. We got this. >> Oh man. >> All right, you guys. Who wants to watch TV? >> Bro, that TV doesn't even work. >> What do you mean it doesn't work? >> It's duct taped to the window. >> So what? Bro, >> things were off to a bad start and Blue and Milan were already trying to leave. >> You guys got to come back in. Come back. Yo. >> Oh my goodness. Yep. I don't think the TV works. >> Maybe the TV doesn't work. Can we have a fan or AC here? It's so hot. >> Guess what? Guess what? We got a basketball hoop. I'm going to put the rim right here. >> Babe, that's not going to work. >> It's going to work. >> Just hold it, bro. >> Oh, man. >> That's what happens when you pay $19 for an Airbnb. Go for one. Go, go, >> go, go. >> You hit my head. You guys, all we got to do is make it for another 40 minutes. >> Yo, bro, I'm getting thirsty. >> I'm thirsty and I'm hungry, too. >> Wait, hold on. Hold on. >> Right behind you. The fridge. Yo, we got drinks. Let's go. Open it. Open it, babe. >> There is just one single drink and it's half of it. >> You want to go upstairs and see what's there? >> Bro, I can barely stand up. Look. >> And you want me to go upstairs? >> Bro, you got this. All right. You know what? Let's go. >> All right. Tell me what's upstairs. >> Hi. >> What? >> Hi. >> Did she say hi? >> You said hi. >> She actually likes the house. >> Bro, you should come check this out. There's something up here. >> All right, I'll go. I'll go. I'll go. I'll go. >> What's in there? What do you mean something up there? >> Uh, you guys, I might be a little bit too tall for this, but I'm going to go up. >> Hi. >> Hi. >> Come on, bro. Just go upstairs. All right, I'm going. Yo, we have a second floor, guys. We got more space. >> Okay. Well, go check it out. >> You guys should come with me. >> I'm not going up there. Come on, you guys. >> I'm going. >> You want to come? It's a little hot. Come on up, you guys. All the way up, Milan. There you go. There you go. Look, Milan. There's a bed over here. >> Too small. >> It's too small. >> Yeah. >> Oh my gosh. This is too small. >> Oh, go. It's too small, >> you guys. We got windows. We got windows. Hey. [Music] >> Oh my. It's so hot in here. >> It's super duper ultimate hot. >> I'm hungry. >> I'm thirsty. >> Oh, no. I'm hungry. >> You're hungry, too? Okay, so we need food. >> I have an idea. I have an idea. All right, go downstairs. All right, good news. I ordered food and it's on the way. And how are they going to bring it to the back? >> That's a good question, >> bro. I'm so hot. >> All right, I got you guys. Fans, here you go. >> A fan? >> Yeah, I got you, bro. >> That feels so much better. >> What about us? >> I got you, too, babe. I got you, too. Here you go. Portable fans, you guys. >> Portable fans. >> Oh, this is amazing. You want some? >> Mine doesn't work anymore. >> Oh, my bad. >> Uh, what am I supposed to do? This tiny Airbnb was starting to get really hot and I was worried that someone was going to quit soon. But luckily, >> food's here. [Applause] >> So, uh just so you know, there's a extra $25 uh food delivery fee. So, >> are you serious? >> Delivery fee? What? >> Why? >> That costs The fee costs more than the Airbnb. >> All right, we got it. We got it. We got it. Bring it in. Bring it in, guys. Bring it in. Okay, let's go. Let's go. I'm so hungry. [Music] All right, since you guys lasted for an hour in that tiny house, we're about to go to the most luxurious, coolest, expensive Airbnb in the world. >> Actually, >> yep. And this place has a special lazy river in the backyard, too. >> What? >> But this time, like, you're being serious? >> Yes. Are you serious? >> Let's go. >> Let's go. Let's go. Let's go. Let's go. All right, let's go. >> We have arrived. >> Bro, that was such a long car drive. That was like 5 hours. >> Bro, it's all going to be worth it. Trust me. Let's go, you guys. Let's go. Let's go. You ready for it? Hey, >> let's go. Let's go. But what my family doesn't know is that I have tons of surprises inside the house waiting for them. >> Wait, what? It looks amazing. >> Knock knock knock. >> Royalty family, welcome to our five-star Airbnb. Here, I got you guys some complimentary towels. Please take one. >> Everyone's got towels. Please allow me to take your luggage for you. >> Are you guys ready to go inside? >> I'm ready. Let's go. All right. Hold up. Hold on. Before we go inside, I have to tell you something. >> What? >> Yes. >> Each one of you guys has a present somewhere in the house, and you guys all have to find it. Okay? And then after that, we'll check out the backyard. >> All right. >> Let's go, go, go, go, go, go, go, go. >> As my family walked inside the house, they were so impressed. And the first thing Fang wanted to check out was the fridge. >> Oh my goodness. >> Wow. >> Yo, >> we have so much ice cream. This fridge is stacked with ice cream, drinks, juices. We got everything in there. >> That's crazy. >> Guys, guys, guys, guys. Frozen dog treats. >> We got you, Gucci. >> We got you. >> All right, let's look for the presents. >> Everyone has a present in the house. room. >> We got bunk beds, >> dude. This is crazy. >> Nicest room. >> Oh my god. >> Wait, hold on. >> How many beds are there? >> One, two, three, four, five, six, seven, eight beds in this room. >> That is crazy. >> We got a present for Mila. >> Come get your present. >> Blue present. Oh, we got Blue Emila's present right here. >> Oh my god. Let's open it. >> All right, let's see what she got. >> Open it. This is for blue. >> This is for Blue. >> Oh, a new >> Blue. You like it? >> Yeah. >> Open yours. Open yours. Here you go. >> That's a Minecraft bundle, Milan. You got toys in there. Thank you, Dad. >> I love you. All right, let's keep going. You guys keep going. Keep going. >> I'm telling you guys, these presents are amazing. >> Let's go. >> All right. >> No, this is Gucci. >> This is Gucci. >> All right. Gucci got a present. Gucci got >> Yeah, Gucci has his own bedroom. >> Gucci, we just want you to know that your family loves you so much and you deserve this present. >> Shut up and just open the present. >> Go ahead, open it. Open it for Gucci right here. Guji, here >> the toys. >> We're still missing your present and we're missing your present. And after that, we're going to check out the backyard. Check out the lazy rivers and the slide and everything. All right, present. >> Let's go. Let's go. Let's go. All right, go find your present. >> Where's your room? This is not my room. >> All right, my present. >> That's for you. with me. You're right. >> Open it. >> Arthur, you're so cute. Thank you so much. >> Hold on. Hold on. Gucci. Come on. Gucci. Wait. Wait. Wait. Wait. Wait. Wait. Wait. Wait. Wait. Wait. Wait. Wait. >> Ollie. >> In the toilet. Your present was in the toilet. >> I don't know why he's in the toilet. No, it's just for me. All right, you guys. Someone got me a present. >> I got it. I got it. Oh, you using your BMW keys. >> What? One day your BMW keys are actually going to work. >> Exactly. >> Let's go. >> Hold this. Hold this. Hold this. >> Oh, what is it? What is it? What is it? What is it? >> It says I pee in pools. Let's go. >> Bro, I don't pee in pools sometimes. >> Bro, I have to find my present. >> Well, first you got to find your room. >> Okay, come on. >> Let's go. Let's go. Let's go. >> All right. All right. Where's the room? >> It's literally right here. It has to be it. >> Are you sure? >> Open it. >> My room. My room. All right, I'm going open it. All right, open it. >> Wow. >> No. Oh my gosh. >> Wo. >> It's beautiful. >> Yo, you got the you got the set, baby. You got the set. >> Thank you. Now that everyone got their presents, are you guys ready to check out this epic one of a kind backyard? >> Let's go. >> You guys ready? >> Let's go. >> Go. Let's go. Everyone, backyard. Backyard. >> All right, you guys. At the very end, I'm going to attempt to throw my wife in the lazy river and hopefully she doesn't get too mad. Come out and see the backyard. Oh my goodness. [Music] We're about to show you some of the coolest things a backyard can possibly have. And don't forget, I'm going to be trying to push my wife inside the lazy river. >> Wow. This is crazy. >> Oh my god. Wow. Look at the lazy river. >> Yo, this place is sick. What's this? >> No. No. No. No. No. Oh my god, bro. You almost fell inside. >> Oh my god, >> it's warm. >> There's a hot tub over there. >> A hot tub. >> Hot tub and water. Oh. Oh. Oh my god. >> Oh my god. >> Okay. Yo, I almost fell in. Look at this. This hot tub fits like 20 people. >> Wow. This is amazing. >> You want to make $100? >> $100 right now. >> If you can put that ball inside the hole your first try, I'll give you 100 bucks. >> 100 bucks right now. >> Right now. And I have to jump over in order to get there. >> Yeah, you got to jump over. Go. Go. >> Three. Three. >> Do not fall. Do not fall. >> One. >> All right. All right. You're next. You're next. >> All right, you guys. If puts that ball inside the hole, I'll give him 100 bucks. By the way, IP in pools. Are you ready? >> I'm ready. >> You get one try. Make it in the hole. Give it to me. Give it to me. >> There you go. >> Look, look, look, look. If you can make a three-pointer right here on this basketball court, I'll give you back the hundred bucks. >> A three-pointer. >> Three. >> That's light work, bro. >> No. No. No. No. No. No. No. No. No. No. No. But wait. If you don't make it, you give me another hundred bucks. >> All right. This is it. I love you, Royalty fam. No. >> Give me my money. Give me my money. Give me my money. Give me my money. >> Are we serious? Now it was time to check out our very own arcade room. >> The whole arcade room is right here behind this garage. Open it. Open it. Here we go. Ladies and gentlemen, [Music] >> this place is sick. All right. Ready? I'll right here. >> Go, babe. Go, babe. Go, babe. Go, babe. >> You made it. You made it. Oh my. By mistake, though. >> Yes. >> Guys, let's go check out this room. There is room here. >> There's popcorn right here. >> Okay, >> that can only mean one thing. That can only mean one thing. Open. Open. No way. >> We got a movie theater. >> You guys, look how spacious this movie theater is. We're going to have such fun nights. >> Hey, can you bring me some popcorn, please? >> But then I found the perfect opportunity to push Andrea into the lazy river. >> Bro, come here. Come here. Come here. >> Oh, where does this go, guys? Go. >> Oh, this is crazy. Where is this going? >> Yo, >> we got slime. >> Wait, there's two of them. So, that means we can race each other. >> Should we race? >> We should race. >> Hey, should we throw your mom in the pool right now? >> Oh my god. >> Let's throw your Let's throw your mom in the pool. >> Let's do it. >> This slide is so cool. Babe, you want to get a photo? Just sit right there. I'll get you a photo. >> All right, so right here. Don't push me. Okay, >> I will. I will. >> All right, so you go there. >> All right. Oh my god. >> Oh my goodness. >> And after pushing Andrea in, it was time for all of us to get inside the lazy river. [Music] Let's go. [Music] >> Families, everything. Stay royalty. We out. Peace.",
    "start_time": 0.08,
    "end_time": 1155.0
}