{
    "video_id": "vnJMbR7bcCo",
    "channel_url": "@royaltyfam",
    "transcript": "All right, you guys. So, today I'm finally moving out on my own. Leave right now. Get out. I'm in trouble. Listen, are you sure you want to do this? Come on, man. You know I was made for this. We're going to miss you so much. All right, you guys. I got to go. This is going to be amazing. I'll see you guys. Bye. I finally got my own place to live. Roy fam, are you guys ready? John, are you ready? I'm ready. All right, cool. So, first things first, I have to bring in all the stuff that I brought with me. So, I need to go get the movers. Movers. Bring in the stuff. All right. So Fon thinks that we left, but what he doesn't know is his mom and I snuck all the way through the side of his new house. And then we entered the empty back house. And we set up a few surprises throughout the day to test for Ran and see if he's ready to leave on his own. All right, we're going to be watching him through security cameras. Are you ready? Yeah, ready. Let's do it. All right, movers, come on in. I'm so excited, you guys. Come on in. Oh my goodness. Yo, that's my clothes. Make sure to set that down nicely. Thank you. Yo, these are my bike parts. You better be careful, bro. How much stuff does he need? Keep going. Keep going. Yo yo yo yo yo yo. What are you doing, bro? What are you doing? Come on. Can you at least help him out? Yo yo yo, come over here. Can you believe that I'm finally moving out? Hey, how old are you? How old am I? Yeah. Too many questions. Come on. Keep going. Keep going. Thank you, though. So, we made a deal with Ferrron. If he can last a whole day without calling his parents, we're going to give him a fully paid trip anywhere in the world with him and his friends. You guys, you guys, it's here. My prized possession, you guys. I know it's heavy, but come on. Come on. Just bring it in. Bring it in. Wait, wait, wait. What is that? You guys have to bring this in. Oh my goodness. Of course, he brought his bike. You want your bike in the house, bro? Come on. I have the perfect spot to put it. Come on. This way. This way. This way. This way. Wait, where are they going to put that bike? I have no idea. Come on. You guys got it. Come on. Come on. Come on. Come on. There you go. You guys got to put it right here on the stand. On the stand. You want this in your living room? Yes. Perfect. Come on. What? Who puts a bike in the living room? That's kind of cool. No, I'm joking. Come on. Lift it up. Lift it up on the stand right there. Oh my goodness. Come on, you guys. Come on. Triple five. No. Okay. We thought for was done bringing in all of his items, but he forgot one last thing. Gucci. I knew it. He can't live a day without his dog. Oh my goodness. Gucci. Come on. I would never live without you. Come on. Living room, you guys. Come on. Come on. Come on. Come on. Right here. Right here. Come on. Come on. Give me my best friend. Oh, Gucci. Gucci. Okay, you guys are good to go. I appreciate everything. Thank you, guys. Oh, yeah. Yeah, my dad will pay you. You're good. You're good. Thank you. Fan thought he was living the life. He had the entire house to himself, his bike, all his boxes, and even his own kitchen. But he wasn't ready for what's about to happen. You know what? I'm kind of hungry. I'm going to go make Yo, what? Somebody's at the door. Hold on. Hold on. Would you stay right there? Did you invite somebody? No. No. Did you invite somebody? I didn't invite anybody. No, I didn't invite anybody. Who's at the door then? Are you sure you didn't invite anybody? I did not invite anybody. Did you order something from Amazon? Nope. Hello. Are you frank? Yes, I am. Mayo. Okay. Have a nice day. Thank you, sir. [Music] Check it out. Check it out. I got my very first mail. What is it? This could be anything. Think about it. This could be like a like a a thank you, a welcome in, like a a party invitation. Could be anything. Open it. Open it. Okay. Okay. Yo, I'm so excited. All right. So, here's the first surprise. So, when you move out on your own, you tend to have a lot of responsibilities. And one of those responsibilities is You're kidding me. I have to pay rent. Nobody told me rent was a thing. I have to pay $5,366.30. I don't got that type of money. Fan is starting to realize what it's like to live on his own. And it's only going to get tougher and tougher from here. So, what are you going to do? You know what I'm going to do? I'm going to call my dad and he's going to pay this rent. Trust me. Don't call because if you call, you prove to your parents that you can't handle living on your own and you lose the prize. Honestly, you saved me right there. That's actually pretty smart. And you know what it says right here? Payment due in 15 days. So what does that mean? It means you got time. I got time. We good. Fan was so close to calling us. I think that it's going to be very tough for Fan to last the whole day. All right, I'm going to start unpacking. Maybe change my clothes, invite some friends over. This is about to be insane. This box right here. Come on. What's inside this box? Hold on. All right. So, here's Fon's next surprise. So, when most people move out on their own for the very first time, they usually don't live by themselves. You guys are going to see what we're talking about. Perfect. What are you doing? Well, what do you mean? What am I doing? Who are you and what are you doing in my house? Who am I? I live here. I'm your new roommate. Well, I think you got it wrong. Actually, I live here in this house by myself. Maybe you got the wrong house number. Okay, it seems like your parents forgot to tell you that you have a roommate when you're living here. And I don't know what this mess is, but it needs to get cleaned up and into your room or I'm going to call it the landlord. Okay, a landlord is the owner of the house and the person that collects rent. But I'm sure already knows this. What is a landlord? Just get this cleaned up, guys. What am I going to do? Fan realized he had a roommate and things were about to get even worse. Royalty fam, do you guys think Fan's going to last the whole day with this strict roommate? She's almost as strict as you. Okay, so that's why we hired her. That's true. All right, this is your room. Put your stuff here. Why is it green? You are such a complainer. Y'all, I don't know how I'm going to deal with this roommate. I got to go bring all my stuff into my room. But seriously, why is he green? Not only did Fan not like his roommate, but he also wasn't too happy with his room. Can you at least help me with the rest of the boxes? No. Come on. Why is she staring him down like that? That's kind of scary. I like her. And while Feron was bringing his bike inside his new room, he saw something very unexpected. Yo, what is that? What is that? What is that? Look at her. Look at it. Look at it. Oh my gosh. We got to go. We got to go. No. Leave. We're leaving. We're leaving. We're leaving. What's going on? Why is he freaking out? I got to go. What are you doing? What are you doing? Come on. Come on. Come on. Come on. What is that? Oh my gosh. Bro, what is that? What was that? What is this? Is that not a snake? That was a snake for sure. Yo. Oh my gosh. There's a snake in the house. Did you tell someone to put a snake there? I didn't do it. Did you do it? No, I didn't tell anyone. Oh my gosh. Hey, what's wrong? Don't go into my room. Okay. There's a there's a snake. Oh, so you met my pet snake. What pet snake? You have a pet snake? Sure do. Can you please just take it out of my room? No, I'm not going to do that. Wait, I didn't know the roommate had a snake. She didn't tell me neither. Are you serious? All right, you know what? I'm going to look for a different room then. John, follow me. There's a back house. Wait, what? He's coming to the back house. Wait, he's coming. We're in the back house, you guys. He's going to see us. We got to hide. Oh my god. Where? Hold on. We got to let him know we're here. Hold on. I don't know. Hold on. Hold on. Hold on. Okay. So, where do we go? Wait. He's coming to the back house, you guys. [Music] Is he alive? No. I want to see him. You know what? I'm going to lock the house. Lock it. Lock it. Lock it. Lock it. All right. I'm pretty sure this is the back house right here. I can't deal with this roommate any longer. She's getting on my nerves. He's right there, babe. Are you serious? He's right there. He's coming. Where? Where? Behind the bush. Behind the bush. Hide. Hide. Guys, guys, we got to hide. Take a look at this. This is actually pretty nice. You guys, I hear him outside. He's trying to open the door. You locked the door for sure? I think I locked it. You seen? Yeah. I don't know. I know. What happened? It's locked. There's no way. There's no way. Yeah, it's locked. Hold on. I'm going to look around the windows. Hold on. See if there's maybe an entrance. Is there a window? Oh, perfect. Now you see Ferrari. You guys, he's by the window. Oh my god. He's trying to peek through. Is it open? No. No. Hold on. Hold on. Hold on. Check if he left. All right. I don't see him. Okay. I think we're safe. We're safe to go out. Let's go out. Let's go out. Okay. I don't think there's a way in there, to be honest. What are you going to do? I think I'm just going to have to go back inside the house and deal with this roommate. We got this, bro. Got this. All right. Come out. Come out. I just showed up. We're good. Yeah, we're good. Okay. That was close. All right, I have nowhere else to go. Please, just take the snake out of my room. You know what? I'll make you a deal. What's the deal? One sec. What does she mean by that? If you sign these house rules, I will get the snake out of your room. House rules. Keep your room clean and tidy. Make your bed daily. Don't leave clothes or belongings in shared spaces. No having parties. No having your friends over. Loyalty fam, do you think's going to sign that agreement? [Music] You have 50 different rules. Mhm. Sign it and I'll get rid of the snake. All right. You know what? Did Fan just sign an agreement to follow house rules? Yes, he just signed it. But you think that he's going to follow it? I don't know. Okay, there you go. I signed it. Now, please get rid of the snake. Thank you. I will get rid of the snake and then I need to go to work. Behave yourself while I'm gone. Wait, wait, wait, wait, wait. Before you leave, what time do you get back from work? Don't worry about it. And just like that, the roommate left to go to work and Fon was home alone. Well, well, well. So, the agreement actually states no having house parties, no having friends over. [Music] Forget the agreement. You know what's about to go down. Oh boy. Faron, whatever you thinking, do not do it. Follow the rules. Hey. Hey. All right, you guys. Oh my gosh. If Farane gets caught with his friends over, he's going to be in trouble. This is my brand new house. I finally moved out. Let's go. Wait, wait, wait. Can we see your room, though? Let's go. Let's go check out my room. All right, boys. Welcome inside my room. You guys don't sound so excited. What happened? I mean, why is it green? Okay, now you're asking too many questions, bro. Like, it's it's nice. Yo, you brought the syrup. Wait, I'm kind of hungry. Yeah, you guys hungry. You have a little food. Go, go, go, go. All right, you guys. I got the pizza. Let's go over there. Go over there. Wait, wait. What is this? I don't know. Open it up. Flip it over. Flip it over. [Music] Oh, we got doggy. Wait, is he throwing a party? I wish I was invited. I'm going to grab some some balls, bro. Yo, good, bro. [Music] Wait, did you hear that? What was that? I have no idea. Something broke. Yo, what did you do? Are you serious? Oh my god, he's in trouble. He better clean that up before his roommate comes back. This is my roommates. Who's your roommate, bro? It doesn't matter. Just help me pick it up. Like, what did you do? Oh, I didn't know you got me. Wait, who's knocking on the door? Wait, what? Yo, who's at the door? Who's at the door? Who's at? Honestly, you guys, we have no idea who's outside the door. We didn't plan this. I I don't know what it is. I can't open it. Just [ __ ] Are you the kid making all this noise? Uh, no. Wait, his neighbors. What? What did they came for? I know the owner of this house and I have already called him and he is on his way right now. Your friends need to leave. Got it. I'm sorry. You guys got to go. Where you guys going? Where you guys going? Come back. This this way. Get out. Out. Out. I'm in trouble. The neighbors said they called the owner of the house. Sir, Ron is going to be in big trouble. Yo, John, what am I supposed to do, bro? Bro, we got to clean up before the owner comes. All right. All right. Do you think we're going to have enough time? I don't know, man. We just got to hurry. All right. We have to clean all of this up before anybody comes back and realizes. Okay. Okay. All right. Come on. Come on. Hopefully Fon gets the mess cleaned up before the landlord comes home. He better hurry up. Bro, I think I regret inviting my friends over. Uh, what's that? What are you doing? Uh, look at the mess you made. What are you Who are you? I'm your landlord. What is a landlord? He's the guy that owns this house, pal. I can change a lot right now and kick you out. Now, what are you doing? Clean this place up right away. And you better call your parents, too, while you're at it. Call my parents? That's right. I want them to know everything you've done. Okay, hold on. Hold on. Hold on. No, wait. Before I can. Wait a second. Wait a second. Wait a second. The owner wants for Ron to call us. And if he does call us, Ferrron loses the challenge and he doesn't get the vacation with his friends. Listen, I just I Is there anything I can do? I just I can't call my parents. Yeah, use my phone if you're on that one, but call them right now. [Music] All right. [Music] I don't know if they're Your call has been forwarded to voicemail. The person you're trying to reach is unavailable at the time. [Music] You two talk to your son. You see, living on your own is not as easy as it looks. Where did you guys come from? Listen, one day you'll live on your own, but for now, you're with us. I love you guys. Sadly, Feron lost the challenge, but he learned a valuable lesson that he's not ready to move out on his own yet. Stay royalty. We out. Peace.",
    "start_time": 0.32,
    "end_time": 1093.7199999999998
}