{
    "video_id": "j0eiBcLNrvs",
    "channel_url": "@royaltyfam",
    "transcript": "[Music] All right, you guys. So, I'm currently at summer school, but my plan is to sneak out of here and go have fun. And my boy John right here is going to help me out. >> Yeah, but change of plans. The door that we were going to exit from is currently blocked by security guards. >> You're lying. You're lying. All right. You know what that means? We have to find a different door to escape through. Come on, follow me. >> If I want to sneak out of summer school, I need to find a door that doesn't have a security guard. >> We cannot get caught by any teachers. Come on. Come on. Come on. [Music] Look at that. Bro, it's locked. Hold on. That one's also locked. All right, we got to go find another door. Come on. As I was walking down the hallway, looking for the door to exit, I came across something unexpected. Is that a teacher? That's a teacher. Let's turn the guy. We have to hide. What are you doing? Freaking not caught. Freaking not caught. Make sure. Make sure she's gone. That was close. Now all we have to do is get past security. >> What's up you guys? So, we just got a call from Ferrron's teacher and he told us that Farang went to go use the restroom and he never came back to class, which is really weird. >> It is very odd because this morning when we dropped him off at school, everything was okay. Now, his location from his location is showing us that he's still at the school. So, I think that we should go check up on him. >> Let's do it. >> Let's do it. >> He's still there. He's still there. We have to find a way to distract him. >> What are you doing? >> Uh, >> you're not supposed to be here. >> Um, listen, listen, listen. Actually, perfect timing. I need your help >> with what? Okay, I need you to get that security guard right over there, distract him, and get him to leave. Can you just help me? >> So, I did what any other person would do. >> How about $5? >> Another $5. >> Okay, I I see the money. >> All right, you know what? $20. They need to go. Please go distract them. Get them out. >> Okay, sure. You owe me for this one. >> Okay, >> it worked. She distracted the security and now it was my time to leave the school. >> All right, we just got inside Fan's school. >> We're going to go talk to Fan's teacher and see what's really going on. >> All right, let's go. >> Let's go. Let's go. He's gone. He's gone. >> Let's go. Let's go. We're free. We're free. We're free. All right. You know where we're going? >> Where are we going? >> The mall. Let's go. >> Babe. Babe. Wait. Wait. Wait. Wait. Wait. He says that he just left the school. >> Are you serious? >> He just left the school. >> Oh my gosh. >> Wait. What? Let me call him. No. Let me call him. At this point, I need to call him. [Music] >> Why is he doing this? Where he's going right now? >> Your call has been forwarded to voice. >> All right. We got to go outside. Let's go find out where he's at. >> All right, you guys. We're finally here in front of the mall. John, what should we do first? >> I don't know. What do you want to do? >> Okay. Honestly, I think I want to go inside Pinstripes and go bowling. >> You want to go bowling first thing in the morning? Are they even open? >> Bro, come on. Why don't we just go check? Come on. Come on. Let's go. Let's go. >> There was no way that we were going to let Ferrane get away with sneaking out of school. >> Uh, track his location. >> Okay, >> let's see where he's at. We got to find him, you We're going to find him for sure. >> All right. Where's he at? Zoom in. Oh, wait. He stopped. >> Wait, wait, wait, wait, wait. >> He stopped. He's not moving. >> One second. >> Wait, that's the mall. >> He's at the mall. So, he left school to go to the mall to do what? >> Wait, I don't think he remembered that we have his location. So, let's go to the mall and find him. >> Hey, what's up? >> How you doing? Good to see you again. >> It's good to see you. All right, so look, here's the deal. I got no school today. Are you guys open? >> We're open. Kitchen's open. Bowling alley's open. Make yourself at home. >> Really? So I can go to the kitchen like grab a pizza and then go bowling. >> Absolutely. >> All right. I appreciate that. Thank you. >> How are your parents? How are your parents? >> My parents. >> We're a couple minutes away from the mall. >> I can't believe that he's doing something like this. >> My parents? Yeah. I mean, they're they're just they're they're good. They're just always busy, you know? Always always busy. That that's just how it is. >> All right, we're pulling into the mall. Is he still there? >> Yeah, he's still there. >> Yeah. >> Hurry up. >> All right. Here you go. pepperoni pizza just the way you like it. Thank you so much. That looks amazing. God, look at this pizza. That looks amazing. I'm so hungry. All right, should we go bowling? >> Let's go. >> Let's go. Let's go. Let's go. Let's go. Come on. Let's go. We just pulled up to the mall, but the mall is big. What's Fun's exact location? >> Wait, he looks like he's there at the bowling alley. >> Wait, why would he be at a bowling alley? >> I don't know. This is so weird. He's here, baby. We need to go get him. >> You sure? >> Yeah, let's go before he moves. Is it bowling alley? >> Really? All right, let's go. >> Let's go. Let's go. Let's go. >> So, I actually have to tell you guys something. My parents have my location, which means they probably know where I'm at right now. But that's okay because I like a little challenge. I want to prove to you guys that I can get away from my parents for the whole entire day. >> You ready to go inside? >> I'm ready. And I know that he's here for sure. >> Let's go inside. >> Bro, we got to hide before your parents come. What are you talking about? We got time. We can go bowling. Matter of fact, I bet you I can bowl a strike on my very first try. >> I bet you $100. $100 that you cannot bowl a strike on your very first try. >> $100. >> $100. >> $100. >> $100 right here. >> Right here. >> All right, let's go. Let's go. Let's go. >> All right. How you doing? >> Hey, how's it going? Um, have you seen our son here? He's got blonde hair. He had a white polo on, some blue shorts. >> Luckily, I was able to convince the manager to let me hide from my parents. >> No, I haven't seen him. >> No. >> Are you sure? Because his location said that he's exactly in here. >> Um, there's other uh entrances to the area. He may have come in from another level. >> We're going to look around if you don't mind. >> Yeah, that's fine. >> All right. Thank you. >> Thank you. >> All right, let's go. This is for $100 right here. I'm about to bull a strike. Are you ready? Ready. Where should we go? To the kitchen. >> The kitchen area is that way. Let's go. >> Oh my gosh, I was so close. There's literally only two pins left. >> Hey. Hey. You know how you told me to look out for your parents? >> Yeah. >> Well, they're here. >> They're what? >> Parents are downstairs. >> My parents are here. >> Yeah. >> Oh my gosh. >> Where's my 20? >> Yeah. Your your what? >> The 20 >> $20. Okay. Give me one second. I don't have $20, but I have $100 and you can keep the change. >> That'll do. >> Thank you. Thank you. Yo, >> that was my hundred. >> Okay. Well, honestly, who cares? We have to go hide. Come on. Come on. Come on. >> All right. This place is huge, but we're going to fight for Ron. >> The manager said that they're downstairs, so that means they have to be right there. Come. Come. Come. Come. Come. You got to be quiet. Got to be quiet. Okay. Come. Have to be right there. Literally right there. [Music] They're literally going to the kitchen. My gosh. Yo, >> have you guys seen a kid with blonde hair? >> No, I didn't see anything. >> No. >> No. >> All right. Thank you. >> Okay. Thank you. >> My parents were literally 20 ft away from me and they were determined to find me. You know what? I think that we should go look for him upstairs. >> Upstairs? >> Yeah. Let's go. Let's go. >> Where you going? What are we going to do? >> Babe. Babe. We're going to find him. >> We're going to find him for sure. He's here. >> Sh. Sh. This is the second floor. >> Oh my god. Just this place is huge. >> All right. The bowling alley is that way. Let's see if Faran's there. >> I think we're coming, bro. >> Far, come out. >> Babe, there's no one here. >> It says that he's here. Check your phone. >> Yeah, it says that he's here. >> You know what? I'm going to go check around the pins. >> Baby, he's not going to be there. >> He might be hiding there. >> Oh my god. Are you serious? >> Get down. Get down. Get down. They're checking the pins. Get down. >> You never know. >> Oh my god. He might be hiding somewhere here. Yo, we got to go. >> Wait, did you hear that? Wait, I think I saw him. Where' he go? Run. Let's run. Hey, be careful. Don't run. Don't slip. No. No. Where's Where's Where's Where do we go? >> Where did he go? >> This is our own way out. Come on. Come on. Come on. >> He's probably hiding somewhere here. Hold on. Hold on. Hold on. >> Hold on. Let's open this door right here. No. All right. Keep going. Keep going. >> Hurry, hurry, babe. Hurry, hurry. >> All right, there's an exit route right here. Maybe he left. >> Okay, so why is he trying to escape from us? >> I don't know. Let's go find him. >> Oh my gosh, that was way too close. We got to go home. I forgot to grab something. >> Home? That's the worst place you can go. You're going to get caught for sure. >> No, no, no. Trust me, I'm not going to get caught. As long as we get there first, we're not going to get caught. Come on. We got to go. We got to go. We just got in the car. For one, left the mall for some reason. But we got to find him. Babe, where is he at? >> All right. So, 1 second. One second. Wait. It's refreshing right now. >> Is he on the move? >> All right. So, yeah. Babe, he's on the move. And it says that he might be like like a like a mile away from here. >> Wait. I know exactly where he's at. But he's moving, you guys. >> Wait. So, so then we had to go. We had to go. Let's follow him. >> Let's go. Fon, we're going to find you. >> All right, guys. We're finally at the house. Now I need to grab that item that I said I forgot. Let's go. Why is it open? Gucci, what's up, buddy? What's up, Gucci? I miss you so much. Say what's up to the royalty family. What's up, guys? Hey, my grandma is here. My grandma is here. I don't have school. She asked me why. Why am I home from school so early? I don't have school. No school. No school. >> I just pulled over and we have an update. Andrea is saying that Feron went home, which doesn't make any sense. >> He knows that we know his location. That's why he want us to follow him home because he's planning something for sure. >> Yep. >> We're about to catch him. >> While we're here, I'm going to go ahead and grab my favorite. Nice. We got a popsicle. Okay. I need to find my wallet. This is going to be very important for the rest of the day. So, we can go shopping. Come on. Come on. >> All right, we're pulling in. I don't see any other cars. >> No, but I know that he's inside the house. >> Honestly, I'm tired of chasing Ferran. So, we got to catch him right now. Okay, >> we got this. >> We got this. >> Bro, you got to hurry up. Your parents are going to come any minute. >> Bro, come on. We're good. Just Just let me focus and find my wallet. Okay. >> Right. Wait. It's locked. It's locked. >> It was literally right here. It was on my desk. >> Oh my god. >> That's the wrong code. >> Wait. >> You got to hurry up, bro. >> Yo, you are stressing me out to the max right now. Okay, >> you're stressing me out. >> Okay, hold on. Hold on. My drawer broke. This is not a good time. Oh my gosh. You kidding me? Okay. Okay. Okay, babe. Just relax. >> Where's my wallet? Where's my wallet? Okay. Okay. Um, where's my wallet? Where's my wallet? Well, I literally always leave it here. Come on. Oh. Oh. Oh. Oh. Oh. My baby is right here. Okay, perfect. We're going now. We can leave the house >> before they come. Yes. >> What happened? >> Oh my gosh. Oh my gosh. Look. >> Your parents. Of course it's my parents, bro. What do we do? Let's go back upstairs. Are you crazy? If we go back upstairs, we're going to be trapped. Where do we go? Where do we go? This is bad. Follow me. Follow me. Fall. Hey, what do I do? Hide. Obviously. Right there. Right there. Right there. Right there. Right there. >> Here. Hurry. Okay, I'm hiding here. I'm going to hide here. Behind you. >> Let's go. Let's go. >> Close the door. Lock it. Walk. Walk. Okay. Ready. We have to stay really quiet. He's literally right there. >> Veran. >> Veron. >> Fan. >> We know you're home, buddy. >> Yes, we know your location. >> You're not funny. >> Stop playing games. Fun. We know your location. We know you're here. >> Fun. Come on. Stop. >> Okay. The pantry. >> Huh? >> We're sure he's hiding in the pantry. >> All right. Check the >> Check the pantry. Maybe he's hiding inside there. >> Nope. Where are you at? >> Check his location again. Is he still at home? >> Yeah, he's home. He's still at home. >> All right, we're going to find you. Wait, hold on. Garage. Garage. Garage. Garage. Garage. Garage. >> Oh my gosh. They're in the garage right now. I don't know what to do. How are we going to escape? Should we escape now? >> No. No. No. We have to wait for them to go upstairs. Open the garage. Open the garage. All right. Bye. >> Hello. >> He's not here. >> He's not here. >> Open the sauna. Open the sauna. Open the sauna. >> Okay. Okay, he's not here. >> Movie theater. Movie theater. >> Movie theater. >> Let's go to the movie theater. >> Movie theater. The movie theater. They're coming to the movie theater. Okay. >> We know Fun's in the house. It's only a matter of time until we find him. >> Where are you? >> We're about to catch you. >> Go, go, go. Two. One. >> We got you. Hey, Pan. Fun. Fun. Babe, let's go to Faron's bedroom. Maybe he's upstairs. Okay, let's go. Let's go. Let's go. Let's go. Go. >> They're going to my bedroom. We have to go. We have to go. >> Hello, >> Pon. All right. Open Fun's closet. He might be in there. >> All right. 3 2 1. >> Got you. >> Should I say bye? Should I say bye? >> No. >> Bye, Mom. Bye, Dad. >> Wait, what? That was Veron. >> Yeah, he's outside. >> We're out. Go. Go. Go. Go. Go. Go. >> He's down here somewhere. >> I heard him say bye. >> Go, go. [Music] [Music] Crazy, bro. >> Do you think they heard me? >> Yeah, for sure. >> Oh, he's gone. All right, we got to hurry up and follow him. He left again. >> You know something about this plan, right? I know that you've been planning this with him. >> Are you serious right now? >> Yeah, I'm so serious. This is so strange. >> Babe, I literally have no idea what he's doing. >> Baby, he just left and he told us bye. >> Okay, babe. Let's go track him. We're going to find him. >> Oh my gosh. >> She thinks that I have something to do with this, >> bro. Oh my gosh, that was so funny. All right, we got to go shopping. All right, you got to take me to Best Buy because I want to get the brand new Switch 2. >> Okay, let's go. >> Let's go. Let's go. Let's go. Let's go. All right, we're in the car right now. Fun can't be that far away from us, so we're going to chase him. >> Okay, let's go. Let's go. Start driving faster cuz you're too slow. >> What are you talking about? >> Let's go. >> We're going to catch him. Don't worry. >> All right, you guys. We're here at Best Buy. I'm going to go inside and buy the brand new Switch 2. And John, you're going to stay right here. Stay put. Make sure to keep an eye out for my parents. >> Okay. >> You good? >> Got it. >> We're about to catch him. >> Yeah. And when we catch him, he's going to be in big trouble because this is not nice. This is not a joke. >> I'll be right back. >> Be safe, bro. >> I will. >> I think we're in the right place. >> Oh my gosh. Are you skipping school or what? >> Uh, no, no, no. Listen, trust me. I'm not skipping school. Matter of fact, uh, my teacher can explain what's happening. >> All right, we're going back to your school. We're going to talk to your teacher right now. >> Let's go. Let's go. >> Okay, >> let's go. >> We were going to find out exactly what's going on when we take Ferrron back to school. >> All right, call your teacher out. >> You call her out. >> You call her out. >> You call her out. You're the one skipping school. >> Yeah, call her out. Come on. >> Oh, hey guys. What's going on? Um, so Feron apparently skipped school today and he said that we should ask you why. >> Oh, about that. Fun finished all of his assignments this week, so we decided he didn't have to come in the class today. >> Okay. >> Just a little bit of a prank. >> A prank? >> Happy summer. >> Okay. Wait, so your teacher and you just pranked us? >> Yep, exactly. Stay with me. We have peace. >> Are you serious? >> Oh my god. Loyalty. [Music]",
    "start_time": 1.28,
    "end_time": 1170.499
}