{
    "video_id": "49OSWOITnNA",
    "channel_url": "@royaltyfam",
    "transcript": "All right, this is going to sound crazy, but my family and I might just be moving to Hawaii. So, my family is currently packing for our vacation to Hawaii right now, and we've been going to Hawaii the last couple of years, and they really love it out there. But this year, I'm thinking about doing something different. While we're on vacation out there, I'm thinking about buying this beautiful house and moving out the whole entire family to Hawaii. Only problem is I got to get the whole family to agree to this. Especially my wife, who usually does not like my ideas. >> No. Are you serious? What is this? >> I'm not approving this. >> Now, let's go check up on my son who's about to get his haircut for our vacation. >> Yo. >> Yo, what's up? What's up? >> You about to get a haircut? >> Yeah, I'm about to get a haircut. >> Hey, since we're going to Hawaii, you should switch up your hairstyle. You got to cut it short, >> bro. What do you What do you mean? I'm not cutting it short. >> Short? Come on. Cut your hair short, >> bro. No, I'm >> Bro, it will look so good on you. I promise you. >> No, it wouldn't. >> I think it should. >> Gucci, should he cut it short? >> Just cut it, Fon. Stop being a baby. >> You know what? Right here. Here's the clippers. Cut off the hair. >> Wait, wait, wait. It might cut it too short. >> It's all good, bro. >> Bro, what do you mean it's all good? This is going to cut it so short, >> bro. We're going to Hawaii. New style. New you. Come on, >> bro. There's no way, bro. >> All right. Rock, paper, scissors. If I win, you cut it short. If you win, you cut it your way. >> Rock, paper, scissors, shoot. Rock, paper, scissors, shoot. Rock, paper, scissors, shoot. >> Royalty fam, like this video right now cuz I do not want to cut my hair short. >> Just do it. >> Are you ready? I'm going. I'm going. Go. Go. Go. Go. Go. We're finally cutting his hair shorter. >> There's no way I'm doing this right now, bro. Alan, finish the job. >> Let's go. [Music] Got a struggle. Yeah, you can feel the >> bro. I love it. I actually love it. >> Bro, you look so good. >> Thanks, bro. >> And before I tell my wife about moving out to Hawaii, let's see what my son thinks about it. >> Yo. >> Yo, >> what were you dancing? >> I was dancing low key. >> Hey, bro. Your hair looks sick. >> Thanks, bro. You like it? >> Aren't you happy you cut it? >> Low key? Yeah. I like it, >> bro. I can see your forehead. >> I know, bro. >> Hey, quick question. What are those, bro? Seriously, did you buy them off Tik Tok? >> All right. Are you excited for Hawaii? >> I'm so excited for Hawaii. >> All right. I got something to tell you. >> Okay. What? >> I got something to tell you. >> Okay. Tell me. >> Can we come out of your closet? >> I'm good. >> Why are we in there? >> Stay. Come on. Tell me. >> All right. I'm thinking about buying a home in Hawaii and moving out there like all of us. >> You're lying. >> No, I'm serious. >> You're trolling. How much do you love Hawaii? >> Bro, I love Hawaii and you want to move there. >> You would do it? >> Of course I would do it, >> bro. It would be so sick. Here, this is the house that I want to buy. >> This thing is like in the middle of the jungle and it has its own waterfall, >> bro. It has its own waterfall. It's sick. >> Oh my gosh, dude. This is massive. >> My son was already in love with the house, but we had one little problem. The only problem is we got to convince your mom. That's going to be the hard part. >> We're moving to Hawaii. Let's go, >> bro. We're moving to Hawaii. >> Bro, relax. I said we got to convince your mom. It's not going to be that easy. We have to take her to Hawaii, show her the house, and try to convince her over there. All right. Wish me luck. >> Wish you all the luck in the world. >> By the way, we're going first class to Hawaii. And I got a special surprise. Once you get to your seat, I got you a special gift. All right. >> Special gift. >> You're going to have to wait. All right. >> All right. Bet. >> I'm going to go check up on your mom. >> All right, you guys. Let's go check up on Andrea and kind of talk about the idea of me buying a house in Hawaii and see what she says. And uh if it doesn't work out, I got a present. Sweeten things up a little bit. Babe. Babe. Babe. Babe. I got to do something real quick. You guys, hold up. Hold up. All right, I'm going old school. Good morning, my neighbors. >> Shut up, >> babe. >> Yep. >> Hi. >> Hi. >> Are you packing? >> Yes. I'm so excited. This is the third year in a row that we're going back to Hawaii. >> We're going to have so much fun. >> I know. >> Um, I got you a little present. >> Really? >> Yeah. >> Oh my gosh. >> Cuz I love you so much. >> Oh, I love you, too. By the way, I was thinking the other day, wouldn't it be cool if we just one day live in Hawaii or like retire there cuz we love it so much. >> Really? >> I never thought about it to be honest. >> Well, convincing Andrea to move all the way to Hawaii is going to be harder than I expected, but I got this. >> It was just a thought. Anyways, um >> can I open it? >> Yeah. Yeah. >> Oh, baby, you're so sweet. [Music] Wait. >> Andrea's been wanting this for so long. >> You got me a loou. >> It's not a laf fufu. It's a labubuoo. >> Okay. >> All right. Open it. Open it. >> Oh my god. I'm excited. I'm excited. [Music] >> Thank you, babe. I love you. >> By the way, this is going to be your best Hawaii trip ever cuz over there I have a special surprise for you. >> Really? Oh my gosh. >> That's all I can say. >> Okay. Hey, I can't wait. >> All right, keep packing. >> I love you, babe. >> You guys, we got to get her to agree to letting me buy that house in Hawaii. >> Now, let's go check up on the kids. >> Hey guys. Hi. >> Are you guys ready for Hawaii? >> Yeah. >> Yeah. >> You guys are packing? >> Yeah. >> Do you guys want to live in Hawaii one day? >> Yeah. >> Yeah. You want to live in Hawaii one day? >> Yeah. >> I'm going to try my best to make it happen. Okay. Okay. >> Wish me luck. Wish me luck. Wish me luck. Wish me luck. >> I love you, daddy. I love you. Da >> Gucci. Do you want to live in Hawaii? >> Man, just shut up for a second. >> Whatever, bro. All right, you guys. Everyone in the house seems like they want to move to Hawaii, except my wife, Andrea. But hopefully once she sees this beautiful home, she'll change her mind. >> All right, you guys. It's currently 4:01. You ready to go? >> I'm ready to go. >> You two going to miss you. Okay. >> We love you so much. One of the hardest parts about traveling is leaving Gucci behind. But we'll be back soon. All right. Gucci. >> All right. You ready to head to the airport? Let's go. >> Let's go. >> All right, you guys. Even though it's so early, we still need snacks for the plane. >> I want snacks, too. >> You want snacks, too? >> All right, you can get $100 worth of snacks. Let's go. >> And if my son spends more than $100, he's going to have to pay for the rest. >> All right, let the family shop. All right, I found all the candy. Let's go. Let's go. Let's go. Let's go, bro. Grab them. Grab them. >> There you go. There you go. >> Pacios. Look what I see. >> Taki. Babe, you're about to have the best trip to Hawaii in your life. >> I know. I know. I can't wait for that. >> Yo, I want to get some chocolate milk. >> Chocolate milk, bro. >> Chocolate milk. This >> right now? >> Yes. >> Okay, so I'm going to get gummy bears. Uh, M&M's >> chicken Caesar wrap. This sounds so good. >> Uh, what else? What else? Oh, sour heads. >> Woo! They got gummies. >> These are so good. And these soup. Perfect. And you know what else I need? >> Gum. Oh, bro. Bro, bro, you're dropping stuff. Chill, >> bro. I didn't say buy the whole store, >> bro. Trust me. I'm going to eat all of this. >> I'm going to eat all of this. >> All of this on the airplane. >> All of it, bro. Trust. >> All right, that's a lot of stuff. >> Now, let's see if Fon spent more than $100. >> Bro, I said $100, not 122. >> Bro, you got it. >> Bro, you owe me 22. >> You got it. I guess I got it. The whole family was excited for our vacation to Hawaii. And now it was time to board the flight. >> You ready, boys? >> Let's go, bro. >> Let's go, baby. Hey, hey, hey. All right. Your mom's about to come, but we got to convince her to let us buy that house in Hawaii. All right, >> bro. She's going to say yes. >> You think so? >> Let's go. >> All right. Hey, you ready for your first class seats? >> Let's go. Go, go, go, go, go, go, go, go, go. >> Yo, this is so nice, bro. Oh, getting comfortable. >> Get comfortable in here. I'm going to take a nice nap. Look at this. >> Before you take a nap, I have a special present for you. >> All right, bet. >> You ready for your present? >> Thanks, bro. >> All right, open it. Open it, bro. >> I hope you like it. >> What is this? >> This is going to come so handy for the airplane. >> Yo, this is the brand new Nintendo Switch. That's a Nintendo Switch 2 for you to use in the airplane. >> I love you. >> I love you, too. >> And after a 5hour flight, we finally landed in Hawaii. >> We're in Hawaii, baby. Let's go. >> All right. So, somebody just gave this to Fan >> and he reminded me of Gucci. >> This is Fon and Gucci, apparently. >> I'm so fired. Aloha. >> Hop in, baby. >> Where do I sit? Say wherever you want. >> Let's go, Mila. Let's go, Blue. >> Go, go, go, go, go, go. Come on. Come on, Blue. Come on, Grandma. Hop in. >> Come with >> All right, babe. Are you ready to go to the hotel? >> Yes. I'm so excited. >> But what my wife doesn't know is that we're heading to the house that I'm planning to buy. >> I'm so ready. I love Hawaii. I love the hotel. And I'm so excited to be here. [Music] All right, we're almost at our destination. >> Andrea was starting to worry about where we're heading. >> Yo, we're in the jungle. >> Wait, this is the middle of nowhere. Where are we? >> We're taking a different route this time. >> Why? >> We're almost there, ladies and gentlemen. So, this is the entrance to our location. >> Babe, where are we? We're not staying at the hotel tonight. >> Why? >> We're not checking into our usual hotel today cuz they're all sold out. So, I decided to get a house for a night that you're going to love and we're all going to love it. >> All right, stay here. Let me go outside. Make sure the house is ready and I'll come get you guys. Okay, just stay here. Stay here. Stay here. Stay here. Hold on. >> Andrea was worried about what was going on, but my friend Spencer here was going to help us show Andrea our dream home. Spencer, what's up? >> Ali. All right, you guys. This is my boy Spencer who lives in Maui. The house that we're about to see that's for sale actually belongs to his friend Spencer. The goal for today is to make sure Andrea falls in love with the house so much that we can convince her to buy the house. That way me and the family can live in Maui for 6 months out of the year and just enjoy life. What do you think? >> I think that should be no issue at all. >> You think so? >> Mhm. >> It's a beautiful, beautiful location. >> All right, bro. Let's see what happens. >> All right, let's go. >> Let's go. Let's go, Mom. >> All right, come on in, guys. But where are we going? >> We're going to tour the house real quick. >> Why? Oh my gosh. This is so weird. Why you didn't tell me this before? >> Babe, just come on. Come see the house. We're staying here tonight >> in the middle of nowhere. >> Yes. That's what's beautiful about it. All right. Right there is the front door entrance. Are you guys ready to go inside? >> No. >> Oh my gosh. Yo, look at this. >> Oh, look. >> What are those? Are those lizards? >> No, they're geckos. >> Those are geckos. Look. Look at that one eating the banana. Oh my god. You guys are going to love this house cuz it feels so private. You get the feeling of so much nature and you're in the middle of nowhere and you get to relax and just be so calm. >> Okay. So, you're trying to convince me to stay here. >> Actually, I'm trying to convince her to live here with me. All right. All right. Open the front door. Come on in. Come on in. [Music] Wa! Yo, there's a hammock and a surfboard. >> Oh my Oh my god. Surfboard for you, >> babe. Try out the hammock. >> Go ahead. Lay inside. Lay inside. >> Okay. I never slept in a hammock. >> Wow. >> Look how beautiful that is. >> Is it comfortable? And look, look, look. >> It's so No. Like Bobby. >> Daddy, there's a fan. >> What? >> There's a fan. >> Oh no, you guys. I hate fans. I hate Hey, turn it off. Turn it off. You guys, I have a fear of ceiling fans. No, stop. Stop. Turn it off. Turn it off. Turn it off. >> Bro, look at me and Blue. We're just chilling. >> You guys are living the life. We're about to fall asleep. >> Okay. Can I chill with you? >> You too. Oh my gosh. >> This is the kitchen. This is the living room. >> Wait, I have a question. Why are there pictures of our family here? >> I thought it would be a nice touch for you to stay here one night. >> Oh, that's nice. That's cute. I've set up tons of things throughout the house to make Andrea fall in love with it. It's >> pretty cool. I like this. And look at this view. Look at this view. >> Gorgeous. >> Wow. >> All right, guys. Let's go downstairs. The cool stuff is downstairs. Let's go. Watch your step, guys. Watch your step. >> What is this? >> Uh-oh. This might be your gaming room set up. >> A gaming room. >> No, this is like a music room. >> This could be a music room or a gaming room. Are you more of a musician or a gamer? >> Gamer. >> Hold on. Sing something. Hold on. Let me hear your voice. Yo, we in Hawaii with Milan, Feron, Andrea, and Ali, and Blue and we're about to go go in the pool and we're about to have fun and we're about to go and jump. >> All right, stick to gaming. >> Yeah, you're right. >> But first, I had a very important question for Andrea. >> So, do you like the house so far? >> Yes, I like it so far. >> All right, there's more to see. Wait till you see the master bedroom. It is so gorgeous. >> Okay. >> All right. Keep going. Keep going. >> Hey, hey, hey. >> Uh, give us a second. Why? >> Just give us a second. >> Why? >> Just give us a second. >> All right. All right. I think we're good. >> You think we're good? >> I think we're good. >> You think she loves the house enough that she'll let us buy it? >> Yeah. >> You think so? >> Yeah. >> All right. We'll find out. >> Let's go. >> What were you doing? >> Oh, for we were just talk uh we were talking about surfing. Surfing. >> Oh, yeah. >> See? Surfing. Surfing. >> Okay. Are you guys planning on something? >> Yeah, we're planning on surfing. >> Yeah. >> Yeah. >> Okay. Daddy, there's a fan. >> Can you stop scaring me with fans? >> Honestly, I kind of like this room. I want this room to be mine. >> No. No. Your room is all the way up there. You have a special room, right? >> What? >> Wait, wait. There are more pictures of our family here. >> Yep. >> Oh my gosh. >> Look, that's you. >> Give her a kiss. Give your sister a kiss. [Music] >> I'm trying to look at you in the picture. Real life photo. Real life photo. Don't you feel like you're at home? >> Yes. It feels like we're at home. It smells like home. I love the candles. >> All right, let's show for his room. Come up. All right. All the way up. All the way up his room. >> By the way, by the way, guys, by the way, I just want to tell you guys this property has its own waterfall. >> Yo, what? >> Its own private waterfall. >> I want to see the waterfall. >> Yeah. I'll show it to you guys later. Fun. Do you want to jump that waterfall? >> Jump the waterfall. Are we serious? It's pretty high, >> bro. Yeah, I'm down. >> Are you sure? >> Yes. >> All right, go up. >> Oh my god. >> What's up there? What's up there? >> Yo, guys, come on. Come here. >> Oh, no way. >> Hold on. Wait for me. Wait for me. >> Yo, >> I got to watch my head. You got it. >> Hold on. You got it. Wait for me. >> Yo, this is a cool spot, >> bro. Look what I found. >> A you and your dog Gucci. >> Man, Gucci. Oh, I miss Gucci. >> I know. >> Imagine he was here. >> Gucci, we're going to miss you. Okay. We love you so much. >> All right, let's go see the master bedroom. >> Master bedroom. Let's go. >> And then we'll check out the waterfall. >> All right, let's go. >> We got to watch our step going down. >> Look, my mom's sleeping. >> Andrea, are you taking a nap? >> Guys, this is so relaxing. >> All right, watch your step, you guys. All right, master bedroom. >> Let's go. >> Master bedroom. >> Master bedroom. >> Master bedroom. >> Let's go. Let's go. >> You guys, I think Andrea likes the house so far. Hopefully, she likes it enough that she'll allow us to buy it. Are you ready to see the master bedroom? >> Let's go. It's all the way down here. All right, watch out. >> Yo, this is a cool entrance. >> Wow. >> Isn't it cool? >> Wait, what? Look at that view. >> I know. Crazy. >> That means that I'm going to wake up and the first thing that I'm going to see is this beautiful view. >> Yep. The bed's right here and the view is literally right in front of you. You have like four or five windows. Yo, come check out the bathroom. Oh my gosh. Oh my god, look at this shower. >> Look, you can take a shower right here and just check out the view outside. This is so beautiful. >> So beautiful. I love it. >> All right, I got one more surprise. >> No >> surprise. >> One more surprise. >> One last surprise. >> No. What is it? >> So, I have a special present somewhere in the jungle. Maybe inside the waterfall. You guys got to go find it. It's really important. Trust me. >> Wait, wait. Is this surprise just for me or for everyone? >> It's for everyone as a family. Let's go, guys. Let's go to the waterfall. Waterfall. Hey, hey, hey. I'm telling you. I'm telling you, this waterfall is sick. Let's go. >> Let's go. >> All right, y'all. Let's check out this waterfall and give them that final surprise. Trust me, you're going to want to see her reaction. >> Now, my friend Spencer was going to take us to the house's private waterfall. >> All right, this is the route. This is going to take us to the magical waterfall where you're going to find your gift as well. >> All right, man. Let's go. >> Let's go, you guys. Let's go. Take us. Let's go. Let's go. Bro, you better jump that waterfall, bro. >> I am, bro. >> Let's go, guys. Let's go. Let's go. Let's go. >> What is the gift? >> You're going to see the gift. All right, just come down. >> Am I going to like it? >> Yep. Yep. Come on. Come on, Grandma. Come on. >> Let's go. Let's go. >> Come on down. >> Yo, come on. Hurry up. Let's go. >> I'm coming, bro. Yo, Spencer, where's the waterfall? >> Right around the corner, bro. Let's go. It's We're close. We're close. >> Yo, F. Show me those games, bro. Let me see those games, baby. >> And finally, after walking through the jungle for 20 minutes, we arrived to the private waterfall. >> All right, you guys. We're here. Yo, this is high, bro. >> Hey, the present is in a box in the orange color. You got to jump down there and go get that present for your mom. All right, >> let's go. Let's do this. >> Spencer, go. You go first. Show Farun how done. >> All right, let's go. >> I'm ready. >> 3 2 1. Oh my god. Yo, that was crazy. He was in the air for so long. >> Hey, Fon, once you jump in, you got to get that orange box and take it to your mom so she can see her surprise. All right. All right, bet. >> Pretty high, bro. Let's go. [Music] >> Easy, easy. This is all you for. You got this. >> Nervous, bro. >> You've already done it before. [Music] >> Three, two, >> one. Let's go. Get it. Get it. There you go. Bring it. Bring it. >> Now, Fan was about to give his mom the big present. All right. Now, it's time to open this box and see what your surprise is. Let's open it. See? >> Open it. Open it. All right. Open the box. How do I open it? >> Open it. Oh, right here. Right here. Right here. Okay. >> Open it. Open it. >> And this was the moment that we've all waited for. >> Wait, what? Keys of a home? >> Yeah. >> What does that mean? >> There are keys to a home. >> What home? What house? >> All right. Open the letter. Open the letter. Open the letter. >> Read the letter. >> Read the letter, babe. Just read the letter. >> You guys are making me nervous. >> Just read the letter. It's going to make sense. >> Okay. One second. All right. This key is for something very special. It's for a new house in Hawaii. A house I hope we can call home. I know we made a beautiful life in California, but every time we come to Hawaii, something magical happens. We laugh more and we are together in a way that feels extra special. It is a place that feels like us. I want you to hold these keys and imagine what life could be in a place that already holds so many of our best memories. I love you. I love our family and I believe they could be the start of something even more wonderful. An amazing life of living in Hawaii. Oh my god, you guys. >> What do you think, babe? I was thinking about potentially buying that home and we can spend more time in Hawaii together as a family since we love it here so much. >> Yeah, Mom. What do you think, >> guys? Uh that was very thoughtful from you, but to be honest, I don't think that we are ready to make a change like this. Um >> no, >> no, >> not even for 6 months out of the year. >> No, I don't think that right now we are able to do that. Maybe in a couple of years, but not right now. Oh, thank you so much. It was very helpful. I love it. >> Are you sure? >> I'm sure. >> Sadly, we didn't get the house, but we still managed to have the best time as a family in Hawaii. >> We'll be royalty as we dream. [Music] >> We love you, Hawaii.",
    "start_time": 0.4,
    "end_time": 1392.6399999999999
}