{
    "video_id": "MFPdyn_Xisk",
    "channel_url": "@royaltyfam",
    "transcript": "Back up, freshman. >> You want to skip class today? >> Why'd you pull the fire alone? >> What you going to do, freshman? >> Oh my god. Dude, the first day of high school is crazy. Get >> back here. >> All right, the bus just pulled up. Let's do this. >> Yo, get out the way. >> Yo, chill. >> What kind of freaking haircut is this? >> You don't like my hair? >> No. >> Oh my god. >> Out the way, twerp. Oh my goodness. Fan has been going to a smaller school for the last couple of years, but for high school, he wants to go to a bigger school with all his friends, >> which is why we're going to put him to the test. So, we've set up the toughest first day of high school for Feron. And if he can survive the whole day, then he proves to us that he's ready for a big school. >> But if he doesn't, he has to go to a small school. >> Watch out, guys. Guys, guys, what are we serious? Yo, what is up with everybody? Bro, move. What? Oh my gosh. All right, y'all. High school might be tougher than I expected. All right, Ferrron's first obstacle is right down the hall. >> And you guys are going to be able to see everything on the security cameras that we set up throughout the whole entire school. >> All right, let's see how he does. >> Let's go. >> Hold on. >> All right, let me see this real quick. Let me see this real quick. Okay, pick that up. Pick it up. There's a kid getting bullied right now. >> So, one of the biggest obstacles to overcome in high school is bullying. >> So, we set up this scenario to see how Fan is going to handle it. >> All right, let's find out, >> bro. So, where's my lunch money at, bro? You got it. Where is it at? Where is your backpack? All right, let's get that backpack off. >> All right, listen. I'm going to mind my own business. I'm going to keep walking straight. Okay, try not to get involved. Okay, >> it's not it. It's not It's not money. Come on. Look for it. >> All right. Fun's walking by the bully right now. What's he going to do? >> Not here, bro. What are you telling me? Where's Where's it going to be then, bro? Get out of here, bro. What you looking at? >> Wait. I think that he's just going to ignore the bully. >> You think so? >> All right, you guys. I think I'm going to go help out that kid that's getting bullied. Wish me luck. >> Got that from you. All right, >> you guys. He's going back and approaching the bully. Yo, bro. Do you need any help? >> Bro, chill out. He don't need help. I'll tell you if he needs help. Okay, >> bro. But like, why are you bullying him? >> I'm not bullying nobody. He has my lunch money and he needs to do my homework. Who are you talking to? >> You. Of course you. >> You got lunch money for me, too? >> No, bro. I'm not giving you anything. He's not giving you anything either. Why are you bullying? >> Give me lunch money. >> No, he isn't. >> What are you going to do about it, bro? >> What am I going to do about it? What are you going to do about it? What I'm going to do about it? >> Okay, go ahead and show me that. What are you going to do about it? >> I run this school. Okay. No, you don't. What are you going to do with water? No. Are we serious? >> Well, at least you're good, right? So, unfortunately, Ferrron failed his very first challenge of the day. >> What he should have done was to call an adult to help because you never know what's going to happen in these situations. >> And if Ferrron fails three challenges throughout the whole day, then he proves to us that he's not ready to attend a big high school. You know, I tried helping that kid. But maybe I should have just minded my own business. And now that I'm wet, I got to go to the bathroom, dry up, and I know I'm definitely late for my first class. All right, you guys. I'm going to history class. Let's go. It's right here. Oh, they're already in class. >> Hey guys, >> everybody, quiet down. For this challenge, we're going to test Fun's ability to focus and not get distracted. >> And that's why we brought two of his best friends to distract him. >> And if the teacher tells Fun to stop talking three times, >> stop talking. >> Then he loses this challenge as well. Fun, lock in, and please stop talking. >> Please don't talk. >> All right, everybody. Welcome to US history. We're going to start with World War II. Everyone has their out. >> Oh my gosh. Yo, what are you guys doing here? >> What are you guys doing here? >> Why is his friend wearing the same shirt as Fon? >> Seriously, >> bro. How did you guys get here? Like, what are you guys doing, bro? >> Fun, just stop talking. >> Bro, yes, you have to come over here. Let's go, bro. >> All right, the teacher's getting mad. >> What are you guys doing, bro? Run, stop talking. >> Okay, my fault. >> Oh my gosh, he's so easily distracted. >> Do you think he's going to keep talking to his friends? >> I have no idea. But if he does, he's going to end up failing this challenge. >> Can anyone tell me that? >> For one, just lock in, bro. >> Bro, I was so hungry, bro. You came in class. I'm so hungry. >> All right, guys. See you guys. seem to know everything that I'm already covering. We're going to take a pop quiz. >> Oh my gosh, everyone in the class is getting mad at him >> and they're all throwing stuff. >> Chill. Chill. Chill. Chill. Chill. >> All right. So, what we're going to do, you're going to write about every single thing you know about World War II. >> Let's get started. >> World War II. Okay. When was World War II? >> Bro, I I don't know, bro. >> That was like the '8s, right? >> Bro, what? For wrong, you're so bad at ignoring your friends. >> World War II. >> Bro, what do you mean? What am I doing today? I'm in class. >> Bro, what do you mean is a party? Bro, >> I'm not going to a party, bro. >> I'm not going over to your house, >> bro. Second time I've had to ask you to stop talking. I won't ask again. >> All right. I'm sorry. I'm sorry. I'm I'm not not talking to you guys. >> If she tells him to stop talking again, that's it. He loses this challenge. >> Bro, I saw that girl. She was looking at you. Say, \"What's up?\" Don't be scared, bro. Bro, that's not like you, bro. >> Bro, come on. It's okay if you get in trouble once. >> Fun, don't respond. >> Don't be scared, bro. Let's not, bro. Come on. It's okay if you get in trouble once. Don't be scared. >> Pay attention. Ignore them. >> Wait. >> Since these guys seem to have more to say, we're going to have extra homework tonight. >> Stop talking, bro. Stop talking to me. Stop. I can't talk to you guys. >> Oh my gosh. I can't lie, his friends are annoying. >> And for once friends kept trying to get him to talk, doing whatever they possibly could. >> Don't listen to >> All right, I can tell you're not the problem this time. You two out to the principal's office immediately. Let's go. Move your seats. Go. That was close. >> His friends are getting kicked out. >> Let's go. Let's go. >> Let's go. >> All right, you guys. So, I know that my parents tried setting me up in that last class by bringing my friends and having them distract me, but I know that I got to stay focused if I want to attend to a bigger high school. So, let's go. I got this. All right, you guys. So, for one pass that challenge, but the next challenge is really going to test his temptations. >> You guys are going to see what we're talking about. >> All right, you guys. I'm going to science class. Honestly, I'm not really excited for this one, but let's just go. >> Hey. >> All right, for you know what to do here. Just stay strong and don't fall for it. >> Oh, hi. >> Where are you going? >> I'm going to science class. >> What room is that? >> Uh, I don't know. It's like down the hall. But I I should probably go. >> Wait, wait, wait, wait, wait. >> What's he going to do? What's he going to do? >> You want to ditch? >> Do I want to ditch? >> Yeah. >> She's asking him to ditch. All right, let's see if he can resist the temptations. >> What do you mean by ditch? Like not go to class? >> Yeah, like maybe we can like walk around or go off campus. >> Go off campus? You mean like off the school? >> Yeah, I know there's a market nearby. Just go to and get something to eat. >> I don't think that's a good idea. I got to get to class. >> Wait, wait. Science teachers here are pretty chill. I mean, I've done it a lot. They don't really care. >> All right. If anyone's going to make Fun ditch, it would be that girl. >> No, I don't think so. He's not going to go with her. You don't think he's going to go there? >> No, I think that he's smarter than that. >> Okay. Okay. Uh, I don't know. >> Come on. It's not going to be that big of a deal. >> I don't know. >> Come on. It'll be real fast. >> All right. You know what? >> Why don't we go? >> Yeah. >> Wait, is he actually going to skip class? >> All right. By the way, it was nice to meet you. What's your name? >> I'm Brooklyn. >> You have really pretty eyes, by the way. >> Thank you. >> Let's go. >> Oh my god. >> No. He's walking towards the exit. >> No. No. Please. >> We got to go. All right. We got to go. We got to go. >> All right. So, how long are we going to take? >> Like 15 minutes. >> 15 minutes. Are you sure my teacher won't get mad? >> Don't worry about that. >> You hit my leg. >> I'm sorry. What do you like to eat? Pizza. Burger. >> Oh, pizza sounds good. He's walking towards the exit. Just come come. >> What type of pizza do you like? Pepperoni pizza. >> Really? I like cheese. Do you like pineapple on your pizza? >> No. No. No. No. >> I don't like pineapple. >> Me neither. I don't like big toppings like that. >> You're too loud. You're too loud. >> Hold on. You're too loud. >> You guys, he's about to ditch. >> No. Please don't go for that. Please. >> What are you doing? >> Uh, I don't know. Like I don't think this is a good idea if we go. >> All right, you guys. For some reason, Fun's standing next to the door. He hasn't left yet. But if he steps outside that door, then he fails this challenge as well. >> Yes, but I I don't think that he's going to do it. >> You don't think so? >> No. >> Come on. The mark is just right there. It's like a 2-minute walk. >> I know, but like I don't know if I can do this. But listen, we can hang out another time. Okay. >> Come on. >> No, it's fine. It's fine. I got to go. Put down the camera. >> He escaped this time, but next time I'll make sure to get him to skip class. I'm so proud of Faran. He actually changed his mind. >> And now he's off to science class. >> Honestly, guys, that was pretty tempting. I almost left school to go get some food. But the right thing to do is go to science class even though I'm already late. >> For this challenge, we're going to test Fon's abilities to think outside the box >> and to see if he's able to solve problems and be creative. >> Fran, you're late to class. You know what that means? You have volunteered for our science experiment. So, come on up. >> What I have to do? You have to do You were late. What do you expect me to do? And you know who you're going to go up against? The smartest scientist in the class. Samuel. Samuel. Show them what you've got. >> Wait. Fan is about to compete with the smartest kid in class. >> All right, you two. The rules of the experiment are simple. We'll both build a volcano and whoever's volcano erupts the highest wins. You have 2 minutes. Go. >> Come on. Come on. Fun. You can do it. >> This guy looks like a professional. What? Okay. All right. Let's go. >> Time to go. >> What are you doing? Are you measuring things? >> We have the same materials. Figure it out, >> bro. What What do you mean figure it out? All right. You know what? Here's what I'm going to do. I'm going to take this blue uh food coloring dye thingy, put it into this water. Hopefully, that helps. This goes right here. Oh, okay. Okay. Okay. We're good. We're good. We're good. Yo, do you have goggles on? >> Yeah, bro. It's safety. >> Safety. Okay. Hold on. My bad. Okay. Let's go. Let's go. >> The experience, dude. >> Okay. Maybe just a little bit more. Wait, he's just pouring random things on the volcano. >> Okay. >> A little bit more of the powder or am I good? >> Uh, I think you need more. Yeah, just a little bit. Just Oh, yeah. That's >> a little bit more. >> Yeah, you're good. You're good. I'm good. >> Ask for undoing. >> I don't think he knows what he's doing. >> I actually I have an idea. >> Where are you going? >> Don't worry about it. >> What is he going? >> Perfect. Right here. Right here. Right here. So, you might be wondering why I have dish soap, but trust me, I saw this trick on Tik Tok that if you use dish soap, it's actually going to make the explosion bigger. So, let's go. >> 30 seconds left. >> 30 seconds. All right, I got dish soap. >> Wait, it looks like he grabbed soap. >> Are you serious? >> Yeah. >> What's that for? Uh, it's actually a trend on Tik Tok. You haven't seen it, bro. I'm too busy figuring out my life. >> What? You're not on Tik Tok? Okay, I guess. All right. I'm just going to put this in here. Do you know how much to put? No. Okay. Oh, I'm kind of missing. Okay. All right. We're good. Extra for my hands. All right. All right. I'm ready. I'm ready. >> All right, everyone. Step back. Further back. All right. >> Now, the teacher is going to test which volcano is going to erupt the highest. >> I hopefully for our wins. >> All right, Samuel, let's test out your volcano first. Ready? >> Oh my gosh. >> Get ready, everyone. [Music] Oh my gosh. Oh my goodness. Oh my gosh. Oh my gosh. Oh my gosh. Oh my goodness. Oh my goodness. >> Now watch. Mine's going to be way better. Mine's going to be way better. >> Oh my gosh. Bae, that explosion was so big. >> Are you serious? >> Yeah. >> All right. All right. So, Fon's volcano is going to have to erupt even bigger than that for him to win this challenge. >> All right, Fon. Do you think that you can beat Samuel's volcano? >> I think so. Let's go try. >> All right, let's test it out. Everyone stand back again. For volcano is about to [Music] Oh my god. Oh my god. Oh my god. Oh my god. Oh my goodness. >> I think he won. >> It's on the ceiling. >> Yo, I definitely beat Samuel. >> I think you did for us. >> Let's go. >> I can't believe it actually worked. Yo, I can't believe I just won that science contest. That was actually crazy. But anyways, I'm off to my next class, PE. And I know I'm going to kill it cuz I've been working out all summer. Faron's next challenge is going to be about strength and courage. >> He's going to be competing against the strongest senior in this school. >> But on the way to class, he's going to have to overcome a little obstacle. Pon, you got this. Oh, hey. >> Hey, Pon. I know you couldn't ditch earlier, but I got you some Taco Bell. >> You got me Taco Bell? >> Yeah. >> And how do you know I like Taco Bell? Let's just say I know you pretty well. >> Well, thank you. I I appreciate it. >> Where are you going? >> I'm going to my next class, PE. >> Oh, why don't you hang out with me and the cool kids? >> No, I have to go to class. I'm sorry. I got to go. >> Well, how about me and my friends meet up with you after class and we can hang out. >> Um, all right. I'll see you. >> Okay. Bye. >> Yo, that was cool. She got me Taco Bell, but I still have to go to pee. All right, boys. Today we're going to test your strength. We got the freshman going against the senior. Whoever climbs the rope and grabs the flag first wins. >> You got this. >> Let's go, baby. >> Baron, you got color yellow. Captain of the wrestling team, you got color blue. >> Easy. >> All right, let's go. >> Let's go. >> What you got? You think you're going to win? >> I am. >> Oh, you're flexing your Oh. Oh. How How do you do that? Oh, yeah. Matter of fact, it get real right now. >> Oh, yeah. Look at this. Look at this. >> Let's go. >> Let's go. >> The guy that Fan is going up against, he looks super strong. >> Babe, Fan and I have been working out all summer. Fun's got this. We've been getting these gains, baby. >> Sure. >> Yeah. Come on. Come on. You got this. You got this. >> Let's go. >> Come on, Fon. All you got to do is get that flag. >> You ready? 3 2 1 go. Come on, princess. >> So close. >> At least he tried. >> Too easy. That was the second challenge that Feron has failed so far. if he fails one more then he proves to us that he's not ready for a bigger school. >> And the next challenge is going to be all about peer pressure. >> But this peer pressure was going to be something that would be really hard for Fon to say no to >> yo check this out. Come on. You want to hang out with kids? >> What? Not and do what? Do something a little crazy, >> bro. Just kick it. What do you mean? >> What are you guys going to do? I mean, I think it would be pretty funny if you pull the fire alarm, dude. Yes. >> You think he's going to pull it? >> No. To be honest, I don't think that he will do something like that. >> You want me to pull the fire alarm? >> Yeah. >> For what? >> Don't pull it for Do not pull it. >> Bro, that is not a smart idea. Why would I pull a fire alarm? I'm not doing it. >> Yo, why would you pull the fire alarm? Why would you pull the fire alarm? >> You pull the fire alarm. >> It wasn't me. It wasn't me. the principal's office. It wasn't me. >> All right, you guys. Fun's going to the principal's office, and he's only got one way to save himself. Fun's currently in the principal's office, and if he wants to get himself out of this situation, he's going to have to do the right thing. >> And if he doesn't, he fails his challenge, and he fails the whole entire day. >> Before I come to any conclusions, I'd like to hear your side of the story. I'm going to be completely honest with you. I wasn't the one who pulled the fire alarm, but I'll take responsibility for it because I was around the people who did pull the fire alarm and I should have made better choices not to hang out with them, but I can understand why that made you upset. >> Fon, you were honest. You stood up and you took responsibility. I'm impressed. We're good to go. Thank you. [Music] I guess you're going to a bigger school. >> I told you I could do it. >> I'm so proud of you. I love you. >> I love you, Mom. >> Stay royalty. We out. Peace.",
    "start_time": 0.08,
    "end_time": 1170.24
}