{
    "video_id": "VmDhkKQekWk",
    "channel_url": "@royaltyfam",
    "transcript": "All right, y'all. So, today our son Fun is going to have to survive living with 10 of the most annoying girls. >> Oh my god. >> What in the world? >> Today is going to be a crazy day. Are you guys ready to meet the girls? >> Bring them in. >> And here are Fon's 10 sisters for the day. looking good but didn't feel. >> Hi, we're sisters. >> All right, ladies. Are you ready to give the hardest day of his life? >> Yes. >> So, Pon thinks that we're about to shoot a gaming video right now and he has no idea what's about to happen. Ladies, I want you to go to his bedroom one person at a time and let's see his reaction. All right. >> Okay. >> Go, go, go. Go, go, go, go, go. >> So, the reason that we're doing this is because lately, Farad has been really impatient with his baby sister, Blue. >> Mom again. Stop. Stop. Stop. Stop. Stop. >> It's okay, >> Mom. >> So, we brought in 10 girls to be Fan's sisters for the day to test his patience and show him how bad things can really be. >> All right. This is Fon's room. You go first. All right. Okay. Go. >> Hi, Fun. What are you doing here? Oh, go go go. Hey, >> bro. >> You too. >> What are you guys doing here? >> Hi. >> How are you? >> Oh, hi. Like, why are you in my room? What's happening? >> What do you mean? >> The three of you. The three of you. >> What are you doing here? Why are there so many of you guys? >> What do you mean? >> Oh my god. Why are you guys in my room? >> What do you mean? >> Yeah, we live here. >> No, you guys don't. Why is there 10 of you guys? >> I mean, we can unpack in here. >> No, you guys. All right. You know what? You guys stay here. I'm going to be right back. Don't touch any of my things, please. We'll be right back. >> Mom. Oh, there you go. Mom. >> Hey. Hey. >> Guys, what is happening? Why are there 10 girls in my room? >> All right, friend. Those 10 girls are going to be your sisters for today. And all that you got to do is to survive the whole day by making them happy. What? >> Yep. And if you can keep them happy, I will give you my credit card and you can go shopping at the very end of the day >> and I can get whatever I want. >> Whatever you want. >> But if you don't keep them happy, you and your baby sister are going to have to swap bedrooms for a whole week. >> Well, I'm not going to swap rooms with a baby. I'm not doing that. >> Well, go keep the sisters happy. The day just started and things were already harder than Feron expected, but it's about to get even worse. All right, since you guys don't want to leave my room, I'm going to leave my room so you guys can do your own thing. Okay, I'm leaving. >> Wait, hold on. Since you're a brother, I feel like we should just dress you up today. >> No, no, you guys are not dressing me up. Like, what is wrong with my outfit? I look good. >> I mean, your outfit isn't giving you have 10 sisters. We need to change that. Your outfit's just not really like fitting, you know? >> What do you mean? It looks fire. All right, you know what? Since I have to make you guys happy, I'm going to go pick out some outfits and then you guys tell me if you guys like it. Okay, >> there you go. That's a good brother. That's not good, bro. Give it up for them, ladies. Give it up for him. Come here. Come with me. Hold on. Hold on. Hold on. Hold on. What is happening, bro? >> They don't like your outfit, >> bro. My outfit is fire. >> Just be a good brother, okay? Pick out something that they might like. All right. >> What's taking so long? >> Those sisters are strict. Make sure whatever you pick right now is going to be creative. >> I have an idea. >> Hello. >> Oh my god. It's going to be a terrible outfit. Come on. >> Hurry up, >> ladies. I'm sorry he's not doing a good job as a brother so far, but you know what? Let's have patience. >> Patience. >> All right, you guys. What about this one? >> What is What is bad about this one? >> Oh, it's so bad. I can't look. I can't look. >> Okay. What about those slides, though? >> No, those are not reals. Those look like Balenciagas. >> Balenciagas? Are we serious, guys? These are real. >> Guys, guys, >> you know, it's just dress for. Show them what we have. Yes. >> All right. They're going to dress you up. They're going to dress you up. >> No, they're not. >> And you wouldn't believe what they were going to try and get Fon to wear. >> All right, Fon, you have to wear these. >> No, those are ugly. I'm not wearing those. >> Wait, but you have to wear this. They're so comfortable. >> Those are so ugly. I'm not wearing those. I'm not wearing those. >> I found you the cutest hat ever. >> That is the ugliest hat. I'm not wearing that, bro. >> Come on. Just be nice. >> I'm not wearing that. >> I love these. They're so cute. >> I don't wear pajamas anymore. I don't like those. >> I mean, this is the perfect shirt for you. >> I love my sisters. I'm not wearing that. >> No, you need to wear these cuz if I had a brother, I'll make him wear these. >> Oh, those are fire, bro. Those are fire. Those are skinny jeans. I'm not wearing that. >> If you don't wear these, I'm leaving. >> Wa. Door's that way. Oh, >> are you sure you want her to leave, >> bro? Yeah, it's less work for me. Fine, I'm leaving. Look what you made you do. That's your sister. >> And with one of the sisters leaving, Fan was about to find out how hard this challenge really is. >> All right. Could we talk to you outside real quick? >> It's important. It's important. It's important. >> So, what's what's going on, >> bro? One of the girls left already, >> bro. Good. That's one less to worry about. >> No. No. If throughout the whole day two more girls leave, you're eliminated. You're done. You lose the challenge. >> Bro, what? You never told me this. >> Well, now you know. So, you have to go back there and be the best brother ever. >> Remember the deal. If you lose, you and your baby sister are going to trade rooms for a whole week. >> I don't want to do that. All right. You know what? Let's go. >> You can do it. You can do it. Come on. Come on. >> All right, sisters. Listen up. I already lost one of you guys, and I can't afford to lose anymore. It's going to be a long day, and I know I have to make you guys all happy. So, what do you guys want to do? >> Wait, I have an idea. How about we do Tik Toks? >> Yeah. >> No, no, no. Tik Toks. I can't dance. I I don't make >> You can dance. >> You can dance a little bit. >> Okay. You know what? At least show me the Tik Tok. >> This one is >> Yes, that one. >> Wait, what is it? What is it? Show >> super easy. >> No. No. I can't I I can't do that. I can't dance. I'm not doing that. >> Let me see. Let me see. Let me see it. I'll tell you if you can do it. I'll tell you. >> No, bro. I'm not doing that. I can't dance. I'm not doing that. >> But we can teach you. It's so easy. >> It's really easy. You can do it. >> Come on. Just try your best. It's just a dance. >> I know, but like I can't dance. >> Come on, F. We're going to teach you. Everyone downstairs. Let's go. >> No. No. >> No. Gucci, what happened to you, Bubba? You're one of them now. What? >> Oh my god. The sisters got him, bro. >> I thought we were supposed to stick together, bro. >> Hey, hey, hey. Gucci sold, bro. >> The girls love me. >> He's one of them, >> bro. Come on, man. We were supposed to stick together. All right, it's time for Fan to make a Tik Tok. You think he could do it? >> I think he's going to be able to figure it out. >> And if he doesn't, one of the sisters might just leave. >> Okay, Fan. So, this is the dance. Ready? 5 6 7 8 5 6 7 8. >> Are you serious? I I can't do that. >> Wait. So, we're good. You know it, right? >> No. >> Yes. Okay, great. And you're going to go first. So, you cannot mess it up or you'll ruin the whole TikTok. Let's set the timer. All right. >> Do not mess up. >> Okay, I won't mess up. >> Wait, how does it go? Okay, I got this. >> You got this, pun. >> Oh my god. >> No, no, no. You need to lock in. >> Seriously. >> Three more tries otherwise I'm leaving. >> No, no, no. Okay. No, no. You can't leave. Okay, you know what? Let me try it again. I can >> He's got this, ladies. Ladies, he's just warming up. He's got this, >> guys. I got it. >> You got this. >> You sure about this? Oh my god. No. No. >> Guys, come on. >> No. Again, remember, two more tries, otherwise I'm leaving. >> All right, let's go. We got this. We got this. >> Oh, wait. >> Wait. Okay, good. Wait. >> Oh, no. No. No. >> Guys, that wasn't that bad. >> It was better. >> It was good, but not good enough. You have one more try, Fon. >> If Fon doesn't do the dance perfectly on his last try, then one of his sisters is leaving. >> Okay. Yes. Yes. >> Let's go. >> I think we got it. I think we got it. >> Thankfully, Foran was able to do the Tik Tok, right? But you won't believe what was about to happen. >> Guys, where's my phone? I don't I just had one of you took my phone. >> Okay, stop. Stop. Stop. What happened? >> I lost my phone. What? Somebody took my phone. It wasn't >> you. Anybody took your phone? Like, >> wait. Was it you? Did you take my phone? >> What? >> I did not take your phone. >> It's because you're mad that we're here. >> Guys, guys, everybody calm down. >> Did you just tell me to calm down? >> You made things worse. You make things worse. Why don't you help her find the phone? Just help her out. >> Okay. Like, what do I tell her? >> Don't say calm down to a girl. >> Okay. >> Wait. But I just have to let you know now. If I don't get my phone in the next 5 minutes, I'm leaving. >> So, everybody, just take a breath. Okay. Really quick, just just breathe. Just breathe. We're going to find your phone in the next 5 minutes. So, don't worry. >> Okay. >> Let's go look for your phone. >> Okay. >> Okay. Where was the last place you remember you had your phone? >> Um, I I think it was up in the room. >> All right. Back to your room. >> Oh my god. >> Don't make a mess. Don't make a mess. All right, we got to find the phone. >> They're destroying your room, bro. [Applause] >> Okay, help him. >> You're not helping me, >> guys. Okay, guys. Guys, guys, everybody stop. Okay, >> three more minutes or I'm leaving. Just find the phone. >> Find it. Go, go, go, go, go, go, go, go. Find the phone. We're looking for a phone. What? What color? >> What color is your camera? >> iPhone. >> It's pink. >> You have a pink iPhone. >> We're looking for a pink iPhone. Oh my god, >> guys. What was that? Okay, guys. Seriously. >> Seriously? >> I found it. I found it. >> No, I'm just kidding. >> Bro, that was not funny. You're not taking this serious. >> Wait, wait, wait, wait. Is this your bag? >> Yes. >> Wait, that's your bag? >> Yes, that's my bag. >> It's probably in there. Let's go. >> Oh my gosh. What did you bring? >> A pillow. >> A pillow, >> guys. >> Uh, there's nothing in here. >> Are you kidding me? >> All right, you guys. Everyone downstairs. Let's find the phone. >> Go, go, go. What's happening? >> At least you were a gentleman for letting the girls go first. >> Dude, I was trying to go first, but they wouldn't let me. >> Go. Hurry up. Hurry up. All right, you guys. This is becoming tougher than I expected. What? You have like 30 seconds left. >> Oh, wait. No, you're right. You're right. You're right. >> Get up, >> guys. Look everywhere. Look everywhere. >> What? I I went to the bathroom. >> Oh, yeah. >> Check the restroom. Restroom. She went to the restroom. She might find it there. >> No, she went to look for her phone. >> Yeah, you're right. >> I got it. Oh my god. I'm so happy I found my phone. But let me check my snap. Oh my gosh. Wait, wait, hold on. Speaking of messages, >> guys, my boyfriend has been waiting outside for 10 minutes. >> No. Oh my god. >> Wait, wait, wait, wait, wait, wait, wait. You have a boyfriend? >> Yeah, I have a boyfriend. Sisters have boyfriends. >> Wait, wait, wait. That's actually perfect. That's one less responsibility. >> Wait, he's outside? >> Yeah, he's outside right now. >> Bring him in. Please tell him to come in, please. Open the door right now. Where is he? >> Come here. Come here. Come here. What? >> Are you sure you want her boyfriend to come in? >> Oh, yes. That's perfect. cuz then he's going to distract her and then she's going to be distracted and then that that's one less responsibility. >> What if you got to end up taking care of him? >> No, dude. >> No. >> It's another It's another guy. Like like we'll get along. You just tell him to go do his own thing. Like let's go. >> Okay. I'm going to go get my boyfriend next. >> Gucci, go over there. Gucci, go over there. Go for it. Go for it. >> I'm going to go find that. >> But little did for one know, the worst was yet to come. >> Hey guys, >> this is my boyfriend, Gino. Bye. >> Hey, Veron. What's up? Nice to meet you. Forget that. Give me a hug. Give me a hug. Okay. Hey, bro. Thank you. Okay. Listen. It feels so good to finally have some help, bro. Thank you so much for coming. >> Of course. >> Listen. All you have to do is take care of your girlfriend. All right. Just keep her company. You're good. Make yourself at home. I'm going to take care of her sisters. All right. You heard me. Make yourself at home. Okay. Okay. Um, where's the pantry at? >> Pantry? Why is it going to the pantry? >> Yo, here's some food. >> Hot zombies. >> What's he doing? >> He's grabbing his toys. What are you grabbing? >> What are you guys doing? >> You said make yourself at home. I was just, you know, making myself at home, >> obviously. But why are you grabbing all of my chips? These are my chips. >> I mean, the Takis. >> Actually, I'm your sister now and this is my boyfriend. So now I say that he can have our snacks because of our snacks cuz we're a family, >> you know? How about we go to my new room and we eat all the snacks? >> Wait, wait, wait, wait, wait, wait, wait. What do you guys mean my new room? Like you don't have a room? >> Uh, yeah, I do. Remember I set up all my stuff >> in whose room? >> Uh, your old room, but now it's my new room, which makes it his room. So, let's go. >> Let's go to my room. >> What are you talking about? >> No, no, no, no, no, no. >> Wait, hold on. I told you now. >> So, now it's your room, nine of my other sister's room, and now it's his room. >> You said it was okay for him to come and now he's a responsibility. >> My room. Oh, no. >> Fan thought the boyfriend would make things easier for him, but things are about to get worse and worse. Okay, so check out my new room. >> Wow, I love this room. >> I know, right? >> Oh my gosh, those posters are so cool. >> I'm so happy I have my scissors and my boyfriend here. >> So, um, babe, what do you want to do? >> I mean, this is a really nice gaming setup. >> Oh, is that a war zone? >> Wait, wait, wait, wait, wait, wait, wait, wait. What did I just hear? Hey, hey, watch out. Watch out. Watch out. Watch out. What do you think you're doing? >> I'm just making myself at home. You have your feet on my table and you're eating bunions and you're talking to my controller. No, you're kidding. You're kidding. What do you What do you think you're doing? >> Hey, hey, hey. Don't talk to my my my boyfriend like that. Yeah, don't talk to my sister's boyfriend like that. What are you thinking? >> Exactly. Rude. He's family now that we're family and he can do whatever he wants in my room. >> That's pretty rude, dude. I'm not going to lie. >> Bro, what are you talking about? No, >> you wanted him to come. >> You said it was fun that he comes. >> Cuz I thought he was going to help me. Now, I didn't know I had another responsibility. >> I'm kind of thirsty, too, bro. Could you bring me some water? Like, these funions get my throat really dry. >> Are you serious? You want me to go bring you water? >> Yeah, >> dude. No, I can't do this, bro. What am I supposed to do? >> Hey, hey, hey. You have to make me happy. Making him happy makes me happy. So, chop chop. That's like the number one rule to make your sister's boyfriend happy. >> If Fon can't make his sister's boyfriend happy, then his sister might just leave. Dude, why are you so >> Oh my god, >> this is crazy. >> This is nuts. >> Oh, wait. Can you get me bag of chips? >> What? >> Yes. Oh my god. Grab me some fruit snacks. >> You guys want me to grab you snacks? >> Yeah, of course. >> Okay, you know what? Fine. All right. What do you guys want? This? Is that Is that it? >> Wait. A few more things. >> Wait. Grab some more. Grab some more. >> Yeah. Grab those. Wait. Get some chips. Get some chips. >> Oh, wait. Those. >> But little did know, his sister's boyfriend was about to do something insane. >> They're making him grab the good. >> Okay. >> You've been an amazing brother right now. >> I don't know how much longer I can take this. >> Yes, you can do it. You can do it. Oh my gosh. My boyfriend's on a bike. Oh my god. Really? No. No. No. No. No. No. No. No. No. If your boyfriend is riding my bike, I'm going to get so mad. No. No. >> Come back. Come back. For you come back. It's just a bike, bro. >> I don't care. >> You got to be nice to your boyfriend. >> Yo. Yo. What are you doing? What are you doing? What are you doing? This bike is sick. >> Get off my bike. Get off my bike. Um, I kind of dropped it. I'm not going to lie. I left a little scratch. I'm so sorry. >> He dropped the bike. >> Yeah, he was. >> Oh my god. >> I literally just powder coated my bike. What do you mean you dropped it? >> Okay. He's family, so we can forgive family. He dropped the bike. >> I mean, yeah, but it's his bike. He knows how to fix it, right? >> Do what you want. You're lying. Okay. No, no, no. Listen, listen, listen, listen, listen. You have to go. You're leaving the house. You're leaving. >> It's our house. >> No, it's not our house. It's my house and you're leaving. >> Hey, hey, I'm your sister. If he leaves, I leave. Okay. He's my family, too. >> Yeah. At this point, honestly, I don't even care. Both of you guys can leave. >> Fine, then we're both leaving. Let's go. >> Fun. That's two girls that have left so far. If one more girl leaves today, you lose the challenge and it's over. >> And just like that, two of Fun's sisters already left. I don't know if Ran is going to make it to the end of the day because honestly, this is way tougher than I expected for him. >> All right, your brother's coming. Give him a break. He's going through a rough time. All right, >> so >> Wait, hold on. Wait. No, wait, wait, wait, wait, wait. >> 1 2 3 4 5 6 7 Hold on. No, no, no. Wait. Is there supposed to be eight? Yeah. >> Wait, you lost? >> There's a sister. >> If one of the sisters left, that means you're out. You're done. >> There's a sister. Where's the eighth sister? >> It's your responsibility. >> No. No. We have to go find her. >> For what? If that sister is gone, that's three girls that left and it's over. >> Bro, where could she be at? Like, >> I don't know. >> Wait. My room. My room. Go, go, go, go, go, go. Oh, she better be there in my room. >> She's not going to be in your room. >> They're pretty, right? >> Yes. [Applause] >> What do you mean? Hold on a second. Those are my favorite shoes. I wear those shoes every single day. Those are my What do you mean go outside? >> Let's talk about this. Let's talk about this. Why did you color his favorite shoes pink? Um because they were ugly before and I want to make them more girier and prettier. >> Yeah, you should add more. And I added G on it just to make them mine. Yes. >> This is so >> What in the world is going on? >> and and shoes are replaceable. But sisters aren't. Bro, >> they should leave. >> If one more girl leaves, it's over. You have to swap bedrooms with your baby sister for a whole week. Okay, you know what to do. All right, just go in there and do it. >> Yay. You're smart. >> All right, hold on. Hold on. Hold on. Hold on. >> Honestly, they're pretty cool. >> You're finally starting to understand becoming a good brother. [Applause] >> I'm going to go downstairs. >> Wait, wait, wait. I'm really hungry. Aren't we all? >> Yes. >> I can make you guys like eggs or something. >> Egg for dinner? >> No, no, no, no, no. I'm thinking we go out for dinner. >> Yeah. >> A good idea. >> And listen, if we don't leave in 10 minutes, I'm quitting. >> You might hurt. >> Yeah. >> Oh, and also, we want to go in a limo. So, >> all right. You know what? Everybody get ready in under 10 minutes. >> I want to throw the out of time. >> You guys, I'm ready. I'll meet you downstairs. Bye. Watch out. Watch out. Watch out. Watch out. Watch out. Watch out. Sydney, over the >> What? >> You have 1 minute to shower. >> You have 1 minute to shower. Get ready. Okay. >> Do you have to shower? >> Yes. I need to get ready and look nice for this dinner. Are you kidding me? >> Tell her she looks nice. Tell her she looks nice. >> You look nice. Just >> No. No. >> She's taking forever. >> Okay. You know what? Just shower one minute. You're good. >> Wait. Don't forget about my limo. Okay, >> call the limo company. Come on. >> Listen right here. I actually had the limo company on speed dial. >> For one ordered the limo and it was going to be here on time, but you got to get all the girls to get ready in 10 minutes and they're all waiting in line. So, go check up on them, >> bro. They're they're going to figure it out. Yeah, sure. >> Yeah, sure. You need to go check out the thing. Come on. >> You don't got much time, bro. Are you guys almost done? What are you guys doing? >> No lip gloss. Do we look good? I mean, do we look good or like presentable or anything? >> No, you're look amazing. You guys ready? Are you lying? >> No, you guys look amazing. >> You guys are ready to go. Trusty. Trust me. Go downstairs. >> Do your lip gloss. >> No, I don't. Let's go outside. All right. >> All right. You guys go wet outside. Wet outside. All right. Cool. Cool. So, what about you? Are you almost ready? >> Okay. So, I need to pick two shirts. This one brings out my eyes and this one looks really good with my hair color. This one is beautiful. >> That one. Just go with that one. Just go. Just go. >> I don't really want to wear that one. I kind of like this one. >> No, just just please just wear this one. Trust me. Just wear this one and just go. >> Hurry up. I'm hungry. Or else I'm going to leave. Okay. I just showered and did my hair. Hold on. Let me show you. How does it look? >> It looks the same. Are you a kid? No. You look beautiful. >> Oh, no. No, no, no. >> Are you Should I go redo it? >> No, no, no. You don't have to redo it. >> No, I'll go. >> No, no, no. Listen to me. Listen to me. Your hair honestly perfect. Just go. >> It looks good. Just go. >> You promise. Just go. I'll redo it. >> Just go. Go. Okay. Go. Go. >> You guys, we got to leave in 3 minutes. >> What about you guys? Are you guys ready? >> The sweater would look better on me anyway. What are you talking about? It looks better with my jeans. >> Oh my god. Help them get ready. >> Okay, guys. Guys, guys. >> You know what? I'm taking it. No. >> Oh my gosh. >> Did you all just rip the sweater? >> You just made me rip. >> Okay. Wait wait wait wait wait a minute. You guys stop talking. Listen. There's an upside to this. Now at least both of you guys have a sweater now. Go. Go. Go. Get. Come on. Come on. Come on. Hurry. Hurry. Hurry. Hurry. >> What are they doing? Are they making a Tik Tok? >> I don't know. >> Guys. Guys, >> guys, guys, guys, guys. The limo's here. We have to go. We can't be making Tik Toks right now. Let's go. Let's go. Let's go. >> Go. Everyone go, go, go outside. Go. Go outside. [Music] >> Come on. Come on. >> Oh my god. >> All right, sisters. I got this limo for you guys. >> Wait, where are we going? That's a good question and that will be answered once you get inside. So, get inside. The boss man goes first. >> All right. Gucci's going in first. >> Oh my gosh. This is insane. >> Oh my goodness. >> This is so shift them out of here. >> No, you got to take them to dinner. >> Now you got to go inside and figure out where they want to eat. Good luck. And if Fon can't get all of the sisters to agree on somewhere to eat, then he will lose this challenge and have to swap rooms with his baby sister. >> All right, ladies. What do you guys want to eat? >> Wait, I want steak. >> No, I want sushi. >> I want boba. >> Oh, I want burgers. >> I want Korean barbecue. I can't really eat any of that. I'm allergic. >> But I want pasta. >> But I want ramen. >> Okay, actually I have a spot that's going to feed each and every one of your guys' cravings. Okay, you just you just have to trust me on this. Wait, how? >> Wait, how is that even possible? >> Wait. Hold on. Are you sure you know what you're doing? >> They each want different things. >> Where are you going to go? >> You'll see. >> Ladies, do you guys trust your brother? >> No, not really. >> Well, listen. If he lets us down, then we can all quit. >> Woah, woah, woah, woah, woah, woah, woah. Okay. Well, let's just say you guys are not going to quit. Let's go. Everybody in. Come on in. Let's go. Yo yo yo. You know where to go, right? Yeah. >> All right. Let's do this. [Music] All right, ladies. We finally arrived. >> Wait, where are we? >> We're on the greatest place on earth. Let's go. I'll get out first and you guys get out. >> Go that way. Go that way. Let's go. Go, go, go. >> Time for my sushi. >> I can't wait to see the reaction. Just watch. >> I'm so excited for my sushi. Let's go. Let's go. >> What? Are you kidding me? You're joking. >> Wait, what happened? This has to be a joke. Are you serious? >> Ew. What is this? >> You took us to Taco Bell? I thought we were getting steak and burgers. >> All right, listen. Listen, listen. I knew I couldn't please all of you guys, so I pleased myself. >> What? You're so selfish. >> You know what? I quit. I quit. We're done. I'm done. Oh my gosh. >> You know what that means, right? You got to swap rooms with your baby sister and you got to do it tonight. >> Tonight, bro. It's got to happen. >> All right, F. Are you ready to see your new room? >> Honestly, I'm not looking forward to it, but let's just see it. >> Bro, you're going to love it. All right, [Applause] >> bro. What is this? I don't even have my gaming setup. And this room is full of baby toys. >> Why? I like it. It looks super cool. >> It looks nice. >> No. No. >> What? >> You know what? At least I have my bed and my Taco Bell. Stay royalty. We out. >> Peace. >> Royalty.",
    "start_time": 0.0,
    "end_time": 1636.52
}