{
    "video_id": "vFRS0ySXe3M",
    "channel_url": "@littlebabybum",
    "transcript": "[Music] Thes on the bus go and round and round. The wheels on the bus go round and round all through the town. On Halloween, the spooky ghost bus goes boo. [Music] The spooky ghost bus goes boo. All through the town on hall, the werewolf bus goes aroo aoo aoo aroo aoo a ar a ar a ar a ar a ar a ar a ar a ar a ar a ar a. The werewolf bus goes aroo aoo all through the town. On Halloween, the robot bus goes beep beep bloop. The robot bus goes beep beep bloop all through the town. On Halloween, the zombie bus goes ra. [Music] The zombie bus goes ra all through the town on hall. [Music] The wheels on the bus go and round and round and round. The wheels on the bus go and let's get on board. The driver on the bus says trick or treat. Trick or treat. Trick or treat. The driver on the bus says trick or treat. Happy hall. The pumpkin on the bus is round and orange. Round and orange. Round and orange. The pumpkin on the bus is round and orange. Happy hall. The mommy on the bus says, \"Wrap me up. Wrap me up. Wrap me up.\" The mommy on the bus says, \"Wrap me up. Happy hall. The vampire on the bus swishes his cape. Swishes his cape. Swishes his cape. The vampire on the bus swishes his cape. Happy hall. [Applause] The witch on the bus brushes her broom. brushes her broom. Brushes her broom. The witch on the bus. Brushes her broom. Happy hall. The cat on the bus goes meow meow meow meow meow meow meow meow meow. The cat on the bus goes meow meow meow. Happy hall. The ghost on the bus goes hoohoo. [Music] The ghost on the bus goes hoo. Happy Halloween. The monster on the bus says, \"I'm not scary. I'm not scary. I'm not scary.\" The monster on the bus says, \"I'm not scary. Happy Halloween.\" The people on the bus say, \"Happy Halloween.\" Happy Halloween. Happy Halloween. The people on the bus say, \"Happy Halloween. Happy Halloween. [Music] Look outside. There's lots of cheer. People in costumes. Halloween is here. Don't be frightened. It's not scary. Look, a pirate and a fairy. Halloween. Halloween. Let's have fun. Halloween. Halloween. Fun for everyone. [Music] Who's that knocking at the door? Three little kittens and one more makes four. Would they like a trick or treat? Give them a smile and a sweet to eat. Halloween. Halloween. Let's have fun. Halloween. Halloween. Fun for everyone. [Music] Grab mommy's hand. It's your turn now. Show her a twirl and take a bow. Your costumes on your on your feet. Knock knock knock. Trick or treat. [Music] Hall is dress up time. Dress up. Dress up. Dress up time. Hall is dress up time. Dress up. Dress up. Dress up time. Grab a white sheet. You'll be a ghost. Woohoo. Put it over your head. Boop boop boo. You'll have ears and a tail. You're a little cat. Well, you can fur and prance. Meow. Meow. Meow. Hall is dress up time. Dress up. Dress up. Dress up time. Hall, it's dress up time. Dress up. Dress up. Dress up time. [Music] Maybe you're a mommy wrapped up head to toe. Put your hands in front of you and go, go, go. You could be a witch. Grab a hat and a broom. Don't forget your cloak. Vroom vroom vroom. [Music] Halloween costume. Halloween costume. Jump and swaying, dancing, playing in your Halloween costume. See the witch fly by, zooming past she goes. Look out now. Take care. Look, she's hurt. Oh no. Then the robot falls because she cannot see. Ow, now I've hurt my foot. Poor zombie. Halloween costume. Halloween costume. Look at you. You had a boo boo in your Halloween costume. Yay! Here's mom and dad with some spooky treats. You will feel much better now when you've had some sweets. Now the boo's gone. Jump back up on your feet. Come on, time for some fun. Shout happy Halloween. Halloween costume. Halloween costume. Jumping, slaying, dancing, playing in your Halloween costume. [Music] Happy Halloween. [Music] Are you ready? Let's go. Time for trick or treat. You know, we will count the sweets we get, but we don't have any yet. [Music] Trick or treat. Time to see who's dressed up for Halloween. Trick or treat. We will be counting on Halloween. Are you ready? Let's go. Time to move along. You know, counting is what we do. Count together. 1 and two. Are you ready? A let's go. Time to move along. You know, count the sweets we got before. 1 and 2 and 3 and four. Trick or treat. Time to see who's dressed up for Halloween. Trick or treat. We will be counting on Halloween. Are you ready? Let's go. Time to move along. You know, yummy sweets. It's quite the mix. 1 2 3 4 5 and six. Are you ready? Y, let's go. Time to move along. You know, 1 2 3 4. They taste great. Five and six and seven and eight. Trick or treat. Time to see who's dressed up for Halloween. Trick or treat. We will be counting on Halloween. Are you finished? Yay! Let's go. We can count at home. 1 2 3 4 5 6 7 8 9 and 10. The wheels on the bus go and round and round. Round and round. The wheels on the bus go and all through the town. The teacher has to count them all. Count them all. Counts them all. The teacher has to count them all. All through the bus, everyone fastens their seat belts. Their seat belts. Their seat belts. Everyone fastens their seat belts. They're safe to go. The bus has arrived at the museum. At the museum. At the museum. The bus has arrived at the museum. All off the bus. They're all here. So off they go. Off they go. Off they go. They're all here. So off they go. Off on a trip. The children love the dinosaurs. Dinosaurs. Dinosaurs. The children love the dinosaurs. They're really big. Now it's time to head on back. Head on back. Head on back. Now it's time to head on back. Go back to school. [Music] Thes on the bus go and round and round, round and round. The wheels on the bus go round and round all through the town. The horn on the bus goes beep beep beep beep beep beep beep beep beep. The horn on the bus goes beep beep beep. All through the town. The wipers on the bus go swish swish swish swish swish swish swish swish swish. The wipers on the bus go swish swish swish. All through the town, the people on the bus go up and down, up and down, up and down. The people on the bus go up and down all through the town. The bell on the bus goes ding ding ding ding ding ding ding ding ding. The bell on the bus goes ding ding ding all through the town. The doors on the bus go open and shut, open and shut, open and shut. The doors on the bus go open and shut all through the town. The money on the bus goes clink clink clink clink clink clink clink clink clink. The money on the bus goes clink clink clink all through the town. [Music] Daddy finger, daddy finger, where are you? Here I am. Here I am. How do you do? Mommy finger, mommy finger, where are you? Here I am, here I am. How do you do, brother finger? Brother finger, where are you? Here I am. Here I am. How do you do? Sister finger. Sister finger, where are you? Here I am. Here I am. How do you do? Baby finger, baby finger, where are you? Here I am. Here I am. How do you do? [Applause] [Music] Goosey goosey gander. Where is the man? Upstairs or downstairs? Help us baby panda. Hunt over here. Then look over there. Where is he? hiding. She's hiding under there. [Music] Goosey goosey cander. Where is baby panda? Up upstairs or downstairs? Help us hunt over here. Then look over there. Where is she hiding? She's hiding under there. [Music] Round and round the garden went a teddy bear. One step, two step. He's hiding under there. [Music] Round and round the garden. Me is hiding where? One step, two steps. She's hiding over there. [Applause] [Music] Round and round the garden is hiding where? One step, two step, he's hiding up there. [Music] Round and round the garden, Paul is hiding where. One step, two step, she's hiding over there. [Music] Tom the piper son had a pig who liked to run. [Music] The pig went running down the street and Tom went chasing happily. [Music] Tom the piper son [Music] had a pig who liked to run. The pig went to the market sea and ran around so merrily. [Music] Tom the piper son had a pig who liked to run. [Music] The pig went running back home sea and Tom went chasing happily. [Music] A t a tasket, a green and yellow basket. I wrote a letter to Daisy and on the way I dropped it. I dropped it. I dropped it and on the way I dropped it. Then Papa helped me find it again. So I put it in my pocket. [Music] A t a tasket. A green and yellow basket. I wrote a letter to Papa. And on the way I dropped it. I dropped it. I dropped it. And on the way I dropped it. And Daisy helped me find it again. So I put it in my pocket. [Music] Ice cream. Ice cream. Yummy ice cream. Ice cream. Ice cream. Tastes so good. Ice cream. Ice cream. A special treat. Share it with a friend. Ice cream. Ice cream. What's your favorite? Ice cream. Ice cream. I love chocolate. Ice cream. Ice cream. Vanilla. Strawberry. Cookies and cream. Ice cream. Ice cream. And strawberries. Ice cream. Ice cream. Blueberries do. Ice cream. Ice cream. Nuts and cherries. So many toppings. Ice cream. Ice cream. Want more flavors? Ice cream. Ice cream. How about caramel? Ice cream. Ice cream. Mango. Mint chip. Cookie dough. [Music] Mia. Mia. >> Yes, Papa. >> Eating sugar. >> Strawberries. >> Not an apple. >> No, papa. >> Open your mouth. >> Ah. Ah! Mia! Mia! >> Yes, mama. >> Eating sugar? >> Bananas? >> Not an orange? >> No. Mama, >> open your mouth. Ah! Ah! Ah! [Music] >> Mia! Mia! >> Yes, Papa. >> Eating sugar. >> Apricots. Nuts and melon. >> No papa. >> Open your mouth. >> Ah. Ah. Ah. [Music] Ba ba black sheep, have you any wool? Yes sir, yes sir, three bags full. One for the master, one for the dame, and one for the little boy who lives down the lane. [Music] Ba ba black sheep, have you any wool? Yes sir, yes sir, three bags full. One for the master, one for the dame, and one for the little boy who lives down the lane. [Music] Oh, where have you been? Billy boy, Billy boy. Oh, where have you been? Charming Billy. I've been playing outside with the toads and the frocks. What a lovely time it's been. Charming mother. Oh, where have you been? Billy boy. Billy boy. Oh, where have you been? Charming Billy. I've been playing outside with the rocks and the locks. What a lovely time it's been, Charming Mother. Oh, where have you been? Billy boy. Billy boy. Oh, where have you been, Charming Billy? I've been playing outside with the toads and the frogs. What the blue time has been, Charming Mother. [Music] Shapes. Shapes. Shapes. Shapes. Shapes. Shapes. Circle. Circle. Square. Square. Triangle. Triangle. Rectangle. Rectangle. Star. Star. Heart. Heart. Oval. Oval. Diamond. Diamond. Pentagon. Pentagon. Hexagon. Hexagon. Octagon. Octagon. Rhombus. Rhombus. Shapes. Shapes. Shapes. Shapes. Shapes. Shapes. [Music] Mary had a little lamb, little lamb, little lamb. Mary had a little lamb, its fleece was white as snow. And everywhere that Mary went, Mary went, Mary went, and everywhere that Mary went, the lamb was sure to go. [Music] Mary had a little lamb, little lamb, little lamb. Mary had a little lamb, its fleece was white as snow. And everywhere that Mary went, Mary went, Mary went, and everywhere that Mary went, the lamb was sure to go. [Music] [Applause] [Music] Humpty Dumpty sat on the wall. Humpty Dumpty had it before. All the king's horses and all the king's men couldn't put Humpty together again. Humpty Dumpty sat on the wall. Humpty Dumpty had a great fall. All the king's horses and all the king's men couldn't but Humpty together again. [Music] Humpty Dumpty sat on the wall. Humpty Dumpty had a great fall. All the king's horses and all the king's men couldn't but Humpty together again. Humpty Dumpty sat on the wall. Humpty Dumpty had a great fall. All the king's horses and all the king's men couldn't put Humpty together again. [Music] Teddy bear, teddy bear, turn around. Teddy bear, teddy bear, touch the ground. Teddy bear, teddy bear, reach up high. Teddy bear, teddy bear, touch the sky. Daddy bear, teddy bear, bend down low. Teddy bear, teddy bear, touch your toes. Taddyy bear, teddy bear, go to bed. Teddy bear, teddy bear, rest your head. Teddy bear, taddyy bear, turn out the lights. Teddy bear, teddy bear, say good night. [Music] Teddy bear, teddy bear, turn around. Teddy bear, teddy bear, touch the ground. Teddy bear, teddy bear, reach up high. Teddy bear, teddy bear, touch the sky. Teddy bear, teddy bear, turn out the lights. Teddy bear, teddy bear, say good night. [Music] Red, yellow, blue, orange, [Music] green, purple. Pink, brown, black, white. Red, yellow, blue, orange, green, purple, pink, brown, black, white. [Music] Five little ducks rode on a bus one day. Quack, quack, quack. They sang all the way. The bus stopped at the lovely pond. So they all jumped out one by one. One duck, two ducks, three ducks, four ducks. Five little ducks quack. Five little ducks rode on a bus one day. Quack, quack, quack. They sang all the way. The bus stopped at the lovely farm. So they all jumped. Here they come. One duck. Two ducks. Three ducks. Four ducks. Five little ducks. Quack. Five little ducks rode on a bus one day. Quack, quack, quack. They sang all the way. A bus stopped at the lovely pond. So they all jumped out one by one. One duck, two ducks, three ducks, four ducks, five little ducks, quack. [Music] A a n b-ba c-c cake daisy e- explorer f- frog g- Go. Horse. I I cy J- J C- King. Lion M-m nighttime. A octopus. P-p-olly. Qu queen. R-r robot. S- s snake. T- twinkle. Umbrella. V-v violin. Wale. X. X-ray. Yu. L zoo. [Music] Peas porridge hot. Peas for it. Gold. Peas. Porridge in the pot. 9 days old. Some like it hot. Some like it gold. Some like it in the pot. 9 days old. [Music] Peace porridge here. Peace porridge there. Peace porridge tastes so good anywhere. Some like it high. Some like it low. Some like to eat it in a car on the go. [Music] Peas porridge hot. Peas porridge cold. Peas porridge in the pot. 9 days old. Some like it hot. Some like it cold. Some like it in the pot. 9 days old. Some like it in the pot. 9 days old. [Music] Ride a horse to Bambbury Cross to see a fine lady upon a white horse. Rings on her fingers and bells on her toes. She shall have music wherever she goes. And she shall have music wherever she goes. And she shall love music wherever she goes. [Applause] [Music] Ride a to Bambbury cross to see a fine lady upon a white horse. rings on her fingers and bells on her toes. And she shall have music wherever she goes. And she shall love music wherever she goes. And she shall love music wherever she goes. [Music] The wheels on the bus go and round and round and round. The wheels on the bus go round and round all through the town. The horn on the bus goes beep beep beep beep beep beep beep beep beep. The horn on the bus goes beep beep beep. All through the town. The wipers on the bus go swish swish swish swish swish swish swish swish swish. The wipers on the bus go swish swish swish. All through the town, the people on the bus go up and down, up and down, up and down. The people on the bus go up and down all through the town. The bell on the bus goes ding ding ding ding ding ding ding ding ding. The bell on the bus goes ding ding ding all through the town. The doors on the bus go open and shut, open and shut, open and shut. The doors on the bus go open and shut all through the town. The money on the bus goes clink clink clink clink clink clink clink clink clink. The money on the bus goes clink clink clink all through the town. [Music] Pick a baker cake. The baker culture name. Who wants to have the finest cakes? Must have seven things to bake. Eggs and butter, sugar and salt, milk and flour, saffron. Mix it golden brown. Put it in the oven. [Music] Baker baker cake. The baker culture name. Who wants to have the finest cakes? must have seven things to bake. Eggs and butter, sugar and salt, milk and flour, saffron makes it golden brown. Put it in the oven. [Music] 1 2 3 4 5 6 7 8 9 10. One little, two little, three little buses. Four little, five little, six little buses. Seven little, eight little, nine little buses. 10 little buses. Yeah. One little, two little, three little buses. Four little, five little, six little buses. Seven little, eight little, nine little buses. 10 little buses. [Music] One little, two little, three little buses. Four little, five little, six little buses. Seven little, eight little, nine little buses. 10 little buses. Yeah. 10 9 8 7 6 5 4 3 2 1. [Music] Let's play the What's the time, Mr. Wolf game. What's the time, Mr. Wolf? 1:00. What's the time, Mr. Wolf? 2:00. What's the time, Mr. Wolf? 3:00. What's the time, Mr. Wolf? 4:00. What's the time, Mr. Wolf? 5:00. What's the time, Mr. Wolf? 6:00. What's the time, Mr. Wolf? 7:00. What's the time, Mr. Wolf? 8:00. What's the time, Mr. Wolf? 9:00. What's the time, Mr. Wolf? 10:00. What's the time, Mr. Wolf? 11:00. What's the time, Mr. Wolf? 12:00. [Music] Dinner time. What's the time, Mr. Wolf? 1:00. What's the time, Mr. Wolf? 2:00. What's the time, Mr. Wolf? 3:00. What's the time, Mr. Wolf? 4:00. What's the time, Mr. Wolf? 5:00. What's the time, Mr. Wolf? 6:00. What's the time, Mr. Wolf? 7:00. What's the time, Mr. Wolf? 8:00. What's the time, Mr. Wolf? 9:00. What's the time, Mr. Wolf? 10:00. What's the time, Mr. Wolf? 11:00. What's the time, Mr. Wolf? 12:00. Dinner time. [Music] Are you sleeping? Heart is sleeping. Brother John. Brother John. Morning bells are ringing. Morning bells are ringing. Ding ding dong. Ding ding dong. [Music] Are you sleeping? Are you sleeping? Brother John. Brother John. Morning bells are ringing. Morning bells are ringing. Ding ding dong. Ding ding dong. Are you ready? D for a party. Do do and do a poo or a pee in the potty. Well, can you? Yes, you can do it. You can do it. Yes, you can do it. You can do it. First, fold down your diaper or pants. Then sit down. Don't take a chance. Next squeeze. Is it poo or pee? It might be both as you will shortly see. Are you ready? D for no diaper. D. Then do your poo and pee. Not in your diaper, but in the potty. Yes, you can do it. You can do it. Yes, you can do it. You can do it. First, fold down your diaper or pants. Then, sit down. Don't take a chance. Next, squeeze. Is it poo or pee? It might be both, as you will shortly see. [Music] One little tea little, three little friends. Four little, five little, six little friends. Seven little, eight little, nine little friends. 10 little baby bump friends. One little, two little, three little friends. Four little, five little, six little friends. Seven little, eight little, nine little friends. 10 little baby bump friends. [Music] One little, three little, three little friends. Four little, five little, six little friends. Seven little, eight little, nine little friends. 10 little baby bump friends. [Music] You can't see me and I can't see you. One, two, three, four. Peekab-boo. Peekaboo. Peekaboo. One, two, three. I can see you and you can see me. Peeka peeka peekaboo. You can't see me and I can't see you. Peekaboo. [Music] You can't see me and I can't see you. One, two, three, four. Peekab-boo. Peekaboo. Peekaboo. One, two, three. I can see you and you can see me. Peeka peeka peekaboo. You can't see me and I can't see you. Peekab-boo. [Music] Tweedle Deep and Tweedle Thumb were not getting along. For Tweedle Dumb said, Tweedle Deep had snored the whole night long. Just then flew down a very large crow. as black as a tarl which frightened both the heroes. So they quiet for up their quarrel. [Music] Tweedle D and Tweedle Dum were not getting along. For Tweedle D said Tweedle Dum had made their meal all wrong. Just then they heard the thunder boom twice right outside their room. It frightened both the hero. So they went to draw cartoons. [Music] Five little baby bum friends jumping on the bed. Daisy fell off and bumped her head. Mother called the doctor and the doctor said, \"No more jumping on the bed.\" Four little baby bumps jumping on the bed. Bubba fell off and bumped his head. Mother called the doctor and the doctor said, \"No more jumping on the bed.\" Three little baby bum friends jumping on the bed. Mia fell off and bumped her head. Mother called the doctor and the doctor said, \"No more jumping on the bed.\" Two little baby bum friends jumping on the bed. Jake fell off and bumped his head. Mother called the doctor and the doctor said, \"No more jumping on the bed.\" Pig was the last one jumping on the bed. He fell off and bumped his head. Mother called the doctor and the doctor said, \"No more jumping on the bed. [Music] I had a little nut tree, nothing would it bear, but a silver nutmeck and a golden bear. The king of Spain's daughter came to visit me and all for the sake of my little nut tree. Her dress was made of crimson jet black was her hair. She asked me for my nutmeg and my golden pear. I said so fair a princess. Never did I see. I'll give you all the fruit from my little nut tree. [Music] I had a little nut tree, nothing would it bear, but a silver nutmeg and a golden pear. The king of Spain's daughter came to visit me and all for the sake of my little nut tree. Her dress was made of crimson. Jet black was her hair. She asked me for my nutmeg and my golden pear. I said, \"So fair a princess. Never did I see. I'll give you all the fruit from my little nut tree. [Music] [Music] Iny wincy spider climbed up the water spout. Down came the rain and washed all the sea out. Out came the sunshine and dried up all the rain. So iny wincy spider climbed up the spout again. [Music] iny wincy spider climbed up the water spout. Down came the rain and wash pouring sea out. Out came the sunshine and dried up all the rain. So, Wincy Wincy Spider climbed up the spout again. Give me an S. S. Give me an E. E. Give me a V. V. Give me an E. E. Give me an N. N. What have you got? Seven. Yes. be seven cats on seven gates. Seven bulls with seven plates. Seven feet and seven skates. The number seven is great. [Music] [Applause] Seven monkeys in seven trees. Seven whales in the seven seas. Seven locks and seven keys. Seven if you please. [Music] to market to market to buy a pig. M [Music] walk around, shop around, jiggity bake to market to market to buy a cute dog. Walk around, shop around, jiggity jok, [Music] buy a big drum. Home again. Home again. Market is done [Music] to market to market to buy a big cake. M walk around, shop around, jiggity bake to market to market to buy a cute dog. Walk around, shop around, jiggity jog [Music] to market to market to buy a big drum. [Music] Home again. Home again. Market is done. [Music] There was a crooked man and he walked a crooked mile. He found a crooked six pence upon a crooked style. He bought a crooked cat which caught a crooked mouse and they all together lived in a little crooked house. There was a crooked man and he walked a crooked mile. He found a crooked six pence upon a crooked style. He bought a crooked cat which caught a crooked mouse and they all together lived in a little crooked house. They ate a crooked dinner on a very crooked table. and came a crooked horse from a crooked stable. They all had crooked dishes in many crooked styles. And after every bite, each had a crooked smile. [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z A B C D E F G H I J K L M N O P Q R S T U V W X Y Z A B B D E F G H I J K L M N O P Q R S T U V W X Y Z [Music] We really, really love spring. Spring brings lots of new things. New flowers, cute baby lambs. Bees are buzzing. Clap your hands. Summertime means ice creams, beaches, holidays, lovely things. Blue skies, smiling sun. Swimming in the pool, lots of fun. And fall the leaves turn brown. Then they fall down to the ground. Lots of birds then fly away, but they'll come back another day. [Music] In winter time, it's very cold. Build a snowman, grab some coal. Snowball fights and sledding, too. Winter time is fun for you. [Music] Polly, put the kettle on. Polly, put the kettle on. Polly, put the kettle on. We'll all have tea. Me lay the table now. Me, I'll lay the table now. Me I lay the table now. We'll all have tea. [Music] Papa brings out all the cakes. Bubba brings out all the cakes. Papa brings out all the cakes. We'll all have tea. Jas takes the cattle off. Jus takes the cattle off. Jus takes the cattle off. We'll all have tea. [Music] Iny pours the water out. Iny pours the water out. Iny pours the water out. We'll all have tea. Spread the jam and cream on sponges. Spread the jam and cream on gums. Spread the jam and cream on gums. Let's have party. [Music] I have two gloves for my two hands. Two socks that warm my feet. I have two shoes I love so much. Two bows I tie so neat. Can you sing a song about the number two? Will you count one, two, with me? There's so many nice things about the number two. So many nice things you see. [Music] I have two ears that help me hear. Two headphones play a beat. I have two eyes that help me see. I close when I'm asleep. Can you sing a song about the number two? Will you count one, two? with me. There's so many nice things about the number two. So many nice things you see. [Music] Two little ticky birds sitting on a wall. One named Peter, one named Paul. Fly away Peter. Fly away Paul. Come back Peter. Come back Paul. [Music] Into the garden the little birds go looking for worms that hide down low. Peter can't catch one. Neither can Paul. Back home Peter. Back home. [Music] Two little dicky birds sitting on a wall. One named Peter, one named Paul. Fly away Peter. Fly away Paul. Come back Peter. Come back Paul. [Music] Solomon Grande school on a Monday, dancing on Tuesday, painting on Wednesday, biking on Thursday, shopping on Friday, scooter on Saturday, playing on Sunday. That's another tale of Solomon Grundy. [Music] and Grandee. School on a Monday, dancing on Tuesday, painting on Wednesday, biking on Thursday, shopping on Friday, scooter on Saturday, playing on Sunday. That's another tale of Solemn and Grundy. [Music] Are you ready for an alphabet party? Here we go. A B C D E F G H I J K L M N Let's win. O P Q R S T U Yahoo V W X Y Z. It's an alphabet party. [Music] A B C D E F G H I J K L M N Let's win. O P Q R S T U Yahoo V W X Y Z. It's an alphabet party. [Music] Can you guess the shape that has three angles? It's shaped a little like a bell. Jingle jingles. Now this shape, you know, it has three straight lines. It has three sharp corners, so very fine. It's the triangle and it's oh so cool. It's in the shape of a pie. Slice your pizza, too. It's the triangle and it's oh so neat. Like a pine tree out the window or a hanger for your things. Can you guess the shape that has three angles? It's shaped a little like a bell. Jingle jangles. Now this shape, you know, it has three straight lines. It has three sharp corners, so very fine. It's the triangle and it's Oh, so cool. It's in the shape of a pie slicer pizza, too. It's the triangle and it's oh so neat. Like a pine tree out the window or a hang anchor for your things. Okay. Are you ready for some fun? Jump here. Jump there. Jump up. Jump down. Wave your arms. Kick your legs and turn around. Jump up. Jump down. Jump here. Jump there. Kick your legs. Wave your arms like you just don't care again. Jump here. Jump there. Jump up. Jump down. Wave your arms. Kick your legs. And turn around. Jump up. Jump down. Jump here. Jump there. Kick your legs. Wave your arms like you just don't care. [Music] Four right angles, four corners and sides. It looks like a square, but it's much more wide. Each side looks the same as the one across. They're called parallel lines. Now, don't get lost. Chocolate bars are rectangles. Windows and doors are rectangles. Books and magazines are rectangles. Can you find some more rectangles with me? [Music] Four right angles, four corners and sides. It looks like a square, but it's much more wide. Each side looks the same as the one across. They're called parallel lines. Now, don't get lost. Chocolate bars are rectangles. Windows and doors are rectangles. Books and magazines are rectangles. [Music] Can you find some more rectangles with me? [Music] There was a man lived in the moon. Lived in the moon. Lived in the moon. There was a man lived in the moon. And his name was a drum. And he played upon a lle. A lle a lleel. And he played upon a lleel. And his name was a drum. [Music] And his hat was made of good cream cheese. Of good cream cheese. Of good cream cheese. And his hat was made of good cream cheese. And his name was Achen Drum. And he played upon a lle. A lle a lle. And he played upon a lle. And his name was a drum. [Music] And his belt was made from sausages. From sausages from sausages. And his belt was made from sausages. And his name was Aken Drum. And he played up on a lle a lle a lle. And he played upon a lle. And his name was a drum. [Music] Boink boink. Bounce bounce. Jump jump jump. Pounce bounce. Spin around. Touch the ground. Tap your knees. Then make these sounds. Boo bu he he he. Boo bu he he he. Ba ba be ba ba beep beep. Come and count. 1 2 3 then play you and me. [Music] Boink boing. Bounce bounce. Jump, jump, pounce, bounce. Spin around. Touch the ground. Tap your knees. Then make these sounds. Boo boo he he. Boo bu he he he. Ba ba beep beep. Ba ba beep beep. Come and count. One 2 3. Then play you and me. [Music] One and two fish. Three and four fish. Five and six fish. Seven and eight fish. Nine fish. 10 fish. Yeah. [Music] Big and little fish. Gills and scales. Colorful fun fish. Fins and tails. [Music] One and two fish. Three and four fish. Five and six fish. Seven and eight fish. Nine fish. 10 fish. Yeah. [Music] Mary, Mary, quite contrary, how does your garden grow with silver bells and shells and pretty maids all in a row? [Music] Mary, Mary, quite contary, how does your garden grow with gold roses and pink posies and pretty maids all in a row. [Music] Mary, Mary, quite contary, how does your garden grow with large daisies for all the bees and pretty maids all in a Well, [Music] yes, we are little baby bum. We learn and have lots of fun. The songs and dancing never ends with the nursery rhyme friends. Twinkle, Mia, Jacus, Baba, Daisy, Pig, Super Pig, Iny Wincy, Baby panda, you met us now. Please do return to see us again. There's lots to learn. Lots of songs and lots of fun. Lots of love from Little Baby Bun. [Music] I went to the animal fair. The birds and the beasts were there. The oath that burned by the light of the moon was curing his odd burn hair. The monkey haker plunked and fell on the elephant's trunk. The elephant sneezed and went down on his knees. Oh, what a time for the monkey. Monkey monkey monkey monk. I went to the animal fair. The birds and the beasts were there. The oath that burned by the light of the moon was curing his awner plunked and fell on the elephant's trunk. The elephant sneezed and went down on his knees. Oh, what a time for the monkey. Monkey monkey monkey monk. [Music] [Music] 1 2 3 4 5 6 7 8 9 10. One little, two little, three little buses. Four little, five little, six little buses. Seven little, eight little, nine little buses. 10 little buses. [Music] Yeah. [Music] One little, two little, three little buses. Four little, five little, six little buses. Seven little, eight little, nine little buses. 10 little buses. [Music] One little, two little, three little buses. Four little, five little, six little buses. Seven little, eight little, nine little buses. 10 little buses. [Music] Yeah. 10 9 8 7 6 5 4 3 2 1. [Music] Do you know the muffin man? The muffin man? The muffin man. Do you know the muffin man who lives on Drury Lane? Yes, I know the muffin man. The muffin man. The muffin man. Yes, I know the muffin man who lives on Drury Lane. [Music] Do you know the muffin man? The muffin man? The muffin man. Do you know the muffin man who lives on Drury Lane? Yes, I know the muffin man. The muffin man. The muffin man. Yes, I know the muffin man who lives on Drury Lane. [Music] 1 2 3 4 5 six marles rolling down the hill. Let's follow them. It will be a thrill. Six birds are watching up above. And can you see six flowers with six peas buzzing? Six. Six. What a magical number. See? Six ants marching on a cucumber. That's six. Six dogs chasing a frisbee. It must be a six number day. [Music] Six marles rolling down the hill. Let's follow them. It will be a thrill. Six birds are watching up above. And can you see six flowers with six buzzing? Six. Six. What a magical number. See? Six ants marching on a cucumber. That's six. Six dogs chasing a frisbee. It must be a six number day. [Music] Roses are red. Violets are blue. Sugar is sweet. And so are you. And so are you. And so are you. [Music] And so are you. Yes, it's true. I love you. [Music] Roses are red, [Music] violets are blue. Sugar is sweet and so are you. And so are you. [Music] And so are you. And so are you. Yes, it's true. I love you. [Music] An apple a day. An apple a day. An apple a day. So yummy to eat. An apple a day. An apple a day. What a delicious crunchy treat. An apple can help you be healthy and strong. Give you energy to help you along. Apples the vitamins and minerals you need. They can even help you clean your teeth. An apple a day. An apple a day. An apple a day. So yummy to eat. An apple a day. An apple a day. What a delicious crunchy treat. An apple can help you be healthy and strong. Give you the energy to help you along. help with the vitamins and minerals you need. They can even help you clean your teeth. [Music] Let's go to the zoo zoo and see what we can do. do. Let's go to the zoo zoo and see what we can do. Can you stomp like an elephant? H like a snake s. Can you hop hop hop just like a kangaroo? Hop hop. Can you talk like a monkey? E Ooh. Roar like a lion. Roar. [Music] There's so many things that we can do at the zoo. Let's go to the zoo zoo. and see what we can do. Do let's go to the zoo zoo and see what we can do. Can you stomp like an elephant? Hiss like a snake s. Can you hop hop hop just like a kangaroo? Hop, hop. Can you talk like a monkey? E Ooh. Roar like a lion. Roar. There's so many things that we can do at the zoo. [Music] [Music] Little B has lost her sheep and doesn't know where to find her. Leave her alone and she'll come home. Wagging her tail behind her. Little B Peep, she searched for her sheep but didn't quite know how to find her. She looked everywhere from here to there, but still didn't know where to find her. [Applause] [Music] Little Bo Peep, she searched for her sheep, but didn't quite know how to find her. She looked everywhere from here to there, but still didn't know where to find her. Little B Peep has lost her sheep and doesn't know where to find her. Leave her alone and she'll come home. Wagging her tail behind her. [Music] Let's sing a song about things that go fast. Have you ever seen a train zooming down the track? Clacky clacky clack clack clack clack clack clack clack. Or a very fast cheetah with spots so black. Zap zap zap zap zap zap zap zap zap zap. Speed boat racing in the water. So fun. And a dolphin loving to swim in the sun. Sh. [Music] How about a fast plane flying so high? Fly, fly, fly, fly, fly, fly, fly, fly, fly fly fly fly fly fly fly fly fly fly fly fly fly fly fly fly fly fly fly fly fly. >> Or a golden eagle diving down from the sky. My my my my my my. >> A rocket speeding on its way to the moon. Zoom zoom zoom zoom zoom. >> It's very fast and will be back soon. Soon so soon soon soon. [Music] The oak tree grows slowly. The snail slithers slowly down the leaf. The turtle below is traveling quite slow and the sloth likes to take things easy. [Music] Sometimes slow is the way to go. Some things are better done slow. [Music] The elk tree grows slowly. The snail slithers slowly down the leaf. The turtle below is traveling quite slow and the sloth likes to take things easy. Sometimes slow is the way to go. Some things are better done slow. [Music] Simple [Music] Simon met a pon going to the fair. Says simple Simon to the pon let me taste your wear. Says the p to simple Simon. Show me first your money. A simple slime to the pond and hear your bus smell yummy. [Music] Simple Simon sat right down to eat the yummy pie. He took a bite and then another. When finished, he did sigh. Simple Simon went back home with a very full tummy. As he walked the long path home, he thought of the pie. So yummy. [Music] Rub a dubdub. We sail in a tub. And where do you think we'll go? An island I see with bananas and trees. Coconuts swaying merrily. Let's step a there's so much more. Oh, what a beautiful scene. La. [Music] Oh, what a beautiful scene. La. Oh, what a beautiful scene. [Music] Rub a dubdub. We sail in a tub. And where do you think we'll go? An island I see with bananas and trees. Coconuts swaying merrily. Let's step a there's so much more. Oh, what a beautiful scene. La. [Music] Oh, what a beautiful scene. La. Oh, what a beautiful scene. [Music] 1 2 3 4 Five little birds went flying one day over the hills and far away. When mother bird said, \"Tweet, tweet, tweet.\" Only four birds came to the tree. One, 2, three. Four little birds went flying one day over the hills and far away. But mother bird said, \"Tweet, tweet, tweet.\" Only three birds came to the tree. One, two, three little birds went flying one day over the hills and far away. But mother bird said, \"Tweet, tweet, tweet.\" Only two birds came to the tree. [Music] One, two little birds went flying one day, over the hills and far away. When mother bird said, \"Tweet, tweet, tweet.\" Only one bird came to the tree. [Music] One little bird went flying one day over the hills and far away. When mother bird said, \"Tweet, tweet, tweet.\" No little birds came to the tree. [Music] Sad mother bird went flying one day over the hills and far away. When Papa said, \"Tweet.\" All the birds came flying to the tree. [Music] Butterfly, you're beautiful. Your colors are amazing. You're beautiful, butterfly. You're totally breathtaking. Your wings flutter in the breeze. A wonderful sight to see. You rest upon a yellow flower and look so very pretty. [Music] Butterfly. You're beautiful. Your colors are amazing. You're beautiful butterfly. You're totally breathtaking. [Music] When you're hungry, do you drink nectar that's sweet and your favorite thing? And when it's to sleep, you find a leaf hang upside down. your veins. [Music] Butterfly, you're beautiful. Your colors are amazing. You're beautiful, butterfly. You're totally breathtaking. [Music] Make a wish. Dreams can come true. Just believing enough is all you do. A fairies kiss on your cheek at night happens when you wish upon the sunlight. [Applause] So believe in magic. Dreams can come true. Just make a wish is what you do. A fairies kiss on your cheek at night. Happens when we wish upon the starlight. So make a wish tonight. Dreams can come true. Just believe enough is all you do. [Music] Let's go swimming. It's so much fun to play in the water with everyone. Let's go swimming. It's really fun to do. It's true. We can swim on our backs, swim on our sides, paddle all around, make a splash so high. We can swim at the pool or swim in the sea. And you can really have a great time. Just wait and see what you can do. Oh yeah. Let's go swimming. It's so much fun to play in the water with everyone. Let's go swimming. It's really fun to do. It's true. We can swim on our backs, swim on our sides, paddle all around, make a splash so high. We can swim at the pool, or swim in the sea, and you can really have a great time. Just wait and see what you can do. Oh yeah. [Music] He meow. He meow. Friendly tiger says hello. Hello. Hello. Hello. Me nei [Music] Hello. Hello. Hello. Me nei [Music] hello. He meow. He meow. The swinging monkey says hello hello. [Music] [Applause] [Music] One, 2, [Music] 3, [Music] 4. Five. [Music] 6 7 8 9 10. [Applause] 11. 12 [Music] 13 14 15 [Music] 16 [Music] 17 18 [Music] 19 20 [Music]",
    "start_time": 0.0,
    "end_time": 7110.719
}