{
    "video_id": "JtwO9TiZMMs",
    "channel_url": "@littlebabybum",
    "transcript": "[Music] A B C D E F G >> A B C D E F G >> We are learning A B C. >> We are learning A B C. H I J K L M N >> H I J K L M N M N >> It's alphabet time again. >> It's alphabet time again. >> O P Q R S T U >> O P Q R S T U >> I can do it. You can do. >> We can do it. You can too. >> V W X Y Z. >> V W X Y Z. >> All the letters A through Z. >> All of the letters A through Z. >> Now you try it without me. A B C D E F G We are learning A B C H I J K L M N It's alphabet time again. O P Q R S T U. We can do it. You can do V W X Y Z. All of the letters A to Z. >> Well done. Now you won't forget the letters of the alphabet. [Music] Singing with the bus driver. Bus driver. Bus driver. Singing with the bus driver. We go to school. She sings a fun song and we all sing along. Singing with the bus driver. We go to school >> learning with our school teacher. School teacher. School teacher. Learning with our school teacher. We love to learn. We read and we write. We try to get our sounds right. Learning with our school teacher. We love to learn. Singing all together together. Singing all together with my friends each day. >> We sing and we laugh. We play games and we have fun. Singing all together with my friends each day. >> Singing with the bus driver. Bus driver. Bus driver. Singing with the bus driver. Time to go home. We had a great day. We worked hard and we played singing with the bus driver. Time to go home. [Music] A B C D E F G H I J K L M N O P Q R, S, T, U, V, W, X, Y, and Z. Now I know my ABCs. Next time, won't you sing with me? A B C D E F G H I J K L M N O P Q R S T U V W X Y and Z. Now I know my ABCs. Next time, won't you sing with me? [Music] Papa, can you teach me the ABC song, please? >> Why, of course, little baby bear. Are you ready? Then let's begin. Here we go. 1 2 3 4 >> A B C D E F G H I J K L M N O P Q R S T U V W X Y and Z. Now I know my ABCs. Next time won't you sing with me? A B C D E F G H I J K L M N O P Q R S T U V W X Y and Z. Now I know my ABCs. Next time, won't you sing with me? [Music] That was really good fun. Can we sing ABC again? >> Yes, of course we can. >> Thanks, Papa Bear. >> Anytime you like, little baby bear. [Music] A B C D E F G [Music] H I J K L M N O V Q R S T U V W X I Z [Music] [Music] A B C D E F G [Music] H I J K L M N O P Q R S T U V [Music] W X Y and Z. [Music] Now I know my ABCs. Next time won't you sing with me? [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z [Music] A B C D E F G H I J K L M N O P Q R S T U V W [Music] X Y Z [Music] A B C D E F G >> A B C D E F G [Music] H I J K L M N >> H I J K L M N [Music] O P Q R S T U >> O P Q R S T U V W X Y Z >> V W X Y Z. [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z A B C T E F G H I J K L M N O P Q R S T U V W X Y Z A B C D E F G H I J K L M N O P Q R S T U V W X Y Z [Music] A B C D E F B [Music] H I J K L M N O P Q R S P U V W X Y Z [Music] A B C D E F G [Music] H I J K L M N O P Q R S, T, U, V, W, X, Y, Z. [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z. Now I know my ABC. Next time won't you sing with me? [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z. Now I know my ABC. Next time, won't you sing with me? [Music] A A B C D E F G [Music] H I J K L L M N O P P Q [Music] R S S T U V W X X Y and Z. Now we know our ABCs. Won't you come and sing with me? [Music] [Applause] [Music] A B C D E F G H I J K L N O P Q R S T U V W X Y V A B C D E F G H I J K L M N O P Q R S T U V W X Y C [Music] A B C D E F G H I J K L N O P Q R S T U V W X Y V. [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z X Y Z [Music] A B C D E F G H I J K L M N O P Q R S T U V W X Y Z X Y Ready? [Music] A a n b- baba c-c cake daisy e- explorer f frog gg-go h Horse. I I inc J C-C- King Lion M-m nighttime a octopus P-Polly Q-queen R-rot Spott snake t twinkle u u- umbrella v- violin wale x x-ray y- zoo Two. [Music] A ant b-bear. C-C- camel. D- dolphin. A elephant. F. F- fox gg- goose hippo ITY J-J- jellyfish c-c kangaroo lion mm monkey mm Noot a octopus. [Music] P-p panda [Music] cquail. R-r raccoon. F-s snake. T- tiger. U- urchin. V- vulture. WW- whale. X X-ray fish. Y- yuck. Zebra. [Music] A B C D E F G H I J K L M N O P Q R S T U, V, W, X, Y, Z. Now I know my ABC. Next time, won't you sing with me? A B C D E F G H I J K L M N O P Q R S T U V W X Y Z. Now I know my ABC. Next time won't you sing with me? [Music] Three. [Music] Three. You and me. Let's all count from 1 to three. Take your time for this rhyme. Let's find three so easily. [Music] Count to three. Over and over. Let's find a little green clover. There it is. Can you believe? One and two and yes, three leaves. Up next, it's the triangle with three sides and three angles. Some sides are short, some are long. If you count three, you're right, not wrong. Three, three. You and me, let's all count from 1 to three. Take your time for this rhyme. Let's find three so easily. Have you ever seen a tricycle? It's like a threew wheeled bicycle. One wheel at the front and two at the back. If you count them all, you've got the knack. Now, don't forget about the three little kittens, the naughty cats who lost their mittens. Here they are. Can you see? Count them with me. 1 2 3. Three. Three. You and me. Let's all count from 1 to three. Take your time for this rhyme. Let's find three so easily. [Music] Give me an S. S. Give me an E. E. Give me a V. V. Give me an E. E. Give me an N. N. What have you got? Seven. Yes. Be seven cats on seven gates. Seven bulls with seven plates. [Music] Seven feet and seven skates. The number seven is great. [Music] [Applause] Seven monkeys in seven trees. Seven whales in the seven seas. Seven locks and seven keys. Seven if you please. [Music] 1 2 3 4 5 six marles rolling down the hill. Let's follow them. It will be a thrill. Six birds are watching up above. And can you see six flowers with six bees buzzing? Six. Six. What a magical number. See, six ants marching on a cucumber. That's six. Six dogs chasing a frisbee. It must be a six number day. [Music] Six marles rolling down the hill. Let's follow them. It will be a thrill. Six birds are watching up above. And can you see six flowers with six bees buzzing? Six. Six. What a magical number. See? Six ants marching on a cucumber. That's six. Six dogs chasing a frisbee. It must be a six number day. [Music] 10 little count. First there's one, then two and three. Next is four and then it's five. Five little skip by. Great, we're halfway. Let's high five. The little number after five is six. Now here's seven. Yes, that's it. Then count eight. 9 and 10. 10 little 1 through 10. 10 little 1 through 10. Let's all sing along again. 10 little count with me. First there's one, then two and three. Next is four and then it's five. Five little numbers skipping by. Well done. We're halfway again. The little number after five is six. Now comes seven. Yes, that's it. Then count eight, nine, and 10. 10 little numbers 1 through 10. 10 little numbers 1 through 10. Well done. You can count to 10. [Music] Aapp bbb bus c-c- cow d-duck e- elephant f- fish gg-girl h- hat I I igloo j- jungle. C-C- kittens. [Music] L-amb. [Music] Mm-m. Moon. N-N- nest. A orange. P-pig. Quack. R-rbow. S-star. T- train uh uh under v- video wale xylophone yo-yo [Music] z-z [Music] the alphabet with me. A a apple bb baby c-cake du du- dog E- elephant f-frog g-g-goat hat I I I J- J- Jelly K C-K-ite L-L lollipop M-mouse N-N- N-N- nest O-r Panda and a Q qur [Music] S star Turtle Umbrella V-Vees WW X X-ray fish. Yellow Zra. [Music] A is for ant. A ant. B is for bear. BBB bear. C- is for cat. C- C- cat. D is for duck. Du duck. E is for elephant. E- elephant. F is for frog. Frog. G is for goat. G-ggoat. [Music] H is for horse. H- horse. [Music] I is for iguana. I I iguana. J is for jellyfish. J- jellyfish. C- is for kangaroo. C- c- kangaroo. L is for lion. L lion. M is for monkey. N m monkey monkey. N is for noot. Noot. O is for owl. Owl. P is for panda. P- panda. [Music] [Applause] Qu is for quail. Quail. [Music] R is for rabbit. Rabbit. S is for snake. S snake. T is for turtle. T- turtle. [Music] U is for unicorn. U unicorn. V is for vulture. V vulture. W is for whale. Wale. X is for x-ray fish. X-ray fish. Y is for yak. Yak. Z is for zebra. Zz zebra. [Music] Hey, let's learn shapes together. Are you ready? Let's begin. Square. Circle, triangle, rectangle, square, circle, triangle, rectangle, square. Circle, triangle, rectangle, square, circle, triangle, rectangle, star, heart Oval, diamond, star, heart, oval, diamond, star, heart. Oval diamond star heart oval diamond. [Music] Circle, square, triangle, [Music] rectangle, [Music] star, Heart, oval, diamond, hexagon, [Music] pentagon. [Music] circle, square, triangle, [Music] rectangle, [Music] star, heart. Oval, diamond, hexagon, [Music] pentagon. [Music] We wish you a merry Christmas. We wish you a merry Christmas. We wish you a merry Christmas and a happy new year. Good tidings we bring to you and your kin. We wish you a merry Christmas and a happy new year. [Music] Oh, bring us a figgy pudding. Bring us a figgy pudding. Bring us a figgy pudding and a cup of good cheer. We wish you a merry Christmas. We wish you a merry Christmas. We wish you a merry Christmas and a happy new year. Good tidings we bring to you and your kin. We wish you a merry Christmas and a happy new year. [Music] Twinkle, twinkle, little star, how I wonder what you are. Up above the world so high. Like a diamond in the sky. Twinkle, twinkle, little star, how I wonder what you are. [Music] Row, row, row your boat gently down the stream. Merrily, merrily, merrily, merrily, life is but a dream. Row, row, row your boat gently down the stream. If you see a crocodile, don't forget to scream. Row, row, row your boat gently down the stream. You might see a great big lion eating his green beans. Row, row, row your boat gently down the stream. If you see an elephant, is he wearing jeans? Row, row, row your boat gently down the stream. Can you see the hidden frogs? They are very green. Row, row, row your boat gently down the stream. Can you see a little duck eating an ice cream? Row, row, row your boat gently down the stream. Merrily, merrily, merrily, merrily, life is but a dream. The wheels on the bus go round and round, round and round, round and round. The wheels on the bus go round and round all through the town. The signals on the bus go blink blink blink blink blink blink blink blink blink. The signals on the bus go blink blink blink all through the town. The driver on the bus says, \"Sit, sit, sit, sit, sit, sit, sit, sit, sit.\" The driver on the bus says, \"Sit, sit, sit.\" All through the town. The people on the bus, they wave, wave, wave, wave, wave, wave, wave, wave, wave. The people on the bus, they wave, wave, wave. All through the town, the cow on the bus says moo moo moo moo moo moo moo moo moo. The cow on the bus says moo moo moo. All through the town. The children on the bus go giggle giggle giggle giggle giggle giggle giggle giggle giggle. The children on the bus go giggle giggle giggle all through the town. The lights on the bus go on and off, on and off, on and off. The lights on the bus go up and off all through the town. [Music] The wheels on the bus go round and round, round and round, round and round. The wheels on the bus go round and round all through the town. The door on the bus goes open and shut, open and shut, open and shut. The door on the bus goes open and shut all through the town. The card on the bus goes leap. [Music] The car on the bus goes beep beep beep. All through the town. The people on the bus go up and down, up and down, up and down. The people on the bus go up and down all through the town. The pig on the street says, \"Wait, wait, wait, wait, wait, wait, wait, wait, wait.\" The pig on the street says, \"Wait, wait, wait.\" All through the town, the children on the bus say, \"Look, look, look, look, look, look, look, look, look.\" The children on the bus say, \"Look, look, look.\" All through the town. The lion on the bus says, \"See you soon. See you soon. See you soon.\" The lion on the bus says, \"See you soon.\" off from the bus. [Music] The wheels on the bus go and round and round. Round and round. The wheels on the bus go round and round all through the town. The baby on the bus says. [Music] The baby on the bus says all through the town. The mommy on the bus says shush shush shush shush shush shush shush shush shush. The mommy on the bus says shush shush shush. All through the town. The people on the bus go cha cha chchatter cchatter cchatter cchatter cchatter cchatter cchatter. The people on the bus go chhatter chchatter cchatter all through the town. The bell on the bus goes ding ding ding ding ding ding ding ding ding. The bell on the bus goes ding ding ding. All through the town. The diesel on the bus goes cluck cluck cluck cluck cluck cluck cluck cluck cluck. The diesel on the bus goes cluck cluck cluck all through the town. The engine on the bus goes vroom vroom vroom vroom vroom vroom vroom vroom vroom. The engine on the bus goes vroom vroom vroom all through the town. [Music] Row, row, row your boat gently down the stream. Merrily, merrily, merrily, merrily, life is but a dream. Row, row, row your boat gently down the stream. Merrily, merrily, merrily, merrily, life is but a dream. [Music] Row, row, row your boat gently down the stream. Merrily, merrily, merrily, merrily, life is but a dream. [Music]",
    "start_time": 0.0,
    "end_time": 3434.19
}