{
    "video_id": "Em-e9f7UTVE",
    "channel_url": "@prestonyt",
    "transcript": "Can you outrun a boulder like an Indiana Jones? >> Have you ever watched a scene from a movie and thought, \"I could survive that.\" So, have you ever wondered if you could actually survive the trash compactor from Star Wars? >> This is iconic. >> What? >> What was that noise? >> Oh no, it's actually moving. Okay, how do we get out? >> All we have to do is find the key to this door behind us, but it's somewhere in the trash. But wait, I think I found Han. >> Oh my gosh, I found me. I'm not trash. >> Oh, we got some boxes, boys. What is it? >> Look in Look in the box. >> There's something in here. >> What's it? What is it? >> I don't think that happens in the movie. >> Oh, I stepped in cream. We can't let a movie literally beat us. We're better than this. We are >> Oh my gosh. Wait, Preston. This might help. What the heck am I looking at? Okay, wait. In the movie, they use like a big old thing to stop the compactor. >> Come on. Keep finding the key, >> please. >> I'm looking at memes. >> Okay, this is not the time to look at memes. >> Give the red of the binder. I'm looking for the key. >> I found a big box. This has to be good. >> Okay, now we're getting a little bit ridiculous. >> Well, why would you throw it that way? >> I don't know, >> boys. Hold on. I have an idea. What if we just ask the people that are trying to kill us if they know where the key is? >> That's a good point. >> Hello. Have you seen the key? Why is the wall touching him? >> Yo, that's a freaking keyboard. >> This is not what we wanted. >> Now, why would they throw away the key that's for the room that we're inside of? Guys, it's closing in now really fast. You guys thirsty? >> It's working. I bought us some time. >> Find the key, Josh. Find the key. >> Oh, there's nothing but phone cubes in here. >> Oh, Chase. Chase, your job is to literally keep them distracted. >> Okay. Yeah, I think it's working. >> Chase, they're squeezing us in. Do something. >> Oh my god. >> Finally. Rat. >> Bye, guys. No, no, no. Open the door. >> This is what you guys get. >> What have you done? >> What happened? >> What have you done? >> Please subscribe to me. Open the door. [Applause] Now we've got to survive the rickety bridge from Shrek. Any one of these planks could fall when we step on them. >> Oh, we're going to get Shrek. >> Oh, hello. >> Okay, who's going first? Donkey, Shrek, maybe. Um, >> yeah, ladies. >> What? I'm not even in the mood yet. >> You're pretty lady at that. >> Now, there's no way the first step is the broken one, right? Okay. Come on. >> Okay. And send it. Why is he stepping on it? >> Okay. Okay. Okay. Well, that Oh my Oh jeez. On the second one. >> You guys didn't see up my dress, did you? >> How are you going to make it to the next place? >> I don't know. I got to pick up my dress. >> You can't jump. >> Oh, I'm alive. Hey, do a little hop. Okay, Princess Fiona's in Shrek 2. I should be good. That's how Fiona died. That's going to be happening in Shrek 5, actually. >> Look, I'm not worried cuz everybody watching right now has clearly already liked the video to protect me. Thank you so very much. I just want to test the bridge. >> Whoa. Whoa. Calm down. >> Don't do this, >> bro. You're scaring me. >> No. >> That was a pretty good jump. Do it again. Seriously, >> he only wants me to do that so I fall. >> You know what, dude? Use one foot. All right, put one foot up. >> Bro, I've been split like this in so long. What if I could do this one with no hand? >> No, no, no, no, no. I'm scared. >> Lift. Lift. >> Oh, he trains for this. >> I didn't know it's going to >> We're almost halfway there. We can do this. >> Okay, don't. You're too confident. We're good. We're good. >> Now, the moment we step onto this plank, we are officially halfway there. >> Whoa. Whoa. That one's not bad. >> This thing is safe. By the way, >> noted. >> I'm going to pull Simbus. [Music] >> It was not good. >> Preston, I'm coming to save you. I'm coming to save you. >> We both died, but Donkey could survive. >> You know what? I left from that safe platform to come and save you and now you're back up here. >> Hey, I think this thing's shaking a little. Hey guys, calm down. >> It's just like the movie. All right. >> When did this happen in the movie? >> Stop doing it. >> Oh my gosh. >> Who invited the dragon? >> What are you doing? >> What is that? No. Stop. Stop. Stop. Oh, >> he's getting through the cut. >> Yes, I made it. >> And they tried to sabotage me. The donkey always wins. >> Don't you guys have babies in the movie? >> I'm I'm not doing that. >> This is my favorite movie from my childhood, Home Alone. All we have to do is get to Kevin, but he may or may not have some traps. In fact, even in the movie, the handle is hotter than heck. We are not going to touch that. We are going through the window. >> Does this make us the bad guys? >> Come and get me. >> Oh, he's going. >> See, are we the bad guys when we're being taunted? I mean, come on. >> Remember, be careful. >> Have you guys ever known me to not be careful? >> Hurry up. >> It's really good. Why are you going through like that? >> Because this is the best position. I'm just looking up to see if there's any traps. Oh, there's nothing up here. Don't go through the window. All right, Josh. You know what, Chase? I think you should just try the door. >> Let me get I'll get the door for you guys. >> Be careful, Preston. >> On the way. >> We're good. We're good. We're good. We're just We're >> Nice shot. >> Preston. >> Oh, stop goofing around. >> Hold on, Dad. I'm I'm coming. >> We're good. >> All right. So, now we just got to find Kevin, right? Who's that? >> I don't know. Oh my. Okay, I think there's no more traps now. Kevin, we're coming for you. >> I don't think Kevin. >> Okay, I understand why they wanted Kevin. >> Christian, your new haircut is dumb. >> Okay. >> Can I move on to the next one? >> Yeah. Be my guest, buddy. Don't be my guest. >> Go get Kevin. Dutch, have you watched the movie? >> My foot is stuck. >> If you haven't watched the movie, watch out for the stairs because usually there's a trap on them. >> No, my shoes. >> We cannot let Josh get to Kevin first. Chase, come on. >> Oh, not these stairs. >> If he had watched the movie, he would know you go up the slippery side, not the sticky side. >> Wait, Josh. Josh, >> you're going on the slippery side. No. No. Oh, it's just my >> Hey, they broke my ball. I'll push you up. I'll push you up. >> Don't press them. >> These stairs are so They really aren't liberating. No, >> I'm going to win. Go, go, go, go. No. No. Press. Go. Go. Go. Go. He's about to get no >> Oh, God. No. >> Josh, it's up to you. Oh, I already won. >> You what? >> You got Kevin? >> That means we didn't survive. >> You guys give up. >> In Jurassic Park, they're trapped in the kitchen trying to make it to the exit without getting caught by the velociraptors. >> Why don't we just go through the the whole thing? >> You know what, Josh? That's a really good point. I think that the youngest person should go first. >> I agree with that. >> Look, I won't argue with it. >> Oh my. That's how they die in the movie. >> Oh jeez. >> Thankfully, I have another younger brother. >> Roger. Coming this way. They're coming this way. Okay. >> I'm going to go left. If he sees me go left, you're going to have to make some noise. Throw a ladle to the right. Okay. >> Okay. Okay. Ladle. Ladle. Lead. Ladle. Why is Chase making so much noise? They hide in one of these in the movie. >> So if I hide near him, they're going to kill me. [Applause] >> He's coming this way. I'm going to close off this spot on this cutting board. Distraction. There was something person. Oh no. Run. Run. Come here. Come on, Raptor. Come on. You're just so scary. Okay. Right this way. Come on. >> He's a braver man than I ever was. >> Okay. Six. No. No. Don't close it. No. He was supposed to put the velociaptor on the outside. [Music] >> That's just been behind me the whole time. Wait, does this mean that even if Josh had made it to the door that even if I had to press this anyways to unlock the door? I'm literally with buffoons. [Music] >> Wait, did that just unlock another one? >> You want some of this? Why does he sound like he's dying? [Music] Stand back. The >> exit door's right behind us. [Music] [Applause] Thank god we're going to the next movie. [Music] >> Can we survive the claw and the claw? >> We have 30 seconds to hide. Go, gentlemen. Go. >> Uh, wait. Drink. [Music] >> We are hiding from the claw. If he grabs you, then you die. Guys, where'd you guys go? Okay, I'm just going to start digging around and if I see something Oh my nuts. Oh, I got something. I think you got Josh. >> Oh, boy. Oh, the blood's going to go to my head. >> No, not my sock. >> Josh has been retrieved by the claw, which means it's just Chase and I left. >> There's movement back in this corner. All right, try to get me over here, boys. >> He's at my corner. >> I think he sees Chase. down. Just let go. Not like that. I think the claw is malfunctioning. I saw you moving back here. Where you at? I got something. No. No. No. No. Get away from me. I got her. I got her. I got it. I just got to go backwards. You can't get me. Do him. >> Get you. Come here. I'm sorry, Larry. No. >> I'm sorry. You shot me in my butt. I didn't want to do this. I haven't worn one of these movies yet. Okay, I got to hit him with a pinser maneuver. >> Oh, I don't know what that mean. >> No, no, no, no, no. >> If you want to take us, Claw, you got to take us as a package deal, >> dude. We're like 400 lb. >> Yeah. And most of that's Chase. >> Preston. No. No. Preston, you can't do this to me. I need you. >> Now, we're in Pirates of the Caribbean, but I don't remember exactly what happens in this movie. That's the second. I think they ran out of rum and then there was something else in it. David, what's happening? >> Oh, jeez. Oh, we got trapped. Oh, it's the second movie. That's the one in the water. >> Okay, so there's only one way I can see to get out of this, which is probably to cut our way out. >> Guys, there's tools over there. But there's snacks over there. Look, I suppose we could use a snack to keep us fueled to try to get out of this. >> Guys, I'm getting rope burned. Okay, everyone together. I can't I'm the bottom right now. Tighten your right cheek and your left cheek and then do it over and over again. Okay, >> keep it going. We just got to get closer. As close as we've been the rope, captain. >> You guys are useless in a nice way. >> You are the captain. You need to give us clear directions. >> We have left or right. What other direction is there? >> Team work together. >> Come on. Get it. Come on, Preston. Give me the Cheetos. Oh god. Nice. >> Whoa. Watch where you're put in that thing. >> What did that help you with, bro? >> Well, I thought we could use this side of the rope to get the weapons. >> Preston, I got an axe. I don't know what to do with it now. >> But come back for that later. Okay, now we can swing cuz our feet is not scraping the floor. >> Swing it. >> Grab it. Grab it. You ly swing it. >> Here. Read. At what point in time do we just accept our fate and roll the >> What do you call a female pirate with a peg leg? >> Eileen, promise you, no matter what, we are getting out of this. It might just take a little while, okay? But we no matter what are not going to die. [Music] In every action movie, there is a scene where you do not cut the wrong wire because if you do, the bomb will explode. What's this on button? Every movie also has the useless sidekick. You can go first. Oh, I always >> uh Chase, why don't we just step back? >> A moment of silence. I'd like to use the the death of my brother for everybody to please go to firem.com. Preston, I think that's your turn now. >> I'm cutting both of the pink wires. >> That's six. That's seven. Which one are you going to cut? You have to choose one. >> No. >> Oh, you did it. >> Some might say you are down to the wire. >> That's nice. Nice. >> Okay. Come on. It's not easy being green. Light them, cowboy. Green, you mean? >> Oh, we're good. And this open. Oh, woo. I won. Yes. Yes. Yes. Yes. Yes. Okay, guys. The channel is officially named Chase. If you want to make it happen, please watch one of these videos or one of these videos. Make this channel named Chase. Let's go.",
    "start_time": 0.08,
    "end_time": 943.92
}