{
    "video_id": "Bgdx7_7HbR0",
    "channel_url": "@ishowspeed",
    "transcript": "I think you should. >> I think you can. >> You don't think I can't? On God. What? I So I can eat a third burger right now. I can kill a third burger right now on God. >> You're fat. >> The [ __ ] I ain't eat [ __ ] all day. The hell? I can't. [ __ ] do you know who I am? I kill a third burger right now. >> What? Excuse me. >> Taste like chat. Chad Rudy think I can't go for a third burger, bro. Bro, bro think I'm sold. >> Bro think I can go for a third burger. >> Chad, should I go for the third burger? Yes or no? >> Should I go for the third burger? Yes or no? You can't. >> Give me another. >> Give me another third burger. >> Where the burgers at? the other two. >> So what? >> I ain't going to lie. If I was on the diet, I can go for three burgers, too. >> Wow. You got greedy, man. >> Chad, should I go for the third one? >> Go ahead. >> Oh [ __ ] >> [ __ ] it. >> I'm about to prove your ass wrong. >> I'm about to prove your ass wrong. Watch this. >> You're going to be You're going to be all right if you do. You're going to be like full. >> I'm not full right now though. >> Seriously. >> I mean, I'm full, but I can go for another one. >> It's a shame, man. We ain't got that one with us, man. >> Could have ate. >> I know, bro. >> I don't know what happened to him. Got too busy out there. >> Did he get lost? >> Lost in the sauce. >> I told him to get in the car. >> Oh, you told him to get in the car? Yeah, I told him to get in the other car. >> [ __ ] it. Let's go for it. >> Need to send the location out. You know why? >> What? way too far. >> That is it. This is it. This is it. This is it. This is it. >> I gave the driver all the sewing lead Austo donated $199.99 through super chat. Hey Jamal, why can't you be like you, brother? >> Well, you want me to eat three burgers? I can be like you. >> You can't eat three burgers. >> I donated£1.99 through super chat. Yeah, >> Rudy, I saw you at Sidon Vid also Costco. >> Are you ahead of us? >> Benjamin Garcia donated $1.99 through super chat. Yo, Speed, where you going next? >> Hey, bro. Send that um send that dude to the bus. >> AG donated $5 through chat. Jamal, get that phone in your damn pocket. You're on a diet. >> I got no pocket. Don't try that. I >> think he flashed you, didn't he? >> Did you ever get his number? >> He flashed a >> We gave him his We gave >> Lfg 123 donated $1.99 through super chat. >> Speed go bald so you can race faster. Fire, fire, fire, first place medal. Trophy trophy. Trophy trophy. [Music] What we doing? Where we going? >> Logan collard donated $2 through super chat. W speed L Messi. >> What? >> Link X lobby donated $2 through super. >> I think he's done. Definitely. >> I can't go over another one. >> 99 super chat. >> I'm not going to be a fatty fatty though. Three burgers is I can What? >> You think I can eat four burgers? >> Jamal stole his pockets and probably it be for real. Exactly. Be for real, >> bro. I don't want to be a ass, bro. >> Chat >> kicking donated $1.99 through super chat. >> Take Jamal to 27th Avenue. >> Watch this. >> You really think I can't? You know I can. Why you doing that? >> You know I can eat four burgers easily. I'm not even full. I'm not even like I'm not fooled. >> Do I do it? Yes or no? >> Yoyo donated $1.99 through super chat. Rudy judging right now. [Music] >> Watch this. >> Super chat. >> [ __ ] out of here. >> I like Jamal V. Smooth and cool like a capabara. >> Let's see you eat that, bro. >> Eat the whole thing. >> Soy Louis C2 donated $4.99 through super chat. >> What are you doing? >> I need a burger. >> I need another one. >> Ripar donated $1.99 through super chat. >> Believe him. He was lame. >> All right, I'm not going to eat no more. I got to leave the rest of the three. >> I got to leave the rest of the three of for Henry. >> $1.99 through super chat. >> Henry's going to eat like two burgers. >> Can you say, >> \"Watch this. Watch this. Watch this. Watch me. Watch. Watch me.\" >> Azul's mind donated $1.99 through super chat. >> That's crazy. Four burgers doubles. >> Yeah. >> Tapped after two. >> Smoking AK donated $1.99 through super chat. Jamal sneaking stop speed. Get on his lying. >> Watch me. Alex donated $1.99 through super chat. Henry in the front demolishing those burgers. >> Hello. >> Hey, what did I tell you? I told you you can do it. >> Soy Louis C2 donated $4.99 through super chat. >> Come to Yuma as >> guys. Move away from the vehicle. Why are you opening my door? Why are you opening the door? Why did you open the door? >> I'm sorry. Apologies. >> All right. Step back. Step back. >> Rip donated $1.99 through super chat. >> Ames loves Molly water. >> What? >> Why you putting your hand in the window? You don't put your hand in. >> Tano donated $2. >> Hey, Captain. Will you check my jersey? [Music] Hey. Hey. Look at him. shirt donated $2 through control and had a great matter what you got. Look at him. Look at him. Look at him. >> He's eating, right? >> So then he had some patience. >> Have some patience. >> Donated $1 through super chat. >> What are we doing though? >> What are we doing? The names to tell you >> Ilia Karoon donated $4.99 through super chat speed. We should collab. I'm an Olympian and would love to race you 25 freestyle. >> Jose Sito donated $1.99 through super chat. Bro, you actually ate that. >> Four burgers, baby. >> Four burgers. >> What I tell you, bro? >> LFG 1239 through superhat. You burn more calories than intake. >> Four double cheeseburgers. >> Yeah. >> Donated $4. Paul and my parking ticket in San Francisco like meww. >> You got a man like me. >> You crazy. >> I got a man like me. >> Four double cheeseburgers just like that. >> He's eating one of them. >> Four double cheeseburgers. I'm And I can eat another one. >> Here you go, bro. Anthony Henry gonna get mad if I eat another one. You are the best. >> Nah, bro. Henry need to eat, bro. >> Henry got like, >> right? Henry's a big man. >> There's more burgers. >> Samuel Riot donated 100 super chat. >> What's happening between speed and slips? >> There's some heat there. >> 200 g of protein. >> Really? >> Yeah. You need 200. >> It's like 40. 40 brand. >> Yeah, you already got >> So I already got my protein intake. >> Can you stay lit? >> Bucket, bro. I've been here since Hey, one at a time though. Y'all got to chill. One at a time. Just right here. >> Just relax. >> Bro, why are you doing this, bro? >> You want to see what's possible? >> Hold on. Hold on. Hold on. Hold on. Hold on. Hold on. Yo, >> eat these burgers. >> That's too much. >> I go for five. Way too much. >> You got to finish those two burgers. Two more burgers. >> I'm not [ __ ] Joey Chestnut, my [ __ ] >> I'm not about to eat all these [ __ ] burgers, bro. >> Do it, bro. >> Bro, chat. Y'all want me to eat five? >> MJ Loyal donated $4.99 through chat. Speed next time. do speed does. >> I like this [ __ ] kind of kind of being a bit bit of [ __ ] >> Read it. >> No, I'm talking about this situation. Like >> glitch donated $3. >> It's just too much. Might just be like >> just eat the fourth burger. >> Ben ate that fourth burger, bro. >> I just have to know the first part. >> Yeah. >> Yeah. All right. >> Collector's Conquest donated $5 through chat. Jamal needs to make his YouTube his reactions in haunted houses. >> Bro, somebody bro, why you giving me these burgers, bro? >> Fingers donated. >> I just don't feel like I'm full. >> I can go for, but I'm just full of soiny temp. >> I can go from a third burger to six burgers. donated $4.99 through super chat. >> Speed, don't you dare step foot in Buckeye, Arizona. That security guard will disintegrate. >> Divine Ambassador donated $1. >> Think I can go for >> Yos to you and your team here. >> You think he can? >> I know halfway. I see everybody. >> Danny Goldstein donated $2 through super chat. >> I love you. You dirty. >> Nah, bro. [ __ ] >> No. [ __ ] it. >> No. [ __ ] that. [ __ ] that. >> No. Watch this. Watch this. No. Oh my damn. No. Y'all know what I mean. My dead homie. Watch this. >> Swiss Franks. >> Did you see my text? >> Yeah. I'm going to wait for the >> bro. This [ __ ] not about to work, bro. I can I added that additional but you let me knowg donated $1.99 through super chat >> bropping the you can't see me >> y [ __ ] got eat five In-N-Out burgers I know who the [ __ ] I am bro >> talking $1.99 through00 >> n cuz [ __ ] now he think I eat five [ __ ] burgers All right, you can do it. Hey, >> shut the [ __ ] up. >> Sticking out his tongue very close to Jamal's face. >> He also did it to you earlier when you were checking the clip. >> Now you talking about the other guy >> donated $1.99 through super chat. >> Speed, can you say Samantha get back with Blackco? Yeah, put it in here. >> Put a burger in here. >> Meaty donated $1.99 through super chat. >> Eat the burger and set a good example for Lil Bro. >> It's true. It's not a good example. >> You can't say [ __ ] about eating 25 radar news donated $4.99 through super chat. >> They're struggling though. You got Vanessa while she was a bench warmer at Miss College UA Goofy for that not going live. >> I got this for you. >> Yeah. >> I don't want that. >> Wow. >> Don't be like that. Donated $4.99. >> Speed. I am begging you to Copper Canyon High School in the morning. Please speed go to Copper Canyon High School Jamal. Please >> other thing you >> cir donated five super chat. Stop eating Jamal's midnight snack jealous and [ __ ] >> Jamal, you couldn't do this. Yeah, you're struggling right I'm not struggling >> cuz I'm trolling for the chat this light work to me. >> Oh yeah. >> [ __ ] light ass work >> x4 i n x rxino donated 20 Norwegian croner through super chat. Give me a burger man. Sam donated $1.99 through super chat. >> Are you going to Tucson, Arizona? >> I'll go eat this hat as well. >> What are we doing? >> I'm about to get back to the bus. 09_Y_D donated $1.99 through super chat. >> Yo, I live in PHX. You have any job available? >> What? >> What? >> Donated $19 through chat. >> It's my birthday. Right. >> What's that? >> Chris donated $2 through super chat. >> Speed going to have the tomorrow. >> Yeah. All right. No. No. Let's eat it. That's enough chat, man. >> I mean, there's one more burger, but that's enough. Chat, >> I can eat the burger, [ __ ] >> Hey. Hey. I'm not saying anything. >> I can eat the burger. >> I know you can. I know you can. >> I can. >> I know you can. I'm just saying there's one more burger left. >> We're done though. It was only five burgers. >> What do you mean only five burgers? >> You already ate five burgers, right? >> Yeah. >> Canada donated $1.99, bro. >> Are you going to go back to >> show it? Just let me show you. >> Winter was never fair. donated $1.99 through super chat. >> My friend Hopol06 wants to date Jamal. >> Oh, Jamal. >> DK donated $2 through super chat. >> God bless you guys. Enjoying the stream a lot. W >> It's actually crazy that this is just normal. donated $2. >> You should visit the Desert Diamond Casino. >> We're just going to buy it. >> Crazy. >> Is that milkshakes? >> Ian Nordon donated $1.99. >> Five cheeseburger jack. Ain't nobody can do that. Nobody in can eat five double cheeseburgers from In-N-Out. >> I've seen that happen live. >> Nobody. No. Oh, nobody can do that. >> Nobody can do that right now. >> Five burgers. >> I want to see someone do that. In-N-Out Burgers. Double right. >> Double cheeseburgers. >> Let's see that. >> That's a speed challenge. >> If you do it, post it on Tik Tok. >> Post it on Tik Tok and let me see you beat that challenge cuz you can't do that. >> Why is Rudy such a hater for someone who gets 100k likes for his client? Give him that Egyptian girl so he can relax. Bro, what's going on? Why am I telling what? >> I don't [ __ ] know. >> Show speed. Jamal is trying to sneak some sauce in his pockets and is trying to play it on it. They going to do something. >> Give me a milkshake, please. >> Oh god, y'all can't do that. All my life can't do that. >> Y'all cannot eat five now. >> Eat some fries before you get cold. I don't like fries. >> What are we doing? >> Who phone is this? >> Glitch donated $2. >> Whose phone is this? >> We know you can do five, but six will really impress us. >> Who phone is this? I want to >> Who phone is that? >> Giovanni Ibara donated $1.99 through super chat. >> Did they give you the bracelet? >> Who phone is this? >> I don't know. I just seen I just felt it on my leg. >> It's not >> LFG 123 donated $9.99 through super chat. One relie burger hamburger hamburger you need to intake. >> What phone is this? >> MJ loyal donated. >> Yo, watery. Yo, >> I'm about to go back to the bus. >> Like if it's going to be like this one proper operation. >> I know, but like bro, it's like being OD now. >> Too much. >> That's what I'm saying. Local donated speed. >> Yo, who phone is this? >> It's mine. It's mine. It's mine. >> I got two phones. >> Dead ass. >> Dead ass, bro. >> Oh god. >> What's the code? What's the code? Unlock it. >> What's the code? >> Huh? >> What's the code? >> Hey, who phone is this? >> Tell the bros what up, man. >> Who phone is this? >> Tell the bro what up? >> Who phone is this? >> That's my [ __ ] >> What's the code? Who phone is this? >> Might be the guy. >> Whose phone is this? >> Hey, it's >> Whose phone is this? >> He got it. >> He got your phone. >> He got it. [Music] Yo, get out of the car. What the [ __ ] >> Get out the car. >> Roll your window. Air Ismmail donated $1.99 through super chat. >> What the [ __ ] is going on, bro? >> Drew Day 626 donated $4.99 through super chat. Next time, order two mustard fried with chopped chili. >> I'm about to get the zooies now. I got too much calories. >> Lex donated $1.99 through super chat. You bro, it's me from the wheelchair. I love you. >> Oh [ __ ] >> That's crazy. >> Glitch donated $2 through super chat. Give Jamal an eighth of a burger. >> Jamus donated $4.99 through super chat. >> I'm the guy with the full setup in the truck. I am trying to find you. Madrid's corner donated $2 Australian.99 through super chat. Hey Speed, are you going to Algeria? Cable car. Cable car. Cable car. Cable car. Cable car. Cable car. Cable car. Playground slide skier. Cable car. People wrestling. People wrestling. >> What the [ __ ] are you like donating? So how you going to ask me am I going to Algeria and donate some random ass emojis? >> God bless you guys. Been enjoying the stream a lot. Like I'm be getting y'all sometimes, bro. >> Like that ass >> D23 donated $1.99 through super chat. You miss the bay. Yada mean >> y mean it's hella lit. Oh my mama. Y mean y mean. made it $2. I got it. Got me. Got me. I mean, got me. Got it. I got it. >> Thanks for picking me. Got me. I got it now. You know what I mean? >> Where you from? You know what I mean? You know what I'm saying? I'm lit. You know what I mean? >> Hey, I got that [ __ ] now. It's rolling now. >> What's good with you, homie? >> Hey, we lit. You know what I mean? >> Yeah. >> No, you don't. >> You know what I mean? I got that [ __ ] right >> ambassador donated $1.9. >> Know we lit right now. You know what I mean? We got everybody lit. You know what I mean? >> Copy22 donated $9.99 through super chat >> speed. You should try a Soran dog o cactus taco full score. And don't forget to stop for the vibe immunity shots for Jamal. help saluting face and is Henry single sy tweaking when I eat too much food. I got too much energy donated. I got too much energy. >> You know I got that. >> Hey, >> you [ __ ] up. You [ __ ] up. You [ __ ] up. >> Yo, he [ __ ] up. This what happens when I got too many calories inside my body. >> I got the zombies. This what happens when you [ __ ] me up, man. This why I don't eat a lot cuz I exceeded my calorie amount. Oh [ __ ] >> I got five double cheeseburgers in my damn body right now. >> Yes, >> I get drunk off calories. I swear to God, >> I'm being dead ass. >> I get drunk off calories. >> See, this what happens. See, y'all don't understand. Y'all don't >> It's your fault. I got too much energy. >> That's how I get the zooies. >> That's how I get zooies. >> When I eat When I have too much energy in my body, >> my food decompensates that [ __ ] >> My stomach decompensates all the nutrition under 30 seconds. >> How many days the longest you gone without? >> He don't get it, chat. See, now see, look. Now I got to turn TTS off and put on some music. Come on, Rudy. Now you got to play me some music now. You got to play some music now. Rudy donated $2. >> We need a DJ. >> We need a DJ. >> We need a DJ. >> Turn me up. >> Turn me up in this little ass car. >> Don't do nothing crazy. >> Turn off $4.99 for superhat. Enjoy. Look, they don't get it. Food is the most essential tool. Essential >> donated $2. >> Stop eating that. It's full of parasites. >> Every food is full of parasites. God damn. It's always It's always that party boomer in a [ __ ] chat about don't eat it. The every food has parasites. God damn it. We got parasites in our damn stomach. What's going on? Yeah. [Music] >> Turn up, set. >> Yeah. [Music] Yeah. [Music] Finger baby. [Music] Break it. Break it. [Music] Let's [Music] [Music] see. Next. >> All right. Is ready. [Music] Say you love me, say you love me, but you never for me. Hello. [Music] Fore [Music] [Music] likei. [Music] [Music] [Music] Next. >> Come on, Jamal. Please. >> May I have your attention, please? May I have your attention, please? Will the real slim shady please stand up? I repeat, will the real slim shady stand up? We're going to have a problem here. Jaws all the floor like Tommy just bursting the door started whooping her ass bursting before they burst from your voice over furniture. It's the return of the no idiots dead chick. I'm sick of him. Look at him walking around grabbing his you know what. Living the you know who. Yeah, but he's so cute though. >> Yeah, I probably got a couple of screws up in my head loose. But no worse than what's going on in your parents' bedrooms. But sometimes I want to get on TV and just set loose but can't. But it's cool for Tom Green to a dead move. My bum is on your lips. My bum is on your lips. And if I'm lucky, you might just give it a little kiss. And that's the message that we deliver to little kids and expect them not to know what a woman splitter is. Of course, they're going to know what in the course is by the time they hit fourth grade and got the Discovery Channel. We ain't nothing but mammals. Well, some of us cannibals who cut other people open like but if we can hunt animals and analopes and there's no reason that a man and another man can't feel like I feel I got the women [Music] and I'm the real lady. Stand up. >> Please stand up. >> I want to talk right down to earth. Everybody here can easily understand. [Music] I know your dreams. [Music] I' been personality. personality. [Music] [Applause] All right. Now we are speaking [Music] [Applause] Heat. Heat. [Applause] [Music] [Applause] [Music] What are you doing? [Applause] >> What are you doing? Turn the light on. Why the light off? >> Okay, we can we can I can just sit down, bro. >> The light's not going to [ __ ] do anything. What the hell? >> I did this before, bro. You don't have to turn them. Just don't show the windows. >> The [ __ ] >> Just don't show the outside windows. [Music] [Applause] >> What is turning the light off going to do? [Music] >> What are we doing? Stop. Stop. Stop. Stop. Stop. What are we doing? >> We're uh we're going somewhere. >> I feel like we doing the most right now. >> He got like lights off and [ __ ] Who idea was that? Hey y'all. How are we doing? [Music] All right. All right. Put TTS back on. I do it. Wait, I think it's already on. I don't think it was on. should be on now. >> Can I please be brief on what's going on right now? >> Yeah. Uh, well, I'm not quite sure what's going on, but we're just going through here and then we're right there. >> Oh, >> yeah. I don't think I realize we have a whole convoy. [Music] I'm not so sure what's happening. Booyaka. Booyaka. >> Yo, is the Bluetooth on? >> Yeah. >> There we go. Jamal, did you take over my stream at like 6:00 a.m. What >> did you take over my stream like at 6:00 a.m.? >> Yeah. >> You did? >> I played a little bit. Bro, she keep telling me this and telling me that. >> [ __ ] it. Play some more music then, bro. Here, here. Hey, >> left me back. Now I got a lesson that I want to teach. I'mma show you where you [Music] >> know I love him. She said he said goj. [Music] Oh, that was smart. [Music] >> Turn the light off. >> That was smart. >> Supposed to turn the light off. >> The light's not going to do anything. >> Yeah, but they can see. >> Uh, we're that plan pretty much. wiped out all of them. >> I thought that you got to hit it. Hit it. They're coming. They're coming. >> He's driving so slow. >> Hit the pedal. >> Why is he cruising? >> Yellow. >> Yala. Habibi. >> Yala. >> Bro is cruising. Go, go, go, go, go, >> go. >> Yeah. All right. Turn light on. Turn on. >> Turn the light on. >> This is good. This is good. Just stop. Stop. >> Stop. Stop. Stop. >> Where is it? It's right here. >> Is that a house? >> Is it right here? >> We missed it. >> It's right here. >> Get out. >> Quick, quick, quick. >> Right here. >> This one. >> No. >> Turn around. >> Jesus Christ. >> Give a U-turn. U-turn. Spin. Who the [ __ ] is that? >> It's good, bro. >> We can get two cars to hold them. >> There's only one car, bro. >> We've already used up our cars to hold. >> There's two. We got two of our cars, bro. >> Left here. Left here, >> No. This is the wrong block. Now we're on. We went up another block. >> No, we went back. >> We would have went back. It's the same block we own on >> you. You have it, right? You have the You have the location. You have it >> here. Wait. Mute for one second. >> Mute it. mute. Yeah. >> Yes. Right here. >> There's nobody. >> Nobody. >> Driver, man. All right. >> Holy [ __ ] >> I know. This is >> We did so much to get here. >> That was Oh, big [Music] >> man. Oh, damn. What's up, >> bon? What's up, >> man? >> What's good, man? So, this the warehouse, man. I man, I did a lot of convoy just to get here. >> Appreciate that. >> I had to get away from all the fans and stuff. >> You know, out your business. >> Yeah, I feel that. I feel that. Nobody know where we at right now, so we all good. It's a nice warehouse though. You got to show me around. >> Damn. What? >> You got a Yo, you got a collection here, man. >> Oh my goodness. >> What's on the hand? What's that? >> This chat right here. They sping debug. Holy [ __ ] Damn. Damn. Damn. >> That's not Booker, bro. This is literally Deon Booker. >> They don't even believe it. No, these this bro these cars crazy, though. >> All front line. 57 58 59. >> This is a damn collection right here. >> Oh yeah. >> Hold on the light behind. >> Get in front. Uh uh Luc, >> how old are you, bro? >> I'm 20. >> You ever you know Rob Berick Fantasy Factory? >> Who? >> Rob Deerick Fantasy Factory. Growing up it was like a show. He had like his own space office, little skate park in it. Damn, >> that this inspired. >> I might be too young for him. I might be too young for that, >> bro. I thought this was Foot Locker. But these your shoes, ain't it? >> God damn. >> Yo, this workout is crazy, though. >> Kobe wall. >> Well, right here. This the Kobe wall. >> This is Olympics in the middle. >> Oh, >> so them Steph joints. >> Damn. medals. >> This is crazy, bro. Look at this whole warehouse, >> bro. How do you even get this much shoes, bro? How do you even I want to count them? >> These are all yours. >> The Brooks. One, two, three, four, five. So 45 per block. So 45 times one two three four five six. What's 45* 6? >> 1 12. What's 45* 6? What's 45* 6? 90* 3 180 270 >> 270 270 pairs of shoes. >> Oh my god, man. >> Back here, we got a golf simulator behind her. >> Oh, it's a Wow. >> Wow. >> What the hell? >> Hey, I'm not like a Happy Gilmore type of guy, but I can Let me get a driver. too long. >> I'll do one. Let me get my little driver in. I I got a little skills, bro. >> You golf? You golf like just want to like >> I got into it now. I'm about three years in. >> Three years in. >> Yeah. This helps a lot though. Just being able to >> How does golfing like help with like basketball? >> Focus. >> If you golfing good, you gonna play good. >> Really? >> Right. because it just Wait, I want to see what's up to your dog. What's his name? >> Haven. >> Haven. >> What's up, man? >> Haven. Haven. >> Damn little big. That's a Kane Corso. >> That's a good dog right there. >> He's from um Germany. Them dogs. Yeah. back right now. >> Damn. >> Ain't even calculating my yards. >> Didn't want to show you that. >> Ain't even calculating mys. >> What did I miss? >> Oh, >> bro. I'm about to just happy to give more of this [ __ ] >> Let me see you Let me see you do it. Let me see you do it. Cuz golfing ain't my thing, bro. >> It ain't mine neither, >> bro. You've been golfing for three years, >> man. Three summers. I don't play during the season. >> Well, it got to be for sure better than mine. >> Watch out, man. Damn. >> A come on. See, I hate people like that. No, I don't really do it. >> 270. >> That's That's a 270 yard drive. >> Give you give you a little playback, too, so you can see where you missing. That's like live. >> You just drove it for 270 yards, bro. That's a lot. >> I wish I could take that >> and and without no T. That's a lot of yards, bro. >> This club you don't hit off T. This ain't a driver. >> Yes, that is >> what is three. >> Oh, >> bro, he really smashed that. >> All right, bro. >> Let me get out of this room. >> Huh? >> I drive a Huracan into yours. >> Yeah. I don't got any old school whips. I just bought my dad a old school whip though. It's up. >> Wait, wait. I think Yeah, that's the exact car that my dad bought. >> Yeah, I bought my dad uh this car right here. >> Yep. Uh-huh. >> Yo, that's exactly what I bought my dad. >> All about the Benjamins, man. >> Yeah, I got my dad a 96 Impala. He love that car. >> Hell yeah. That's the last real Impala. >> Uh-huh. >> That's the three colors. That [ __ ] mint. Got 89 miles on >> 89 miles. >> Yeah. >> Now my dad love his new uh Impal. >> Well, he asked for it. >> Yeah. >> Yeah. I was like I was like, \"Dad, so what's your dream car?\" >> Where you from? >> He from Detroit. >> Okay. I'm from Michigan, too. >> Oh, for real? >> Hell yeah. >> Grand Rapids, though. >> Grand Rapids. Oh, yeah. That's like an hour or two. >> Yeah. >> Really? You from Michigan? That's crazy. I didn't even know that. >> I'm from there, too. Low key. There we go. >> I'm lowkey from Michigan, too. I never knew that. Yeah, I do miss my dog. That's why I keep touching this dog. >> Hey, baby. >> Yeah, you like me, don't you? >> That's my birthday, though, too. >> What? >> 96. >> Oh, for real? >> Nah, this warehouse survive 100%. >> Trying to get on the >> ax. Oh yeah. You don't want me to play my music? >> I just tuned in when you was on the way. I heard. >> Yeah, I start I start jamming. Yeah, I know. I start jamming. >> You got the ping pong pool. You ever play shuffle board? >> What's that? >> Shuffle board. Throw the weights down there. Score on the end. >> I never even heard of that. >> Shuffle board. >> Yeah, I know. I need to give me a warehouse, bro. >> I don't, >> bro. I need to give me a warehouse. I don't know why I don't got one yet. >> Let me see. >> We trying to stop it on the other side. One, two, three points. >> Oh, I get it. >> I get it. >> So, it's three points, one points, and two points. Got it. >> You got to fully cross the line to score. >> So, you need to put yours over there then, right? >> No, we play from the same side. >> Oh, same side. We play from the same side. the scoring work. If it like if it's like this, only the furthest puck scores. >> So if it was like that, you would be up 3-0, >> right? Cuz I'm Right. I got it. >> But if it if it was like that, it'd be 6. >> Okay, got it. I get it. Let's do it. Let's play game. >> 11. >> 11's crazy. Let's do best out of three. >> Okay. No, no, no. A lie. That's my practice run. >> I call you speed. >> So it's a lighter touch. >> Okay, I get it. >> Oh, you got to really get the touch on this. >> Three. >> I ain't going to lie. GG's on this one, chat. GG's on this one. >> Oh, wait. I can knock yours down >> and get a three. >> Hell no. >> Slow down. >> Let's run that back. >> Let's run that back, bro. >> Yo, you should just get the really only be two. That's why >> that was terrible for my first time. >> We keep score. We going to 11. It's 4 Z. >> All right. Bet. >> Yo, bro. Get a better angle. >> Oh, I'll go first. I got the last point. >> Hell no. So that's not a one. >> No, cuz it's not past mine, >> right? >> Bro, you too good at this. >> Bro, >> tell you too good at this, bro. >> Yo, [ __ ] this. Here we go. >> Yo, why yo, bro? You too good at these games, bro. I put him here, >> bro. Play me a ping pong, bro. >> [ __ ] this, bro. Play me ping pong. >> Play me in ping pong, bro. >> I'm Hell no. He keep playing me in these games. These damn Hell no. >> Let's do ping pong. right there. >> I'm pick my pick my own. >> You got that one. You got that one. >> No, I like these ones. >> I do, too. I got one of them. >> Come on, bro. You scared, chat. >> All right. I get first serve. You ready? >> We playing to >> 11 or 21. >> 11. Let's do 11 >> by two. Okay. >> Ah, >> he's good at ping pong, too. >> No, this ain't fair, bro. net. >> 6 Yo, I'm getting [ __ ] up right now. I'm not going to lie to you. Damn. >> I'm from >> Chad. This is bad. Holy. Like do you just do this for fun or like >> like you just got you good at pink like >> I know >> that's a terrible serve. So sir let him get one. I want him to come back one day. >> Ah, hell no. We gonna have to race or something, bro. I ain't going to lie, bro. I'm not going to lie to you. >> Beat you and uh Jaylen. >> Yeah, I beat him. He tried to Bro, I beat him and my left leg was um my left hamstring was tightened up and I still beat him. He tried to make it seem like he won. He did not win. Oh, where the basketballs at? >> Right there. >> Yo, tell him Rico, give me >> Hell no. Just what it feels >> I got a little form on me. >> Oh. Oh [ __ ] This car. >> What? >> [ __ ] that game, bro. >> Yeah, I'm getting a self warehouses. after like one more tour or two more tours >> so I can plan out my like next streams. >> Imagine I had a warehouse full of team >> you like there. >> Yeah. >> Yo, Luka. >> You should maybe. >> Yeah, >> you splashing them. >> Is he shooting? Yeah. Not just >> Yeah. Not. >> Yo, get him. Get him, too. Get like Just get a back. >> I got you. Yeah, I was >> interference. Wet like water. >> I can beat you in the free throw show. >> Played in high school, >> huh? >> You played in high school? >> Yeah. >> You played football? >> Yeah, I was D1. >> For real? >> D1? >> You 20, bro? You beat me? >> I know. I was D1, but I stopped. Like my freshman year. I was like top 10 in Ohio. >> But I just quit. >> So you from Detroit? No, my I'm like a half breed. My dad from Detroit, my mom from Ohio. >> So So So I So I grew up in Detroit and Ohio. >> Okay. >> Yeah. >> Short drive. >> Yeah. Four-hour drive. >> Yeah. That's why I told you like I can beat you in the free throw contest. >> You play, >> huh? >> Or running back? >> DB. >> I play DB, receiver, and running back. I got >> it. Do >> pig. >> Pig. >> What's that? >> What's pig? >> Horse. >> Oh, horse. Yeah. Yeah. >> Three letters. >> Yeah. Let's do that. Let's do pig first. >> Yeah. I go first. [ __ ] >> I thought you >> Oh, you missed. Let's go. >> I might I might actually got to dunk it. >> Hell no. I got to let you do that. >> Oh, for real? >> I got to let her do that. >> I might got to dunk it. You want me to do that? >> Yeah. >> Okay. >> Okay. >> I'm right here. >> Right here. >> Go again. >> Watch me. >> [ __ ] Long left it. >> Pith, >> you hit the concrete. >> Ah, am I about to get picked this quick? What I want to do right here lined up. >> Damn. What can I do? Oh, I know what I can do. >> Uh-huh. >> Damn, we can do that. >> All right. [ __ ] What do I do? >> Ah, damn. Damn. >> Yes. Yes. Yes. Yes. I got pee, bro. >> P. >> Let's go. Hey, Chad. I can beat him in this. I just got to do. Okay. >> I can I got to beat you. I got to beat him. >> Nah, it's not. It's different. It's different. Trust me. What the [ __ ] was I thinking, bro? What the hell am I doing, bro? >> Damn. How the [ __ ] do I get out? >> Wait, I'm stuck. Hold on. Damn, bro. What am I doing? Damn, I tried to do something else. All right, let's keep going. Yes. I'm still in the game. >> Let's go. >> All right. I got to think. I got to think. I got to think. Where my phone at? Where my Chinese phone at? >> I got to think. >> Oh, I know what to do. Back flip layup. That >> ain't a back. That's a back flip then a layup, >> right? >> P. >> Let's go. >> Okay, one more. One more. I'm about to beat Deon Brooker. I'm about to beat him. Come on. >> [ __ ] Come on. I need some ideas. Yeah, >> front flip. >> Yeah, >> that's crazy. >> I don't got that on deck yet. >> All right. >> Nah, not on this damn concrete. All right. Devin, get him. Devin, get him. >> Devin, get him. Deon, get him. Devin, >> [ __ ] I was just playing with him. >> He don't know. He don't know the place. >> [ __ ] [ __ ] I tried. >> I told you upon entry. >> [ __ ] >> All right. [ __ ] I see. I was going to bark then do a layup, but it messed up. >> Go do it. >> No. No. I ain't doing that. That's hilarious. >> [ __ ] What should I do? >> What should I do for this last G? >> For this pig. I'm about to beat him with pig. I need one more thing. >> Left hand. >> You think he do? >> You think he can't do a left hand? >> All right, [ __ ] it. Let me go for it. This might be my G. >> I thought you was dead, but I didn't know the word to tell him to stop. >> Yeah. Why you ain't tell him to stop? >> Cuz I wanted to see it. You say you >> He wasn't going to catch you. >> No, he was going to catch me. >> Let's go outside and try it. >> I promise. >> I promise you ain't going to catch me. I promise you not. >> Come on. Damn. I sold. I sold. >> I sold chat. >> Yes. I still got one more chance. What should I do? Jamal, >> put a pig. >> Somebody got a good angle of that. >> Haven was about to get on you. >> Race the dog. I I can race your dog. >> I give you to a dog in a race. I think you on his good side right now. >> Oh wow. Oh, I know what to do. >> That's crazy. >> Oh, I got one. I got one. >> Two. Three. Four. Five. Sue. >> So, five kickups. >> Yes. Let's go. Let's go. Let's go. [ __ ] Damn it. What the hell? >> What is wrong with your dog? film. >> That dog tripping. >> Let's go. I won though. >> I won. Say sorry to him, man. >> I ain't even do nothing. >> Say sorry, man. Barking at him. >> Sorry, bro. >> I'm sorry, bro. My fault. >> Come get my pet. >> You sure? >> I ain't 100% sure, but >> nah, he fine. >> Devin, you I mean, uh, Haven. >> Haven. >> Haven, you good, Haven? >> He's good. >> Nah, he tripping, bro. Nah, >> no. I got a dog. He tripping. He tripping. >> What kind of dog you got? >> I got Australian Shepherd. >> I can tell that dog ain't >> nice. N bro, that dog ain't [ __ ] with me, bro. I know dogs, bro. >> Hey, I told you. Hey, Heaven. >> Hey, Heaven. >> Haven. >> Haven. Haven. >> That's why he's getting on your ass. >> Oh, Haven. >> Say his name right. >> Haven. Hey. >> Say hi. There you go. >> A. >> There you go. >> Haven. >> Yeah. >> See? >> Haven. >> That's how you make up. >> There you go. >> Haven. I told y we cool, bro. We cool. All right, bet, bro. GG's though. GG's, bro. >> GG's, man. W's in the chat, bro. For real. W Arizona, dog. >> Where you going next? >> Where I'm going next? >> On to the next uh like city. >> City. >> I can't say it on stream. >> I can give a hint though. >> Somewhere out west. >> The hint is >> Where'd you start? >> In Florida. >> Florida. and then work your way across. >> Yep. >> I can give a hint, but I can't say it like live on stream though >> cuz they going to figure it out. >> Well, I think they already know. >> Yeah, they already know. >> It's the most like iconic cities of America. >> Yeah, exactly. >> Yeah. New York. >> That's short drive though. Y'all still playing this? >> You good at this? >> Nah. >> No, Deon's like super good. >> Damn, you got two threes. >> Oh, that's good. >> That was a good shot. >> There's always track. All right. Rudy, >> great. >> Show me some joints. >> What? Look, >> it is the Ronaldo ones. >> Devin. Deon, what size you wear? >> Damn. >> Yeah, we can talk. We can talk off stream. >> Yeah, we got to talk off stream. What's up? >> They are sample size. >> These boys is rare. >> Yeah, they dumb heavy. >> 24 carats of gold. >> Yeah, we going to have to talk off stream with them boys. >> I'mma need them. >> You got a trip when you're done. >> Oh, what? >> Need some balance. I know you're going to take a vacation. >> Yeah, I am. I'm going to take a little vacay. >> Need that like at least like a one week or two week. I've been live for 33 days, bro. >> That's crazy. >> 750 yards. >> How you sleep like that? >> I sleep on the couch on this bus. >> Saying with the camera on you? >> Yeah, >> that be my toughest part. >> Why you can't sleep with a camera on? >> Hell no. >> Snoring? >> Nah. No, I don't snore. That's why I'm like a peaceful sleeper. Like I'm a wake up. You feel me? >> What time do you go to sleep? >> About 2:00 a.m. 3:00 a.m. Wake up at like 12. start the day. >> But the days be like 14, 15 hours though. >> Like I streaming >> like >> I'm tired as [ __ ] Really? >> Tired as hell. >> Respect. >> Yeah, >> we complain about our travel schedule. >> Nah, I couldn't imagine being on a bus. >> Yeah, for 35 days straight at that. taking on the run. >> Y got some good pucks down there. >> Who winning? >> [ __ ] it up, dude. >> For the win. >> This kind of light. This game remind me of um >> What's up? >> I got to hit this three. You have to hit the >> I think. >> What's he got? >> Wait, that's not a >> two and a one. >> Draw [Music] it easy. Now these cars crazy chat >> one one >> a wrist. >> Which one? This. >> Yeah, this. >> Yeah, I think that's >> good angles. >> So, whoever has the furthest >> I a never show nobody. >> Oh [ __ ] you got 2K here. >> You got to have a system here. >> I got >> a switch. >> Mario Kart. So we sit at the same >> Mario Kart. >> I'm good at that. >> Is it connected to that? >> No, I don't play 2K. But >> you play FIFA. >> What game you good at? >> Call of Duty, >> I guess. So >> you don't play Fortnite? >> I got an operator. >> Oh, real. Yeah. >> Having in there, too. You seen? >> Yeah. >> You don't play Duty? You be streaming playing games? Yeah, I don't play Call of Duty though. >> I don't know. Call of Duty is like >> nice. >> Like it used to be good. Like War Zone used to be good. I just >> It's in a bad spot right now. It's got a lot lot of cheaters. >> Like I was a war zone type of guy. >> That's what I'm >> like. I was like top 20 at the world like like one time. Like everybody wanted to like run ones with me. I just stopped playing though. >> Is that how you started? >> Yeah. >> Video games. >> Yeah. 2K at that. >> I started playing 2K. It's crazy what you Was there a time when you get on that [ __ ] You only have like >> Yeah. >> I had like 10 viewers. >> 10 viewers. >> That's crazy. That's Yeah. >> Now it's different now. That's crazy though. >> What was the What was the switch or when was the switch would you say? >> I say like about one year in like literally one year from when I started. I started in like May 2020. >> June 2021. >> Gone. >> Gone. >> Literally one year. That's crazy though. >> So you only collect old school cars or you like >> only old school. >> Wow. You just prefer that? >> You can drive them out here too. There ain't much traffic. >> Yeah. I'm holding this button. >> Oh, just give Dar a camera, bro. >> Get my camera, bro. >> Man, these >> mother. Come on, bro. How you don't know how to [ __ ] >> I just held the button. You gota let it >> You got to press it halfway and then press it. >> Press it halfway then press it like pop. Pop. >> Come on, brother. >> Take a photo like that. >> Here you go. That's all. >> There you go. Oh my god. >> Yes sir. >> Hey you hydraulics. >> Nope. >> What the hell? >> It's bouncing his ass. How's it doing that though? >> That's why you like old school cars cuz they can do this >> sit down. Just use these >> where the second one is the back switches. >> Okay, got it. >> All right, let me do it. Man, you got to have a feel. >> Oh. >> Oh, I broke it. >> No, you can hit the second one. >> Oh. >> Oh, yeah. >> Not the third one, just the first two. >> Oh, yeah. You're right. Yeah. >> Oh. >> Damn. >> You done? You done? >> All right. Back. Go down. >> Oh, go down. >> Lay it down. Yeah. >> Hey, bet. >> Get it knocked out. It's all good. >> [ __ ] These cars crazy. I might got to give me one. >> Yeah. >> Heaven. You see that? >> Haven, bro. >> Haven. I keep >> Haven. It's Haven. Heaven. >> Stop him next time. >> No. No. No. No. >> I had a girl in my class named Haven. I keep saying Haven. Haven. Haven. >> Haven. Haven. Haven. My fault. Haven. >> My [ __ ] No. >> Where you live? >> I live in Florida. >> Florida. >> Miami. >> Yep. >> Yeah. >> I do not live in Ohio. I couldn't do it anymore. >> Say >> it ain't nothing out there. >> How old is it? >> Eight. >> Eight years. >> Oh god. >> Lucky son here. He really be all over the place, >> bro. He got a son, too. >> Oh my. >> I miss my dog. >> I ain't seen him in 35 days. >> Damn, man. >> I miss [ __ ] >> Y'all still playing this, bro. >> Nah, bro. I don't like this game. This game too hard, bro. >> Hey, Haven. Haven. >> Hey, Haven. >> Haven. >> No, he's not. He's chill, bro. >> He's chill. >> No, I'm not bargaining at him. >> Don't do that. You going to sue my ass. >> Everybody see. They know it was your fault. >> All right, y'all boys ready. >> All right, chat. Let me not >> landed for too long at Deon's house. >> You already took a picture. >> All right. Oh, wait. I got to do one more picture, bro. is for thumbnail pictures. >> Ready? >> You take it. >> Take one more. >> All right. Bet. >> Pleasure, brother. >> All right, Devin. Bro, >> yes, sir. Nah, preach. Show me around your warehouse, bro. This [ __ ] lit. >> What's your >> I'm inspired, bro. I like I need to get me a warehouse. It's about that time. I feel like I'm at that point. I need to get me a warehouse and like this >> little hang. It keeps everybody at your house too. >> Yeah, exactly. Like exactly. You don't want everybody in your house. >> Make content in there the whole time. >> No, you're right. >> Be a good look for you >> 100%. >> All right, Deon, bro. >> Appreciate you coming. >> Yes, sir, bro. Chat Wde Devin in the chat, man. >> Man, finish strong, bro. >> I will. I got two more days. >> Two more days. >> Two more days. >> Two more days. >> Two more days. >> Yes, sir. >> All right, Haven. >> Should I bark at him? Nah. I'll see you in LA. >> I'll see you in LA. All right. Bye. It was nice meeting you. >> All right, bro. >> Uhhuh. >> All right, y'all. All right, everybody. >> Peace out, y'all. >> Yeah, we we will. What? >> He got another hoop down out here. >> Leave. Wait, what happened? Who Who leave it? That's why we had to do that. That's why I had to sell. >> Let's just get in a car. Let's get in a car. >> This isn't our car. >> It's our car. >> Who leaked it? Drop. Drop. >> Oh, you know I really got to keep PG. >> Come on, Luka. Man, you're not locked in, bro. [Music] >> What the hell? >> Excuse me. I'm waffling, bro. I'm waffling. >> That warehouse was not, bro. You can put the light on. Just put it on me. >> I got Just don't show that. >> I know. Just don't show the outside. That warehouse is lit as [ __ ] I need to get me a warehouse. Where do I like get one at though? Ask a quite >> like like tell where do I get like where do I put my warehouse? Like what city? >> You should probably put it near where you live at. No >> I'm getting another house. >> Like a warehouse is so lit. >> I think Florida got some cheap ass ones. Draw, draw, draw, drop a 50. >> I might get one in Cali low key. San Francisco. >> Oh, that was lit, bro. No. W Devin, though, he chill. No, he's actually chill as hell. >> He, bro, he look got like the perfect life. Like the full not perfect, but like ideal life. Is the speaker on? >> I don't know. Where's the speaker going? >> Like I never lose to nobody in ping pong, bro. Y'all know that, bro. >> Let's go. Go get out quickly. >> Look at that. Voila. No fans. >> Damn, that's crazy. >> Let's go. >> Who came up with that plan >> in the chat? >> Oh. Oh, you came up with that? >> Well, me and >> Come on, bro. >> So, ideally, we can actually lose the fans if we really want to. >> Yeah, but it takes a bit. >> But it takes a bit of >> It's not like we were waiting around for ages cuz I had to get SUV. >> All right. You good now? You good now? >> Yeah. Yeah, you're good now. I had to get the other SUV in place. >> Put it back. That's crazy. Um, I want to get a warehouse. Like a warehouse where I can stream and they content in too. >> Like what if you want everybody in your house? >> Yeah. >> You feel me? >> Makes sense. Makes sense. >> It might be that time for me to move. Like I might I might just need to move. >> You feel I think you got that feeling that you want to move somewhere, man. >> Yeah. I think it's about that time for me to move out of um just move out. I'mma keep that house, but >> experience different. >> Yeah, I think it's time for me to get like a new house somewhere else. >> Yeah, it's time for a new uh chain. >> You were saying New York. Come here. >> Well, he hasn't decided yet. >> No, I haven't decided. >> That was the sole purpose of this America, too. >> I'm joking. I thought you were going to go back >> to see where to see the next home of Speed. >> Yeah. >> I thought you were going to go back to Portugal. >> Speed buy your mom's house there. >> Now, Portugal is actually cheap as hell. >> They are. >> I get a good house. >> They're back. >> They're back straight away, bro. >> This is the same family. >> Look at them. >> Nah, they too dedicated. I might have to get a little picture. >> That's our whole family. >> They too dedicated. >> I might I'mma move like toward like the like the west. I think that might be more of a vibe. >> Houston. >> Houston. >> No, not Houston. >> Houston's all right though. It's just >> I feel like Austin's better low key. >> You like Austin? >> I like Austin, >> honey, >> I like Dallas was lit, too. Houston. >> I like Dallas. I like Houston, too. I mean, all of Texas is fire. >> New York. >> Cali or Cali. >> Chicago. >> You guys went to places in New York, right? >> Yeah. Jeff, we're on our way back now. >> Yeah. Somebody said Vegas has so much to offer. >> I really want a house in the bay. I feel like that's different. Like who lives in the bay? >> Bay is lit. >> You feel what I'm saying? >> Bay might be just too lit for you, man. >> You might not have chief of police. >> They'll know where you'll find. >> Yeah. Like Yeah. Yeah, like I know the chief of police in the Bayie. >> I know the chief of the fire. Everyone loves you there, bro. >> Bro, the Coast Guard. >> The Coast Guard. >> True. >> Although they're basically >> the news, they really like put the spotlight on you. >> Even Seattle was cool, bro. Seattle was a cool ass spot, too. >> Seattle was kind of lit, too. It's a lot of good spots. I just got to choose one. I really like Boston. Boston had like a calm vibe to it. >> I think you enjoyed Boston. >> Boston was like cool but lit. Like >> Boston's actually a nice spot to live in. I liked Boston as well. >> Yeah. >> Yeah. I think Boston was all right. Like regards to the children. >> I didn't. >> Yeah, me neither. N I mean like there just some spots where I can't live >> cuz like I got to live at a city that has like a good airport that like that has like a >> fluent airport. >> What place? >> So it can't be like anywhere like >> Where did we go before? Um Seattle. Seattle was a nice place. >> Yeah. Yeah. >> I like Seattle. >> Oh, that's where you're from, right? >> Yeah. >> You can go outside the city and it gets quiet. >> Seattle was nice. I like >> How's the airport? >> It's good. There's a >> No, I'm talking about like international flights and [ __ ] >> International flights. Oh, it's good. They go direct Japan, Thailand. Um, and then for like local flights, there's another airport like an hour. >> Yeah. >> And it's an airport with two terminals, but it goes to LA. >> Yeah. >> It's like private. >> I just need to live where where it has like international airport. >> Yeah. Because if I like because I travel so much. [ __ ] I'm tired, bro. Can we go to the bus now? I'm gonna do a poll chat. ever each each uh whichever city wins. That's where I'mma live after that poll. Drop. Drop. What's up? >> We will. We will. I think we should just pull over. >> Yeah. >> Take a picture and still Yeah, exactly. Don't do that. >> Thank you. >> And then the next man, Seattle does not suck, bro. Seattle's a good ass city. Good ass skyline. >> Yo, >> drop a f. >> Wow. Wait, >> how the hell do they do that? Look, >> that's hilarious. >> Speed. >> Oh, wait. >> What is it? >> They're wearing the same clothes. Twin brother. speed. You know that that fan of yours that got the the the views? He's at the bus. >> The what? The who? >> The fan that got the the 200k views or whatever's at the >> Okay, good. >> Cool. >> Yeah. >> Yeah, it's cool. Yeah, you can wait. You know, I got to keep it, [ __ ] Bro, why is it is the speaker on? Can you turn the speaker on? Uh uh Idaho. I ain't going to lie. No, I remember Idaho. Idaho was when we went to the uh to the uh Blue Turf Boise. That was a highlight of that stream. Damn, I did so many streams this tour. Well, we're officially done with this day. >> Yep. Wow. >> Yeah, man. The numbers are just >> [ __ ] >> It's crazy that it's almost like an end. >> Damn. >> It's really coming to an end. >> How are we going to do it, >> bro? I'm not gonna lie. >> I'm not gonna lie. I was like, there's no way I'm going to finish this tour. Bro, it was getting to a point where I was like, I ain't going to lie, I'm about to like cancel the tour. I swear to God. Everything was just so out of the place. >> Yeah. >> And everything was just so It's been um It's been good though, man. >> Especially like obviously the whole team, everybody's just been playing their part, team bonding. >> Yeah, man. Definitely. >> Damn, bro. It's about to be the 29th. That's literally two more days. >> It feels like it went quick. >> It went super quick. I'm sorry. >> I think >> it went too quick. >> Like I can't even remember like like everything is a blur to me. >> It doesn't feel like I've been out here. >> It don't feel like crazy. I remember before I left I was like ra I'm going to be out there for a whole month. >> Whole month. That's mad. And like this tour going to be for the books. It's going to be in the books. >> It's going to be crazy to see all the [ __ ] that we actually did. >> We did so much [ __ ] We did >> so much [ __ ] So much [ __ ] >> I feel like it's like too much [ __ ] Like everything >> it needs to be digested. You know what I mean? >> What I'm saying? >> We don't even realize what we done. >> Mean. Yeah, exactly. We did so much [ __ ] >> We just go in day in day and day in day out. >> There's a lot we did. >> Yeah, we actually did it. Like now that it's flashing in my head like why everybody was sick >> so late. So late. We did some food. So yeah, Salt Lake City was list >> where was that one spot we was at? We was like we we was seeing them um >> no them like Buffalo or some [ __ ] Remember that that one lady that was driving us >> that was like South Dakota. >> Yeah, >> South Dakota. >> South Dakota. >> Wait. Yeah, that was South Dakota. We seen Mount Rushmore and [ __ ] >> Yeah. It was a lot. >> That's crazy. Yeah, this might be my favorite tour in terms of like >> in terms of like >> in terms of like book I'm trying to >> probably entertainment. >> It's not entertainment. >> Not entertainment. >> Entertainment. It has to be something else. >> It's like in terms of like >> culture. American culture. >> No, let me think. Wait, wait. Let me get my words right first. >> I don't even got a full like full damn I I don't got a full set of choice of words yet. But it's up there though. Like my personal favorite. >> I'm not even [Music] going to personal favorite. I think me and he already know. >> Y'all don't know what my favorite. >> What his personal favorite is? >> What? I know country that you went to. >> Oh, >> like tour. >> Yeah, definitely. >> I know. >> Chicago was one of my favorites though. >> Yeah. Now, Chicago was lit. >> Chicago, you know, >> Chicago was like Chicago day one. Really? It was like, what the [ __ ] is going on? >> Chicago, but I said that. I said this. >> Everything was just happening. >> Chicago was day one. >> People jumping out of cars, all of that stuff. Yeah. Okay. >> I was like, yeah, >> hanging from the [ __ ] building and [ __ ] >> All right, now we're in it. >> That's where we were in it. >> Chicago was literally day one. It took a little minute for this tour to like >> momentum. >> Actually gain momentum. >> That's when the game. >> But since but since from Chicago, it's been snapping snapping. >> Bro, I ain't going to lie, I miss Chicago. That was like actually my city. >> That was fun. Chicago was a really >> Chicago was really my city. >> It was a really funny city. >> Chicago was actually funny. >> Yeah, you did that don and stuff. >> Yeah, >> we went to as well with the >> I always forget that. >> That's crazy. That's crazy though cuz I feel like nobody never streamed these cities before. It's cool to do it. Chicago is actually lit as [ __ ] Like Chicago is like the most like I people it was so early in the tour that people kind of forget about that [ __ ] But that was like just vibes cuz I always grew around Chicago culture cuz Chicago and Ohio >> like Ohio bit off so much from Chicago. Like so much. >> Hey, you did your little dot thing at the end of that. >> Yeah, exactly. Like I grew up like I like I grew up around so much Chicago culture. >> Cuz they kind of influenced like >> the Midwest a little bit. >> Yeah. They bas Yeah. Yeah. Chicago basically influenced the Midwest. New York was I like New York. >> New York was fun as well. >> You did that song. >> What's Jamal? >> Jamal. Yeah. >> Oh yeah. Yeah. >> I remember that. >> Nashville. You did like a country song. >> That was >> Nashville was good as well. That's when like John Bobby really hit the streets. >> Yeah. John Bobby was that he >> activated where? >> Yeah. In Nashville. >> Oh, Nashville. Yeah, I remember that. >> He hit the strip. >> Memphis was crazy. Memphis was asleep. >> Oh, Memphis was a sick as well. >> No, Memphis was lit as wild donuts and I was like, \"Babe, be careful.\" >> Memphis was like the wild west. >> Yeah. >> Like the wild west. >> Then we went slicing. We was jumping off them damn houses. >> Slicing first. >> Was lit. >> [ __ ] was crazy. >> No, DC was lit, too. >> Abraham Lincoln. You were Abraham Lincoln. Abraham Lincoln remember Abraham >> Lincoln and then that dude again that dude what's his work let's >> Oh yeah >> yeah he was alone >> and then you raced him >> he tried to push you into >> Yeah he tried to push him out of the car >> up >> He really did though he like he really did that was so funny >> DC was like the first lit stream low key >> yeah DC was a lot going on. >> DC was the first lit stream. >> Remember NASCAR? >> Orlando. >> Oh, yeah. Orlando. Orlando. Orlando. >> Disneyland. >> Oh, yeah. >> Disneyland. Daytona. >> We did Disney World. Daytona. Yeah. Daytona. >> Every time. That's crazy. >> Yeah. Bro, >> New Orleans. New Orleans was fun. >> No. New Orleans. N >> New Orleans was like we was just in, >> bro. New Orleans like a cartoon. I felt like we went back in time. I don't know. The speed just kept going. It's >> so colorful. >> Speed kept going. I feel like I'm in a dream, >> bro. I can't. Bro, >> if I ever go to New Orleans, it's literally feel like you're in a dream, bro. >> It's dreamy. >> The people, the colors, >> vampires, and all that [ __ ] >> Oh, you remember that one? >> Oh my god, that >> I was scared. I was not scared, bro. >> Rudy was scared. >> He was just saying stuff. >> Yeah, >> I was like, >> he was like, \"What? >> What? where you died >> and it was like >> he's here >> like Sabrina Carpenter coming through the radio. >> He knows you. He likes you. >> Remember and crackling on the radio. >> Yeah. Yeah. That was fun. That was that was >> And I was like New Orleans. You know what it is? >> Your favorite color is orange. >> Being with New Orleans. Yeah. I feel like as it starts to turn darker at night, it just the environment just changes. It just feels weird. >> Yeah. We walked >> you remember we went back in the street and then you and Jamal did your dance and we finished the street. >> Oh yeah. >> That was sick to the >> bar that was sick. >> We went fishing first. We started the day fishing. >> Yeah. >> Yeah, we did go fishing. >> Gator like Oh, we did go gators with the Damn, we did a lot. >> That [ __ ] snapping turtle that was like 150 years old or something. The good thing about this tour is it's been very like diverse in the things that we done. Do you know what I mean? It's not always the same thing in every city. Like >> some things were slow, but they were good things. You know what I mean? >> Yeah. >> Like even when you tried to do fishing, you and your pups tomorrow, do you remember that you tried to do fishing? >> That was funny. And then that's when you shave the dude's hair off. >> Oh yeah, that one. Yeah, that one. >> I remember I said it. >> Like shave my eyebrows. Yeah, but I said to him I said to you speak no shave your head >> cuz he's like his eyebrows always remember Santo >> Santo? Are you kidding me? >> From an Indian store. >> Sto from the Indian store >> Santo. And then um >> he text me the other day. >> Oh is it? >> He's like brother. What's up? Let's talk. Let's talk. >> I got to call him >> Santo. >> Laser tag. The laser tech was [ __ ] >> Oh yeah the laser. Damn. Where was that at? >> That was in Austin. >> What was that in Austin? Oh, that was in Texas. >> Yeah, that was fun. Your dad won. >> Dad actually got the most points. >> That was a team won. Red team won. >> Yeah, >> our team was sabotaged. >> Rudy 12 times, >> bro. I beat you. I chose you more times than you >> when I tapped you on your shoulder like this. >> Got your ass and then you almost [ __ ] choked me out. >> I feel like I feel like this tour felt more like a trip. Like a >> like a family trip. >> Like obviously it was a road trip. >> Yeah. like it felt more like of a road trip more than like a tour. >> Even Even though it was a road trip >> is Yes, I know that. >> But it just felt like >> y'all ever watch that one movie? >> They got Ice Cube and I remember like >> Are we there yet? >> Yeah. Are we there yet? >> Y'all ever watch uh Are We There Yet? Like that like this kind of reminds me of uh that this tour. You got to watch the movie to know what I'm talking about. With ice cube and his little girl, this little boy. >> Basically like a stepdad. >> Yeah. The kids just keep watching. >> Yeah. And a kid keeps like throwing up in the car and [ __ ] I remember one scene when the kid had to pee. He like pissed in the seat. Yeah, that movie. Ch. I know we yapping, bro, but it's two days left, bro. It's two days left. like we got a yap >> about the the time we had >> just feels like >> cuz we never have time to talk about the actual streams. >> South Dakota was also really nice. That was like a different pace for the first time, >> bro. I Bro, I streamed in my hometown. >> That was lit as [ __ ] >> That was lit. >> That was lit. And I and I showed like my whole >> mom's side and your pop side >> like it was just an adventure. >> It feels like an adventure. It was an adventure, >> right? >> Like literally an adventure around America. >> Taco beef. >> Oh yeah. We had a whole taco beef. >> Oh yeah. Detroit. Bro, four different taco spots came up >> and all of them tacos was getting clean by the whole family. >> You know what I mean? >> No, this was a very great America tour. I feel like it showed showed America. There's a lot of people on our bus. Are we trying out the bus? [Music] My bad. I got your neck. Oh, bro. I'm sorry, bro. Are we good, bro? My bad, bro. I love you, [ __ ] I love you, [ __ ] I love you, bro. >> Calm down. That's it, man. >> You saw him get like worked up. >> I love you, [ __ ] >> I love you, [ __ ] >> I think he loves me. >> Are y'all ready? This this deserves a spot in my my house. >> O where on sour? Who is that? Who is that? Who is that? Who's that dude on the bus? >> Oh my Yo. Open. No way. No [ __ ] way. Hold this. Oh. I'm back, man. >> You good? >> You here for the last two days, man. >> It's about to be wild. >> I miss you, man. I miss you so much, bro. >> Miss you, too. >> I miss you, Dad. >> What's up? What's up, Dad? >> What's up? What's up, dog? >> You did. I forgot you was coming for the last two days, man. >> Oh, you forgot, dog. >> No, I didn't forget. It was just Chad. We going to have Dad pull up for the last two days of the tour. >> Oh, yeah. We about >> Never met Luka, have you? >> Yeah, I know Luca, man. How you man? >> This is uh this uh Spider-Man. >> Yeah, she called you Spider-Man. >> Like uh Peter Parker. >> Ah, how you been? >> Good, man. Couldn't wait to get back. >> Yeah, bro. >> Oh, you know the game was >> Oh, yeah. Today Cleveland head dog. >> Oh, yeah. I did be Cleveland. >> Got busted. I was at the game, dog. >> Uhhuh. >> I sent you a picture of me in the stadium. >> A lot a lot happened since you left, man. >> I know, man. I've been trying to keep up, >> but once I got to the West Coast, the timing was off. >> Yeah, I know. The timing was >> the timing was totally different. >> That three hours is Dang, cuz I'll be off doing stuff and you still sleep. I'm like, dang. Get started. >> Oh, yeah. That's right. Cuz the time is so messed up now. >> Oh, God. Chad, we got Dad back. >> Yeah. >> Yes, sir. It's a great way to end off the tour, man. >> Yeah, man. >> We got two days left. >> I came straight from the game, man. >> Oh, >> you did? >> Yeah. >> Oh, I can tell you tired, bro. >> No, I ain't. I slept on the plane. >> No, you Nah, that plane sleep don't matter. >> Whatever, man. >> That plane sleep don't count. >> Yes, it does, dude. Especially if you sleep like I sleep cuz you know I go chill before I get on the plane. So, >> whatever. >> Not here. >> Oh, [ __ ] Where at? >> He wanted to come. Yeah, Uncle Wayne. >> Why you ain't saying? I would have brought him. >> He told you. Jamal, you supposed to >> Jamal said nothing. >> Jamal, you ain't say [ __ ] >> Can you uh uh can you fix the uh >> Yeah. Okay. >> Why a say something? >> I told him I showed him. >> You should have told slips and watching right now, too. >> Uncle these [ __ ] El >> he can still come though. >> For tomorrow or the next day. >> Yeah. >> Like dead ass. I showed you the message too. >> I want to know if he's still watching. If he watching >> like I'm dead serious. He's probably watching this [ __ ] like ain't no damn >> like all these [ __ ] did it to me again. >> For real. I showed you I showed him the message. >> I should have showed you, >> right? You showed >> I was thinking I was I was paying attention to the message. He said show me this. >> So you like Arizona, man? >> Yeah, I did. Man, where you left off at? Dallas, right? >> No, I left Damn. No, >> we were in it was Oklahoma, Kansas, then what was the next city? after Kansas. >> Denver. >> Denver. Denver. >> Oh, because I left at the zoo. I was at the zoo. >> Denver. >> Kansas. One day. Yeah. >> And since Denver, we've been in what? >> Y'all been everywhere ever since Denver. Y'all been >> That was eight days ago. >> Y'all been through. >> That was nine days ago. >> Y'all went through the Dakotas. >> Y'all went through all that [ __ ] man. >> You probably thought the Dakotas gonna be whack, but no, it was tight. >> Dakotas, North South Dakota. Yeah. Yeah, it's pretty nice out there. >> This is great, chat. This is great, y'all. >> Yeah, we about to get it in, man. >> Tomorrow. Tomorrow we got a fun day. You got a fun day tomorrow. >> Fun day. Oh, I seen you at uh uh Deon Booker. >> Oh, yeah. Yeah. >> You seen the car he had? >> Yeah. >> You should have pulled up to that. I didn't know you was I swear to God. I did not know you was here. >> I said that like as you said you were landing, we were pulling up. >> Oh, okay. >> Oh, that's why. Yeah, >> we should have just killed Tom. >> We could have had >> Yeah, he got the same car I got, man. That's dope. >> It's hard to predict how long you'll be at a spot. I'll be honest, >> right? >> Yeah. Deon got a nice >> You could have been there for 10 minutes or you could have been there for two hours. >> No way. >> He got the same car guy, man. >> Yeah, I know. The same car. Yeah, I seen >> I told him about that. >> But his only got like a couple of miles on it. >> You know that from um Grand Rapids, right? >> Yes, man. >> Oh, you knew that? >> Yes. He's supposed to be playing in Detroit right now. But it's all good. this. >> Oh [ __ ] >> I'm help. >> Yeah. Sweep some cars, man. >> So, what y'all got planned tonight? >> Tonight? [ __ ] We I don't even know how far the drive is. Let me look up on my phone. >> How far? >> You got two of them boys, man. >> Yeah, I do. >> Let me take that one. >> Go ahead. >> How far are we from the last location? Oh, then I I bought some I got some weight plates, dude. >> Weight Oh, you do? >> Yeah. >> What's up? >> I'm go see how much you can lift. >> You got You got athlete plates. >> Yeah. >> Okay. >> I know. Olympic weights. >> Oh, yes. I mean, yeah. Olympic high. >> You said an athlete. >> [ __ ] We like five, six hours away. >> You like five, six hours? >> So, we So, we don't got a long drive. We don't got to leave early. >> No. Okay. >> Damn. Two more days left. >> You ready, man? You been you've been humping, dudes. I I be watching I like how he be doing this [ __ ] But you be sleeping. So you get enough sleep, you could be able to do it the next day. >> Yeah, >> I know. I just I just require four or five hours of sleep and then I'm >> nah, not >> at this pace I'm going at, >> I need like seven, eight. >> I can't do four or five hours. >> Yeah, cuz you you constantly moving. >> Yeah. >> And then the weather climates are different. >> Like I need like seven, eight hours of sleep. They got a documentation of the moment that you you were asking for Jamal to go on a diet. >> Really? >> Yeah. >> Stream, man. >> I want that so bad. >> It's the exact moment. >> That's the exact moment. >> Wow. >> I know you're happy right now. >> Pops is back, man. Box is back for the end of >> That's right, man. >> Finish strong with Fox. >> Come on, man. It's so good to see you. >> Yeah. I come on the tail end. >> Let's go. [Music] >> Let's do it. >> I'm ready. >> I'm ready. >> Yes. >> Hell yeah. >> Damn. I don't want this tour to end, bro. >> That's right, man. >> This [ __ ] really coming to an end for real. >> I know, man. >> [ __ ] >> We only just started. >> Shut the [ __ ] up. >> Coming to start. Damn. >> Every day since DC. >> Dang. So I was away 10 days. >> Henry says it's only >> Yeah, it felt like I was just >> He just It's been a week. It feels like it's been a week. >> 10 days. >> Damn. >> I know, bro. We've been through a lot, dog. >> Yes. and watching. I'm like, \"Yes, >> we've been through a lot. >> On an adventure, remember?\" >> Yes, man. >> Like, real [ __ ] >> Y'all been humping. >> I mean, working, you know, >> that's No, they was talking. >> You remember my dad before? >> Yeah, man. Yeah, papa's back. >> I didn't know you never met her. I was just saying >> you I've been around her. >> You stayed with us in Texas. >> I was tag, >> you know. It's been 35 days. >> Oh, y'all was tearing her up in laser tag. >> Yeah. >> I was like, >> \"Yeah, we laser.\" >> Oh, yeah. We was on our team. >> Okay. Okay. All right. [Music] >> Me and him got in there before everybody got in there, man. We were we were waiting for y'all about to stop working, bro. >> Yeah, right. >> It did. Seriously. >> And then he got a spotlight on him the whole time. So, I'm like, >> then he also had Daryl just going, >> \"They're over there. They're over there. >> Somebody's coming.\" >> Yeah. Laser tag. >> You even had one of the guys that laser tag with you. >> That guy with the long hair. >> No, man. We didn't. >> He Yeah, you did, >> Sydney. We did, didn't we? >> We did. >> The game The game was rigged. James, didn't they have like a laser type official on their team? >> Henry Henry. >> I don't know. >> Have you met Luka? >> Yes, that's Peter Parker. >> Peter Parker. >> That's the guy from Spider-Man. >> Why you look like Spider-Man? You shouldn't You should just become a [ __ ] actor. Model. >> Keep told me that before. >> Yeah. You Yeah. Like you should become like an actor or model. That might be your thing, bro. Spider-Man though. >> Well, you need to become >> Spider. >> What? >> Yeah, Luca Bogs you, bro. I ain't going to lie. >> That's my brother, man. >> Bro, I seen an edit of you on TikTok. >> I saw that. I saw that. I saw that already. >> Yep. coming in >> like you're already >> like the the music when he when it goes to cam too. He starts looking up at it. >> Yeah. Like bro like just put the camera on you, bro. Put the camera on you. >> That's Peter Parker. >> No, that's Harry. You like Peter Parker. Harry Potter. >> Dang. >> You like a lot of Potters. >> Yeah, you like Harry Potter. >> I'm calling you Potter. I'm going to call you Potter. >> Potter Potter. >> Potter. >> That should be his nickname. Potter. >> Potter Parker. >> Potter Potter. Man, I had a terrible night last night. Dude, >> what happened? You >> So, I'm leaving uh our cousin's 70th birthday party. >> Oh, yeah. The 100k likes guy. >> Can you come on? >> Yeah, he come. >> What happened though? I made a turn leaving my cousin's birthday >> and my the lower ball joints on the car went out. So when I made the turn, it was like crack. >> Come on, man. >> What? >> So the car >> speed >> the wheel guy came off. >> The wheel came off. >> Introduce yourself. >> What's going bro? It's my dad right here. It's my dad, bro. How you doing, bro? >> All right. Good to see you, man. Good to see you, too, bro. Hey, you let this sit on the ground. >> Is that like a voodoo doll? >> It's the speed. >> Why? I got a chest. >> What's up with the chest though, man? >> What's up? That's >> No, this girl made me this. This >> Yo, turn that off. Turn it off. >> What's up with that though? >> That's just That's like monkey. >> That ain't That ain't muscles though. >> That's how Luffy is. >> Really? >> He stretches. >> So, he got that too. I mean, I don't know about I n Luffy tit are not this big. >> That's Lucia. That's Lucia. >> They keep calling it a voodoo doll. >> Yeah, it look like a voodoo doll. Like if you stick pins in it, you'll be like my stomach hurts. >> That's scary. >> Yeah, that is weird, dude. >> That's scary. Yo, Rudy, can you turn that off? >> Turn it off. >> Did you buy these? >> Yeah, I did buy those today. >> Wait, where that Luffy shirt? Please, somebody tell me I got shirt. >> A fan gave me a Luffy shirt at at the state fair. >> It should be in one of the trucks. >> I know. I know. It was a black one. It was a black one. >> It's not like pink. It's like >> It's got a graphic on the front and back. >> It was like black pink graphic. >> Black shirt. Yeah. >> Black shirt. >> Black shirt. >> It's a nice dial though. They took they took their time with this like literally. >> No, they not they n that >> articulated. >> I think it could stand up. >> They can 100%. >> They don't want to extend it chat. Y'all want to extend a tour? >> If we do this tour, we >> I feel bad. You know what? I feel bad for people who like who've been watching for like >> forever. >> For like 20 days, 15 days. >> Then boom. I'm just not live anymore. >> It's just gone. >> But they said you got the Guinness record now. >> I do. >> I read it. I read that you got the Guinness record for the live stream. >> What do you mean live stream? >> Maybe IRL or something. >> IRL tour. >> Yeah, you got the record. >> We should have just did 51 days, bro. >> Well, >> that would have been crazy though. >> Drop to Alaska. >> We should have just did 51 days. >> Is the security team up? Where did you get 51 from? >> 51. >> Cuz there's 51 states. >> That's smart. >> We should did a 51 states. >> What's the 51? Puerto Rico. >> With territories. >> Puerto Rico. >> Puerto Rico. >> Yeah, but where's 51 coming from? >> Yeah, it's just 50 states. >> It's not just one territory. >> 50 states. >> 50 states. >> D. >> That means like a downloadable content. >> What content? >> Content. You have a Sharpie in your pocket. >> Maybe basically extension to sort >> Oh, yeah. That being >> means department of corrections. >> Oh, that's game term. >> I like what are y'all? >> Yeah, it's like a [ __ ] >> You tired, Dad. I know when you tired. >> He's tired, bro. I know when he's tired. >> Man, I just got off the plane. I was sleep on the plane. >> I like No, I can tell you. Um, >> no, you can't. back there. >> What? >> I got rid of my >> I don't know where is it. You got >> you gotone. It's gone. >> It was in the other car, bro. >> Was rap. >> Yeah, it was rap. >> It was two of them. It was two of them. >> There was two. >> Yeah, I [ __ ] up. >> That's cool. We got We got food right there. >> At least I know my burgers went to a good cause. That's it. You order some burger? >> I had two in burgers. >> Oh, yeah. >> Is it In and Out here? >> Yeah. >> West Coast. >> How was the game? >> Oh, it was insane. >> My ears are still bleeding, man. It is so loud in that stadium, man. >> Aiden went down ball. He just He just got the wind knocked out of him. >> The Lions. >> The whole crowd went silent. >> The Lions are actually good. >> They're good. >> Oh, no. They're awesome. Y'all better than us this year. >> Yeah, very >> [ __ ] Joe Burrow got injured, bro. >> Supposed to >> like what the [ __ ] >> We're done. >> This is our year, man. Super Bowl bomb. >> You're engineer. >> Electrician. >> So, so, so if we break a light, you can fix that [ __ ] >> Yeah. Yeah. >> Prove it. >> You kind of like uh Jordan Pool. That's what everybody say. Somebody called me a black Jordan pool today. I'm like, \"Bro, I'm the same.\" >> They called him a black Jordan pool. When Jordan pools >> the same color >> 11-1ven make Oh, we missed it. >> I miss 111. >> I'mma steal. >> Oh, nice. It said it. But if you do it, we go to >> what >> I mean realistically like T got understand. We've been to the good part. We literally been to every good part of America. >> We've been to every good part of America. >> What that mean good part? There's a lot of good parts. >> You know what I like? We went to the majority of the majority. >> Okay. >> You know what I'm saying? >> Yeah. >> Like that. >> I know. >> You know Yo. Yo. On the last day, Henry, you got to wear outfit. >> We got to go buy We got to go buy you an outfit. >> You got to wear it the whole day. >> You should wear a suit, man. >> Should we go buy him an outfit tomorrow? >> Yo, I think on the last day we should all wear a suit. >> California. Get you a green suit, man. >> What? We not going to California. >> The last team needs to get >> We b No, I No, no. I b said that. I made that on stream will be fire on the whole team goes and get suits. That's what I said needs to happen. >> Did you Did you see >> I think on the last day we all wear suits. The whole team. >> I sent out I sent out sizes for everyone like a week ago. >> But then wear a tuxedo. >> You'll be You'll look like a rock. You look like a rock if you wore a tuxedo. >> He said the rock. It look like a rock. >> No, >> Harry. I think you like like you got like Maui blood in you >> like >> like Maui. You got that blood in you >> like that Moana [ __ ] like the Hawaii. >> Yeah, you do. >> He talking like the rock just like >> Yeah, you guys can get ready. No, you're doing it. >> No, you got to do it. >> No, you No, you got to wear a suit. >> Junior has >> We're not going to be able to get him a suit. >> Exactly. >> Why? >> Y'all can get suits though. >> You got to get a customade. >> You should get You should get Yeah, like you all should get fitted on stream. >> That's going too much. No, no, no. We getting just regular suits. >> We not getting fitted, bro. We just going to buy late. No, no. >> Just Just get suits. >> N don't want my suit hanging on me, dude. It's not. >> I feel like honestly Henry because we need you in your casual clothes. So we need to go shopping for like >> or get a shirt with the >> bro. You've been wearing black every >> You ever seen Secret? >> What do Secret Service wear? >> They wear suits. >> They wear suits. >> And also, by the way, I've seen Secret Service in Hawaiian shirts. Chat, go to any of my IRos. Chat, go to Chat, go to any of my country streams. >> Henry will be wearing black. You can go to any stream of mine. >> Henry probably been in like 200 300 streams of mine >> with cargo shorts or cargo pants. >> He Bro, you can any You can click on it right now. >> Bro, he showed me a picture of him wearing like a regular shirt. I was like, who the [ __ ] is that? I was like, who the [ __ ] is that? >> I was like, who is that? He looked like and it was a picture from like 2012, bro. >> Oh, I was about to bring you something, man. This What's up, Daryl? >> Little D. No, no, no. No, no. It's Little D. >> Oh, I got to tell you what he did the other day. >> So, it was his girl, right? >> Oh my god. >> Hold on. She She just Hold on. Before you even tell that story, she just blew up his phone and forced him to answer. >> And the only thing she said, >> \"No, we go to 1 a.m. bus school. >> You owe me $500 cuz I won the race.\" >> What? >> No, she didn't say. >> What? >> She raced. >> No, >> no, he didn't race. >> Let me clarify that. She was, I think, driving a car race and she won a car race and she got >> Yeah, right. He don't got no game, Dad. >> Oh, yeah. on stream. >> No, she was asking you to send her >> what >> I mean. You want to be happy, right? >> Send the 500. >> Oh, no. >> If going to be happy. >> You're right though. You're right, though. >> Both parties going to be happy with 500. >> I ain't saying no. >> Dad, you one of those. >> No, I'm not one of those. >> I ain't going to lie. I'm one of those too, Dad. >> I mean, yeah. I mean, I'm not one of them. You are one of those. Yes, you are. Dad, >> you are a s. >> I am not a s. Ask anybody. Daddy is not a s. >> I'mma put this in charge. >> Right back. >> Now, Bobby Brown is a s. >> Bobby Brown. >> Bobby Brown. >> Oh, yeah. >> Bobby Brown is a >> He will buy a woman anything. I like, man, why are you buying these chicks though? >> N I'm not a trick, but I'm like I'm a good person. >> What's up, man? That's That's earful right there. >> That's Anthony. This my guy right here. >> I know him, man. >> Oh man. >> I was on the bus when he when he bust his ear, dude. >> Oh yeah. >> Henry. >> Oh yeah, you did bust your ear. He was like >> He was like >> He's like, \"Hold the camera.\" >> He's like, \"Hold the camera. >> Please hold the camera.\" >> All the blood out. >> Everybody Everybody just got up out of the car and just went Yeah. He had some ketchup. Ketchup. Ketchup right here. That was classic. Everybody was getting hurt that day. >> Two cameraman got hurt. Rudy just ran out the way. >> Oh yeah, they they uh spotted me on the on the aerial view running to the car after >> dude. What the [ __ ] >> 1 a.m. bus call. >> So I So I said shower then >> 11:15. >> I should shower >> speaker back here. Ready? >> Switch batteries. All right. I'm gonna switch the cam, too. >> Do it now. >> No. Give it. Give it. >> Do it now. >> Let's see your battery reload, Tom. >> All right. All right. All right. All right. Let me get ready position. >> Okay. Chinese. >> We're good. We're good. >> Nah, Chad. That's not fast. That's not fast. It's not fast. >> That's not that fast. >> That's not fast. Trust me, I always see the cameraman's reload. When I see a good reload, I'll be like, \"That's a good reload.\" That was like a five out of five, six out of 10. >> Yeah, that wasn't great. That wasn't fast though. Trust me, though. It's like a different customer. >> Who had the best one? >> No, no, no. Anthony had a No, D, I think. Yeah, you had a fast ass one. >> You had a fast reload time. >> You are there for that one. >> I'm the only one with an edit. >> That's true. >> Got the best bit rate out of everybody. That's for sure. >> You try reloading. Hell no. I'm not reloading that [ __ ] No >> the [ __ ] >> this camera hard to reload the camera's easy. >> Yeah, man. Good to be back. >> My children. >> All right, Henry. I'm ready to shower, man. >> Not a clue. >> Maybe this is some LA [ __ ] >> No, I don't know that >> RW Blackber with the gift. RWB Black hit you up. >> So why you looking him up then? >> Someone suggested it and then I was thinking like maybe that was >> RWB back Blackbird with the 50 gifted >> Valerin with the 50 gifted again. >> No, RWB Blackbird. >> Oh my god, we got a heart train. >> Sy's like I'm sick of this [ __ ] man. He keeps yelling and [ __ ] >> Sydney, Sydney, Sydney, it's been a long tour. Sydney, >> it's been a long tour. Is your mind stressed out >> with all the planning? Ames, you too. >> No, I'm sorry. >> I play me A should box on the last day. >> Bro, have a ceremony for the last day. >> Me and Ames should box on the last day. >> Let me tell you, we box every day >> cuz low key I lowkey want to beat you up, bro. >> I know, bro. And I want to I lowkey want to beat A >> bare knuckle though. >> Nar, I want to box a bro. I don't want to embarrass >> that guy. >> Yeah, I'm about to get in. >> Chad, shimmy me and Ames box for one minute, >> bro. You got to put some >> I love Ames, >> but sometimes Ames be making me want to >> I think you have to keep the camera. >> That sounds great. That makes a lot of sense. >> Okay, bye guys. >> Just go for it. Let's see what happens. >> I'm there. >> Go ahead. >> You're good on battery, right? >> Yeah, we're good. [Music] >> I just >> Yeah, unboxing eggs, bro. >> You don't want that. >> Damn. We didn't get one more Michael call this whole tour. >> Yeah, I don't know. >> We should just [ __ ] call him. >> Should we call him? >> We should just call Michael. >> You know, you know how we've been calling us all the time. We should just call him. >> Call him right now. >> Right now, though. He's with his 25y old dog. >> 16. >> Ty, should we just call Michael right now? >> Or maybe on the last day. >> Michael chicken cafe. >> No, you >> Why would you do that? You just showed him. >> You need to do that. >> You actually just leaked his number. >> I think I did. >> You You don't like Michael with you. >> You really don't like Michael. You just You just leaked his number. >> I was showing I was trying to show the Did it go? >> Did it work? >> I don't I don't know if it leaked. They didn't get it. >> Nah. >> Yes, they did get it. They [ __ ] got it. >> Of course they got it. >> You're [ __ ] up, bro. >> Sorry. Whoops. >> Oh, no. I think you're good. All right. No, you good. You're good. You're good. >> [ __ ] me. Sorry, Michael. >> Michael. Really? Is that your lowkey revenge? >> No, bro. I Michael's fine with Michael. Michael made my life a lot more annoying for sure for a second. But >> who is Michael? Bro, if you don't know Michael, you have not been watching this tour. >> Not been watching. >> You not been watching the tour. >> Chicken cutlet, baby. >> Michael chicken. He's like a chicken cutlet [ __ ] A chicken cutlet [ __ ] Chicken. >> Yeah, >> Chad, we go. Chad, we'll call Michael on the last day. >> Yeah, we got to call Michael on the last day. >> Don't for Chad, don't forget to do that. Don't forget to tell me, though. >> What? >> This reminds me of you. >> Little D, man. We've been together for 30 days, man. 35 days. >> Yeah, man. >> You going back to Miami? >> I am. >> I'll be there. Dams. >> I'll be there. >> I know. What about your girlfriend? >> I'm flying her out. >> You flying her out? >> Joking. >> Wait, why did I even break up? >> Wait, what? Wait, are we talking about the same thing right now? >> I'm talking about your girlfriend. Your old girlfriend? >> My ex? >> Well, your ex? >> Well, she cheated on me. So, >> she cheated on you? >> Yeah, you just I been told you that. >> Oh, hell no. >> Yeah. >> Do not get back with her. >> With my uh ex- best friend. So, if you're watching this, >> really? >> Yeah. >> [ __ ] her, bro. Yeah. >> How did she cheat on you? By texting her or some [ __ ] >> No. >> [ __ ] she do? >> I can't say it on stream. >> Oh, [ __ ] her, bro. >> It's uh >> Damn, that sucks. Did you cry? Did you cry? >> Of course I did. >> Damn, that's [ __ ] bro. >> Wait, I can say that on stream, right? Sexual intercourse. >> Oh, she [ __ ] her ex- best friend. >> Yeah. Yeah. Yeah. Yeah, >> bro. That is terrible. >> Yeah, I know. >> That's like bad, bro. That's like >> That's like terrible. >> You know who you are, too. >> Damn. >> Well, [ __ ] >> It's Hey, I'm here. That's why I'm here, though. >> Yo, that's bad. That's like seriously bad. >> I will crash >> now. Imagine walking into it. >> He's trolling it. Oh god, he's trolling. >> He keeps adding on to it. >> I swear to you. I swear to you. >> He keeps adding He's lying. Oh god, he's lying. On God, I wish I was lying. >> You walked in on him. >> I On god, I wish I was lying. >> What did you do? >> Closed the door, walked out. >> True. That that's exactly what I would have did. I would have I would have >> I wouldn't even like I wouldn't even fight with the girl. I wouldn't even talk to the I wouldn't even like I just >> waste your words. >> I would just leave. There's no words. >> Leave and block her. >> Cuz if I cuz if I would have even like stayed there for two more sec, I would have crashed out. >> You like being dead ass. >> Being so dead ass. Damn, >> bro. It was like a week. Remember what I told you? How long ago did I get cheated on? Like a week before? >> Yeah, right before. >> Yeah, >> I cheated on right before tour. >> That's a good time. >> We know Daryl. We've been knew Daryl. He wasn't like He >> Yeah, I know. But I didn't know him though. >> Well, I knew him. >> I didn't know him. >> And he was opening up to me about how his girlfriend cheated on him right before. >> Damn, bro. It >> happens. So now she's watching. >> Yeah, she's definitely watching. She's Yeah, she she's for sure going to see a clip of this. Any words for your ex, bro? >> Now that's bad, bro. >> Yeah, too, bro. >> Best friend, you're a piece of [ __ ] And a girl, you're a piece of [ __ ] too, bro. Y'all are both [ __ ] up. >> [ __ ] y'all. >> And if your mom's watching this, I still want you. >> Two little kids been out here all day. >> Guess what? >> What up? What I do? He caught his ex-girlfriend cheated. Wait, you say it. >> I caught my ex-girlfriend [ __ ] my ex- best friend. >> And walked in right right before tour. >> Did you walk out? >> I walked right out. I l This is literally what happened. >> She was like, >> what happened? This what happened. >> Wait. >> Two little kids. >> Damn. >> Damn. That's messed up. >> How did you let her cheat on you, >> bro? >> What were you not doing? No, actually though, >> what were you not doing? >> I think he was being a >> s working. I was working too much. >> I think he was being a s >> n hell no. I'm >> yo >> yo, yo, it's ready, man. >> Hey. Hey, Rud Baker. Somebody want to meet you, man. >> Rud Baker, >> Rud Baker, >> a [ __ ] >> Rud [ __ ] >> Oh, you ready to show her? That's heavy. Daryl, >> let me get my Let me get my underwear. >> Damn, chat. That's [ __ ] up. Imagine catching your best friend [ __ ] your girl. >> That's heavy. >> That's heavy. >> That's heavy stuff. >> Like that never happened to me. >> I wouldn't wish that on the worst, bro. >> Me neither. >> That's heavy. >> Like damn. And then she has the audacity to message him after the audacity. >> Why? Why don't you have her block? I would have blocked her. I don't play that [ __ ] I don't play that [ __ ] >> I don't even like chat. If I had a girl, I would even allow her chat. I wouldn't even allow my girl to have a best friend. That's a boy. >> Bro, what? Why? >> What do you mean why? >> Literally, why are you insecure? You're [ __ ] >> Are you insecure? That's not insecure. >> You're insecure. >> That has nothing to do with insecure. >> Guys, keep it clear, please. >> That has nothing to do with insecure. >> I would not have my No, no, no. >> Because I'm a man. Wait, shut up. >> Cuz I'm a man. >> I'm a man. I know man intentions with a girl. Why the [ __ ] would I let my girl have a boy best friend? >> Because >> Cuz I, bro, I [ __ ] if I have a fine ass girl, right, >> and she got a boy best friend. >> Yeah. She wants to think You don't think You don't think that [ __ ] boy best friend wouldn't [ __ ] your girlfriend if she would ask your boy best friend? Shut your dumb ass up. >> Are you worried about your girlfriend [ __ ] another dude? Why would she [ __ ] another dude if she loves you? >> What What's the problem? >> That's That's not the That's not the point. >> No, that is [ __ ] stupid. >> He's dumb as hell. >> No, he's dumb. >> Yo, excuse me. >> No, you're actually slow. You're actually slow. You're slow. She's cold. >> You're actually You guys are arguing. It >> depends on their arguing one night. She's super mad at you. >> Best friend, can you come over? >> And you and look, listen, hear me out. You think You think that boy best friend is going to You don't think Oh my, you're so stupid. You think that boy best friend would deny [ __ ] your girlfriend, your bad, your fine ass girlfriend. You think you think a man >> man with a high testosterone? >> Yeah, but she has she has the choice. >> That's not the point. [ __ ] That's not the [ __ ] point. >> A, >> what's the point? >> She has a boy best friend. >> So, >> anything could happen. >> But then that then she's not for you. >> Yeah, bro. >> What are you talking about? >> Ames, you're you're the best friend. >> A is the best friend. >> Be careful. Be careful. Careful. >> Oh my god. >> You want this? >> You want this, bro? >> I would never. >> I would never, Jack. Oh, yeah. >> You have a higher chance Santa Claus and letting >> You're dead. I promise you I would never have a boy best friend. >> I never have a boy best friend. Hell >> no. You know why? You know why I said that to you? I was the boy best friend once. >> Exactly. >> Exactly. Bro, I know what they do. >> I was the boy best friend. >> I know. I know that [ __ ] If you a man, you know, bro. >> And as soon as y'all break up, who she going to >> the boy? Do we want showers? >> My girlfriend has >> Yes. I'm sorry. I'm looking for my clothes. Sydney put my clothes. Where did Sydney put some clothes? >> Right here. >> One more, man. >> Another signature dad. >> Yeah. One more >> chat. >> You know these kids, man. >> I don't want to be that guy, bro. >> It's the kids, man. It's kids out there, >> chat. I don't want to be that guy. >> But if your girlfriend has a boy best friend. >> Yeah, she's getting [ __ ] >> No. No. No. No. >> Nope. Straight up. >> No. Cuz there's people in the chat who actually girlfriend has a boy best friend. >> N. And I'm telling you right now, >> she got a boyfriend best friend. >> She's getting hit. >> Maybe. Ask some questions. Ask some questions. >> She's getting hit. >> I want to do that. I don't want to do that. Are y'all ready? >> Been ready for a long time. >> Are y'all ready? >> No. >> Y'all ready? >> Iro, >> are you ready? >> A, you're too naive. ring. >> Do you know the world we live in, bro? >> I feel bad for you. >> Did you listen to older than y'all? >> It don't matter what age you're in. >> Did you not just hear my >> It don't matter what age range. >> Your story Your story Your story is brutal. I'm so sorry, >> bro. He doesn't understand the world we live in right now. >> Bro, these females are >> If I had a girlfriend and she was bad and her boyfriend decided to just argue, I'm [ __ ] >> straight up. >> We're in 2025, bro. And I'm the least insecure man. >> Hey y'all. Hey y'all. >> Wait, let me say what's up to the fans. >> I'm Say what's up to the fans real quick. >> Real quick. Real quick. >> Hey. Hey y'all. Couple stream pick. Couple stream peaks. Y'all Wait, you want a >> message? >> Pick back up. >> Stream. Look at the camera, man. >> All right. >> Draco BK. Hey, this game pick for you. This for you. Free pick. Look at this shirt. Look at this shirt. >> Okay. >> He already got one. He already got one. >> Free pick. Free pig. >> This side. This side. >> I got a song for you to listen to. >> Hey, we don't got time everybody else. We got to get everybody else. >> All right. >> Dad, you on the road. >> Look at the camera. Look at the camera. Look at >> Dad. You on the road. >> Look at the camera. Dad, Dad. Example, >> let's go. >> You want some cookies? >> No, I'm good. I'm good. I'm good. >> Pick. Let's go. >> Stream. >> Next. Who's next? >> Straight pick. Stream. >> Pick. >> Okay. Okay. Okay. >> Okay. Thank you. >> Let's go. Stream pick. >> That's going on. Thank you for signing. I got a giveaway. >> All right. Cool. >> Do you want to sign? >> Is that iPhone 17? Yes, it's new. >> That's fake. >> Yeah, just go around. It's real. >> Oh, it is real. >> Do you want to give it away? >> Give it away. >> Yeah. Hold on. >> Everybody has move. >> Thank you. >> No signatures. We're just doing stream pick. >> Yeah, y'all can't be getting streams. >> Come stream pick. Stream. >> Porn. >> Bro, you already trolling. I'm trolling. No, no, no, no, no, no. >> You with a bun, bro. >> Guys, give it give chances to people that haven't had it. >> You already did a bit. Who get >> yo speed? I got >> everybody. >> One more. >> You agreed, >> bro. night. >> Why y keep want me to sign these baseball for my brother? I swear it's a pen. It's a pen. They had a baseball tournament all weekend. They could have come today. It's 11:00 at night. They had school. They could have come. >> You have I signed three baseballs of y'all. >> There's a million. >> How many balls you don't want to get signed? >> This is for my little brother. I promise. I have not got on God. >> On God. My little brother. >> Bring your little brother, man. >> It's 11 o'clock at night. He has school tomorrow. >> We didn't see him all day. >> He's 11 years old. He had a baseball. I just said I have two little brothers. They're at a baseball tournament right now. >> No, he had that frame. Do you remember? >> Remember he had the frame and you were yelling at the car? >> What do you think? >> That's my third grade photo. Remember that? >> We're on a schedule. >> I just don't want nobody selling these. Like I want I really want somebody to give it to somebody. >> Guys, open up. Give us space. Yo, give us space. >> All right. Here you go. >> Here we go, >> guys. Open up. Please open up. Open up. All right, I got to Okay, I got about real quick signatures. No, >> it's Ronaldo though. I got to sign. That's why you got to sign >> I got >> I got earlier. I was on >> you. What? >> Get in front. Get in front. >> Where Dad at? >> Dad, come here. >> Let's go, >> bro. You've had your chance. >> Where's your pops? You ain't coming. >> You going to take over the stream, pups. >> What you waiting on? >> Yeah, we pups now, man. >> Jamal, jump on. Hold on, man. Let Jamal jump on. >> All right, we're good. >> Hey, Dad. Why you in a roll? >> Come on. Go look. >> He look like uh he like the man city manager. >> No, he like he escaped from >> Guatemal. What's his name? >> Guatemalo. >> He escaped from somewhere weak >> on the iPhone giveaway. [Music] >> What the [ __ ] bro? Hey, you not you shouldn't be following us. Stop following us. >> Stop following us. >> That was a good picture. What picture? What's going >> now? It's a beautiful day. >> Thank you for sunshine, Lord. I thank you for rain. >> I thank you for boy. >> I think so. All right. >> No. What you mean? No. >> I just got here. >> So, you should cleaner than all of y'all. >> Yeah. Right. >> You don't need them You don't need them airports dirty as hell. >> No, man. I breathe clean air on the airplane. >> You breathe clean air on the airplane. breathe clean air on the >> I mean he >> because they usually have recycled air in the area. >> Oh, it's an outside hotel. >> Oh, it's like a motel. >> This a nice place outdoor pool. >> Bro, I I could have I could have >> No, no, no. Like a swim bar. They got like >> It's a nice spot, y'all. You should >> Bro, I could have saved so much money if I just would have booked motel rather than hotels. Yeah, motel is, you know, that's my thing. >> Like I could have like like we could have just booked mot cuz all we do is just shower and poop in them. >> It's a nice >> So why am I buying fivestar hotels every day? >> Cuz you a fivestar dude. >> Yeah. Yeah, I guess. >> Well, it's too late now. I already spent over six figures on hotels this tour. >> Yeah. Make sure they get up >> and over six figures on cars. >> You know what? We'll sleep in them. >> I spent so much money this tour. We could have just [ __ ] in the bus. >> It don't make no damn sense. >> Not in the bus. >> You want to know how much I spent? >> Yeah. How much you >> I spent over >> I spent over a mill this tour. >> Dang. >> Why you holding my hand? >> You got a million dollars to spend on tour. >> Well, when you doing when you doing big projects like this, >> that's what happens. my tour it be like 10,000. >> Yo, that's outside pool. That's not even possible. >> Yes, it is. >> Use your own car. >> There's a there's a there's your own, bro. >> Oh, that's the outdoor system. >> Wow. >> Oh my gosh. >> That's a good ass outdoor pool. >> That ain't even the >> Bro, y'all got to see the lobby. N let's walk through the lobby cuz >> What's up, man? >> It's actually insane. >> All right. Can you come to the hotel, man? >> Different pool >> at the hotel. >> All right. bar. >> What was that? >> That was Daryl. >> What does Lil D want? >> What is D? >> Really wanted you to have that. >> Yeah, it's like a Rick and Morty. >> Rick and Morty. >> Rick. Rick. Rick. Rick. >> Wait, I got to wash my hair today. >> I got to take out my hair. >> Yeah, I think you should take it out. It's a bit a million dollar. >> What if we spent two million? What was that? What would that look like? >> I It's probably that. I said over a mill. That's all I said. >> I don't know technically. >> I can't, bro. Man, I can't wait to sleep on a bed, man. Me too. >> Y like y >> he can sleep on the bed. He just I don't know why he don't >> he don't he don't have to sleep on the bed. >> Oh, I can't wait to sleep on the sleep on the goddamn bed. You shoot shotgun. >> What room number we in? >> Oh shoot. They no one can get here. Ready? >> Just shut down. >> I'm sorry. This is the room over here. >> Okay. God bless America. >> All right. Thank you. God bless America and no place else. >> Low key. Y'all better off just walking outside or something. >> Say the pool. I should go see that pool. Not that one. >> I should go see the pool while I >> What is like Olympic pool or something? >> Nah, it's it's a crazy. >> Oh, you seen already? >> Nah, that's not the one. >> Oh, Luka. Luka. >> Luka. >> So, how' you know? >> I walked I took a shower this morning. >> Yeah. So, you didn't walk to this pool? >> N. Yeah, I walked through it. >> Go see the pool while I shower. >> All right, cool. >> Any type of soup? >> Yeah. >> Dang. That's what I want >> cuz it's like a liquid, you know. >> That's what I want to do. It's kind of far though. >> It's set up, you know. >> All right. Y >> Jamal, you're you're showering as well, right? >> Yes. All right, man. >> I should go take the pool off. Doing >> Yeah, we about to go. We about to go. >> Huh? >> You showering? Speed's going to go. >> You want to? >> What is this? >> Going IRL now? Yeah. >> Yeah, we're we're on. >> What is this? That's Rick and Morty. That's Morty. >> Oh, okay. >> Yeah. >> Oh, >> it's like a cartoon. >> Oh, I know that cartoon. >> This person made >> It's like u >> Isn't it like a Back to the Future type thing? >> Yeah. It's like a scientist. >> Yeah. >> And Marty. >> This is what it's meant to be. Doc and Marty, right? >> Yeah. >> I never thought of that. >> Marty McFly. >> Yeah. >> You killing me, McFly. >> Your shoes tied. >> That's one of my favorite movies. >> Oh, Back to the Future. I like part two, bro. >> Part two. Yeah. Part two is get it gets dark. >> Number two is the best. >> Yeah, it gets dark in part two. >> We saw the Delorean. >> Remember that museum? >> Oh, yeah. >> Yeah. >> They don't even have they don't even sell that car. >> Museum. >> It was a Delorean there. >> Yeah. >> What? >> Oh, be think about those cars. The the the doors that come out like that. >> Tesla, right? The Tesla's open, right? >> Oh, yeah. >> Yeah, cuz the Tesla's open. >> Not the Teslas I've been in. >> Yeah. I must been in the I must been in the pro Teslas. >> That's Tesla X. >> Tesla X. I was in the poor Teslas then. >> Not to bring it up, but you really wouldn't jump off the bungee jump for a Cybert truck. >> No, bro. >> You wouldn't bungee jump. >> No, I know. >> Why? >> A bungee jump for a Cyber Truck $100,000. >> No, no, no. Cuz listen, if I did jump >> Have you done it before? >> No, never done it before. Ever. Dad, have you seen Have you seen uh what happened with uh Junior uh thing? >> Oh, his strap broke off. Yeah. >> Yeah. Yeah. If I would have got him that. >> It probably would have been bad. >> That was insane. When I saw the closeup picture, I was like, >> \"We don't know if it's a glitch.\" >> Yeah. We don't know if it's real or was a glitch. >> Yeah. I don't know. >> I'm pretty sure it must have been a glitch. >> It had to be a glitch cuz >> they always do that safety check. >> Yes. But I did see a video of a girl who uh she was on the uh What you call those things? The uh >> ziplock. >> Zipline. And they didn't have her strapped in. >> What? >> But she held on to the uh thing. She didn't even know. >> Oh wow. >> Yeah. >> Yeah. That's crazy. >> I went ziplining in u Puerto Rico and they have a half mile long zipline where you just like will stop. >> Oh yeah. It's incredible. That's >> you got to go a lot of high altitude so you can get that down play. >> Crazy. >> Oh yeah. I was bunny jump a car. >> Were you over water? >> Yeah. >> Oh yeah. >> No. >> I was over. >> Oh, hell no. >> Watching the actual jump. It didn't look as scary. >> No. cuz he was it like he had >> he was on he was on two wires going down each side. >> Yeah. So just bring down it was holding a little bit of him. >> I know it was going to be like that. >> He he was he had two support lines. >> He had two support lines. >> Oh the stratosphere is not it is not scary. >> It's when you on one >> because they're control when you're on one support line. >> It's not like when you're on one support and they they you know tie your legs together. It's >> like a ride in an amusement park. Really? >> Yeah. Right. Yeah, because you're not really free falling at all. >> I've done that. I've done that one cuz I stayed at the Strat. So, >> okay. >> Go all the way up to the top. >> Yeah. >> Hey, I sat down there at the pool like I saw them come down. I was like, \"Oh, no. Come down.\" >> I want to go back to Vegas, bro. >> You Hello. >> Huh? No, I want I want to do it. I'm just going to say I'll go back to Vegas. >> You like Vegas? >> Yeah. >> I don't know. We roll in a golf cart. >> Who's that? Girl, >> you don't know how to get here. >> That's what No, it took me like 20 minutes to find the room. >> Terrible. >> Tell you this, the hotel's crazy. I don't know. Y'all y'all don't want to walk around and see it. >> No, I don't. >> See, we came in a restricted area. >> I can't even describe the directions. >> Yeah, this place is hard to >> It's tough. >> Is Dar trying to get to us or just >> trying to get to us? >> He needs to go. You want me to share the location? >> Yeah, you can do that. >> All right. I'm leaving soon. >> It's been a day today. What' you say? >> Sir. >> Hey, Chad. chat always say the same stuff like prank speed like how we gonna prank him >> how >> how >> easy it's easy to bring junior >> I mean everybody got to play along with it though that's the thing about it that's the only way it'll work it just can't be like one or two people. Everybody have to be a part of it. >> So what is it? >> See Ch always says to prank but never said what >> my thing it has to be probably with money like he lost like some money or something and have be like we don't know where it went you know and then have a guy pull up with like a bag that says money. on there >> and walk past him. He's like, \"No, >> we should do like like one person like somebody that one person just have all the cards like this one of everybody cards.\" >> Oh yeah. If he looking for something, everybody like I don't know such and such got it and then everybody blame it on somebody else. >> Yeah, that would be fire. >> I think he'll he'll he'll crash out. >> No, he will. Mhm. >> That is smart >> cuz he crashes out on the production. I be like, I know he'll crash out. >> Have you seen Have you seen uh when Slips and uh Jer got mad at production first day? >> Yes. >> That was hilarious. >> Walking past. He walked past like the best ever. >> What the hell? >> The best thing ever. >> I can't do this. >> That was just the first day. >> It was too. >> That was hilarious. I seen all those clips before coming on the tour. I was like, \"Yo, what is this going to be? What am I walking into?\" >> But production better now. >> N Yeah, they smooth things out by the time I got them shots look incredible now. >> Way more way more better. >> So, how's it been, Dad? >> Good, man. Uh, Jess's birthday was party was yesterday. Saturday. Saturday. Yeah. For now on we just going out to dinner now. >> For birthdays at that house. >> Why you say for now we're going out? >> It's too much work, man. >> And then I'm the one doing all the cleaning and stuff. >> Yeah. So we just going to a restaurant now. >> Unless you have like a milestone birthday, you know. >> See you and Junior birthday always in the winter time. So, it's like we're going to do indoor stuff. >> Yeah. That's why I like that's why that's why I like having one of the birthday, bro. >> I hate that. My birthday is in the cold. >> All in. >> Yeah. >> January. >> See, March ain't really supposed to be cold, but in Detroit, it is cold in March. We might have snow in March. We had snow in April one time. >> Full of weather. >> Yep. But it's uh it's pretty it was pretty hot when I left. >> It was about 80 degrees when I left. >> Still it's hot. >> It's it was No, it might not be as hot in the day here, but at night time it is cold here. Like even in the West Coast gets cold at night time. >> I just realized I had to switch everything. No, but I miss I miss home, bro. >> No, you don't. >> I kind of do. I kind of just miss in the my bed. That's it. Just go to bed in a normal thing. >> A normal square bed, not a rectangle. >> That's everybody's still saying, you know, Jason walking. >> Yeah. See the uh real you saying? >> Yeah. He He walking everywhere now. I knew that was going to happen, though. >> That's good. That's really good. >> Yes. Got to carry him, man. He heavy. >> I would be I would be 59 at his graduation. >> My youngest son, I'll be 59 at >> 59, >> right? >> What? >> What? the fellows at work. >> What is going on? >> He pushed him back and said, \"Hey, don't fight him.\" >> You said you were playing like some streams or something a couple days ago. Do you give any hints or anything? >> Any ideas? >> Um, no, but this is this is in the morning. >> I want to go to a convention. >> Okay. Multiple conventions. I want to go to Sneaker Con. >> I want to go to a anime convention. do more stream like that. I want to do a lot of stuff. A lot of future stuff. >> You gone You've done like a IRL stream like on your own channel. >> Not an official like yo whole IRL. We starting we getting pop. No, I haven't started. >> Haven't started one yet. >> Folks got to tune in for that one. That's got to be a crazy one. >> I want to do I want to do a lot. I feel like you're just getting in your rhythm. >> Yeah. >> You jumped off that thing today. >> Well, the uh >> I messed up my forehead. >> That got him. >> Your water. >> Yeah, >> I see the mark on your head. >> Yeah, that jump. >> I don't know how that messed me up. >> Cap the water. Chad, when is Oh, streaming university 20 >> 26 >> streaming university back. Yeah. >> I don't know. >> I don't know. >> You don't know? >> Hey, if I do get back, I I don't know if I'm I don't know. I don't know how it works. I don't know how the stream university stuff works. So I can't say and if I do go to stream university I know I'm going to be better and have more stuff not have more stuff planned out but like I have better equipment so I won't be slacking and all I have I've been taught desktop wise from master slips since slips 67 but um yeah I've been taught the desktop ways the camera ways need a cameraman I got all that last year. Well, this year was, was it this year stream university? >> Yeah, it was this year. >> Yeah, this year stream university I did awful. I did awful start, but at the end of the stream university did so good. The end of stream university was so that was my like that was the best stream. Jamal too big for stream university. All right. I shouldn't have said master slips. I mean sensei slips. >> But very good. >> Yo. Yo, look at this. >> Look at that. Crazy. >> Look at that. Look. Look. >> Yeah. It's crazy. >> No. But I know. But I know everything. If I do do it, >> that's Wow. >> Yo, Paul, look at this. >> I'll turn the light on. >> You You set the camera right here. That's crazy. >> You won't even know. >> You don't even know. When you wake up in the morning, you see complet So, don't y'all have like a a recharger on your >> Yo, wait. I think we just effed >> you dead ass. >> I'm so dead ass. Wait, where's D? Isn't Daryl coming to the room? >> Yeah. >> Okay. Okay. >> He He need to hurry up now. >> Wait, wait, wait, wait, wait, wait. Daryl need to hurry up. >> The backpack died. >> Backpack dead. >> Daryl, hurry up. >> Oh [ __ ] >> Does that mean the stream's ended? >> It's dead, man. >> Yes. >> Does that mean the stream ended? >> The stream is done. >> Yo, Daryl. >> Hey, wait. Daryl, I'm going to put you on speaker. Hey, Daryl. >> Hurry up. >> Daryl. Daryl. Uh, >> how are you? >> Yo, Daryl, hurry up. >> Yeah, hurry up to the uh hotel room. Yeah, hurry up. >> Just the cam, too. Uh, hey, I gotta call Wall. I got Cam. Tell uh tell Wally to switch to Cam 2. The TV just died. The back >> desktop. Tell me you're not live now. You're not live right now. >> Okay. >> Here. I got to check production. YouTube. The YouTube's frozen, bro. >> Your YouTube's off. >> It's done. >> The stream's ended. Y'all some [ __ ] Now look, imagine if I would have knocked out naked. Y'all can't play like that. Y'all can't play like that. >> That's only right. That's the only thing on that one. >> Especially when I thought you >> was like Daryl. >> You had him for a minute. >> Switch the cam too. >> Put you on speaker. >> Where's the batteries? Where's the batteries? That was good. Where's the cap, too? Switch the cap. That's real good. >> He hopped out of the shower. >> He was like He was like, \"What? What? >> What balcony? >> You got a balcony?\" >> Yeah. >> Oh, yeah. It goes down back here. >> Yeah. It goes down back here. If I was at this hotel, it would be going down. >> What do you mean? Is that a personal pool? >> No, I'm tripping. That's the first one like space for each room. >> Gota >> outdoor patio. >> Yeah. >> Arizona. We're in the middle of desert. >> I looked I looked at the satellite when we landed. I was like, \"This is no land here, man. Ain't nothing but desert. Two more days. >> Two more days. >> Who's next? >> Yeah, that's fine. Yeah, that's cool. You're good. You're good. You're good. >> Yo, I need that Luffy shirt. >> Excuse me. >> Where is it? >> I'm going just turn this off. Just Just stay on shotgun. Really? Okay. All right. >> We on our way back now anyway. >> Who's showering next? Simone. >> Yeah. >> All right. >> I don't know. >> You ain't showering yet, >> dude. I showered before I got here. >> That's dirty, bro. >> That is not dirty. >> Why is that dirty? >> Because you was on that plane. >> My forehead is like, \"Dog, >> you look like I took a D.\" >> You having a shower now? Yeah. >> Yeah. Yes, sir. >> Take back. >> Okay. Yes, sir. After I got out the game, I went home, took a shower, put the same damn clothes back on >> and got on the plane. I washed my hair. I had to get that chlorine out. >> I know. >> You should wash your hair, Jamal. >> You did? >> Yeah, I washed my hair. >> I might take my stuff out before. >> All right, Dad. Come on. If I ain't going to wash. >> All right, Jamal. I'll see you in a minute. >> All right. >> Wait, did I leave anything? >> No problem. >> And if you did, I'll bring it back. Hey Daryl, that was that was a prank. Sorry. >> Where is Daryl? >> Where is Daryl? >> Almost walked out naked, bro. Y'all can't do that, though. For real, >> dude. >> My dad almost walked out naked. >> Nobody want to see that. >> Yeah, I know it's complicated. I can help you once I'm back. >> We're on our way back though, Darl. >> We're on our way back. Yeah, my bad. My bad, though. I should I should have texted you that it was a prank. >> It was just in the moment. >> Just chill out, man. >> It was a tried. >> My bad. If you ran back to the bus, my pissed >> Oh, he ran back to the bus. >> He's pissed. >> Daryl tries to be the biggest joker. >> That's what he get. >> That's what happens, man. That's what happens, Daryl. >> Daryl funny as [ __ ] >> Daryl do talk a lot. He'd be like, \"Speak.\" So, look, guess what? >> I had a pet lizard and when he was 3 years old, he like just died. Like, just died out of nowhere. I'd be like, \"Bro, what the [ __ ] is you talking about?\" He's supposed to be cameraman, bro. >> Popped his spot and then got then he had to go hospital. >> Be like, \"Bro, don't do that.\" Like, trust me, >> Daryl is the most power. >> Yeah, Daryl talks a lot. Chew your hair off. Oh [ __ ] I'll let that freaking morning necklace. Let me tell you tomorrow morning. >> His face is just so [ __ ] going to have a shower. >> I know. Damn. And we got to leave at 1:00 a.m. So y'all going to have to sell her >> under an hour. >> Get in front. Get in front. >> You all good? >> Yeah, we good. Thank you, driver. I really appreciate you. >> I guess we I guess we weren't good. Wait. Hey, I'm just doing what I'm told. [Music] >> You all right, Rudy? Man, >> he's all right. >> We're 15 size 15s now. >> It's like a mag. >> I got to get a golf cart just to go to the store with >> Well, you got to Well, you got to go to the corner store. >> Yes, I can go to the store in it. Lazy as [ __ ] Welcome to the playground. >> Let's go to the playground, kids. >> Just >> I got to go back to my old life, bro. >> What is your old life? >> What is your old life? >> No, like not streaming, >> bro. >> You go. Your life is streaming. >> Your life is streaming. >> You like the black uh Gary Truman. What's his name? Truman Crim Black Truman show. >> No, I know. I >> But everybody not actors. Everybody real people. So >> he has to go back to real life. >> No, I'm saying like I got to go back to like >> not streaming quietness. I don't like that. >> I be getting like sometimes I be feeling it for for IR stream or stream, >> you know? Like I love doing what I do. Keep being this world still here. >> Did we just take a pic? >> Yeah, you just took a picture with me. >> We took picture with you. We done a We took a picture with you, bro. >> We already took a picture with you, bro. >> Bro, you either going to freestyle or not, >> bro. I can freestyle right now, bro. I'll freestyle live, bro. >> All right, we'll freestyle now. >> Can I play a beat for you? >> Just play a beat, man. >> No. Freestyle. [ __ ] she look like it's getting kind of cold. [Music] So I came in first. >> Come on. This your chance >> was the size of a quarter. All 21 million would fit inside. >> Hey, my name Draco BKJ gang on YouTube. >> All right, bro. Let's see what you got. >> I'm a engineer. I got the equipment on me right now. >> Guys, guys, where you schedule? You got a picture already. >> [ __ ] [Music] >> Yeah. >> All right. Yeah. Draco. Ain't no real rap, but I'm going to try this [ __ ] Yeah. Had that [ __ ] drive. St. Louis from three4 game. St. Louis. You already know. You said Chicago. I got to keep it real with you, bro. for the I got a [ __ ] to suck on my dick. She sucking me up. Got the diamonds and my nick. I got a B chopper the boys going to hit your man. I'm six in the file. I'm balling a hardy. Yeah, the [ __ ] to suck on my dick and I get a honey. Stack up the B on top of the board going hit your man the B on your head and the B on your head. Your boy you a spare [ __ ] going to give a [ __ ] [ __ ] I got the B. This [ __ ] to suck me up. Give him the [ __ ] I got some rope if it too long. Get round in the wood. Got on my [ __ ] to speed on the side. He going to hit you with the wither the glide. Giving the [ __ ] up about the honeys. I'm the baby going to get us a dy. Get us some money. You know how to fun baby the girl. You know how to b it. Got my [ __ ] just be on the side of the [ __ ] You know I don't get on the rise. Yeah. >> [ __ ] rise. [ __ ] on high. Yeah. We probably do. We up in the sky. >> Yeah. I ain't got much. >> Hey man, look. I ain't going to lie. I ain't no rapper. I ain't no rapper game. But look, I'm trying. Okay. Chillillill chillill chill chill. >> I'm out here with speed. >> Got to get speed though. Come on. Get >> Yeah. You know we with the team >> team. >> Yeah. You know we getting green. We getting money sipping lean. Yeah. We going crazy. We getting bean. Yeah. >> This is your group. >> This is your clip. 1 2 3. >> Take >> guys. I don't know. Like All right. Real quick, >> bro. Got pictures, >> bro. We already took pictures, bro. >> We doing the same [ __ ] >> Hurry up. We running after this. >> Okay. We're going up, >> bro. >> All right, man. You got it. Let's go. >> All right. Let's go. Yeah. >> All right, y'all. Good night, y'all. >> Pick. Come on. >> Not you. Not you. Not you. All right, man. >> Peace out, y'all. >> That was funny. >> Yo. Yo, >> good night, bro. >> Who? >> All right. Good night, bro. >> All right. >> He said, \"I want the [ __ ] I want the speed.\" I tell this [ __ ] I'm scene. Yeah. How's your speed? I'm green. Yeah. Tell that girl she draw the team. Yeah. >> I'm running around the scene. Hey, two plus two is set me. Bang bang. If I pull up and I step back like hurry and I well like water and you know that it's a dream. >> Uh it's 1210. What you mean? And I got the ends like the 30 means Luffy here. It's white. >> If I make it right, it's going to be Mike. >> What you doing with your guy outside? >> 100. Yeah. Go around. >> Yeah. We about to go about You want to tell him take care? >> Yeah. Chop it up. This is his back. Chop it up. Yeah. about to do. >> Bring on the bus so we can chop it up. >> Yeah, we about to It's time to go. >> We got to go. >> You You guys got keys? >> Yeah. >> You need a key? >> You go get ready as well. >> But I need to take a get in a shower. >> I know. >> Get in a shower. >> Whose drug is this? >> Yo, brother. Come up there. >> Yo, brother. >> After two plus two is me. >> Yeah. Come up. Hey, 1 plus 1 is three is sitting knee spe your bag. Your bag's here, right? >> All right, G. We about to go, bro. >> All right, man. >> All right, G. >> Appreciate y'all. >> It's your bag in it. >> Yeah, I see that. >> Got to go. She love me. >> Where did my dad go? Oh, the one. >> I don't know where it is. >> Where the one piece at? I need that one piece. I see that >> wait a piece shirt is production car right >> it's probably in the production bus at this point >> it's not in here >> that's not fit for tomorrow it's in the production bus It's right [ __ ] here. Hell yeah, [ __ ] All right, let's go. Let's get up out of here. >> Go and join your crew, bro. >> What's up, man? >> We found the shirt. >> You a fool. >> We found the shirt. >> My dad a fool, man. >> Found the group. just got here. >> I guess it >> Yeah, I found it. >> Yo, Tyler. >> Yes, sir. >> Did the bucky go? >> No, he's outside. All right, go have your shower. >> Go and have your shower and then I'll have mine after yours. Asian and Jeff have already had theirs. >> Yeah. Yeah. Yeah. >> Huh? >> Oh, you just need one. Yeah, >> I'm wear this tomorrow. My fit going to be hard. Fire ass one piece shirt. >> Yeah, the pink. >> This [ __ ] hard, ain't it? That [ __ ] hard. >> Did someone custom make it? >> I don't know. >> It looks custom. >> Do you know this guy? >> Oh my god. Do you know this guy? >> You know this guy? >> Who is that guy? Never heard of him. >> Cool. >> Why? >> N this is my demographic. >> It is. >> It was not. No, I'm saying like I don't >> Your demographic will know this. >> Don't show it. >> I'm not show >> this is like your demographic. This is like your [ __ ] >> Real quick. This one of the comments they said that you weren't gonna stand on business and keep your word for how you how you feel about them saying this. >> I a sh I got you. >> I stood on business. I took my word. >> I keep his word. I'm on this bus right now. >> I I took him on a bus. I took him out to eat. We have fun. >> So speed keep his word. >> Speed. Hey, he gonna keep his word. That's one thing about speed. John Bobby, man. >> Let's go. John Bobby. Yes, bro. >> Yeah, bro. Oh, I got to do my curly moisturizer. Uh Rick Rody. Uh >> what's up? >> I think my uh face on. >> What's your curly moisturizer? >> I put this curly stuff on my hair to make my hair curly. >> I'm not going to show my chat the brand. When we um >> cuz I'm gatekeeping. You going to release your products? Feel >> them. I ain't making no hair products. The [ __ ] I look like >> Kylie Jenner? >> You know Kylie Jenner, >> huh? >> You know Kylie Jenner? >> Yes, I know Kylie Jenner. >> You met her? >> No, I met like other ones. >> You met Kim? >> I met Kim? >> Yeah, I remember you met her at that soccer game. >> Yeah, at the football game. What was your name again? Kyla. Kyla. >> Nice to meet you, bro. Nice to meet you, too. Yes, sir. Oh, are we doing uh the dand? >> No, they're imagining awkward [ __ ] >> The dand. >> Oh god, angel. I have to make it more obvious. >> Oh yeah. Yeah, we're Yeah. >> Thank you. >> Yeah, that's hilarious. >> I'm like, bro, I've said it super obvious. Yeah, we're doing the >> D >> drum line. >> No, >> I saw you conducting the band. I was proud, dude. >> Oh, yeah. >> I was like, he got his timing going. You was You was directing in in cut time. >> If you did, if you did come time, you would be like one, two, three, four. One, two, three, four. You was just one, two, one, two. >> That was dope, though. I got to teach you how to ran into >> Oh, my face not even that dirty today. >> Well, your face be dirty. >> Hell yeah. >> You get out the shower? >> No. Like I mean after the day. >> All right. So, let's do my moisturizer. Uh >> it looks way better. 30. >> Ruby, I miss you. Ruby, happy birthday. I was on tour by Ruby. I miss you so much, Ruby. >> Who's Ruby? >> A's girlfriend. >> Let me get my moisturizer. You know what I'm saying? You know what I'm saying? Don't get the brand. Don't get the brand. I can't show the brand. It's my secret brand. What I've been using since I was 14. feel what I'm saying? Secret brand I've been using since I was 14. [ __ ] I just got to >> Oh, you getting a Uber? >> Nice meeting y'all. >> Nice meeting you, bro. I'm meeting you, bro. >> What the f keep doing your thing, man? >> Appreciate you, bro. Appreciate you, >> man. You're a millionaire. Remember me, man. >> Of course, bro. >> Hey, there's a car out there. Yeah. Get in a shower, Rudy. You stink. >> I don't know. Hey, you called me the other night. It was like 3:00 in the morning, though. >> Yeah, I know. I forgot. I was going to ask you something. >> I was done. >> I forgot what I was going to ask you. >> Shower. Yeah, I got to go shower, too. >> Yeah, I know. We leave at 1:00 a.m., right? And it's 12:18. I got 40 minutes to shower. Sydney's happy. N you're too happy right now, Sydney. >> Sydney's too happy. This tour ended. >> No. >> Yes, you are. I can tell. >> I think I might cry. >> Really? >> Yeah. This was like my life for since August 25th. >> Yeah. >> Yeah. Like I don't think I don't know how I'm going to go back to normal. >> That's what I said. Shoot. I cry when I left Denver. >> Exactly. >> Yeah. >> You cry? >> I always cry though. I'm a um >> You're a crier? >> Yeah, I'm a crier. >> You cry. Do you cry in the plane or in the >> cry? I'm in the Uber. >> You cried in the Uber? >> Yeah, I was in the Uber. Like, >> okay. >> Uber driver was like, \"What term?\" >> Yeah. What is wrong with this dude? >> Oh, there's nothing worse whenever you're in an Uber and you're just silent crying. >> Yeah. I got I did I did the whole sniffles and everything. >> You did the sniffles. >> I was like, >> that's awesome. >> Yeah. >> I always been like that when I leave my kids. >> Yeah. >> Family's back. >> Yeah. >> As soon as I got As soon as I got home, the kids was at the house >> just waiting. >> A whole another set of kids. >> Let me take my medicine. You should have put this in the washer, dog. What's going on with this thing? >> I don't even know. >> It's all good. Only two more days. I'll be all right. >> Can you open my hand slippery? >> What are you taking? >> Um, I'm taking praamin. What is that for? >> For my I don't know. And I'm taking Amoxillin. Amylin. >> You been sick. >> I've been I've been watching you, man. >> Yeah, I've been sick. >> I think it's the different climates that you're in. >> I think it's >> Yeah, because it's hot. >> Nobody's [ __ ] working harder than this dude, >> right? >> Usually on people tours like they'll get someone else to do the tour photo for a day. Yeah. You need me to do it for a day? >> I'll just do it. No, I'm not scared. >> Only two more days. >> Oh, there's only two more days. >> It's only two more days. >> Oh, okay. Okay. Okay. Well, yeah, two more days. So, we got the 29th today. Today's the 29th, basically. >> Okay. So, we got the 29th and the 30th. That's two days. >> So, you talking like Tuesday? >> Tuesday. >> Yeah. I'm done like I'm done like the 128th. Yeah. I'm I'm doing 35 days, but I'm kind of cheating it. Really? >> It ain't cheating to me. >> You gonna be sad? >> Who? Me? >> Yeah. >> Yeah. >> I got to go back to my old life just like sitting there. >> You act like you about to go sleep on the floor or something, man. >> No, I'm not. I'm not mean like that. >> I'm about to go live in the trap. I'm about to go back to the slone like Like I wanna like I'mma miss like I be missing streaming. I be missing streaming. Like streaming is my life. I've been that's why like I never do what I did of like what I just did. I took two months off. Like I'mma be back like in the next two weeks. >> I've been doing this every day. >> I can go in, right? >> Yeah. Mhm. >> I go in. >> I should start my 30-day tour. >> $10,000. >> I just got to like after stream like like after the streaming, I got to cook on what like my schedule. I don't know what I'm on like what like like what I'm going to be doing these upcoming months. I got to get me a new house. It's a lot of deals. I gotta fly, bro. I gotta fly all the way to Thailand for a commercial chat. Then I gotta go then then I got to fly all the way to Saudi Arabia for like a little thing after this. >> Really? >> Mhm. >> Of course. >> Yes. I'm dead ass, bro. I'm like damn, I got to be in Thailand for a couple days. >> Oo, that's dope. I I want to go to Thailand. I like Thai food. It's my favorite kind of food is Thai. >> Thailand would be lit. >> Yeah. Just for a commercial. >> Thai food. >> I got to go all the way to Thailand. >> What's up with that new league? >> It's going to be a good commercial though. >> The new witch. >> Yeah, that new league. >> I'm actually I'm signing with the um I don't want to leak it. Oh, >> the league. >> Yeah, the league. The trailer. >> I'm signing with a with a Let me y with a little music. No, no, not music. That sounds dope. I'm not signing a label. Never mind. Y'all see? >> Yeah. Let me not even leak it. >> Yeah, I'm not gonna leak what I'm about to do. I got a um a segment coming up. >> Let me not even say nothing. >> It's gonna be real dope, too, dude. I think you'll be proud of me. Just saying that's about to happen. >> I'm not signing. I'm just like just like just collaborating. >> Oh, no. No sign, right? >> Yeah. I'm just like collaborating type [ __ ] So I can't So basically I can't walk around with it's like some some things do that. >> What? That [ __ ] watch Lions won 34 to 10. Yeah, 34 to 10. What the Bengals do? Did they play? Let me see what the Bengals do. >> What's up? You just saying [ __ ] Lucas shower, eh? >> I showered this morning. >> You good? Yeah. >> I forgot. >> Oh, they play Monday football. >> You good? >> Do you want a shower? >> No, we're good. >> Do you want a shower? >> Just Bro, I mean, bro, you >> take it take like >> I can switch the camera, too. >> It takes so long to get to the thing. I'm good. >> It is quite a mission. >> Yeah, it's a mission to go there. >> If you're good, I can give it to someone else, but I was gonna mine for you. >> There's other cameraman, bro. >> I could be a cameraman. [ __ ] >> I take pictures of myself every day. This is us. It starts with one thing. Stop avoiding Africa. How do I tell you Africa is going to be the next tour? You [ __ ] donut. >> Africa will be dope. >> No, Africa is going to be It's gonna be wild. Can't wait. I can't wait for Africa, bro. >> All right, Dad. What should we do? >> Now, that was funny, man. >> Oh, yeah. We was wrestling. >> Yeah, we was throwing the gorilla. >> We was a DMX, man. I miss WWE, bro. >> That was crazy. Tell >> y'all ain't grew up in our WWE era, bro. Man, y'all didn't grow up in my era. >> No, I grew up in the best era like 2008 to like 2002. >> Most definitely, >> bro. What? >> Hell yeah. CM Punk, all them John Cena was going crazy. Who you think? Okay. Who you think the goat is >> in wrestling? >> Yeah. >> Hulk Hogan. >> What >> you think Hulk Hogan's the goat? >> Yeah, man. >> I think John Cena is. >> John Cena's most >> I know. I've been watching Hogan since 85, man. >> I say The Rock or John Cena. >> No, Ric Flair. He a go too. >> Like one of my my favorite wrestler is like Macho Man, Bret Hart. They're my favorites because they're like technicians. >> Like Macho Man, he would jump off the top rope >> like he'll be up there >> and then jump off of it. And then his promos are the best. >> His promos. Can't nobody beat Macho Man promos. He start out real low and then he starts going bananas, man. I remember he had a feud with um with uh what's that good name? Georgia Animal Steel, man. He would eat the turnbuckle. >> Ch. He knows balls. >> He'll eat the turnbuckle. >> You know, I know. >> Yeah, I know wrestling. Me and me and my brother made our wrestling belts out of cardboard boxes back in the day cuz we couldn't afford the wrestling belts. So we wrote WWF >> WF. >> It was WWF before it was WWE. >> Oh, it wasn't. >> Yes, it was. Dude, >> it was WWF. >> That was a different wrestling. >> It was It was Vince McMahon's Wrestling >> Federation. >> World Wrestling Federation. And then they changed their name because someone else owned the rights to that name. So they changed the WWE. Now it's real. >> Nice meeting you, man. >> Appreciate all. Peace out, bro. >> Go for real. >> Hey, I'mma take your advice on that back flip, though. >> All right, bro. >> Good night, bro. What? No. Alter, bro. Ch. He was waiting for his Uber, bro. >> What's wrong with y'all, >> man? Your word, man. >> Like, they go have that. Somebody in the chat was like, man, just go. What's wrong with y'all? >> You're talking about finally like, bro, he was waiting for his Uber, >> right? He's good, dude. >> He was He was cool. Oh, >> yeah. I was reading it like, y'all wrong, man. Rody Piper. Yeah, he was dope. Ric Flair. He always been funny to me. He always made me laugh when he would walk off and then fall. That was classic. The uh the uh the uh the Road Warriors, that was the one of the best tag teams. The Steiner brothers, one of the best tag teams. The Rockers was dope with Shawn Michaels and Marty Janetti, man. Shawn Michaels back in the day, he was awesome, dude. I just hated the way that they u broke them up, broke up that team. He kicked my man Dusty Rose. Yes. I like Dusty Rose. I used to have a a crush on Sapphire. Just Just look up Sapphire. Y'all go roast me. I don't care. But I like big booties and Sapphire had a big old butt. So >> what I just walked into? >> Oh, >> who got big booty? >> Sapphire >> from Dusty Rose. >> Starfire from Titan. >> Sapphire. Sapphire. Goldberg. Now when Goldberg ate the scene, he changed the whole game up. >> Goldberg. He was on WCW. >> He started on World Championship Wrestling >> and he was beating everybody up. Oh, this track can't be real. >> Demolition. Demolition. That's a good tag team. >> Y'all should look up these guys though, man. You'll be like, \"Oh, they demolition had the best like uh intro music and they would take off their mask. They have the makeup and they had the red tongues. Tell you they was yo bungee almost snapped. >> See that? Apparently it was a um >> Yeah, the the Was that real? with the picture. >> Was that even real? They didn't It looked like I was like But that thing that was on the Strat, right? But the Strat is like controlled though, right? >> It's not a free fall like type of thing. >> Oh yeah. >> Harlem Heat. You know who Harlem Heat is? That's Booker T and his brother. You don't remember. That's the one he was like, man, when he said, \"I'm coming for you, Hulk Hog. I'm coming for you, nigga.\" And he was like, \"Oh, that was when he was with his tag team brother.\" Undertaker. Undertaker already always been a go. He made me cry the first time I saw Undertaker. >> You cry? >> Yeah, dude. He scared the living daylights out of us, dude. His first entrance into WF was at Survivor Series and he was laying everybody out, dog. And then when he put uh Hogan in the casket, I was like, \"Oh no, Hogan is dead.\" >> Undertaker used to be scary as [ __ ] He was the scariest wrestler in the world, dude. Undertaker was scary. >> Papa Chango was uh he was scary. >> Have you seen the video of Undertaker talking about speed? >> Yeah. You >> talking about me? >> Yeah. When you got Spear, my man. >> He was praising you for how you took it. >> Yeah. How you took it? Yeah. Him and his wife >> on a podcast. >> I didn't take it. Go, bro. >> Hell yeah. the uh the hint next date, >> bro. That [ __ ] been leaked so many [ __ ] times. >> I'm about to just tell y'all where the [ __ ] I'm going. It don't even matter. >> What's the fun of that? >> Let's not announce it or anything. >> The whole Bro, the whole >> the whole chat knows where I'm going tomorrow. >> Where where chat? Where is he going tomorrow? Chat, where am I going tomorrow? >> But it's not clipped. You see, like they can't clip you saying something without you actually saying it. And then it widespreads. Right now it's just locally to your chat. These people are from all over the place. But once you have a clip and then that reaches the local communities. >> You going to Louisiana? >> You're right. >> You going back to Louisiana. >> You just leaked it. >> They said Louisiana. >> Sting was dope. Sting. NWO. Sting. I take him over everybody. Because the Sting back in the 80s, he was all right. But nWo Sting, he was dope. He would just pop up out of anywhere with a baseball bat. A black baseball bat. >> Kane. Yeah, Kane. >> Oh, Kane. Undertaker Brother. >> I remember Kane. >> Undertaker brother was crazy. >> Yeah, he was he was massive. >> Ball head. >> He was massive. >> Yo. >> Oh my god, bro. My hair's so oily. >> They said Kanye dissed you. >> I don't know. They trolling. >> Oh, why would Kanye diss me? >> Right. They don't even know each other. >> I never even talked to Kanye. Met Kanye, >> right? People don't talk about people that never met, >> right? We never even met or talked. >> Yes. Detroit in the house. Aiden Hutchinson. He got like two sacks today, bro. >> For real. >> That's what's up. >> Andre the Giant. Yeah. Oh, Andre the Giant. He died though. >> Oh, Hogan died too. >> Wait, wait, he actually posted about me. >> Wait, Kanye actually dissed me? No, >> I don't know if this verified. >> I never even did nothing against >> Oh, yeah. Rick rude. Ravishing Rick. I can't tell if the screenshots's really fake. >> You can't tell. Oh, match up. >> Who's that? >> I think it's fake, >> bro. I never did nothing to Kanye chat. >> Maybe that's the problem. >> I was like 90% fake. There's like a 10% chance. >> That's uh >> we're not even using that camera. >> Oh, that Oh, shoot. I feel dumb, bro. >> He's literally the cameraman is standing right here. >> But I thought it was like two different like >> Oh, Dad. I I got to call Betty. >> Betty. It's like two different, you know, >> pictures. >> I met this girl named Betty. >> Betty. What she look like >> in Las Vegas. >> What she look like? >> She's like your age or probably older than you. >> That's good. >> I like women older than me. Like she >> I like women older than me. Your mama older than me? >> Yeah, I know that. >> Dre and mama older than me. >> Your call has been for crazy. >> Wait, wait. Wait. His mom older than you? >> Yeah, his mom older than me. >> He like older. >> You like older woman? >> Yes. What's wrong with that? >> He does. >> I do. >> What's wrong with that? I mean, >> it's nothing. >> Older women are nice. And now that >> I'm realizing you do. She's older than me. Betty older than me. Betty must be old. >> Nah, Betty was old. >> Oh yeah, >> Betty was like, >> how old? Like 70? >> No, she was like in her like I say chat what? 50s. >> That ain't old, man. >> I say 50s. Shaq, >> I've dated women in their 50s. >> I say early 50s. Shaq, >> you dated a woman in the 50s? >> I dated a woman in her 60s >> and I was like 27. >> All right. Like what would I what was I what was your daddy though? >> You like it? >> Yeah. Her name was Bonnie. >> 40s or 50s, bro. She's like in her 40s. 50s. Late 40s. >> Oh, that's that's perfect. >> Late 40s. Late 40s. >> She got soft skin. >> Or was she real thin or >> No, she was >> she had some meat on her. >> She was She was >> You got a picture? >> I I don't I don't have >> So, I got to go back to your your screen, I guess. >> Yeah. >> Oh, she wasn't on the screen. She was on the screen. I just don't know. Like, >> man, so she must be uploading. >> Nah, she she was just a regular lady, bro. >> She was all over him. >> She Yeah. >> What's wrong with that? >> Wait, I'm about to call Santo. Let me call my brother. >> They said she was bad. >> Bless you. >> Let me call. >> She was bad, y'all. Somebody send me a picture of her in my um on my IG. Go to my IG and send me a picture. I want to see. Let me call Santo. >> Don't let these people sleep. >> Oh, you're right. >> Wait, where did I meet Santo at? >> Uh, >> nah, he work at the Indian spot. Santo, brother. >> My brother. My brother. My brother. >> I miss you. I miss you, brother. >> I love you, brother. >> I love you, Sato. >> He got on. Is he even dressed? I'm swe. >> Yes, brother. I miss you. I miss you. Sto man just say he's my brother. >> I miss you, bro. >> I miss you, bro. >> What the he? Okay. What is he running to? >> Yo, what you on, bro? >> Yes. Where the [ __ ] is he going? Where you at, son? What you on, bro? >> Yes, sir. I miss you, man. >> Oh, he on a restaurant. >> I love you, man. >> I miss you. I miss you, man. >> Come back again. >> You said what? Then you come back again, >> bro. Yo, yo, I gotta visit again. I'mma visit the spot again. Uh, Santo, >> please. Please. >> I will, man. I got you, bro. I will. >> I love you. I don't have any words. >> I wasn't hungry at first. >> Yes, Santo. >> I'mma come back, Santo. >> Something me. >> I will, Santo. I'm going to come back, bro. I miss you, man. Trey, >> you look cute right now. Santo, you look good. >> Me too, but I can't speak. >> I don't have any brain. >> You don't have any brain? >> No. I can say to you, everybody say to me, \"Yo, speed come serious.\" Oh, brother. >> Brother, you got to make me more chicken biryani. I miss it. >> Yes, I miss >> chicken biryani. >> I knew it. I do. I >> Yes, brother. I miss you, man. >> Please come. >> I'll visit again, Santo. All right. Hey, look. You got my number, Santo. Just call or text me. No, just text me anytime you anytime you want, Santo. All right. >> I don't have any. >> Okay. Okay. Okay. You're my baby brother. Baby brother. >> Yes, bro. Yes. Big bro. >> We're brother. >> You know I miss you so much. >> I miss you too, San. >> Please for me over here. >> I will visit you. >> I miss you so much. >> I'll visit you, San. Nobody believe me that. All right, Santo. I gotta go now. All right, just text me. Okay, Santo. >> All right. Good night. Good night, Santo. >> Good night, Santos. >> Good night, >> T. Where did I meet Santo at again? >> At the Indian restaurant. >> No, I know it was at the Indian restaurant. >> He was outside Vegas >> in Vegas. >> Salt. Salt flats. Utah. >> Salt. >> Utah. >> Utah. chat. When I visit Utah again, I gotta meet I gotta go back to that Indian spot. >> Did you meet Carl Malone? >> No, I ain't mean Carl. I was supposed to meet him though. Utah, bro. As Santos, >> I miss Santo, bro. >> That was so much fun. >> That was That's my dude. He funny, bro. He was like, \"Bro, bro, like the ass like you know the boobies, you know the girl.\" I said, \"Bro,\" I was like, \"Bro, just >> No, we No, I was trying to I was trying to >> You gota be like Santo. >> No, Santos the guys. >> I like everybody named Santos though. >> You taking out your hair? >> Yeah. >> Your hair curly. >> But this part right here, it don't feel weird as You taking out your hair for the last two days. >> It go crazy. It go. Is you gangster? Is you G? Is you not? >> You ain't never seen that. >> You ain't never seen uh BBL. He never seen BBL. >> BBL. No, it's a dude with a BBL and he got a song called Bop. It go and he bounce his booty when he shoot the gun. >> He was on uh Drew just Yeah. >> Did you uh you hear a story about this? >> Nope. >> This boy, his mama raced in >> Oh, yeah. Olympics. >> In the Olympics. >> Yeah, that's right. >> In the Bahamas. >> Bahamas. I about to say if he would have said like uh Jamaica I was like the uh Frasier that's the fastest woman. >> Jama Frasier in and the fastest woman in this >> Shakari Richardson. >> No it's not. >> Yes it is. >> She can't beat Frasier. >> She's the fastest woman. >> No she can't beat Frasier. >> Fraser been the top dog forever in women's running. Like they don't even race against each other. Shelley Frasier, that's her name. Just look up Shelley Frasier. Shakari can't beat her, bro. I'm sorry. >> Wait. Oh, you talking about the girl from Jamaica? >> Yeah. >> No, but I think Shakari is the fastest though. >> She haven't raced her though. They haven't even raced each other. >> I've never seen them in a race together. But Shelanne Fraser, man, come on, bro. She might be older now cuz like they got a video of her at the uh like the parents. She had to all the parents had to race at the school. Man, she smoked all the parents. Man, it's not even fair. Shelly and Frasier, fastest woman alive. Oh, >> and she's cute. >> I remember when she had braces. She was even cuter. >> Now them track girls. >> Yes, man. Tell y'all don't know about them track girls, bro. Let me tell y'all a little secret. As of when you train for track, you train your glute, right? >> Yeah. >> Like everything in track is glute. So all them workouts is just glute and your glute is a part of your butt. Track ladies overtrain them glutes. So y'all know what that mean. >> Y >> buddy, >> y'all ever seen the pole vaults? >> Y'all know what that mean? >> Or the high or the long jumps. >> The women long jumps. That is a sport to watch itself, >> man. >> I think the women loan jump is the best one because they got to get out the they got to get out the sand cuz when they get out the the dirt or the sand, you know, >> them gluts be hard rocks, >> but big glutes muscle. [Music] YouTube doing good with the uh with the chats. >> YouTube doing good with the chat. >> YouTube usually YouTube be on some beer. >> YouTube do be tripping sometimes. >> Um now the thing like I I like going to like watching beach volleyball and like college volleyball stuff like that. That's pretty dope. >> So you ever watch beach volleyball? No, I never watch beach volleyball. >> Dude, I'll sit there all day watch volleyball. >> Who's his sister? >> It's one chick. She like 6 feet four or five, dude. >> So now you know actually beach volleyball players. >> Yeah, >> I have Tik Tok, dude. You be watching beach volleyball. >> Yeah, who don't watch beach volleyball, >> bro? What way? No, that's damn bad. >> On a Saturday when things are slow. >> No, that's crazy. >> Just watch beach volleyball. Beach volleyball is crazy. >> Beach volleyball. >> Oh, anybody in the chat watch volleyball? Anybody watch beast volleyball? >> Girl, beast volleyball. >> Yes, it's a great sport. >> That's crazy. >> That's too hard. >> Little D. No, I want No, thank you. Little D. >> What up, bueno? >> Gas trucks. >> Gas. >> Gas. >> Gas. Gas don't mean good in my day. E >> what? >> Somebody. >> No, it's the texture. When I bit it, I'm thinking it's going to be like a dense, but it's like hollow, you know. >> Yeah, I know. Ball. >> I know ball. Hey, you see um Lil JJ was roasting you cuz you had on the um Lonzo ball jersey. >> Yeah. >> You don't know Lil JJ? Bobby Johnson. Thompson. What's his name? Bobby Thompson. He played in uh Role Models. The little boy that was cussing. >> You got to show me a picture. >> Damn, bro. >> You got to show me a picture, man. You know I'm a bit young, Dad. >> Yeah, you are. >> You know I'm young, Dad. I know the OG, but I don't know all the OG's. >> He not even OG like that. They like 30 something. >> Yeah, he uh >> John Bobby, >> he was going live while you were in Chicago. >> Oh, come on. >> I fall. Why they got y cheekbones like this in this picture? >> No. That look like you. >> No. I was look I was like that's African speed for real. Like if you were African that's how you >> an African speech. >> I am African. >> No you're not. You're >> I am. >> You're an American. >> But we from Africa. >> Who from Africa? I've never been to Africa. >> But you're African. You're a your your descent is is African. Dad. >> But you don't. So, so >> you know how far of a descent that is though? That's a >> 1900s. >> We talking >> that's not that far. >> We weren't African in the 1900s. We couldn't 1900. >> We We were We were bought the slavery in like 19 freaking >> slavery was over in the 1865 66 something like that. >> Never mind. >> I mean 1800s. >> Still African descent. It's still African descent, >> right? But just cuz you know born in Africa, you're still African descent. All right. But your my mom's father's Jamaican. Nana's dad's Jamaican. >> That's still Africa. >> No, that's that's still Africa. >> No, it's not. Jamaica and Africa is not the same. >> Africans came to Jamaica to the Caribbeans. >> Yes, that's true. Okay. >> They migrated. >> Who told who told you that? >> I forgot. I think Tik Tok told me that. >> Oh, >> right. Chat. Tik Tok is all >> right, >> Chad. Didn't Yes, bro. The African Yes, the Africans came to Jamaica. I seen it on TikTok. Yes, I'm right. >> No, I don't know about that. >> Yes, that's true. >> Wait, so if Jamaica is basically Africa? It's just >> No, it's not. >> Yes, it is. >> They don't even speak the same dialect. >> I know. I'm talking about the race. actual. >> Come on, man. >> Bro, I'm talking I'm not obviously I'm not Yes. It's different culture and different language. I'm talking about the the the actual skin, the race. >> At the end of the day, we're all African. >> But, >> yes, there's no butt. There's no butt. At the end of the day, we're all African. >> We all come from the same continent. >> I'm not going to get too deep with it, man. >> Yeah, me neither. >> I know where real Africa is. >> I'm not about to get too deep. >> I know where real Africa is, though. >> You know what I'm saying? Real Africa is here. America. >> Oh my gosh. >> All right. >> Yeah. Just Okay. >> That's what I'm doing. I'm >> Yeah, Dad. Just >> That's why I'm not. >> All right. >> But you said he said Africa's here. >> No, this is the real >> What is he talking about? >> America. >> Okay. All right. Okay. All right. Dad, don't just just don't. >> Right. Okay. >> Just Dad, don't. >> That's right. >> We're not We're not going to go that route. >> We're not going to go that route. We're not going to go that route. >> Just be quiet. I don't want to hear you. I'm trying to tell y'all. >> America, y'all. Just be quiet. >> All right. >> Be quiet. >> All right. Let dad talk. >> I'm trying to tell y'all, man. >> No, cuz he's about to say something. >> No, we're not African, man. No. >> So, what are we then? What are we? What am I >> American? >> Yes. I was I was born in Portugal, Dad. >> Africanamean means you were born in Africa and you moved to America. >> Okay. >> But you wasn't. You were born at what was that hospital name? Uh St. uh uh what was that? You was born at Cincinnati, dude. Across from UC. You you you was born across from uh University of Cincinnati. >> Who's that? Um Good Sam. >> So basically >> Good Samaritan. That's where you was born. >> So basically we got Jamaican descent. >> Yeah. My mom's dad's Jamaican. >> Your mom's dad Jamaican? >> Yeah. >> Okay. So, that makes grandma Jamaican. Was he born in Jamaica? >> No. >> His father was born in Jamaica. >> That's See, that's just is too far now. So, now we're all the way off. >> That's exactly That's why we're Americans. >> Can you even speak like Jamaican dialect? Can you speak African dialect? Well, African dialect is like French. So, Which part of Africa speaks French though? >> Uh I think Ivory Ivory Coast. No. Okay. Ivory Coast. >> Yeah, that's it. >> Because look. Okay. No, we not going to get into that >> because people will start be like, \"Oh, his dad is one of those guys.\" No, >> I just know I know I read I've been I've been reading a I read a lot. Just don't I read a lot. I'm not the dog like that. Just don't. I read a lot, man. I don't read the stuff that people want us to read, but it be like true stuff. >> We're not going to go that route. >> At the end of the day, bro, >> you're an American. >> Born to be an American. >> We're black Americans. >> Oh, we're African, >> bro. Why >> Why you trying to convince? >> Because we are. No, Rudy. Rudy and them, they Africans, right? >> No, actually Simone. >> No, Rudy. No, >> that's African. >> Simone is not Africa. >> Is it? >> Simone is Africa. >> That's the islands. >> That's the island. >> Oh, you talking Simone? Yeah, I'm thinking Somalia. I'm thinking Somalia. My bad. My bad. >> My bad. That's my bad. He don't know what he's talking about. >> My bad. That's my bad. I think I thought he No, I thought you talking about Somalia. >> He don't know what I thought. I thought he meant Somalia. >> He don't know what he talking about. >> Simone. I know what he's talking J don't know what he talking about, >> dude. I mean, I made one blunder. You've been blundering all day and I made one blunder. >> I thought I was going to say I thought Simone was actually from Africa. >> Yes, sir. >> Now, Rudy Rudy's African. >> Yes. Now, that's African. >> Rudy's African, >> right? And y'all look y'all look nothing alike. Nothing alike. you. I mean, >> who's actually asking? >> He's from Ghana. >> Speaking of them, where they at? Ask me. >> Oh, they taking him a while. They trying to find a way back, >> right? Yeah. I was going to say if we bus ain't going to leave for five minutes. Might as well. >> It don't even [ __ ] matter what I am. >> It does matter who you are. >> Bro, this this You're American, bro. >> You don't care who you are. I know I do care, but like does it matter >> at this point, bro? You're American. >> We're all [ __ ] humans. >> Yes, we're human. >> We're all humans. >> We're all We all have the same [ __ ] tenderlands, the same bones, the same damn oxygen cells, the same blood cells, all the same [ __ ] We all got the same [ __ ] inside of our body, >> right? >> We just come from different areas. We just it's just we just some of us just look different at the end of the [ __ ] day. >> Yeah. >> Y >> we're all the same [ __ ] species. >> Some people look like Beetlejuice. Some people like Peter Parker. >> Um Wow. >> Do a DNA test. I'm Bro, I'm doing a DNA test. >> A DNA test? >> Cuz my dad don't know what he talking about. >> Yes, I do. >> Pretty simple. The mom mom's dad is Jamaican. He wasn't born in Jamaica, but he's Jamaican. >> Yes. >> You don't to be a Jamaican. You have to be born in Jamaican, right? >> No. >> H. >> You can have Jamaican parents. >> But they have to be born in Jamaica. >> No. >> Yes. >> No. No. You're not understanding. Okay. >> I am. No. No. >> All right. Listen. Listen. If you have two African parents and you're born in American, that's Africanamean. >> What? If you if you're if if >> No, that means you're African. >> No, you're African American cuz you're an American. >> No. >> Oh my god. >> I thought I thought you said >> Stop talking about this. >> If you have No, both parents are African and they have a child in America. >> They're African. >> They're African. American. >> All right. >> That child Okay. >> Because that birth certificate is in America. It's not in Africa, >> I guess. >> Yeah. I thought you said I was going to get too deep into this. >> All right, it is Chad. I think I'm right. >> No, that's the definition of African. >> Listen, listen. You're >> That's the definition of Africanamean. >> No. African. No, no, no. The definition of a Africanamean is it goes back. It goes way back. >> No, man. >> It goes way back. >> I don't associate with Africa though, >> right? Cuz you're >> So, how can I be Africaname? I have no association. Because you are Africanamean. Two parents from Africa. >> My mom ain't from Africa. >> Exactly. >> My mom are from America. >> Exactly. >> My mom from Detroit. >> Exactly. >> So she's American. >> Right. But you just said two African parents. >> Two African parents that have a kid in America. That's AfricanAmerican. >> All right. Or you got an African mother and a American father. That's Africaname. >> That's African-American. That's African-American. No. But if you're born here, but if you >> if you have African parents and you're born in America, you're Africanamean >> because your your birth is here, >> but your parents descent are African, but you're born in America. I like to be in America. Okay, for me in America, everything free in America for a small fee in America. Here you are free and you have rights. >> Yeah, that's from Westside Story. That song is called America. That is wrong. No, that is right. Right. That is right. Yeah, I'm right, man. Come to America is a funny movie. One of my favorite movies. Not part two, though. They could have kept that one. >> Oh, yeah. I remember that movie. >> They could have kept part two. >> Coming to America. >> It It wasn't even the same like cadence. >> I'm saying dad is dumb. D [ __ ] dad. Dad is dumb. >> Daddy don't say dad is dumb. Somebody said it. No one said I'm dumb. I'm not dumb. I'm not dumb. Either way, I'm doing a DNA test. I need to know where I'm from. >> You are from Cincinnati. >> I'm talking about my descendants. >> Watch. They going to say you're from Jamaica. >> This your boy was right. What did I say? >> If I'm Jamaica, then I'm Jamaican. [ __ ] >> Dad is wrong. Gans. Gans too. You got the wrong name to say I'm wrong. >> So, Dad, you think you don't got no African blood in? think you just pure American, >> bro. Yes, man. >> Yo, what? What? >> Yes. >> What? >> We don't, dude. No, man. No. >> Yo, he's slow. That's slow, bro. >> No, we don't, man. We've been here. We've been in America our whole life. >> Yo, what? You're black? >> Okay. >> What? >> My grandma? >> My grandmother was born 1910 in America. Her her mother was born 1875 in America. >> Come on, man. >> Bro, my yo, what? He tripping, bro. >> You tripping. >> There's no There's no African ties like that, dude. >> You tripping. >> Come on, man. >> Yo, what? >> My grandma was born 1910. >> Bro, >> she had she had Nana at 43 years old. You know blood is transferred from ancestors, right? >> Our blood is blood. Our blood is easy. >> You know what? Let's just stop. Let's just stop, bro. >> We been in America. Let's just stop. >> Our family been in America. >> Trust me, man. >> So, when did the Walkkins family start? >> I don't know. I'm like I don't know which number generation I'm in. >> That's hot. I just don't I know I never met my great-grandparents, but I've seen pictures of them and nothing says Africa about them. >> Have you seen grandpa's mom? >> She's white. >> She's not white. She >> Yes, she is. Bro, >> she's not white. >> No, she's not white. She's She looks like it, but she was white. >> Just mellow out, guys. Just mellow out. All right. >> Right. You got to wash your hair. >> I know. How you think you got green hair? >> How you think grandpa that had light skin? >> Because >> exactly, Dad. >> All right. This another thing we come in all colors though, man. >> Dad, >> like his his dad is his dad was real dark. >> Grandpa's dad was real dark. >> So grand but his mom was white. So mix. >> Okay. See, >> so grandpa mix. I'll give you mix. I'll give you mix. >> So grandpa's mix. Wait, wait, wait. No, no, no. >> Oh my god. >> So grandpa's mix. Have you seen his other brothers and sisters? They all different shades. His one his older brother darker than you. Dad's Chinese. You got that right. I seen a picture of grandpa mom. She was >> Yes. >> She was She was white, man. >> She wasn't white. That's it. The pictures are black and white. >> No, she was like >> Where the picture? You got it in your phone? >> Yeah. I got it on my phone right now. >> Show it. >> Let me Let me get it, man. Don't be in my phone. >> All right, get it right now. I'm about to show tap. >> You can't be up in my phone. >> I'm about to show tap and I'm about to show y'all, boys. >> She was She was white. >> No, she wasn't. >> All right, chat. I'm about to show y'all the the picture. All right, chat. I literally looked at I was like I was like, \"Oh, >> I got to go to my Google. She was not white, right? >> Better get rid of your accent. >> Here you are. 3M, you path right. >> You got the vision. >> Hold up, bro. >> Hey, >> long as you stay on your own side, >> Ames, >> what's up, baby? >> You make me pain. You make my just do a DNA. Yeah, bro. I'm going just do a DNA test. So then I can just tell my dad. Go, Dad. I'm >> right. I promise you. They going to be like, \"No, you ain't.\" >> What is he going to say? >> They going to say we probably from the islands. >> Islands? I >> I'm trying to tell you, Jimmy. >> I'm not from no island, bro. >> Why? What's wrong with being from the island? >> I'm not from an island. I know I'm from like um >> How do you know? >> I'm from like Angola, bro. I know I'm from somewhere like Angola. >> No, we are not from Africa. We're from America. >> We are Americans. >> I'm Portuguese. I know it, bro. As soon as like I don't even know why I'm asking my dad cuz my dad don't even know. >> That's cool. >> My dad don't even know. So, >> yes, I do. >> I'mma pee in that cup and that and when I pee in that cup, the pee going to trace back every single [ __ ] ancestor. >> Cup. >> Yeah, I think you pee. >> They They going to swab your mouth. They swab your mouth. Junior, >> I'm from Angola. >> Why do you wash my hair bad? >> Why you didn't wash? >> Oh, cuz you still my hair. >> I got that. Let's go. I got to go all the way back in the day, though. >> The [ __ ] >> I got to go back 10 years on my >> Where is that, >> bro? Get out of my phone, man. [Laughter] Okay, I'm getting close. >> Ew. Ew. >> I don't like how like that's weird. >> What's weird, dude? >> Like how they hold the camera. >> Go here. >> Oh. Oh, >> I got Bruce right here. >> Better get rid of your accent. >> Leo is Angolan. Exactly. And I look I look just like Raphael. No, >> I look >> Rafael. >> I look just like pull up a picture of Rafael Leo. >> I look just like Rafael Leo. And you tell me we not the same. >> Let me see. >> And you saying we not from the same country? >> We Bro, I'm somewhat Angolan, bro. >> No, you're not, dude. >> Bro, look at your cheekbones, man. Let me get a good picture. >> If you look at cheekbones, that's part Indian, Native American. Watch. You going to be totally surprised you figure it out. >> This is Raphael Leo. >> Hecky no. >> And this is me. >> No, >> bro. I look just like Raphael Leo, bro. >> You don't. >> Yes, I do. >> Let me see. >> You don't even know who Rafael Leo is. >> I just seen a picture. >> I don't I don't like him. >> No, you don't. No, you don't. >> Chap Junior. >> He don't look American. >> I look exactly like Raphael Leo. >> He does. Okay. Bro, [ __ ] out of here, bro. >> Where the picture at? >> I'm still looking for it, man. >> Damn. >> I got a lot of man. This phone go all the way back to 2008. The pictures. >> Nah, chat. We going chat. We going to find the bottom of the bear. The Africa tour coming up. I'mma do a DNA test. You look [ __ ] You look I don't even know what you look. You look First y'all go by your cheekbones, man. >> What is your grandpa? >> Y'all cheekbones is Native American. So I'm Native American now. Dad, >> you're an American. >> I'm Native American. >> I'm just trying to tell you you're an American, >> bro. Holy [ __ ] >> Why? She going to go to Africa like >> Now I'm not going to have a connection. >> Now I'm Native American. >> Oh god. Where has this conversation come from? dying. >> There it go. That's better, >> man. Now you got people inboxing me. If Junior is from Africa, >> let him don't let him tell y he's from good Sam [ __ ] star. We going to keep [ __ ] pushing. I'mma keep going and I'mma keep on [ __ ] cuz I'm a [ __ ] Yeah. >> Where the picture at? >> I'm still looking, bro. You don't even got in your phone. >> I'm in 2016 right now. >> No, I took I I think I know I think I know where the picture is. I just want to make sure I got to go through everything. >> Somebody said Elon Musk is African. >> He is. He's from Africa. He's from South Africa. >> Really? >> Yes. >> How do you know that? >> Wait, dead ass? >> Yes. What is wrong with y'all? You think it's only black people in Africa? >> Yeah. >> Hell no. >> Wait. Elon Musk is from Africa. >> Why you think French is the language? >> Come on, guys. Do your research. >> Wait. Oh, he is. >> Oh, they was dead ass. I never knew that. >> You didn't know that? >> I never knew that. >> Uhhuh. >> You guys are nuts. I never knew that. >> What? You learn something new every day? >> No, I thought somebody was trolling. >> Dudes from Africa. >> I didn't know that rich part of Afric is all [ __ ] up, bro. I mean, it's his story. Just look at the name. His story. History is a big [ __ ] mystery. >> That's never going to be solved. >> Because we're only told what >> we don't know. We don't even know what we're told. If you do your own research, you'll find >> Did you back? >> I go down rabbit hoes. I smell like all four cameramen. >> All four camera. >> Yeah, it's bad. >> I'm sure. >> Damn. Elon's more arrogant than me. >> Oh, it's a moment. >> Sydney. >> I was about to scream, too. >> Sydney. >> Hi, Sydney. >> Sydney. Sydney. >> Hi Sydney. >> Sydney. Sydney. >> I was like alert. He has something in his handset. I almost ran. It was scary. >> I didn't say anything. >> It just happened. >> Sydney Ever. >> Sydney, you're a >> Okay. Cine is 100% Polish. [ __ ] >> I feel like you got like Mexican in here. >> Mexican. >> I was saying like what? >> Oh, you are you found a picture? >> No. >> You still finding this picture? >> Yeah, dude. >> I got little pictures. >> Have you Have you showered >> uh this morning? Yeah. >> I'm not getting >> bus call was 10 minutes ago. No. >> What? >> Brothers and sisters, >> why do you look so much like a [ __ ] like Marvel character, bro? Chad, let me put the [ __ ] camera on his ass. >> You got enough. You know how I'm on manual focus. >> No, I know how to [ __ ] work a camera. >> You know how I work a Sony FX6 with the 16 to 35. Somebody sounds like slips. like a [ __ ] Marvel. Like, hello guys. I'm going to save the universe. Where is >> You know, I've been meaning to do some push-ups if you want. >> Okay. My My arms hurt. >> I don't know who the hell you look like. Like Andrew some Andrew Garfield or some [ __ ] >> Yeah, >> he look like some like like Superman or some [ __ ] >> I don't know what the [ __ ] you look like. You look like some Marvel character. [Music] Why you looking at me? >> Oh, Dad, you still ain't part of the picture. >> You keep doing double takes at me, bro. >> I'm looking around. braggers. I was in love with my Twitter. >> I'm out of here. >> And I'm out of here. >> What the hell? He's chewing on plastic. >> Oh, my phone. >> Okay. Huh? >> Back in the sixth grade. >> Back in this grade. I was excuse me. I'm sorry. that >> you good, bro. >> Nah, that's what rap going to sound like in the next 20 years. >> He said Luca African >> rap is not going to sound like in the next 20 years. >> I promise you that's how rap going to sound like. >> Already sound like that. >> Already sound like that. I was born. >> Okay. Are you happy that you was born in this generation or would you rather be born in like in a generation where we like want to be like way better technology? Like we're >> No, this generation >> this generation >> cuz if >> it's like in the middle in it. >> Yeah. But like if we had new bit of technology, you wouldn't be able to like, you know, do certain stuff. >> Imagine they invented a self throwing football. >> Hell no. >> You know, in 2000 they said we supposed to have flying cars. We have flying cars. >> We have flying cars. 2000. >> China has flying cars. >> Yeah. China has flying cars. >> In 2000 they said you got to correct them. I miss China, bro. >> I want to go to China. China. Was it fun? >> That [ __ ] was great. >> Was it China's [ __ ] go? >> Look who it is. >> Henry. What's up, Henry? >> You You missed our whole conversation about >> We're not going to bring it back up. >> Rudy, >> what's up? You're AfricanAmerican now. It is actually hot in this bus. >> Dad Rudy's African American, right? >> He's all right. Where were you born? >> In the UK. >> So he's British. >> British. >> African. British. British. >> British or just British, right? >> We're really British. But my >> I told you see if you were born >> My parents my parents obviously their background is African. So that's why I say I'm African cuz that's my my >> But he was born in. You don't think you you don't look just like Woody, but he just a bit more dark. >> No, we don't look like >> [ __ ] out of here. >> Like what? Wait, what's he trying to say? >> I'm not going to bring it up. >> You might as well bring me up. >> Back up, bro. >> Bring it up. >> Henry Henry looks like a [ __ ] African-American in this case. He does. >> We both do. >> Exactly. So your your argument, Dad, is just messed up. >> I want to hear your your Henry. >> He called himself an African-American. I say, \"No, you're an American.\" >> Yeah. >> Right. >> Okay. He He don't think we don't have no African bullet. >> He doesn't even know. >> I don't know. Right. So, we're an American. >> Where you get the black skin color from >> that? We come from the islands. >> That's still Africans came from the islands. >> I get what you're saying. The origin. >> You think you just black because of the sun? >> Huh? >> Yes. >> The origin is African. They >> But I don't go by that. We never went by that. >> I hear you. >> So, look, bro. How you think you black? I have no connection with Africa with my family. >> Let's just say >> like generations of generations and generations have just been born in America. America. America. America. So they forgotten >> the African side or wherever they came from. But their true roots are from Africa. Yeah. But like you're saying, you don't know nothing about that. >> So for you to call yourself African, >> you don't even know what part of you mean. I know I'm arrogant, bro. >> A long time in America. >> Yeah. Like >> since the 18. >> Yeah. Yeah. Yeah. Hey. Hey. That's why Americans say they're just American. Like you ask where they from, they say America. >> No, my dad rage ba into that. >> What? >> They rage bait him. >> What is that? >> I'm making him angry. >> No, I'm just It's logic. Slow. Yeah. But like if you ask me cuz I know where my my my parents are from. So do I. >> And that's why I say I'm Ghanaian. I'm African. You know what I'm saying? >> Like if you ask me where I'm from. I said I said Ghana. I'm African. >> Right. I can't even tell you if we were from Africa what part of Africa. I can't tell. >> That's probably taking a DNA test. I'm taking DNA test. >> Take a DNA test. >> I'm doing it. I'm taking a DNA test and I'm going to call you. I'm be like, \"See that I told you I was angry. >> See that? I see. See that? I see that. See that? I told you I was somewhere from in the West Africa. >> Well, it's going to say Native American Detroit. >> It's going to say Native American Detroit. >> I guess I'm Native American. >> Yes. Look at your cheekbones. That's not Africa, dude. >> Bro, bro, if my [ __ ] come out as native, >> I can't wait. >> Don't do the ancestry thing. No, I'm doing the one where they get your spit and you pee and you pay like $10,000. >> Indian take your hair out. >> Dad, didn't you say some of my friend was Indian or >> I said we got Indian your great granddad Indian. >> He don't look like he's African. >> Exactly. >> You guys look Arowak Indian. >> You might have some bite in you, some other stuff in you. Man, I got everything. I got every race in me. >> I'm the ultimate form. >> Huh? [Music] >> He said Indian [ __ ] >> What? >> Wait, what? >> Mike is waiting on me. >> Oh, yeah. >> He's waiting on me. I have everything inside of me. >> Native, Asian, Polish, Indonesian, >> Portuguinis, >> every All right. Cam 2. Cam to desktop mic. >> Can we do desktop mic? Cam 2, please. Thank you. >> Thank you. >> Aim, why is so quiet? >> Why is Aim so quiet? >> He just ate, bro. He just ate, bro. People don't talk. I am scared to talk. Um, Darren, I think you're from Africa. >> Darren, >> you're a [ __ ] alien. >> You're from Good Samaritan. >> Darren, >> you got everything in you. >> Darren, I think you're from Africa. >> You're from Good Sam. >> Ames loves to give us >> information. Echoing, what are you still doing, man? Blowing my nose, man. Come on, bro. >> Waffling. All right. >> All right, fellas. >> All right, fellas. >> Trevor L donated five Canadian super chat. The whites are staying out of the discussion log on the flip wherever the next location might be. Well, >> how does it feel to be back on the bus, bud? >> It feels great. It's like I never left, dude. Still smells the same, you know. >> Everything is nice. >> Nice. Put this on your spot. >> Like wherever they are. No, you put it on. Give me a finger. >> Samuel donated two Australian dollars through super chat. Speed. You are 50% Ohio, 50% fried chicken. >> I got to go to a dermatologist. It's just >> speed rapes me donated $1.99. >> Can you have Henry and Rudiger both? >> Cuz Rudy thought I couldn't eat him. >> Oh man, you always going on dares. >> I just didn't think you could eat it. He told me he could. East Santa donated Canadian through super warehouse segment. Also, Luka and Anthony are way better behind the >> D. What are you doing compared to man? >> Mm444 donated two Australian dollars through super chat. >> Don't chew plastic. It's full of toxic chemicals. Warning, warning, warning. Double speed. >> Yeah, >> you got a new challenge. >> Demba 76 donated $1.99 through super chat. >> Speed, you are a foundational black American. >> Wow, nice. >> What did you get? >> Waka Portugal donated 99 through super chat. >> Your forehead is Russian. Yeah, there's no reason. >> Foxica 567 donated $2 through super chat. I saw you at >> Tempe. Crazy crowd. Good morning. >> Hey to Africa. Jamaicans primarily trace their roots to West Africa. >> Lizuki donated $1. I think speed is right on this one. I can't lie. But you guys have a point, I guess. >> Yeah, >> they be on your side. >> Roma roomas donated €249 through super chat. Come to Roderdam, Netherlands. Bro, >> Netherlands. >> Herbert Green donated $1.99 through Super Chat. >> Rudy is German. >> Damn, Rudy's German. He said he's German. Rudy, >> what's that? >> He said you're German. >> Why? >> I don't know. Staunch Australia donated seven Australian dollar.99 through super chat. Ames is a s full of estrogen. Ames is a s full of estrogen. Ames is a s full of estrogen. Ames is a s full of estrogen. Ames is a s. >> Paul bright donated 79 through super chat. >> Different triant are the biggest. Mangtop donated $1.99 through super chat. Throw your dad to Africa, please. Thank you. >> Yeah, I'm going to take him to Africa so he can realize where he came from. >> All right. >> Gate XYZ official donated $1.99 through super chat. Your foundational black American icon like MJ, >> like Michael Jackson >> cuz they ain't no >> How is it good? >> Pretty good. East Santa donated $6 Canadian.99 through super chat >> W collab with DB that warehouse was sick AFW segment >> brother Deon Booker had a [ __ ] way better behind the camera and with compared to Lil >> Deon Booker is living um living 2K IR >> donated five Bosnia and Herziggoina convertible marks through super chat can you explain why you didn't go meet again but you went to random car when stream was mid as [ __ ] >> Getting to his house. >> You don't know what happened, bro. So, >> don't >> Manu donated €249 through super chat. >> When is Jamal's car? Stop chewing plastic. >> I literally just took it out. >> I just do the same thing, man. >> Messiah El Messi. Super. >> Yeah, me too. I think you were right about being a descendant from Africa. >> I'm doing a DNA test. >> Rome donated $1.99 through super chat. >> Amber White made a love song for you. >> I mean, Amber RP. >> Should I go to RP right now? >> Donated $1.99. Play some Bad Bunny, bro. >> Bad Bunny. Oh yeah. [Music] >> Get an RP. >> Let's hear Henry's take on this. >> I make an RP. He's scared to look. He's scared to stuck. He's stuck. His cam is blurry. >> Which camera? >> The dash cam or this cam. >> Go ahead, brother. >> Super chat. >> Daddy speed. You prefer Pamela or Carmen Electra? Who? Pam or Pam. >> I'll take Pam. >> Pam Anderson Magic donated $1.99 through >> RP again. >> I'll take Pam. >> I literally just played RP last night. Is she still about? >> I don't know where she's >> She was on Baywatch back in the day. >> Well, it's 4 a.m. Eastern time. This pops like Michigan or MSU. Go Cleveland. >> Seuss donated $1.99 through super chat. Speed is a quarter Mexican. >> You mess with him. >> Maybe donated $1.99 through super chat. What states do you have left? >> Which one next? >> I know we got Indian. >> We're on the road. >> What? Native Indian or what? Indonesia. >> Yeah. >> Donated $1.99 through super chat. >> Speed. Don Wonder donated $5 through super chat. Glad daddy speeds back. I am 39 and watch every day. He reents for his O.Gs. I am going to miss the stream when it ends. >> Was that a lady or a guy? >> A guy. >> Demba 76 donated $1.99 through super chat. Speed your true roots as of the tribe of Judah. >> Judah. Speed want to know where you from. >> Nookie bear donated through super chat. Humans all came from Africa speed crazy. >> Tell me we're descendants of like Moses and stuff. >> Yeah. >> YBD donated $1.99 through super chat. LA waiting for you homie. Dad speedw >> Clippers donated1.99 through super chat speed. Is it pink? >> Dude, >> the [ __ ] are y'all asking me, bro? like that associated [Music] $2. >> Your dad got some freaky stuff on his phone. >> What? Y'all tripping. Who don't know? >> 20,000 Indonesian got wild. >> I was fooling, man. >> I said, \"Hold on, let me get my Ray-B band. Why did someone steal my case?\" >> Mayo donated $4.99. >> I put the glasses on. It was at the table with my grandfather and my uncle >> and someone came and took it. They thought the glasses was in there. >> Oh [ __ ] >> I know. They feel stupid. >> At least you got your glasses, bro. >> Right. >> Mean to charge it, right? But it made me think wasn't one of my family. >> I was around my whole family yesterday. >> Your knees are >> I hope it wasn't my family. >> Heartbreak. Do you think someone picked up everything $1.99 through chat? >> It's your son from Seattle. Check Discord clips. Dad, >> everyone's video man donated£1.99 super www. I'm readw www. >> Cincinnati play tomorrow, man. >> Bengals. >> Yeah. >> Where they play? >> Random donated $2 through chat. >> Africanameals African descent. Google. >> No, they don't have Pittsburgh yet. >> What team are they? Come on. Chiefs >> EBGL donated $2 through super chat >> speed go to Puerto Rico. It's part of the USA the Ravens. >> They kick their butt. >> Ravens trash. We beat the crap out Australian through super chat. >> He shook. Ain't no such thing as halfway. >> He's scared to death. He's scared to look. He's shook. Dom CTBG donated $5 through super chat. Speed move to the Bay Area. Great weather, amazing food, tech, entrepreneurship, Silicon Valley, three airports, and vibes. >> Really? >> Bashar Magic donated $1.99 through super chat. >> The taco man from Detroit missed you. Tough taco. >> Oh, did I tell you that the taco man catered our um our money like football? >> That ass? >> Yeah. >> Canadian through super chat. >> Call Betty back. >> Call Betty back for the crew. Call Betty back. That's right. It's only water. >> Ella donated£1.99 through super chat >> speed. Will you open FIFA packs? >> Yes. >> Yeah. The first type of cool. >> Yeah. I asked I asked I wanted I said I wanted to make an order. He was like, \"No, no, no. I bring it all by no chance.\" I said, \"I'm done competition.\" Ove donated. >> I was here first. >> My father just died. >> Taylor donated $2 through super chat. Hi Rudy. Big fan man. Love y >> Rudy Baker. What's up? DJ Tessy donated $5 through super chat. Speed tell us what your dream warehouse setup would have in it. >> Yeah. >> And then he went to >> what happened through >> the bed. Oh, >> Chad. Francis Monroe Studio donated $1 through super chat. >> Dan than donated $10 through super chat. You guys should go on Finding Your Roots with Henry Gates on PBS. >> You might be surprised. Are you going to Knox Scary Farm when you go to Los Angeles? with um Oh [ __ ] the lab mic is right here. [ __ ] >> donated $4.99 to super you from your father's testies which makes him right in the argument. >> Yeah, you scared to death. >> The Frank Knight rises donated $2 through chat. He put you on his betrayal on a deleted tweet. Alberto SSSJ Lean Avenue donated $1.99 through super chat. Speed from the bay. Omar Rodriguez donated $1.99 through super chat. >> Open the bags they gave you today at the mall bro. >> Bashar Magic donated $4.99 through super chat. the taco mascot from Detroit. >> Really donated three Singapore chat. >> Oh, that's fake. >> I'm good, man. How you doing? >> Ask Adrian donated $1.99 through super chat. >> Are you going to Ethiopia during Africa tour? >> Yes. I got to go to Ethiopia, bro. >> Donated $1.99 through super chat. Thank you for traveling to Phoenix. Wish I met you. >> Thank you, brother. We on dirt. >> Etheral Gardens donated $1.99 through super chat. >> First Rudy and Street Fighter >> hell yeah. >> Yeah, I was looking on the area. I'm like, where the [ __ ] is the airport? >> Ben Chavez donated $1.99 through Super >> Chat. Tomorrow. All right. All right. [Music] >> Good night, bro. Francis Monroe Studio donated $2 through Super Chat question. Do you like music band Gorillas? >> Gorillas. They was pretty cool. They had a video on >> donated $1.99 through super chat. That was my last $1.99. Now I'm broke. >> Why would you make a donation? East Santa donated $6 Canadian.99 through super chat. Best streamer also Luca and Anthony killing it behind the cam. Not Lil D though respectfully. >> You know I was watching man >> Cecilia donated $1.99 through apologize. >> You kept looping and looping. You had a whole bunch of noise on there. You was like, \"Ah.\" And they looked at you were like, \"Fuck.\" And it had all the noise going and it was You was going crazy. It was a while ago. I think he was trying to go to sleep or something. I think he was doing a sleep stream. Was this tour? No, it was it was back when he was back at home. Every time you make a noise, the video will will make a loop of that sound and then it'll make a loop of another sound you was making. $1.99 super chat. >> Did you go to any malls and ask? >> Wooie Boogie donated $1.99 through super chat. >> Rudy the security is handsome. Is he single? Alber donated1.99 through super chat. >> Y'all is grown. You need to tidy up that bus. through super chat speed is part Chinese. That's why he has yellow people. >> So chat, I got a question. So like when you like 2% Chinese, >> what does that mean? >> Australian through super chat. Is Sydney named after Sydney, Australia? >> Like chat, if I was 2% Chinese, like do that mean somebody like like like somebody in my family is Chinese? E T H I N G T O G I V E5 donated two pounds through super chat. Are we going to do a stream with your ex one day? >> Yes. >> Donated $1.99 through super chat. It's your son from Seattle. Check. >> Right. Okay. Got it. Got it. Got it. You know, >> tired oak YouTube donated 45 through chat speed. You came from your >> dad the war today. I can see >> and field guy donated $4.99 through super chat. Humans began in Africa. American is nationality. Africanameans trace roots to Ghana, West Africa. DNA region, not exact tribes, countries. >> No. >> El Valentina donated $2 through super chat speed. Come back to Tucson. D Blackman donated $4.99 through super chat. When are you going to react to clips in Discord? >> Jango donated through super chat. >> My ancestry is the best place to do that. Oh. >> Oh, Ted. I'm about to go to sleep, man. It's 400 a.m. right now. >> Jamie J donated $5 through super chat. Sorry about the jumping on a rock joke earlier. Finished strong with Deon Booker. >> Michael Gomez donated $1.99 through super chat. Speed is Colombiano Garia. I got to understand there's going to be nobody in the RP server. It's too late right now. It is 1 40 It's 4:00 a.m. >> 650. >> Nobody's in that server. >> I know what y'all want, but it's too late. I promise y'all. >> It's 4:00 a.m. My [ __ ] Yo, wallet, put the map and time back on. What are you doing? >> Speed come to San Diego to eat Somali food. I don't think I understand. Valon with another five. Get this subs. >> Wa. Put the map back on. >> Axelins donated $3. Speed stop avoiding Aiden Ross. Not cool man. Aiden's community misses you. >> Ain't nobody avoid nobody, man. Abu the bandit donated $4.99 through super chat speed. Read my red letter. >> I I got your red letter and I'm going to read it at the end of the tour. >> Dawi Mangav donated $4.99 through super chat. Bring your dad to Africa and happy holidays from Ethiopian. Thanks. Greg donated $5 through super chat. Daddy Speed, which core of bowling balls do you prefer to bowl for league play? >> My dad just left. >> Asymmetrical or hybrid? Also, which brand? >> My dad just left. >> New Genetics donated $2 through Super Chat. Go to a museum and look up the moors. >> Donated $2 through super chat. Go to a museum and look up the moors. >> Good night. I love y'all boys so much. Two more days left. Fix >> Gus Buzz donated $1.99 through super chat. Pull up. Really? Caleb, >> check. Y'all see me? >> Not yet. >> All right. Good night, Harry. >> Love and gel donated $1.99 through super chat. Yo, Papa Speed, I'll see y'all in LA tomorrow. Smile with horn. >> I love y'all. I love y'all. [Music] >> Andre, good night, baby. 99 through super chat. Yo, Speed, I mean this respectfully. When are you going to crack Sydney? >> She is gorgeous. >> Thank you for another five gifted. >> I love you, >> Bashar. Maddie, $4.99. >> Tough taco mascot from W speed. >> Why is it zero miles per hour? Coco. Coco, what are you doing? Wow. Paul Bright donated£1.99 through super chat. >> Wow. >> Rudage, use your hands like a true African. >> Wlet, why is it zero miles per hour? >> Unclick crack donated $2 through super chat. >> There we go. Www e Salto donated $1.99 through super chat. What does Henry and Rudy do when they whit you speed? Lock25 donated $1.99 through super chat. Signed baseballs being sold on eBay for $5,000. Waka Portugal ko donated£1.99 through super chat. Henry Rudy, where you guys from? I grew up in Watford. Majesty Nate donated $1.99 through super chat. Remember to suit up Henry and Rudy on the last day. Lee Bunny donated $5 through super chat. Speed, why are you the only one with your dogs out? Arf arf. who let the dogs outs argoso donated4.99 through super chat. According to chat GPT, I show speed as Africaname, which means his DNA would most likely trace back to regions of West and Central Africa. E Dixon donated $4.99 through super chat. Hey Speed, pull up to Orlando, Florida. We want you to come out to Halloween Horror Nights at Universal. Kahir donated $1.99 through Super Chat. Speed Dad, I am also a Lions fan. My fab player. A M O N. Lucy donated $5. It was amazing meeting all of you tonight and good night, Rudy. Use the number. [Music] Salito donated $1.99 through super chat. Have you ever been to Kentucky Speed? [Music] >> Shop Talks with Jay Goss donated $1.99 through super chat. I am your barber from Chicago. It'll travel to you. [Music] Francis Monroe Studio donated $2 through Super Chat. Question: Do like music band Gorillas. >> America First donated $4.99 through Super Chat. Majority TY of slangs in the hoods of the USA come from the Bay Area. Y'all feel me? on my mama, Hela, and Push and P just to name a few. [Music] Nico De Gea donated $1.99 through Super Chat in LA. Hit up Santa Monica Pier and Venice Beach. African Business News donated 70 South African rants through super chat. Isho Speed's dad is so ignorant. He said his parents are from Jamaica and that they are not African. But Jamaicans, like about 90% of the Caribbean population, are of African descent. Abd Arb donated $2 through super chat. Shout to Palestini Speed. Tyson Fernandez donated $1.99 through super chat. Wsp speed. Gusbuzz donated $1.99 through super chat. Pull up to LA real Cali. [Music] Vince donated $9.99 through super chat. Come to Posolaria Mexican food. It's in Phoenix. Come for breakfast. It's my parents spot. [Music] x12_zander donated two Australian dollars through super chat. You're the goat speed 2025 streamer of the year. Goank donated $4.99 through super chat. Daddy Speed, how does it feel to have your son compared to Michael Jackson? Seuss donated $1.99 through super chat. I know that highway. OMG, I drove on it. [Music] East Santa donated six Canadian 99 through super chat. Wream legend. Also, Luca and Anthony been killing it behind the camera. Lil D, not so much. NGL, thanks for the streams, GOAT. [Music] Liam Connell donated $2 Australian.99 through super chat. How is your dog going? Kim Jong W donated 5 Canadian dollars through super chat. Long live Speedy. Ever think of buying the Breaking Bad house? It is listed. Also look up Von Helden Mayor Mcheese. Life Ghost Mati donated 35 South African rans through super chat. I have been rejected three times. [Music] Rei donated 20,000 Indonesian rupeas through super chat. Please play a message to you Rudy song for Rutiger. DJ Steey Donated $1.99 through super chat. You've come a long way as a person speed W pops. [Music] Jimmy Butler donated $2 through super chat. Hey Speed, guess what? Giniga Pratt donated $1.99 through super chat. Speed call Bart from the truck stop. Japan 1994 donated $20 through super chat. Y'all are going to pass by my crib in a bit. Appreciate y'all popping out to AS. I am headed to France TMRO. Enjoy the tour, bro. Night everyone. [Music] A one amazing donated $2 through super chat. W for speed bodyguards. Keep up the hard work. YBD donated $1.99 through super chat. Ram's house. [Music] Uncle T35 donated $5 through super chat. Africans are 1 millions years old. Europeans are 3,000 years old. [Music] Osiris 650 donated $1 through super chat. Jose Shindano donated two Australian 99 through super chat. I show speed Melbourne Storm or Brisbane Broncos. Native XD donated $6 Canadian.99 through super chat. I think I know what the cameraman sits when in the car he sits on Henry's lap. I think New Genetics donated $2 through Super Chat. Speed look up the more Victor Lipson donated seven Australian 99 through super chat. Speed, can you say, \"Hey, Joseph from Australia. My son's a big fan of yours.\" Big love from Australia. [Music] The Zmax Show donated $1.99 through super chat. I show I show meat. I show meat. I show me. L Gru James donated 200 Kenyon shillings through super chat. Speed come to Kenya. We fastest man in Africa. FB Technics donated two Australian dollars through super chat. Senior looking like proof the rapper Polico donated three New Zealand 49 through super chat. I love speed in Georgia. Aston Jorge Charles donated $4.99 through super chat. Speed, are you coming to LA? Please sign my pictures. Don't do me like party. LA loves you. We man donated£1.99 through super chat. Come back to Scotland and come to Glasgow. Clipper boy donated 20 Norwegian croner through super chat. Come to Norway again. Times with Ben donated $4.99 through super chat. Speed, will you help me get my teeth fixed in Mexico? I'm going through hard times and I'm in so much pain. It's $1,000. My cash is times with Ben. Type [ __ ] donated $1.99 through super chat. Yo, speed you and your dad for real carried YouTube. Omar Rodriguez donated $4.99 through super chat. Speed open the bags the guy gave you. [Music] Mailman P donated $4.99 through Super Chat. Listen to Mailman P. I'm a rapper now on all platforms. Young Flock donated $1.99 through Super Chat. You about to be going by the Hila River Reservation. Jorge Charles donated $4.99 through super chat. Speed can't wait for you. Please sign my picture. Don't do me like liked. Cardi Arpit Shukla donated 100 rupees through super chat. Speed pls help me. I need laptop to study. Alma Toms donated£1 through super chat. So, donated $2 through super chat. Raw. RB. Pause. [Music] Carlos Ortega donated $1.99 through super chat. Come to Sacramento. Yo, Mikey Doo donated $1.99 through super chat. R donated $5 through super chat. called out of work just to watch your stream all night speed. [Music] >> Yo, Mikey Doo donated $1.99 through super chat. Wsp speed from Phoenix. Good night, everyone. [Music] Mailman P donated $4.99 through super chat. Ralphie the plug and stink team going to pull up on you in LA. Give them to promo they deserve. Stink team runs LA. [Music] Tank donated $249 through super chat. Tank donated $249 through super chat. Speed come to Iceland. [Music] A Royo Jr. donated $4.99 through super chat. Speed, thank you for visiting Arizona. Hope we going to see you again here. Safe travels for you and your family. Uncle T35 donated $2 through super chat. Flat Earth people wait then for RV to fall off Earth. [Music] Leonardo Santos donated 35,000 Indonesian rupees through super chat. Speed come to Timor Lee. [ __ ] guinea pig G donated two Australian dollars through super chat. Wake up, [ __ ] Wake up, [ __ ] Wake up, [ __ ] Wake up, [ __ ] Wake you. [Music] [Music] Dylan Zenner donated $4.99 through super chat. Yo, Speed, are you going to Louisville, Kentucky? If so, then can you come meet up with me in my area around the city in Hillview, Kentucky? Thank you, bro. Thank you. Dylan Zer donated $1.99 through super chat. Wsp speed. Two to three more days left to go. GN rest up, bro. Valeri Vasalev donated two Bulgarian levs through super chat. Kawaii was here and he is a good boy. [Music] Senna 109 donated €1 through super chat. Valeri Vasilev donated two Bulgarian levs through super chat. I'm telling you guys, Kawaii has a big gill. Happy birthday. handc crushed donated $1.99 through super chat. Bangladesh are annoying subhumans. Oh yeah. Donated 100 rupees through super chat. [Music] Hi. Ah yeah donated 100 rupees through super chat. Speed loves messy. Speed loves messy so much that he kisses messy photo every night before sleeping and keep messy photo always near heart. [Music] Lenny Sanguino Lopez donated $4.99 through super chat. Are you coming to LA? [Music] Speed rapes me donated $1.99 through super chat. Hey [ __ ] I know you're awake. Monkey dart eighth count. [Music] Dylan Zer donated $1.99 through super chat. What late night stoner weed sessions be like? L MFAO. [Music] Oh yeah. donated 100 rupees through super chat. Congrats bro, you soon getting 10 billion subs. Congrats, bro. You soon getting 10 billion subs. [Music] InfoVR donated $4.99 through super chat. Speed drop me a band right now or you going to find out what's waiting for you on the highway. [Music] InfoVR donated $4.99 through super chat. Speedwake TF up right now, bro. Stop sleeping ape. [Music] Oh yeah. Donated 100 rupees through super chat. Congrats bro. You soon getting 10 subs. Congrats bro. You soon getting one. Oh, [Music] wow. Hello. Hello. Heat. Heat. [Music] Oh yeah. Donated 100 rupees through super chat. Ah oucha oucha. Do it fast. Go. Ah. Go deeper. A ouch. Yeah baby. Go deeper. Ah yeah baby. Go deeper. [Music] NBCAP Fireside donated $5 through super chat. What up? I show speed chat from Massachusetts. [Music] NBCAP Fireside donated $5 through super chat. I can't sleep for the life of me. Who is on team insomnia? [Music] Motomadness Media donated $5 through super chat. PLZ flew my TT Moto Madness media chat. [Music] Oh yeah. Donated 100 rupees through super chat. Bro loves messy. Bro loves messy. Messy kisses speed. Messy kisses speed. Bro loves messy. Bro kisses messy bro kisses messy. [Music] Moto Madness Media donated $3. Wake up PP PPS ped. [Music] [Music] Oh yeah. Donated 100 rupees through super chat. Messy kisses. Speed messy kisses. Speed kisses. Messy kisses. Speed kisses. Messy kisses. Speed kisses. Messy kisses. Speed kisses. Messy kisses. Speed kisses. Oh yeah. Donated 100 rupees through super chat. Bro, your meat touching balance. Bro, your meat touching balloons. Bro, your meat touching balloons. Bro, your meat touching balloons. Bro, your meat is sweet. [Music] Roblox King09 donated $1.99 through super chat. GooGy down to the socks like I am Biggie Papa baby. YBD donated $1.99 through super chat. Isabella, go to sleep. Oh, forgot you meeting speed. [Music] YBD donated $1.99 through super chat. Go Dodgers. Go Rams 4 niners lane. [Music] YBDE donated $1.99 through super chat. I know you awake. Welcome to Cali Roads. [Music] Ah yeah. Donated 200 rupees through super chat. Bro, you are in heart of whole world. It means if anyone loves you for you are a good heart person. Love you. height height height height height height height height height height height height height height height height height height height height height height height height height height height height height height height height height height he hight height YBD donated $1.99 through super chat speed. Welcome back to Cali Wike. [Music] YBD donated $1.99 through super chat. What's up, Mike? Good driver, homie. Hit 140 mph. X X X X X X X X X X X X X X X X X X X X X X X X X X X X X X X XXX donated 200 rupees through super chat. Wsp speed W Henry W. Rudy W Jamal W Senior Watkins W Slip W Cameraman W Sydney W Drivers W Speed Equals B equals C. If we love you bro and you love Henry and Rudy by that formula. We loves Henry and Rudy love you speed. [Music] Roro donated $1.99 through super chat. you speed. It's the guy whose was boxing double spoon. PPP Roro donated $1.99 through super chat. What's up, chat? Yellow King YK donated €2 through super chat. Why is the monkey sleeping? Roro donated $1.99 through super chat. Get up PPP loip. [Music] Roro donated $1.99 through super chat. Sleep if you like tortoise. [Music] Roro donated $1.99 through super chat. [Music] Roro donated $1.99 through super chat. Shout I have raced speed. He going to have two. [Music] Lily donated5 Australian dollars through super chat. The fog is coming. The fog is coming. The fog is coming. The fog is coming. The fog is coming. The fog is coming. The fog is coming. The fog is coming. [Music] Roro donated $4.99 through super chat. 6,767. [Music] Roro donated $4.99 through super chat. 67 [Music] [Music] Roro donated $1.99 through super chat. I need my get back with kampoo pom pu. [Music] [Music] Lenny Sanguino Lopez donated $1.99 through super chat. Are you coming to LA? [Music] Rich Manion donated $1 through super chat. Lenny Sanguino donated $2 through super chat. Shup pa ma Lenny Sanguino donated $1 through super chat. [Music] Lenny Sanguino donated $1 through super chat. # Brady 2.0 donated £1.99 through super chat. Wake up, you lazy boy. Lenny Sanguino donated $1 through super chat. Lenny Sanguino donated $2 through super chat. Speed go to an underground LA rave like lick and dip. [Music] Lenny Sanguino donated $2 through super chat. Speed hit me up for party favors. Lenny Sanguino donated $2 through super chat speed. Let's get feral at Allah rate. [Music] Lenny Sanguino donated $2 through super chat. speed does sugar booger. [Music] Lenny Sanguino donated $2 through super chat. If you need electric plug in LA, hit me up. Lenny Sanguino donated $2 through super chat. Who needs a plug in LA? [Music] Lenny Sanguino donated $2 through super chat. Let's go raving speed. [Music] Lenny Sanguino donated $2 through super chat. Hit me up for rave favors in the hashtag club. Finger ping ping. Dink. Lenny Sanguino donated $2 through super chat. Lenny Sanguino 37 is my app. [Music] NDG donated $3. Issue speed 666 donated $1.99 through super chat. What's up mamombo Rambo? Wear that bit. Wear dad ammo. [Music] I need you. [Music] [Music] [Music] NDA live donated 100 rupees through super chat. I'm struggling with a 12 rupees L loan. Please support me if possible. Folded hands bank. Bank of Berota A C ending 20 trill88 bill100,56,944 IFSC B A R B 0 R A J B A R I swear my mother [Music] Cardestry donated $5 through super chat. Chat, would you rather be skinned alive or experience heartbreak on loop for the rest of your life? Cardestry donated $4.99 through super chat. Chat what comes twice in a week, once in a year, but never in a month. Lenny Sanguino donated $2 through Super Chat. HMU if you need a plug at Lenny Sanguin 037 in LA. [Music] Luis C donated $1.99 through super chat. Let me know if you need some back shot speed. Come on. Come on. [Music] CJ donated $5 through super chat. Ah [ __ ] Here we go again. Hello. Hello. Creamy a camel donated $1.99 through super chat. Bus driver drunk driving. I Anyway, Thank you. [Music] Alan Sandival donated $4.99 through super chat. Highspeed, welcome to the entertainment capital of the world, Los Angeles. Enjoy our nice curvy roads, delicious food, and nice weather. Good morning, chat. Oh yeah. [Music] [Music] Luis C donated $1.99 through super chat. It's a pretty morning to give my girl back shot. I got my Luis C donated $1.99 through super chat. Wake up, Speed. My grandma is excited to see you TV. Luis C donated $1.99 through super chat. Speed, you need to come to Pomona FR. Loudly crying. Loudly crying. Ha. Rookie Basha donated $2 through super chat. chat say. Luis C donated $1.99 through super chat. I am pretty sure Speed is going San Diego. Heat. Heat. [Music] Willie Montes donated $1.99 through super chat. Speed come to boil height. [Music] Berserk donated $4.99 through super chat. Don't sleep on your stomach. Diddy is going to get you. [Music] [Music] [Music] Jackie Chan donated $2,000 Hong Kong dollars and donated six Malaysian ringit through super chat. Hello speed [ __ ] [ __ ] [ __ ] I'm at Hong Kong. One donated $1.99 through super chat. He's still over an hour away from LA. Y'all slow. Eli C. Pistol Pete donated $1.99 through super chat. I hope you and Dro have a safe, blessed day. All right. Eli C. Pistol Pete donated $1.99 through super chat. Jesus loves you by the way and God bless you all. We have donated 10 United Arab Emirates dearhams through super chat. Don't check my channel. One donated $4.99 through super chat. Y'all gone be in traffic for 2 hours loudly crying. This freeway is always like this. [Music] Nikico R donated $9.99 through super chat. Welcome to Cali, where you suddenly learn you should have taken the express lanes tears of joy. Hello. Hello. I show slow donated $1.99 through super chat. Speed I'm dying. Help. Call 911. I show slow donated $1.99 through super chat. Hey Siri, call 911. Green Owl donated $4.99 through super chat. speed. Are you doing Hawaii and or Alaska? Sus x Crona donated 100 rupees through super chat. Still remember when speed used my track invisible smiling face with hearts. Gil donated $1.99 through super chat. Hey Siri, play music max volume. and stick. [Music] That boy if donated $1 through super chat. Taimma donated $5 through super chat. Chat, if you're in LA, you better show up and show out. Let's end this with a bang. [Music] We have donated 10 United Arab Emirates dearhams through super chat. 911, what is your emergency? [Music] West Coast NN donated $4.99 through super chat speed. Welcome back to LA hit marathon burger and slap some nipy hustle while you ride around the city. Vincent stood I show slow donated $1.99 through super chat. [Music] H rookie Basha donated $2 through super chat. [Music] Deshawn Benali donated $4.99 through super chat. Desawn is a diva and you all know it. Eli C. Pistol Pete donated $1.99 through super chat. Hey TTS, can I get a hi? Yeah. [Music] I show slow donated $19. 99 cents through super chat. See [Music] Cortez. says, \"Crej fpfsekin stacks.\" Prader donated $1.99 through super chat. Speed should have came to San Diego. Nick donated €2 through super chat. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Magnifying glass. Raul Andrade donated $1.99 through super chat. Welcome to Los Angeles. Eli C. Pistol Pete donated $1.99 through Super Chat. He's not in LA. He's in Orange County. Raul Andrade donated $1.99 through super chat. So, is he going to San Diego first? Niko R donated $9.99 through super chat. They made it into the express lanes tears of joy. Welcome to SoCal Speedway. Better than the bay. [Music] Vanderon donated $4.99 through super chat. Highspeed, I live in Phoenix and I hope you have a great time here. Have fun to the next trip. Dark Cloud donated $2 through Super Chat. Wake up, Speed. We're in Yusede. And go Warriors. Y69T donated $1.99 through super chat. If you in LA go outside today, YN, turn up for speed. Nikico R donated $9.99 through super chat. If he was going to San Diego, they would have hopped on the 15 South, most likely LA, but would be cool to see them hit OC real quick. Zanthipe donated $1.99 through super chat. He's on the 91 my commute to work shoutout. I Cecilia donated $1.99 through super chat. Slips is so handsome and amazing. I love him. SMM Blackheart. Nikico R donated $9.99 through super chat. Imagine speed hitting the Baloa Peninsula skull. Tony donated $3. What's the deal? If speed does not meet up with Kai, then there is some serious beef. What's the deal? [Music] Depth donated $1.99 through super chat. Speed sleeps. Wsp speed mending heart. Stuckco superstars donated $2 through super chat. Speed baby. Wake up Poppy Chulo. Bradley donated $1. What soccer football team do you support? Anthony donated $5 through super chat. [Music] Love you. speed. >> Luis XDXD264 donated $1.99 through super chat. Speed breathing wsp speed hard adhesive bandage battery. Scartox Numero Wo donated €2 through super chat. WWwww. www. Jackie Chan donated 2,000 Hong Kong dollars and donated six Malaysian ringit through super chat. Wake up, [ __ ] I'm Jackie Chan. Dark Cloud donated $2 through Super Chat. www. John Cena for following speeds bus. Willie Calderon official donated $1.99 through super chat. Disney is Illuminati. Beware. Also OC is not LA. Scartox numero uno donated €2 through super chat. Increase his aura. www. Dennis Gonhildred donated 25 Norwegian croner through Super chat. Nika nika na na na na na na na con. [Music] The Frostman donated $2 through super chat. Speed, are you going to stop by the Freemasonique Lodge? Dennis Dav Goonhildred donated 25 Norwegian croner through super chat. Come to Bulgaria. [Music] CJ Ables donated $1.99 through super chat. You in Dahood. Mr. Beast donated $1. Big black monkey boy. N Dennis Gonhildred donated 25 Norwegian croner. through super chat. Den poop sugar. Danny Sulkick donated $1.99 through super chat. He's not going to San Diego chat. He already said it. Dennis Dav Goonhildred donated 25 Norwegian croner through super chat. M mm mach. Jackie Chan donated $2,000 Hong Kong dollars and donated six Malaysian ringit through super chat. Hello. Come and visit me. www. Khali and Kyle 5 donated five United Arab Emirates dearums through super chat. Hookie Basha donated $10 through super chat. No crib for a bed. The little Lord Speed laid down his sweet head. The stars in the bright sky looked down where he lay. The little lord speed asleep on the hay. Henry donated $1 speed. I need help wiping in the toilet. Help me. Loudly crying. Loudly crying. Loudly crying. Loudly crying. M T d d d d d d d d d d d d d d d d d d d d donated $1.99 through super chat. Speed. Tell these Edgars to go to school. [Music] Alexis Landanda donated $1.99 through super chat. www. [Music] [Music] [Music] [Music] [Music] [Music] Scoffield donated $2 through super chat. I show sleep. It's 9:00 a.m. Asking for pancakes at 100 p.m. M T d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d donated $1.99 through super chat speed. Get them tortoise out of here. [Music] Jackie Chan donated 2,000 Hong Kong dollars and donated six Malaysian ringit through super chat. Stop staring at us or I'll send y'all to Hong Kong. [Music] CJ Ables donated $4.99 through super chat. Y'all better be eating breakfast at Rosco's Chicken and Waffles. Aden Ross donated $11. One cent. Sante. Sante. Mingir lu. Miskin. Wake up. You naya na na sab sahaba [Music] baba baba baba. Verplex donated $2 through super chat. Should I skip work for Disney? [Music] I need you. [Music] Ha. Rookie Basha donated $5 through Super Chat. Chad, I'm flying into LA from London just to be with Speed today. I quit my job, sold my house, put my dogs for adoption to make this trip. Excited. Cindy Fern donated $2 through Super Chat. Speed try Porto's Bakery. Get the potato balls. [Music] [Music] Maestro Burger donated €2 through super chat. Time to wake the f up. Thank you. Maestro Burger donated €2 through super chat. Good morning. Rise and shine. Wake up. Simply [Music] Yasu donated €2 through super chat. Riddle. What can you catch but not throw? Lose weight faster. Donated $1.99 through super chat. Let's go, Haiti. Crippy donated $1. Yeah. Speed in Cali. I'm turned to the max. Pull up on the scene. Whole crowd gone. React. Need a session with Snoop. Roll the green real fast. Hit a backflip. Bark twice then dash. Sunshine. Ha. Rookie Basha donated $5 through super chat. Away in a bus, no crib for a bed. The little Lord Speed laid down his sweet head. Eager fans look where he lay the little Lord Speed asleep on the hay. Bubba donated $1. Yo, Speed, what's good? Why don't you wake up and let me see that morning wood? here. >> Yes, sir. Cars are here. I think so. I think that should be the game plan. 10. It should should have been nine, but 10 is good. He's >> Yeah, he's he's in he's in the lobby. Yeah. >> Who's that? >> He's in the lobby. >> Tyler. >> Yeah, but he go to Oh, really? >> Yeah. Because the security they won't be here.",
    "start_time": 2.96,
    "end_time": 42899.64
}