{
    "video_id": "u-YhMqGfAXg",
    "channel_url": "@ishowspeed",
    "transcript": "[Applause] That was so fun. [Music] Crazy. [Music] [Music] [Music] [Music] Oh my god. [Music] Ah, you [ __ ] Ah, you [ __ ] [ __ ] doing football at me. [ __ ] you. Da baby [Music] right here. [Music] Oh my god. Here goes wild ass. niggaes catch that I can't pass the shooters I don't need my bro they behind the [ __ ] you [ __ ] sitting in the driveway pull Hell no, [ __ ] >> What the [ __ ] [ __ ] 67 six. That's that built up anger in them cameraman, [ __ ] Bro, >> the cameraman's got too much built-in anger. K too mad right now. The >> cameraman's way too mad. >> Both of them [ __ ] are human, bro. >> Oh [ __ ] >> Oh my god. >> Oh my god, bro. >> I think it's my turn now. >> No. >> You want to go again? >> No. I'm about to You need some water, my [ __ ] I need some water, [ __ ] >> [ __ ] all that. >> I think it's my turn now. >> [ __ ] beating and put belts and hats and [ __ ] >> I think it's my turn. Go ahead. Go ahead and get you some. >> The [ __ ] did you say? >> What did he say? >> It was It was a joke. >> Don't be saying that [ __ ] >> What did he say? >> What' you say? >> Damn. Why you switching up? >> No. >> It's scary. >> It's scary ass. cuz he scared as [ __ ] Jamal switching up. Oh [ __ ] bro. Bro, I'm I'm supposed to be getting on DJ RP right now. What the [ __ ] is going on right now? We should be close to the uh truck stop in a minute. chat, should I do? Yo, chat, should I show off? Do we got cars on? Uh >> oh. They're turning off the lights. What's about to happen, chat? Let's guess. What do y'all think is about to happen? Halo. [Music] [Music] Batman. [Music] Oh no. [Music] Oh [ __ ] Oh [ __ ] Oh [ __ ] [ __ ] Oh [ __ ] Oh [ __ ] Ain't [ __ ] >> Yeah. >> Three, my yes. Yes. Get him, Harry. [ __ ] you. >> Yeah, Harry. >> Yeah. That's the real Henry. That's the real Ariel. >> Let's go. >> Yeah. Oh [ __ ] >> Oh [ __ ] >> Yeah. >> That's the real >> Oh [ __ ] Somebody get somebody that somebody get somebody get that wheel up. Break his neck up his neck. Break his neck up his neck. Break his neck up. I never going to be scared of a man. I walk through this land like a run. This man never can you imagine the pain that I bring. If I said I'm a join in the streets of the same as the K in here while this man in the world and I have no fear. I'm the mean and the mean the nightmare dreams the rule of all evil. We real [Music] you up and knock your ass to the floor [ __ ] [Music] [Music] [Applause] everything and you thought work the one day I need to stay high on my feet to succeed. Can you feel that heat run to you? Can you feel it too? Want to lie to me? You will change the fact with your drugs. It will be just fine. Never see yourself just the way you are. Don't come and cry for me cuz you come too far. Want to lie to me. You will change the miss with your drugs. It will be just fine. See yourself just the way you are. Cry for me. [Music] [Music] [Music] [Music] Heat. Heat. [Music] [Music] Yo, [Music] [Music] heat. Heat. Heat. [Music] [Applause] [Music] [Laughter] [Music] [Applause] [Music] [Music] Where the [ __ ] is he? My giddy little [ __ ] [ __ ] [ __ ] Where is he? Where is he? Where is he? Tell me where the [ __ ] he's at. [Music] A reality [Music] [Music] is talking [Music] to I Yeah. Heat. [Music] Heat. Heat. [Music] [Music] Heat. Heat. [Music] universe into high gear. Oh, this is where we got the skills to blow it away. One piece still better. And Jamal ate the spirit bomb. What are they playing in here? Lollipop lollipop. Lollipop. Lollipop. Lollipop. Lollipop. Lollipop. Lollipop. Lollipop lollipop lollipop lollipop lollipop lollipop lollipop lollipop [Music] I haven't got a chance I call him [Music] [Music] Oh [ __ ] [Applause] [Music] [Applause] Oh [ __ ] I cannot do this anymore. [Applause] Say everything I said before. All these words they make no sense. I found no less I hear the less you say. You'll find anywhere just like before. [Music] The answers aren't so clear. Wish I could find a way to disappear. [Applause] All these thoughts, they make no sense. I found this ignorance. Nothing seems to go away over again. >> What the [ __ ] Who the [ __ ] was that? Heat. Heat. [Music] Everything you say [Music] I need a little [Music] gofather's in the house. Grab your [ __ ] Ppping ain't pimping ain't easy, man. Pimping ain't ain't easy, man. Pimping ain't ain't easy, man. Pimp ain't ain't easy, man. Oh snap, [ __ ] Your [ __ ] ass, [ __ ] He got no chance. A rocks in the east and a rose in the west. Pimping. I could really get less cuz it's pimp or die. Pimp or die, baby. Pimping ain't ain't easy, man. Ain't ain't easy, man. Pimping ain't ain't easy, man. Pimping ain't ain't easy. G O D F A T A G E R start when they see my car. Even though I'm a pro wrestling, they know I don't play and I What's next? What's next? What could possibly next? I can hear them talking. What could possibly be next right now? You can literally hear them talking about what they trying to do. Wait, why are we pulled over? We got a flat tire. [Music] What the [ __ ] All right, ladies and gentlemen, chat. We have experienced different amount of sorities in this bus. We don't understand what's going on. Come on. I thought you got a flat tire that We got a flat tire. >> We got No, no, no. >> We good. >> I'm just trying to learn. >> As I was saying, Chad, after I was rudely interrupting, we have seen I show speed get whooped by different types of entities in this bus. We seen his play on the field beating Jamal's ass. Then then he gets his ass beat by Luca himself. Then he gets beaten by Slits. You already know who that is. Then Henry, then Rudy. Good night, ladies and gentlemen. This was all. [Music] Okay. What the hell? Harry Potter. Harry Potter. [Music] Harry Potter. Harry [ __ ] Potter. Love you. Expend all this. [Music] Deio. [Music] [Applause] Germany. Oh. [Music] Oh. [Music] What the [ __ ] Bro, it's my turn, bro. It's my turn. >> It's my turn. [ __ ] that, bro. I ain't going [Applause] [Applause] [Music] [Applause] Oh, [ __ ] it up. [ __ ] it up. >> Reset. Reset. Reset. Take five. Take five. Take five. Take five. Reset. They [ __ ] up. [Applause] [Applause] I'm ready. [Music] [Applause] [Music] choosing your battle. Pick yourself up and dust yourself off and back in the saddle. You're on the front line. Everyone's watching. You know it's serious. We're getting closer. This isn't over. The pressure's off. You feel it, but you got it all. Believe it. [Music] All right, guys. Oh, [ __ ] [Music] People [Music] [Music] are raising their expectations and this is your moment. No hesitation. [Music] Feel it. Take away. You get down. Get up. When you get down, get up. >> Oh my god. >> Oh my god. [Applause] Get your [ __ ] >> Oh my [ __ ] god. [Music] I need water. >> I need water. [Music] It's not that I don't like my wife. It's just >> It's just, you know, when it's [Music] >> I took Sunny to go to the baseball game two days ago and the wife just kept chirping. >> Look, I'm all for driving stick shift, but it's more inconvenient. Does that make me less of a man? >> Is that a problem? >> It's called bleeding. It's just on my back about always the clutch. Always the clutch. Always the clutch. All right. My left foot is sore. I use it for stabilization. My right foot is the preferred foot. Is that wrong? No. [ __ ] A me and the wife took the kids to the lake. [ __ ] jump. They [ __ ] They [ __ ] They [ __ ] drowned. Okay. And yeah, it was cuz the clutch got stuck, but [ __ ] All right. Okay. Okay. It's quite a lovely day here. >> It's really nice to sit out under the stars. >> You're [ __ ] me up. You're [ __ ] me up. >> It's quite beautiful this time of night. >> It's quite good. >> Oh my goodness. The shooting star. Do you see it? >> Uh right next to the little dippler. >> Yes, it's a little dipper. >> Wow. >> Nice. If only we could stay like this forever. Nothing ever happened. Right after us being here in this field in England. Oh no. >> I think something's happening. That's exactly what I looking dizzy. Oh my god, it's Bob build up and Wendy join the follow. They get the job done. >> I don't know what [Music] >> happened. He was about to [ __ ] >> I didn't know what the [ __ ] to do. killing you with >> Yeah, we were about to be [ __ ] >> We were about to get [ __ ] >> We were about to be nails into a [ __ ] 4x4. >> Oh [ __ ] >> [ __ ] a >> reset. >> Reset. >> All right, bro. How far are you to this truck stop? >> Got to be close. We got to be close. >> What the [ __ ] are we doing? [Music] Baby [ __ ] time. >> What is it? On the couch. Oh yeah. [Music] I won. I won. Reset. Wow. [Music] >> Yay. Good. So, >> okay. What? >> I don't think they know we're about done. >> Yeah, I'm done. I'm [ __ ] done. >> Well, I was telling Ames. >> Got him. Got him. >> What the [ __ ] Marie. Marie. shall not pass. [Music] [Music] Heat. Heat. [Music] Heat. Heat. [Music] [Music] [Music] Time to clean up everyone. Let's pick up our things. [Music] Clean up. Everybody clean up. Time to clean up. [Music] Everybody pick up everybody. Pick up. Everybody pick up. Time to pick up. Pick up the toys. Put them away. Pick up the books. Put them away. Pick up the books. Put them away. Put your things away. Pick up the toys. Put them away. Pick up the books. Put them away. Pick up the books and put them away. [Music] Clean up. Everybody clean up. Everybody clean up. Clean up. Everybody clean up. Time to clean up. Pick up. Everybody pick up. Pick up. Everybody pick up. Pick up. Everybody pick up. Time to pick up. Pick up the toys. Put them away. Pick up the blocks. Put them away. Pick up the books, put them away. Put your things away. Pick up the toys, put them away. Pick up the books, put them away. Pick up the books, put them away. Put your things away. [Music] All right, that wraps that up. [Music] Time to make a circle. Make a circle. Big, big, big, small, small, small, big, big, big. Make a circle. >> We really do. We [ __ ] do it. >> Oh man, >> we doing it. >> I wanted to make a circle with you. [Music] Oh yeah, >> your knowledge will soon impress someone special. >> Well, [ __ ] >> Hey, don't stop the music. >> Clean up. >> Everybody >> clean up. Clean up. >> Clean up. A rather good collaborative cleanup effort. >> That was I mean it looks amazing. >> Clean everything up. >> That was >> We should all work together. That's how easy it is. >> We should do that every day. >> That's how it That's easy when everybody clean up at one time. >> Team, >> bro, how far are we to the truck stop, bro? >> I think we're arriving. >> Just in time. >> Can you guys clean up my bed? >> I [ __ ] with you, but you don't [ __ ] with me. >> Whoa. Look at Luka. >> Get to it. >> Look at him, too. >> Look at him, man. Look at Luka, man. >> Are we >> Look at Luka, man. So inspirational. >> Yeah, we need to hit. >> We here. >> Nearly. I felt the bus stop a little bit. >> A lot. >> Well, that was funny. >> I [ __ ] with you, but you don't [ __ ] with me. Don't always show each other. Maybe before we go to sleep. >> I don't know [ __ ] about no jealousy. Going >> to sleep rather good tonight. Y'all took off the map. We did. >> I'm tired as [ __ ] bro. I ain't going to lie. >> What time is it? >> 10:42. >> 10:42. We're arriving. We're here. Yeah, we actually stopped at the right exact time. >> Damn. >> W Henry >> 67. >> I just bit right on the highway. >> [ __ ] 20 days left speed. It's the 27th, but it's about to be the 28th. So, two days left. Damn, two days left. It sounds so crazy. Saying we have two days left sounds [ __ ] crazy. All right, y'all. We're at the truck stop. Let's get >> We're here at the truck stop to shower. Let's get showers. >> Let's get IRL ready. I got a shower. >> IRL. IRL. IRL. Ira. >> You wake up, you go like this. >> We just need a battery. I mean, we have like 37 minutes on here. >> Yeah, I know. >> Yeah. >> What' he say? >> Is there going to even be a shower available? >> They only had three a while ago. >> What' he say? >> They only had three a while ago. >> Saying it's busy. >> What? The truck stops are busy? No, the all the people are I mean we got probably >> we got fans. >> 15. >> Oh, 15 fans. Well, if you give them all stream pickics, they should leave. >> Stream pics. >> Rudy, how do you do a stream pick? >> Get your stream picks ready. >> Stream ready. >> I only have three showers available. >> That should be good. That's all right. We're not in a rush. >> Clean up. >> Wild lizard. >> Everybody come. Still haven't found any >> found anywhere. >> Lot lizards. They keep talking about lots. >> Oh yeah. Lot lizards. >> You want a what? >> They say we haven't we haven't found. >> If you're looking for a lot lizard, you got to go to the right lot. >> Boy, you got to >> It's got to be on I 80 on mile marker 430. >> You know, >> is this the >> If there's a Liz in your lot, you put that lizard right in her. Oh, sorry. No lot lizards. >> 67. >> First one to find a lot lizard. Get that bug light. Hold up. Don't trip. Boy, I'll tell you why. I lose you. I will lose you to the damn bit. >> Uh, I just right on the highway. Clean up. Clean up. Clean up. Production. I need a battery. Clean up. Speak off your phone. Sorry. Oh, this tour. It's coming to a [ __ ] end. Wow. Uh, >> no worries. No worries. >> Got you, Luka. >> All right. All right, B. You ready? Let's go. >> You ready? >> Let's switch. >> We need a new battery. >> Where the pack at? >> I mean, >> real quick. >> I guess we're doing shotgun for now. >> Someone's going to run it. >> I put the pack right here. Where did I put the [ __ ] That was >> What the hell? What the hell? >> It's right over here behind the behind the the PC. >> Um, not good, guys. Not good. >> What? >> The crew bus. >> I mean, we got 35 minutes. >> Who waited? >> All right. >> The crew bus is 30 minutes behind, so we're risking it theoretically. Wait, how? Why are they behind so much? >> Wait, can you You got a portable. >> Yeah, my bad. >> I mean, 39 minutes is >> No, no, no. I got it. I got it. >> My bad. >> Speaking of, you >> give me a port. >> Ro, give me one second. Hold on. Hold on. >> A mag safe one, too. It's not clear. You want a port? >> We need a a actual USBC cord to go into there and it'll charge that. >> I don't know if that'll charge it. >> Everybody clean up. Clean up. >> See, it's char that's charging this. But if you get a cable, it should do the other way. >> I don't know. 37 minutes. Speedun. Truck top. >> Truck stop. Speedun. >> USBC. Let's just try to run it. >> Um, >> wait, wait, wait, wait. >> Oh, wait, wait, wait. >> Somebody put me in Tom's. >> Wait, wait, wait. >> Which I run. >> My breath smell like [ __ ] burn. I hate that. >> You ate that [ __ ] >> It's tricky with that [ __ ] >> There's only one shower open right now. >> It's a little tricky. >> Should we go somewhere else? >> Yeah, there's another shower. >> Oh, my fault. I'm sorry. >> I'm sorry, bro. >> Turn the camera off first. This a PlayStation, man. >> Hopefully they didn't switch it. >> Yeah, please don't switch it. >> It's been through it ups and downs. >> I think we're cut. >> We need a PD charger. >> And it's at 100, so it should charge that. But if it's not hand work, >> um, okay, just plug it in back. Yeah. >> Uh guys, what do you want to do? There's only one shower available here. >> Should we go somewhere else or >> another truck stop we can go to? >> Should we go to another truck stop? There's only one shower available. >> How far? >> There's only one >> cross the highway. >> Oh, yeah. Let's go to the other one. We're going to go to the other one. >> It's across the highway. 10 minutes max. >> I'm not seeing no LEDs. >> I just plugged it in. >> No, man. >> Clean up. Everybody clean. >> This is such an unfortunate situation. >> Uh well, look, should we just plug it in for the fast charger? >> Yeah. >> Oh, bro. >> You get there. >> Thank you kindly. The pleasure is mine, pal. >> Thanks. >> Pleasure is mine. >> Oh, >> so what? We're going to a new uh It's right across the highway, so 5 to 10. >> They only got one shower open. Yeah. >> See, that's the reference right there. >> I just spent right on the highway. >> Bit rate on the highway. >> 67. >> Oh, yeah. Bit rate on the highway. >> I seen your bit rate tweet. 100,000 bit rate. >> 500k. >> 500,000 bit rate. >> Yeah. >> Yeah. Jason don't got nothing on I'm the bit rate. >> You got to up your bit rate. >> 1 million bit rate on the way. >> Speed. Do you want to Do you want to pull a 1 million bit rate stream? >> What? >> Is that possible? >> Let's do it. >> We could go in Japan. They got like 10 gigabit. They might have 100 gigabit. >> We got to do it on super Wi-Fi. You can get 10 gig fiber in the US for sure. >> Yeah. Is that a tool kit? We'll figure it out. >> We don't use toolkit. We'll figure it out. We'll figure it out. >> Guess what? Speed toolkit crashed two days ago. >> Really? At least >> it wasn't affected. >> Real. >> Yeah. You want to know why? Cuz we built a server for you. >> What? What p What is that called? Why that PC? A small PC. >> Uh, it's called a mini ITX PC. >> Yeah. >> Mini ITX PC. Yeah. >> Yep. >> Would you prefer that over the normal PC? >> It's the same. >> It is the same form factor. If you need more ports and like more expansion, you get a bigger one. But >> see, this is why I like playing games. >> You remind me of me. >> Go back to the B. >> Both are just super nerds. >> Yeah, >> super attractive nerds. >> We both just have so much bit rate. It's crazy. >> Bunch of bit rate. >> Bunch of charisma. I kind of want to give you one. >> Speed's got another one of these. >> Really? Why? >> Yeah, I got two of those for >> his like marathons. >> Theoretically, like we could have used the >> travel >> like like we have enough room. >> Yeah, it's nice. >> Yeah, but I feel like this one wouldn't fall as easily. >> Yeah, it's not as tall. >> He got another one like that. >> It's not doesn't look like that, but it's the same size. Same spec. Well, this is a 5080 actually. >> That one is a 4080. >> What is that? >> Oh, 40. >> Not bad. >> What is strobe lights? >> Strobe lights. Like >> we have strobe lights. >> Would you like to see? >> Do we? >> Oh, those. >> I can strobe it. >> Speak the Jupiter. Bet. >> I can. >> I was there yesterday. VR, >> please don't stop the music. >> Huh? What the [ __ ] Oh, we can be on some animates so I can put up speed. Wait, I thought we were done. >> Oh [ __ ] We could have did something cool. >> Yeah. >> Oh, that's an idea. That >> strobe light. >> Strobe light. That looks like uh what you call it? Uh intro song. >> Yeah. Yeah. Yeah. What's it look like on stream? >> Sick. >> The Mic. >> That does look sick. >> Mic, >> but it's out of focus. Oh, there you go. >> That looks sick. We could have like did like um >> Well, now we know >> who [ __ ] WWE intro song. >> Okay. Who switched the camera? Who want to switch the camera? >> Stop the music. They're saying trigger warning. It's not >> epilepsy. Let's go crazy. >> Yeah, Chris Jericho. Chris Jericho is like that. >> Coco, shut up, bro. >> What Coco say? >> He's talking about I had a stroke. >> I had a Caesar. Thank you. >> Coco, you're scared. Iro, you don't even have any of >> Coco's ugly as [ __ ] That's why you didn't want to. >> Dude, that's crazy. He's an ugly white guy with long black hair. >> Damn slips. You be talking about >> Yeah, you talk to the cocoa like that. >> You about to roast your cops. I'm hearing everything. >> I put this shoulder I put this shoulder up and I put it back down. >> Lo. Okay. Hop on karaoke Jamal. I don't really Shut the [ __ ] up. Okay, >> let's go crazy. It's [ __ ] hot in here. Speed >> quiet. >> It's quiet as [ __ ] The [ __ ] is TTS on? >> You probably have it not set to the speaker. >> Audio output. I'm about to get on GTA, brother. >> No, we can't. You can't. >> Is it plugged in? >> I think the headphones are plugged in. >> You can't stop the music. >> Speed, you look tired. Yeah, I'm tired. I ain't going to lie. >> I didn't hear anybody tired. >> You taking the mic in? >> I might just No, I just use shotgun. We only need it for real. >> I can't locate the speaker cord. >> It's the green one. >> Yes, I know, brother. I can't find it. >> What the [ __ ] >> Say la boooo funk. >> It's lab boooo funk. >> Let me look that up. >> Bro, speed. I can't find it, bro. >> Dead ass, bro. >> Oh, it is Lubu funk. What the [ __ ] >> I thought y'all was trolling. >> I can't find the speaker cord. >> Ah, there it is. [Music] Never. [Music] [Music] >> I never know. They made a boo boo funk. >> Why? >> That's curse funk. Speakers now plugged in. [ __ ] [Music] Hello. [Music] What does [Music] he [Music] feel? [Music] Hey. >> Yeah. I I just switched it to Are we >> allegedly in theory? Now we are >> Shan. Yeah. [Music] [Music] I got it. >> Let's go up front there. How you doing? [Music] Get a car. You want a car? We need a car. Showers shower. >> Car showers. >> Oh yeah, that's right. We >> showering. A got the car. >> He's not here. Mother >> him right now. And then >> we're here to pay for a shower. >> Yes, sir. How many showers do you need today? >> But we can't all shower at the same time. That's the thing. So, he's going to shower. >> Then I'm going to shower. >> He's going to shower >> and then another two and three hours. >> Buy your showers now and then take that. >> Okay. We just give the slip in. That's fine. >> Make sure you get my shower, bro. Thank you very much. >> So, one, two, three, four. >> I'mma go first. >> You waiting. >> Yeah, [ __ ] >> Wayne. >> N you go have a shower. >> You got to have a shower, bro. You just take a shower. >> Yeah, we wait. A is coming. Take a shower, bro. >> You're better off having a shower now than the >> better taking a shower now, bro. >> Yes. >> Take it on the bus. >> All right. Take it on the bus now. Do what you want to do. >> Guys, can you give us some space, please? >> We're trying to shower. Like the team's trying to shower. >> I'm doing good. I'm trying to shower. >> Thank you guys. Thank you. >> You have >> Yeah, we're just trying to shower, that's all. >> They followed us all the way out here, bro. >> Nice meeting you, too. >> Drop home safe. Yo, >> the cops on us. >> Who said that? >> I called the cops on y'all. >> Not here. Maybe somebody else. going to walk up. No, he >> ain't nobody call the police. >> Six showers, my >> boy. Yeah, I'm definitely trying >> kids you touching and stuff like me. >> Yeah, they're coming now with the card, but we won't all be able to shower at exact same time. Okay, just let you know that. >> Now that my quarter goes that way, you guys are going to do >> Thank you very much. Thank you very much. >> No worries. No worries. >> How are you? >> That was sick. >> I'm John Bobby. Nice to meet you. >> Nice to meet you. >> How are you? It was funny, man. How you >> How you look dead like Harry Potter? The Irish one was >> Irish one. >> I'm actually still hungry. >> What did you eat? >> What did you eat? A >> He's here. >> What are you doing? >> Over there. >> Still in character mode. That [ __ ] get some good, >> bro. I'm like I'm I'm feeling like a snack. >> That's what I'm saying. >> I need a little snack or something. >> Can I get a picture of you? >> Oh yeah. >> Oh my god, that's awesome. >> I was watching his stream. >> Are you a snack? >> No. >> Oh wow. I was asking for a snack. >> Ou. This lowkey look good. A cinnamon toast crunch season size. >> Yo, brother, what snack can I eat? >> What snack can you eat? >> Yeah. >> Hey, brother. >> What? What snack can I eat? Beside me, Jeffy. >> Hot dog. >> Protein cookies. >> Yeah, hot dog. >> Yeah, >> I get hot dog with my brother. >> Uhhuh. >> Everybody going to want to have Thank you. >> You're welcome. >> Yeah. to my El Re. >> I don't want I don't want it just the meat, bro. >> Get Get that anyway. >> Yo, man. >> Protein cookies. >> Chad, what's that song called? [Music] that song. >> Yeah. >> Or is it uh [Music] what's that song called? >> It's like a from Shrek. >> I forgot. What shower I am? It's called [ __ ] Town. [Music] >> Oh, it is off track. It is off freaking >> Can I hold you? >> Can I Oh, shoot. Can you beat it up for me? >> Oh, my clean. It's not clean anymore. Oh, baby. >> Oh, this baby. >> Take your take your kid, please. Sorry. >> Take your kid. >> Thank you. >> Is my draws dirty now? >> Thank you. >> Why you want something? >> All right, I'm ready to shower. >> All right, we're ready to shower. >> Ready to shower? >> Get your street. >> All right. $20. >> $20. >> What are you going to do with that $20? >> No. No. What are you going to do with the $20? >> Frame it. >> What? >> Frame it. >> Frame it. [Music] >> Sorry guys. >> Face, please. >> Oh, need a shower, guys. >> Hold on. I need a shower. >> Then take pictures, too. And then can you say hi dear? >> Thank you. >> Yeah. Can you say hi dear? >> Hi Darren. >> Dear >> dear. >> Yeah. >> Y'all say hey. >> Can you take a picture? Dear mom. >> Who? >> There should be. >> Your phone is freaking me out. >> One more. >> Hey. Where's the security? >> I don't have a murder. >> You need one. >> Shower. >> Have one. What about you? >> Go for it. >> It's fine. He doesn't need to shower, man. Look at >> I'm joking. I'm joking. >> We'll get you. We'll get you one. >> I'm not for slippers. Like slips. >> No slippers. >> Drive home safe, y'all. Drive home safe. Drive home safe. Drive home safe. >> Say hi, Navo Nation. >> Hi, Navo Nation. >> You need to turn these boom. >> You kids better. >> This one. >> Don't crowd him, please. One at a time. >> Drive home safe. >> Drive home safe. >> On the right here. >> Right. >> Yeah. Where is right there? Thank you guys. >> There you go. >> Guys, shower. >> We're just having a shower. Trying to shower. >> All right. Thank you, >> guys. We're just trying to shower, you know. We're just trying to have a shower. >> Did you just shower? >> You showered yet? >> Bye. Bye, everybody. >> The shower's good. >> Thank you. >> It good. >> All right. Quick one, speak >> or whatever number it is. >> I don't know what number I am. >> Uh, check on me. >> Shower. Shower >> 17. >> 17. No, we've all got 17. >> Let's do 17. >> Sir, which one is my shower? >> The shower. >> It was at the cost. So, it doesn't matter. >> Anyone? >> Yeah, it doesn't matter. >> Good. Good. He said anyone. >> Which one do you recommend? You're lucky. Not seven. Which one do you recommen? >> Seven. >> What's the best shower? >> Come on. Tell us the best one. Seven. >> Seven is taken. >> No, that's the go. >> Oh, >> you're in Ronald's shower. >> That's number seven. Get the [ __ ] out my show. >> He He put me in there. >> Hey, he put >> he put everyone in number seven. >> He put everyone in number seven. >> He put everyone >> All right. Well, seven it is. >> Where's Jamal? >> Well, stream. I will be back. >> I'm about to take a shower. >> Jamal. >> Yeah, Jamal. >> Byebye, chat. >> Adios, amigos. >> Bye-bye, chat. I got a shower. >> Can you entertain the chat, please? talk to them. >> Yeah. Yeah. Yeah. >> All right. Cool. >> One sec. >> So, follow me. All right. Now, we're in the truck stop. Speed is showering. >> As you can see, gentleman sitting down. >> Showers are good, sir. >> Cool. >> And this is this is basically a trap spot where we're just going to get a little massage. A >> can you pay for the massage so we can um >> see how it works? >> Yeah. Just uh pull it on. Just the chat. >> Yeah. Yeah. Yeah. I'll I'll put it on. >> Chat needs to see. >> They need to see how it works. So, first you have >> cash. $5. $5. >> Mate, it's digital. $2 to start. >> Three minutes for each $1. >> I'm still shower. Have you had a shower yet? >> Oh, you at the hotel. >> That makes sense. You ain't going to get one. >> 15 minutes. >> Yeah, I'm good. >> You press your side. >> Oh. Oh, whoops. >> Oh, whoops. >> Accidentally. And there he is. The man himself. >> Anthony, the man of the hour. So, Anthony. Anthony. They're wait. Where you going? >> They're waiting for you. >> Oh. Oh. Something's going to happen. >> So, talk to them. >> What's up? Tell them about your day today. Why you giggling? You had a long day. >> Wait, hold up. It's >> almost Do the shower Do the showers have like >> soap. >> This shit's almost bigger than me. >> Little D. >> Wow. >> 5,000 break. >> Tomorrow, right? >> Today was a light day. >> Today was a light day. >> Today was a light day, >> dude. Sorry. >> And he's telling you about the day. I was just I was getting >> Look guys and also it's Sydney. >> Sydney. >> There he is. [Applause] >> Hey guys, what's up? >> I'm over here trying to find snacks I actually eat, but I can't find nothing. >> You got no protein, >> huh? >> Protein. How do I check number? >> How do I check number >> guys? >> Guys, how do I check number? What is all this money doing? >> This is yours. >> How do I check the number in my shower? >> Have you got a shower? >> Shower number. >> Any shower? I think >> what number is my shower? >> Anyone? >> Any number. >> Any number. >> Yeah. >> What the chat saying, man? >> Shower number am I? >> Number 17. >> What the chat saying? >> No, that's shower. Uh, chat saying uh W team W Jamal L Jamal. >> Damn. >> Well, you had you had to read the L Jamal. >> I'm reading everything. I'm I read the W and the L. >> All right, bro. >> W Jamal Lamal. >> Tell you to help me. >> Hi, Jamal. >> Tell you to help me. What's next time? >> Or Jamal. >> I can have diet Mountain Dew, right? >> Yeah. >> Okay. >> Yeah. Just want to make sure >> anything diet, right? >> Yeah, diet. >> I don't like how you said like that, bro. >> I I drink diet, too. >> I drink diet, too. I drink diet, too. >> I drink diet, too. You know that? >> Tyler segment. >> Tyler. >> Tyler. Tyler don't like being on camera because he got ops. Let me chill out. No snacks. No soda. >> This is your idol right here. Here's all the snacks. >> Really [ __ ] bro. >> This is all the snacks. Have you ever tried the protein Pop-Tarts? >> Is it good? No, it's not. Right. >> I mean, don't take like >> Exactly. I don't want to hear that. I don't >> It's It's decent though. It's decent. >> Foot bars. No. >> Uh, one of these. Maybe. This is what uh this is what Rudy eats all day. That's why he looked like the way he looked. >> I have Oreos. Why don't you >> Is this a bar? >> See? Yeah, that's I don't know. Wait, wait, wait, wait. Reese's protein cups. >> Oh, wait. It's a bar. >> Is that a fruit bowl? >> Are those apples? >> Honey, do they have eat pickles? >> Yeah, that's a vegetable. Or are pickles a fruit or a vegetable? cuz tomatoes are fruit. >> Chad, is this valid? Snap. >> Pickles. >> Hold up. >> Can you sign my iPad? >> Hold on. My hand is full. Um, >> Luka, you too, bro. >> Would you sign my orange? >> Really? Sign the iPad? >> Yeah, [ __ ] it. I don't want to mess up my signature. >> Luga, you're >> That's my That's my sign right there. >> Oh my god. >> It was a little shaky, so I'm holding the camera. >> Don't matter. Sorry. >> Yeah. >> Oh, yeah. >> No, you're good. You're here. I'm going to try to be less shaky this time. This is a sick phone case. >> Thank you. >> Oh, no. I'm shaking. >> Less shaky. >> I'm holding the camera. >> I know you're good. >> Thank you. >> Have a good night. >> You guys with you, dude. Take care, guys. >> Is this not good enough? >> I could go for some pickles right now. Some nice juicy pickles. That don't sound Huh? You said you. Who said e? >> Oh, you said ew. >> Dude, this is valid, right? >> Yeah, it's healthy. >> Wow. >> It's healthy, right? >> It's blood health. >> This probably not not this yogurt. Probably. >> No, the yogurt. >> It's protein. It's a little protein. >> This is yogurt. Probably not. >> It's not bad. It's not bad for you. >> Yeah. Just read it. >> It's yogurt. >> Five calories. No, thank you. I get the pickles for snack. Blue marker. What about a blue marker? >> Oh, they're going to resell the phone in the iPad. >> They're going to resell my signature. >> Hey, what's up? >> Oh, look who it is. >> Where's your brother? >> Taylor, >> I didn't expect you guys to be in here. >> I'm about to hit the shower. >> You got slides. I don't want to hit the truck stop shower. Oh, I didn't think >> I'm trying to wait till uh the hotel. >> Mike, is that something we should be worried about? >> Definitely need slippers in the shop. >> Hold up. Are these like What are these? >> It's good. >> Are these sleep gummies? >> What does goodbye mean? Goodbye stress. >> Active immunity. Anything that helps you sleep, bro? >> Healthy Indian. It's like vitamins. >> Oh, is it? >> Yeah. Yeah. Yeah. A gummy form. >> Yeah. Why don't you get some, >> Jack? Can I get some? >> 10 calories. >> They're like healthy gummies. >> Chapstick? I don't need no damn chapstick. >> Oh, we need these right here. Yes. Luka, you want some? >> That's you, bro. >> It's What do you mean? It's me. >> You are. I don't know. >> You got an extra small. >> Have you made you stop talking? You stop talking. I was going to say, have you used the one that the ones that you already had? >> You have those already. >> Y >> found them. >> They said I should get these. This one got vitamin C though. >> But what is the difference? They're good inside. Feel good inside. >> This guy got vitamin C though. >> I don't think any of them are valid. >> Segal. I'm just trying to see like >> stress go away. >> Which one? >> Look at these. Come on. Let's Let's play. Let's go check out I'm gonna eat pickles while I'm pooping in the pump. >> Actually, you know what? >> What if you get a bumper sticker for the bus? >> What bumper sticker? >> No, we're not getting no damn bumper sticker. >> They're stickers. >> We're not getting no damn bumper sticker. >> Waterproof. >> Okay. I speak fluent song. >> I put ketchup on my ketchup. What was that? >> Save the chubby unicorn. >> Hug life. Suck it. One love. >> Who makes the stick? >> Yeah, I ain't going to lie. I need this brain right there. >> Can you get over me? I got to pay for my food. I need my stuff, babe. >> No, let me get in for you. >> Anything else you want? >> That's it. You you look like me. >> What about one of these? >> You want anything? >> [ __ ] put that >> [ __ ] No, no. >> You pay for this. >> I'll get a bath, though. Can we get >> Yeah, get a bed. >> I got a bath. >> Of course. Yeah. Come on. >> Yo, W Anthony. >> Let's go. >> End is a real one. >> Ice. >> I got you. You want ice cream? Get ice. >> What? They got hydration. >> They only got one thing of prom at the bottom. That's so disrespectful. What do you want? Uh, >> don't show that on TikTok and like move it. >> Yeah, don't show that. >> Get uh two of these. Two of these primes. >> It's two for five. It's two for five. Two deals. >> We're getting two primes, y'all. >> Two primes. >> Yeah, that's two primes. >> Two primes. >> Two primes. >> Yeah, that's what I got. >> That's what I got. >> Yeah. >> Anthony, come here. >> Anything else? Yeah. Come here. Put that stuff down. And I got to show you something. >> Come here. >> Oh, it's right there. >> Yeah. >> Hi. >> W. >> No problem. >> Hello. Nice to meet you. >> Nice to meet you. >> My grandson wants to say hi. Hey, how you doing? >> What's up, man? >> What's up, man? >> What's up, guys? How's it going? Aren't y'all supposed to be asleep? >> Yo, what up, man? >> Pull up then. >> No, but it's too late. It's too late to pull up. It's too late to pull up, though. It's too way too late to pull up. We about Honestly, it is honestly. >> Yeah, we about to leave back out in a minute. >> You said what? >> I said y'all stay blessed, man. Have a good one, man. >> No, appreciate it. Appreciate it. >> Point at me. Point that way. Point that way. >> Point it at me. That's what you say. >> You're getting two more. >> Yeah. >> Okay. Okay. >> Yeah. There you go. >> Okay. >> All right. Let's go. Let's go. Uh, we go back over there. >> Yo, W Anthony and Chad, though, >> Anthony, >> huh? >> Got you. >> It's just like my drawing >> right here. >> Yeah. Yeah. Right there. It's fine. >> Can we get a picture? >> Thank you. >> Come on. >> Come on, Luka. Sir, >> onward Michael. >> Uh, never >> back to the massage chair segment. >> I was laughing at this guy. He was getting beat up in the bus, man. >> Wizzy, why the bus? >> He go beat him up in the bus. >> I know. Oh, they were wrestling. That was pretty funny. >> Oh, they were wrestling on the bus. Speed finish. >> Are you okay? >> Like how sick? >> Like I can't hear anything. >> What the [ __ ] >> Like my ears won't pop. My head's full of snot. >> Your head's full of snot. >> What the [ __ ] >> I hope you feel better. But damn. >> You're the one that made everybody sick. >> Yeah. Get Yeah, right. I have allergies. Those are allergies. >> I make nobody sick. >> That makes your own self sick. >> You know what, Rudy? I always wanted to tell you this. Go >> ahead. Let me tell you real quick. >> Just make sure it's nothing bad cuz the chat will say, \"Lar, >> how you >> I'm just saying that's what the chat's going to say. Say Jamaica.\" >> So, what do you want to say? >> How your day going, man? >> Huh? >> How your day going? >> How's my day going? Yeah. >> Um, my day is all right. You know, I'm just chilling, just getting a little massage, >> you know. >> I bet that feel good, don't it? >> Feels all right. >> All right. No, that [ __ ] feel heavenly. I know it is. >> I probably want to be better. But hey, you have to be You have to make >> You're right, [ __ ] You know that [ __ ] feel good. >> Feels better than nothing, >> you know. >> Yeah, I feel it. >> All right, chat. Post game. Jamal show. I think that's do it for today. All right, chat. This is your boy P. Oh, your camera about to die. What percentage of [ __ ] on? >> I got battery. >> No. How much battery, [ __ ] >> It just started blinking. >> Oh, it just started blinking. >> All right, bet. >> I got extra postgame Jamal show. Actually, Endgame Jamal show. Uh, we have been through a lot today. We have went to a nuclear power point. No, a nuclear museum. That was lit. We went to a place called Bob's Burgers. That [ __ ] Bub's bad. >> That shit's mid mid. >> Mid mid. >> Yeah, Bob's good. >> I'm sorry. I'm sorry, but that [ __ ] was mid. >> That joke is mad. I had to be honest. >> Where did we go first? We went to Oh, we went to the breakfast spot. Mid. I don't think my chicken was supposed to be juicy. Like, no, not my chicken, but like my supposed to be juicy. >> Where did you guys go at? >> I think we went to we go to eat. >> What was your best place that you ate at so far here? >> I ain't going lie. We ate We ate >> PF James. PFJ. >> Yeah. >> Oh, what? >> Oh, yeah. >> Hey, if you guys do come back, you got to try some of our local. >> Definitely. >> I don't have water, bro. >> You want to try it? What are you eating? >> Just peanut butter. >> Oh my god. >> Ice cream sandwich, >> dude. Don't >> I'm so like I'm like I'm like so bad that I can't eat that, bro. >> I'm left-handed. >> You're left-handed? >> I'm a right hand. >> Is this [ __ ] left-handed? >> We go. >> Eat that [ __ ] I want Look at that. >> Wait for him to come out. I'm Taylor. >> He's not that good. >> But chat, >> this day has been good. >> W day. I ain't going to lie. >> Yeah. >> Back. Got you. >> For your brother. >> Gas. >> Yeah. Right. >> How's it going, man? >> I know that [ __ ] gas. >> Were you using that thing or just >> I was using it. Just finished. >> Oh, you just finished. Yeah. >> Now you're in a state of complete therapeutic euphoria. >> Not really, man. I think uh I need a real the real thing, man. >> Yo, Jamal, what did I do? >> Little D. He went >> What the [ __ ] did I do? >> Yeah. Yesterday or something. >> Yeah. >> Bro, revitalized. >> What did I do? Why they spamming L? >> I told you. >> I didn't even say nothing. >> I told you that. What is L for? >> I told you that >> chat. What is L for? What did I do? >> Told you B say to me to be nice, bro. >> Yeah, you got to be careful with me, bro. >> What the [ __ ] >> What do I do? I don't even No. No. They're spamming it now. Like what? >> Like what? >> You want to know the answer? >> What? >> Ask everybody's chat. Type their age, bro. Why they all No, they're literally They're all spamming L. >> They're like teasing. >> What did I do? >> Who won the picture earlier? >> Who won the picture? >> Oh, she wanted the picture earlier. >> Oh, yeah. Come on. She's been watching you guys all day. >> Got you. >> All day. This >> is nice. >> Stream pig. >> Stream. No, we're doing good. >> No stream pics here. >> Thank you. >> Like the chair has a weight limit. All right, guys. Chill out. >> Bust on that [ __ ] I want to sit. >> So, what do you want to do? Go back on the bus now? Yeah. You know what you mean? You know what I'm saying? You know what I mean? >> You can sign up for my daughter. >> I got you. >> Yeah. She was scared the first time, bro. >> Guys, guys under my name right there, >> bro. >> And I need yours, man. I need the camera, man, bro. >> Got me. >> There you go, boy. >> Thanks, man. Thanks, >> huh? >> Let's do some of the camera. >> Oh, you want everybody show? >> Yeah, bro. Holy [ __ ] >> I even got Jamal's on the back. >> What the f What kind of signature is that? >> It's It's hard when it's moving here. Is this your >> last mean? [Music] >> The last of us game. >> Dunk game, bro. >> Golden game. >> Thank you. God bless. Part one. Better than part two. All right. >> All right. Go. Y on me. >> This truck's almost dead. >> Why is there a picture? >> All right, kid. Take >> You can take a stream pick. Come and get a stream pick. Look at the camera. >> Stream pic. >> Stream pick, >> guys. Look at the camera. Stream pick. All right. Come on. Let's go. He said be cold on this car. >> So I told you you didn't catch a cold cuz I'm playing. >> I ain't catching no cold boy. >> Y'all done mean? >> Oh yeah. >> Yo, we should go to waffle hours, bro. >> Yeah. >> Can I do stream? >> Yeah, let's do it >> quick. Stream pit. Look in the camera, >> guys. Come on. Let's go. We got to keep going. Let's go. >> Stream pit. camera. You want to get a picture? >> Stream it. >> Get a picture. You don't want >> You want to stream it? >> They don't want pictures. >> Look in the camera. Stream it. There you go, guys. There you go. >> Take a picture. >> We took a picture on this YouTube, boy. I mean, I'm going let you out of my white speed. >> We made it. Speed. Let's go. Let's go. >> Speed. >> Yes, sir. Bro, >> you bro speed now. >> Round speed, bro. Love you, bro. >> Love you, bro. >> You just showered. >> My bad. Yeah, sorry, bro. Sorry. >> No, but bro, I'm running on 5 hours of sleep, bro. 60 hour trip. We really in here, bro. Shout out, bro. God did it. Love you, bro. For real. >> Inspiration. >> Brown. Let's go. >> Thank you. This way. >> That's crazy. >> Come on. Hurry up. Come on, y'all. >> Come get stream pictures. Look in the camera. Get some stream pictures. >> Well done, guys. That's it. Thank you. >> All right, y'all. Drive home safe, y'all. Guys, guys, calm down. We got to get done. >> Hey, go. >> Thank you. >> Make sure someone grab the speaker. >> Yo, speed. I love you. >> Oh [ __ ] the speaker. >> Yeah, >> I'll get someone to bring it. All right. >> I'm hungry as [ __ ] You know what I mean? one of these. >> I'm actually hungry again. >> No, me too. I'm hungry as [ __ ] >> I'm very good. >> Where? Where? >> No, I'm saying I could do the one. Thank you, man. >> Such a cool Gavin. >> Such a >> such a cool guy. >> Hey. Hey. >> Thanks, >> Brown Speed. Put it in the back. >> We lagging. >> Where's Wos at? >> We can get stuff at one. Wait, you said you said what? Uh oh. >> All right, Rudy, you should take a shower, bro. >> Yeah. >> Got me. >> I'm hungry, dog. I'm not even going to lie to you. Why the hell am I hungry? Y speed or white speed. Let me get some of them gummy bears. Oh, I'm a gummy bear. Oh, I'm a gummy bear. Oh, I'm a gummy gummy gummy gummy gummy bear. >> All right, I'm about to switch to What? I'm about to go >> GTA. >> GTA. Yeah, now is a good time for that. >> True. Get all five of them. >> I'm hungry as hell. >> What's this up somewhere? >> Waffles. >> Yeah. >> Oh, yeah. All right. >> A thing on the west coast. >> All right. So, I'm connected to >> see that five gifted. >> I think it's a thing in the south. What is it? >> Yeah. >> Yeah. I don't think W off house is in a west coast thingy. >> So, it's a south. >> It's more of a east coast. >> Why you say south? >> East coast is a south. >> Is it? >> Yeah. >> Like Atlanta, Florida. >> Yeah, >> that's the south. >> Atlanta, Florida. Some um >> So why would it be east coast? Don't confuse. >> East coast is that's the east coast. >> So what's the south then? The south is like >> New Orleans, right? >> Yeah, that's the south. >> But that is that east coast or what? I'm confused. I'm trying to understand it. >> That's like part of the east coast. Yeah. >> Like midwest. Midwest. >> Why can't it just be south? >> The south >> just was left. >> Yeah, I know. >> Gas. Has he been around to rush Mount Rushmore? I have. All right, I'm about to get a [ __ ] DTA, man. Let's go. DT is done. You want to switch desktop mic. Oh, mic is on. One sec. One second. One second. One second. A malfunction error. This mic not even on. Yeah, it is on. >> Oh yeah, I could get on with your hair right now. That's why they gassing me up. Head shot 223. Be a baddy rock. Let me take her to the back. She want to look at a head shot 223 bear rock movie scene baby let's turn up in this party. It's the same hitters in the club we blowing up the scene. It's the same boys be turning up. We repping for the D. All my homies play 30s like Steph Curry. But look shorty say she want to blow my whistle like a referee. She been tripping. It's been jealousy. She said just love me please. I do not like this girl so please don't put my neck on her. Please. >> She say she on the same valve. >> Put the gas in the trunk. >> Gas. We short bus, man. You didn't raise that guy, man. >> I didn't see him. >> You needed to get into um head shot 223. >> See you up here. Rex, bro, I'm a hungryest. Bro, it is no food on this bus right now. >> No. That's for change. Got loads of food, >> bro. We got two more days, bro. >> Three more. Wait. say 31 out of 35, >> but it's 12:00. >> Oh, therefore, therefore, that's not mic. >> That's not mic. You're on it. We can't we can't see they can't see your game, but you got to put it on like the projector. All right. Good. Okay. Just making sure. All right, fellas. See you on the flip. >> Good night, boy. Can I get that beef jerky? >> Yo, Rudy, give me that beef jerky. >> Rudy, can you pass me that beef jerky? >> It's in that uh right there. >> Huh? >> Ch, are we delayed? Yes or no? Where's it meant to be, bro? >> Right there. It's the one I just opened. Yeah, that. >> There you go, bro. >> Thank you, brother. We good? Thank you. >> Yo yo yo yo yo. >> Who's that? John Bobby. >> Yo, John, you need to change your clothes, gang. >> Hey. >> Yo, John. >> Yo, bro. Bro, put me down, [ __ ] >> No, no. I'm not kidnapping you. I'm just trying to tell you a funny joke. You want to laugh real quick? >> Picture. Don't worry, >> bro. Put me down. >> John, listen. You know where we are right now? The building, right? Like how you report people here and [ __ ] >> These guys, they've been talking [ __ ] every day. You feel me? Man just caught them lacking. Took their [ __ ] Now they >> Wait, what? >> We just robbed these kids. Took their [ __ ] They keep talking all that [ __ ] Now they in here telling. >> Yo, the [ __ ] said, \"Y'all just took that dumb.\" I ain't going to lie. Y'all [ __ ] took that. >> Hey, bro. Who said that? Who said that? >> But that [ __ ] is on. >> Who's this right here? >> Hey yo, >> this is John Bobby. >> John Bobby. >> Hey yo, >> John. >> Hey y'all see Chester in town. >> Yo yo y got to clear JC. Yo. >> Yeah. Is there are you all making report? If you're not making a report, head out. >> [ __ ] >> Like why am I head busting out here? >> What the [ __ ] is going on? >> We >> What are you doing? We is [ __ ] crazy, bro. >> [ __ ] >> what >> with the Q site right now? >> I'm about to Okay. Yo, gang. >> Head shot. 223. Where the [ __ ] is Cesar? >> Good, Bobby. >> All right, so let's change this fit. >> Hey, look at Bobby. Get it. Go. >> What the [ __ ] is you wearing? Has it? You look crazy. >> He's the He's the [ __ ] [ __ ] right here. >> That's the bully, man. >> Not smoking [ __ ] >> Nah, none of these not there. What a terrible day. Awful. There's so much [ __ ] going on here. >> Is that Chester? >> What's up, John? >> There he is. What the [ __ ] >> You just manhandled him, >> bro. What are you doing? >> He just got kidnapped. >> What are you doing, bro? Yo, put me back. Yo, >> I know. >> Probably smack the [ __ ] out of you, >> bro. What the [ __ ] is wrong with you, [ __ ] Put me down. >> [ __ ] you, [ __ ] >> Oh, God. >> Yeah. Yeah. >> [ __ ] ass [ __ ] Who the [ __ ] you punching like that, little [ __ ] >> Bro, why is you picking me up? >> Damn. >> Who the [ __ ] is this? Kill him. Kill him. Kill him. Kill him. Kill him. Security. Kill his [ __ ] ass. Yep. There you go. There you go. [ __ ] [ __ ] Yeah, just take him in a car. Come in a car. >> That's That's first degree murder, by the way. Just to let you know. >> Um, let's take him to Let's take Bobby to the hospital. >> Like, who is that? >> Uh, he's dead. Yeah. >> Don't worry about it. >> Oh, sorry. Sorry. Sorry. >> No, you're good. You're good. You felt good. >> Hold the Wait, I got to change my fit. No, no, no. This fit has got to go. >> Are you sure? It looks super dope. >> No, no. This got to go, bro. What? Wait. Wait. You like it? >> [ __ ] no. Change that [ __ ] >> All right. >> See, I figured that. Whoa. My god. You got to be kidding me. [ __ ] >> those. These are my Timberlands. Mud. >> [ __ ] big as [ __ ] Mud that dick. >> What? >> We can find out. >> Huh? >> Yo, bro. What's up with you? What's up with you, daddy? >> What's up with you, Zaddy? >> Hola. >> The [ __ ] up. You hear us calling? >> What the [ __ ] >> bro? Hey. Hey. Hey. I don't know what's in the air tonight, but y'all going to have to chill the hell up. >> Who's ghetto? >> Yo, excuse me. Excuse me. >> [ __ ] >> All right. >> Hey yo, can I watch out? You can change the fit you wear. >> Can I get in? >> Yeah, it is. >> General muddy. >> Wagwan. What you telling me? >> Let's see. >> There's too many people in here. Legs are 127. >> That's a good fit job. >> I don't worry about my fashion. >> Yeah. Maybe we can get you a job. >> Oh, hell no. >> Come on, security. [ __ ] it. >> Who is this? >> Security. >> Security, I Does he have a gun? >> Yeah, maybe. I don't know. >> Dude, you have a gun, actually. >> No. >> I got robbed. I got robbed. >> All right, dude. So, you're just [ __ ] useless is what you're trying to tell me. >> I got some big muscles. >> Okay. All right. All right. We're just going to go to the hospital, get some touch-ups and [ __ ] so we don't get knocked out in one [ __ ] punch. >> Yeah, >> I'm 100 hell. I'm I'm going just for you, >> guys. Good. >> Yeah, stay in the car. Don't let anyone take it. If that happens, your whole family's [ __ ] murdered. Do you understand? >> Hold on, hold on, hold on, hold on. Let me get in. >> Tessa, what's the move today, bro? >> I got some [ __ ] I got some [ __ ] lined up. >> Like what? >> Nothing. But we'll figure it out. >> Check in. >> How do I check in? >> Uh, third eye. The guy right here. >> I just did it. >> The hell, bro. I never knew, bro. Ain't no way this was a thing this whole time. >> God damn. You feeling better, John? >> Yeah. >> All right. But [ __ ] dude. Why is my [ __ ] [ __ ] cooked? What's up, baby? >> Uh, wait. I have some for you. >> You have something for me? I didn't get it. I didn't get it. >> I didn't get it. Do you know her? >> I mean, yeah. I probably [ __ ] her or something. Probably a bunch of times. Just don't remember. >> You didn't get it? No, I didn't get it. Just put it on the floor, my heart. >> All right, give me a second. >> All right, bet. >> Come on now. >> Here you go. >> Printer document. >> What did she give you? >> What the [ __ ] Nothing. She didn't give me >> What the [ __ ] >> What did she give you? >> You want to see it? >> No. >> [ __ ] dumb. >> There's too many weird ass girls, man. >> Right. >> Oh, what the [ __ ] This guy's dead. >> Are you breathing? Is okay. >> Oh my god. Are you okay? Is your boyfriend dead? Shocker. >> I don't know. >> Oh my god. Can we pray with you? >> Yes. >> Okay. Lord. Lord, I pray you don't accept him into your gates and send him down to the fiery pits of hell where he deserves to be. >> For no reason. >> Your boyfriend's going to hell. >> Well, because he doesn't seem like a good guy. This actually, you want to know why I said that? Heck, cuz this guy jumped me. Him. Him him and all his buddies. Now look it. Karma's playing her part. >> You're on a crutch. So what is Karma doing for you, [ __ ] >> You know what? Hold on a second, John. >> What? >> [ __ ] it. Your boyfriend's dead. Do you want to be with me instead? >> Damn. >> Yo, [ __ ] you. >> You [ __ ] work. >> Uhoh. >> Oh [ __ ] >> Oh my god. >> He John Bobby, are you marrying this [ __ ] with his fat ass? >> I would never marry that. Weird [ __ ] Are you serious? >> Are you [ __ ] kidding me? >> Is this Ashley and Amber? >> Wait, why? >> Hello. >> My name's Amanda. >> Okay. >> Well, Amanda. Damn. How many A's is it? >> Our cousin. >> So, it's Ashley and Amanda. >> Well, he took so >> No, it's Ashley, Amber, Amanda, Amy, Africa, and >> John. >> Africa. >> Yeah, he's our cousin. He's gay. >> So, So, Amanda, how you doing? I never met you. >> I'm good. And you? >> Oh my god. >> Are you a bop just like the rest of the sisters? >> What the [ __ ] >> Oh. Um, >> good. >> Sure. >> Oh my god. >> Babe, get up. They gave you treatment. >> Okay. Well, >> but I'm actually that [ __ ] for real. >> No, you're not. No, you're not. >> Oh, you want to take it outside or >> Oh, see now you want to now you want to fight cuz I called you out. >> Yeah, I don't I don't take disrespect though. So, do you want to take it outside? >> Okay. Okay. >> Okay, then shut the [ __ ] up like I thought. [ __ ] in fast braids. Yeah, >> sister right here. That's who's here. >> Who's that [ __ ] talking to? >> Oh, is that Amber? >> That's Amber right there. >> I'll give you >> Hey, Amber. Don't beat the [ __ ] out of her, though. >> Hi. >> Long time no see. >> I'm wearing flip flops. When you're >> Why are you dressed up like this? >> Like what? >> Professional. >> No, you're not dressed professionally. Good. >> I'm not dressed professionally. >> No. Why are you Why did you go behind me? What the [ __ ] >> Oh, sh. >> How you been? >> Yeah, I got >> I've been amazing. I've been making I'm actually in a lawsuit right now. >> What happened? >> Well, we're suing the beauty trap for assault. They beat us up while we were getting our Punani wax. >> Yeah. And they stuck dick in the back room. So, >> oh my god. >> I heard that. I heard that and I've been trying to get there to find out for myself, but [ __ ] >> I saw it. Peanut Peanut got it done to him. It was crazy. >> Are they open right now? >> Um, we don't know. >> Actually, wait. Wait. Can you guys help us? We're trying to get like a video like catching them like doing the happy ending. >> Oh, yeah. Yeah. Yeah. >> We can record it. >> Yeah, I'll do that. >> I would love to do that. John, hold on one second. Hold on one second. Let's do it. Let's go do it. Let's go do it. >> Okay. Catch them. We can get it on camera. >> Yeah. Yeah. Let's do that. W >> Please. Yo, John. Bobby, >> where's my car? Oh, it's right here. >> Oh, my bad, girl. >> Yo, Amber, what the [ __ ] >> Yo, Bobby, >> [ __ ] watch the [ __ ] >> I don't give a [ __ ] [ __ ] watch where the [ __ ] you're throwing that. >> Good job. >> What? I said good job. >> Yeah, thank you, bro. Appreciate that. >> You're welcome, man. Yeah, no problem. >> No problem at all. >> So, wait, what are we doing? >> Well, we're going to go try to get hand jobs after a massage so we can get them prosecuted. >> Oh, so we got >> basically undercover, >> right? So, we're undercover customers. >> I'm not going to enjoy it at all. >> [ __ ] dude. This is the [ __ ] best job ever. I don't even care if I'm getting paid for it. Okay, we have to be lowkey. We can't just be like, \"Yo, all right. We need head.\" >> Yo, that guy who lost his necklace back. >> They're locked. [Applause] >> I have to call. I have to call. >> They're not locked. I'm in. >> No, he's too >> The guy who lost his necklace. >> He got his necklace back. He did. >> Got his necklace. >> Really? Listen, the only reason you're getting in is because you is because you can't see the [ __ ] door. The door's locked for me. Come on. >> Just a bunch of horseshit, dude. >> Yeah. >> As you wait, where my phone at? >> Yeah, my phone was F1. Got it. >> All right. his neck, but someone did. >> He tried to save his legit. >> All right, let me see where the [ __ ] this [ __ ] is. >> Who? >> Just just a girl, dude. No big deal, >> bro. Yo, bro, all the girls you mess with is like >> they either, bro, like it's either something wrong with them >> or they leave. It's either that and that. >> You want me to call the [ __ ] >> Okay, first of all, first of all, coming from the guy who [ __ ] with the [ __ ] that look like they're in the movie White Chicks, right? You're talking. >> That's what I thought. Let me call this one girl. >> I got a couple females on my phone. >> Hey. Hey, Vad. How you doing? Sweetheart, sweet sweet girl. >> Nothing. I'm just here chilling with uh with John. John Bobby. >> Put it on speaker, bro. >> I have it on speaker, [ __ ] Shut up. Damn. >> Hi, John Bobby. >> Hey, how you doing? >> What's up? >> What you doing? >> It's unlikely. >> We're at this Sasquatch thing about to hunt for some Sasquatches. >> What? >> [ __ ] excuse me. >> Yeah. Look in the sky. >> You make yourself useful and come come to us. Um, I'm I'm trying to win me some money. So, >> till you can buy me that Trackhawk? >> Nah, you're hell no. >> Where's the Sasquatch thing? Where is it? >> Postal 3002. >> What the [ __ ] is Sasquatch, bro? >> They're They're [ __ ] trying to find Sasquatch. Do you want to go? >> What is that? >> They're like uh It's like Bigfoot. >> Oh myoot. What kind of [ __ ] is this, bro? >> It's right here. If you guys I marked it. It's way too >> 5 miles away. >> 5 miles away to see some [ __ ] Sasquatch. >> Is there a lot of girls? >> There's money involved. >> Is there girls? >> Yes. Yes. There's plenty of girls up here. >> Are you guys all in the woods? >> Yes. >> Execution time. We're on the way. >> All right. >> What? >> Just go. Just go. >> You want We don't have to. I can turn around. >> No, I mean, you know what? Just go. You want you want to go chill with [ __ ] Amber? >> No. >> No, just go. Just go. We're going to try to >> try to find a [ __ ] Sasquatch. I guess >> we don't have to go. >> No, just go. Let's find [ __ ] Bigfoot, Chester. Let's try to find Bigfoot. >> Okay, you know what? Yelling at me, yelling at me is not going to be a thing that happens in this car. You can get out and walk. >> Yeah, I'm going to walk four miles. Oh, I almost got in a [ __ ] car accident. Yo, make sure you have your seatelt on cuz you have a your your seat belt's on. >> Okay, I was just Yo, security guy, make sure you take yours off. >> Oh, really? Okay, just if you I'll stop. No, did I just stop? >> No, you're good. >> I'm just kidding. Security guy, don't get out. Don't get out. You're You're cool. You're cool. >> Okay. >> I used to not like you cuz of the >> I literally met you. I have the best outfit in the city. Don't even [ __ ] talk about it, [ __ ] >> Go ahead. Jump out for me, please. >> We going all the way across, bro. >> You just told me to. >> Are you [ __ ] Hold on a second. You just told me to. >> Yeah, I know. But you driving hella slow. >> I'm at max speed right now. What are you talking about? >> Oh, yeah, you are. No, you know what? No, we only got like one mile left. >> Actually, 2.62 actually. Don't worry, we're going to be there soon. We're going to You know what, dude? What if we actually find Bigfoot? >> What do we do to it? >> Punch him in his [ __ ] throat. Cut his arms and legs off and bring it to a pawn shop. Imagine the bread we can get for that [ __ ] >> Excuse me. What did you just say? >> Nothing. >> No, no, no. Say it again. >> Imagine we drive all the way this long and it ain't no girls here. >> There's going to be girls here. She wouldn't say there's girls here if there's no girls here. >> I mean, we can just [ __ ] him. >> What? >> Excuse. This is >> Wait, what am I talking about? What the [ __ ] did you say? >> That's what I'm saying. >> Say why? Why say it twice? Both times under your breath, but not say it again when you know you're going to end up saying it again when we're least expecting it. So, just say it. Did you say [ __ ] Bigfoot? >> Yeah. >> Okay. >> Oh, no. This dude's weird as hell, bro. >> Yeah. No, that's a super weird ide. I mean, how do you know that's not going to be good? >> Wait, is that Bigfoot? >> Is that Big? I think I think that's a cat. All right, we're almost there. Holy [ __ ] >> bro. We're like, bro, what is the bit rate going to be down here? [ __ ] >> The bit rate 500. We're cooked. >> The car dies, we're cooked, too. >> Holy [ __ ] Chester, can you drive? >> I That's what I'm doing. In the driver's seat of the [ __ ] car, douchebag. Hold on. >> Okay. >> All right. So, they should be over here. Oh, >> where are you at? >> Is that Bigfoot? >> What the hell? >> That is Bigfoot. Wait, let me >> look at me now. I'm starting to stop. >> Yo, Bigfoot, I want to punk the [ __ ] out of you, >> bro. Get him. >> Wait, are you Bigfoot? >> Yes, we're big. But where's that squatch? >> See, Chester, I told you. >> I told you. >> Chester, >> what the [ __ ] is this, Chester? Get >> behind his ass. Get behind his ass, Chester. >> You want to [ __ ] me too? What? >> I mean, I'm thinking you with me. All right. >> No, no, no, no. Put me down. Put me down. Put me down. >> Put me down. Put me down. >> You're going to [ __ ] this squatch [ __ ] Okay. >> No. No. Put me down. >> You might see some balls hanging, but don't worry about it. All right. >> No. No. No. Put me down. Put me down. Put me down. Put me down. >> Take off your [ __ ] pants right now. >> I I don't know how to do that. >> Did you just try to [ __ ] punch me? >> No. Put me down. >> Did you just try to say please? >> Please put me down. >> Say, daddy. Tester, the [ __ ] are you? >> Thank you, Tester. >> Huh? If you're gonna [ __ ] anyone, you're gonna [ __ ] me. >> What? >> No, >> I I'm sorry. That was It was like I was just trying to like >> Chester. Chester. It's Jeffrey. It's me, Jeffrey. >> Oh, Jeffrey. What's up, man? Who's Jeffrey? >> It's Jeffrey Dmer. Who's your friend? Chester. >> Jeffrey Dmer. >> I think it's the skin complexion he's attracted to. >> Oh, it's John Bobby. >> John Bobby. You remember me, Jeffrey? >> Yeah, a little bit. Listen, I'mma keep it a ban with you. I haven't had ass in a little while. So, John Bobby, come on. You going to have to come up off them them pants. I ain't going to lie. >> Okay, hold on a second. John, you know what? >> Listen, listen, listen, Chester, I done [ __ ] Johnny. His [ __ ] was pretty all right. I haven't [ __ ] you yet. Your friend right here, >> I'm trash. Don't worry about me. >> You're trash. All right, [ __ ] it. Uh, so what's up? Like you you wanna you feel what I'm saying? >> Yo, Bigfoot, listen here. I'm not [ __ ] nobody. >> He's built like Henry, huh? >> Yo, that is Jeffrey Dmer. >> Yep. So, uh, you throwing ass or what? >> All right, man. Follow me. I got you. >> Here we go. Perfect. >> Hey, real quick before we start. >> Yeah. Uh, if you tried to hit me, I do have a scop on me and I will cut the [ __ ] out of you. All right. >> All right. Never mind. >> What happened? >> No, >> he said never mind. >> Yeah, I said never mind. >> Yeah, I don't know. I think he got cold feet. Yeah, I don't know. >> Never mind. >> You know what I You know what I got, dude? >> You know what I I got a hot dig? >> I got hot hands, dog. Right there, [ __ ] Oh, >> all on camera, too. Isn't that >> Oh, [ __ ] >> Yo, can you look at my message? >> Then if you just say stupid. >> And then we're like, okay, hang on a second. Okay, we're here. And then we're like, hey, calls, calls. And then we're waiting for you. >> And then I'll just >> All right. Uh, maybe we uh >> reschedu. Yeah. Get >> up next. >> I'll see you later. >> You will get followed. >> Okay. All right. All right. Um, >> so they didn't even do the Sasquatch hunt yet. So, do you want to stay or do you want to go back to the city? >> Let me see what the girls look like. Hold on. >> Over here. Yeah. Yeah. Oh, yeah. Maybe don't get out of a car when it's moving. Probably. >> Maybe park the damn car and stop twisting it. >> Got you, dude. No problem. Oh my god. >> [ __ ] drop kick your ass. >> So you guys are looking for Bigfoot. >> Yeah. >> So for each one that you find, you get 20k. There's four of them. So no one can win up to 80k. >> So are we going in groups or tag teaming? What are we doing? >> It's every man for himself. >> Yeah, but you got to survive by yourself. >> Wait, hold on. Survive. I thought we were finding them. What do you mean? >> Yeah, they're going to Well, yeah, you can find >> What? You don't think they punched back on me? Come on. >> Are they going to try to kill us? >> Yeah. >> They're going to fight back, but they won't kill you. >> Wait. >> Yo, who put Yo, wait about who put her in charge. >> She's hosting the event, stupid. >> You got a power. >> You're pregnant, baby. You should probably go do breathing exercises. >> Okay. >> Look, I'm not going to lie to you. If that [ __ ] Sasquatch swings on me, I'm pulling out the Glock on him straight up. >> Not going to win. >> What if the Sasquatch finds you and rips that baby out of your [ __ ] >> What? >> What the [ __ ] You're good. >> Okay. No, I'm not. I'll breathe over here. >> If you don't find them by the time the sun comes up, they win the 20k. >> All right. >> So, start now. >> That [ __ ] ass thing I stole a gun from, too. >> It's not the easiest. >> Well, Chester, let's go. Let's find Bigfoot. >> Are we going to look? Are we going to look for it? >> Yeah, for like a couple minutes. Nah, let's just >> All right. >> Yo, John Bobby, >> what? >> How you doing, bro? Bro, I don't [ __ ] with you, bro. Stop. Yo yo yo, >> why? >> Cuz you picked me up while I was changing my clothes. >> That wasn't me. That, bro. That was a different person. >> That was you. >> Where do we go? >> Oh, I see one. >> Where? >> What? >> I suck my dick. >> Oh, yeah. >> What the [ __ ] >> Oh, chill. Chill. >> Sorry, sir. Are we going to fight or [ __ ] >> Yeah, I don't know what the [ __ ] we're doing, bro. We should just take the car. >> Yeah, let's just take the car. >> Let's just cheat. >> Yeah, we're going to cheat the [ __ ] out of this [ __ ] >> Yeah, >> we'll find this [ __ ] right now. Kill him. Chop his head off. Bring it back. We'll get paid for that. >> I'm excited. Okay, maybe I got to find a different way up, actually. >> So, you're going to Yeah. You know what? I think we should just go back into the city. >> Should we go Should we go back to the city? >> Yeah, let's just go back to the city. >> Let's go back. Let's go back to the city. I'll have some girls ready for for us. Yeah, you're right. >> You know what? Let me just call a girl. You suck at this. >> Yeah, go ahead. Call a girl. I'm going to just focus on driving real quick. >> What girls do I have in my number? Her >> probably none. I just killed a bird. Let's see. >> [ __ ] see one. >> Where? >> Oh my god. Put your seat belts on. Yeah, I think I see one. He's [ __ ] Oh no, that's a car. >> If we lose this car, we're [ __ ] Like there's no cars in here. >> No, I know. Yeah, I know. Let's go back to the city. [ __ ] this [ __ ] >> Oh my god. Do I have any other girls numbers? >> You're calling. >> Oh my god. Let me call a girl. You're so [ __ ] >> I don't have any other girls numbers, bro. probably [ __ ] with you. The only girl I um introduced you to probably >> No, buddy. I have more than just seed, bro. >> Let me see. >> I think she's not in city right now. Gloriana maybe. Is she here? [ __ ] She's just like so she's just I don't know what she's saying. She's always Oh, look at the deer. [Laughter] killed the [ __ ] out of him. All right. Um Oh, I'm about to call this girl named Betty. >> Betty? >> Yep. >> She sounds hot. >> Uh where is she? >> Ah, don't worry. Don't worry. >> What the [ __ ] Wait, I think I blocked all the girls I'm trying to call. >> Well, that that that would be that would be an issue right there. Oh, [ __ ] >> Who the hell? Why not? >> Oh, dude. I might have to call Amber, dude. >> Amber? >> Not even here. Amber's not even here. What the [ __ ] >> Amber's not here. >> No, she's not. >> Oh, she saw you guys and she blocked like I'm out of here. >> She blocked you. Let me call her. She blocked me. >> Yo, Amber, what's good? >> What? >> Where you at right now? >> 6 1 3 5 >> All right. She just sent me the address. >> No, she didn't. >> Yeah, I'm outside way point. >> What? >> Amber doesn't [ __ ] with you anymore, bro. I mean, I don't I don't I don't care, but it's just like it's kind of [ __ ] crazy. >> If anything, we can go over to the hood. I think there's some gang members over there. >> Why are we Okay. Why are we going Why? Because let's let's Okay, let's look at the facts. We're not good with the ladies, especially you, >> right? No. And I don't know. Okay. >> And gang activity seems fun. If anything, we just wait at the hospital. Girls show up. We We get them while they're like going through like broken bones and [ __ ] so they're all like depressed. It's easier to like >> Yeah. And they can't run, so he just can't. >> Okay. You know what? Hold on a second. Back there, buddy. Okay. >> I'm sorry. >> Yo, whoever this dude in the the uh the back, he's weird as hell, bro. >> This guy's really weird. >> Yeah. No, you Yeah, dude. You suck, actually. Hold on. You suck. [ __ ] you. >> I just [ __ ] Bigfoot. What are you talking about? I'm not weird. >> No, he's lowkey not weird to be honest. Oh, Amber's calling me. Amber's calling me. No, she's not. I swear to God. >> Put on a speaker. >> Hey, Amber. >> Hello. >> Whoa. >> [ __ ] >> Hey, babe. How you doing? >> Whoa. >> Good. How are you? >> Wait, is that Amber? >> Yes, it's me. What are you talking about? >> Oh, you sound a little different. >> Not good. >> Sorry. My fault. Sorry. >> Where you at? >> Um, I'm by the uh Where the [ __ ] am I? >> The [ __ ] is you talking about? >> Oh, >> gym. >> Gym. >> We're on the way. We're on the way. >> Coming. Okay. >> Yeah. >> All right. >> Okay. Bye. >> Yo, I might do it today. I might do it today. Chester, >> do what? Do Amber >> propose? >> Yeah. >> Oh, [ __ ] no. Good luck with that. >> Don't do it. >> Oh my god. John, are you seriously proposing on my [ __ ] guy? My [ __ ] >> Like, dude, come on. You want that, dude? I could do that. >> No. >> Okay. All right, >> guys. I'm going to go get a car. This car is almost um out of >> Please do something. Yeah. >> Do something useless. Yeah. I'm going to do something useless. >> Don't even know your directions, dumb ass. >> Chat, do chat. Do I propose to her? >> Wait, what? Do it. They say April Fool's after. Where the [ __ ] did Chester go? Chester. >> Yo, John. Yo, >> where'd you go? >> Do Do you mind spotting me real quick? >> Can you see me? >> I can't even see you. >> You can't see me? >> No. >> What the [ __ ] Okay, run outside and come back in. Come here. >> I'mma do it and say April Fool's after. >> All right, turn. Can you see me? >> Yeah, I can see you now. >> What about now? >> I can't see you. No. No, >> you can't see me. >> I swear to God I can. >> Oh, [ __ ] Okay, I think I think I have I think I have to bring her to you. >> You're not going to be able to see her. >> What? Why? Wait, Amber's calling me. >> Two cops. >> Hey, Amber. >> She's not even in there. >> Where are you? >> I fell. >> You what? >> I'm stuck in the subway. >> She's stuck in a subway. >> I don't know what to do. >> Are you What? >> She said she's stuck in a subway. I don't know what to She said she said she's coming over here. >> No, she said >> you want to Hey, wait, wait, wait. Maybe let me uh pretend I'm Amber and then like we'll like I'll do like the whole proposal thing, you know? >> All right, bet. >> Um, so Amber, like I feel like me and you has been like connecting with each other for so long, you know? >> Yeah. >> And I feel like us being friends is not the only thing that I want. >> Yeah. And I just want to say I just want to ask you, >> Amber, would you marry me? >> Oh my god, John. Bobby, are you serious? >> Yes, I am serious. >> You want to be with me? >> Yes. >> Oh my god. Yes. Of course. >> Yes. Yes. >> Yeah, dude. That's going to go pretty good. >> Are you talking about >> You shut the [ __ ] up in there, piece of [ __ ] >> Yeah. You just, bro, you know, you just rob us and be our security. All right. Please, >> Chad, >> you know you can do Hey, >> I think Amber's going to fall for it. >> What? >> You know, if you do T/ E space propose, you'll get on one knee. >> Really? Really? >> Yeah, dude. I always do it. That's how I get my girlfriends. See? >> Oh, how do you do it so quick, though? >> Yes, Desert. Yes. >> Remember what we said about shutting the [ __ ] up? Do you remember that the conversation just a second ago? Yeah. >> Oh, it worked. Yeah, it does work. >> Oh [ __ ] Okay, I'm ready to do it. You ready? >> Where she's at? >> I mean, it's not my uh I don't know. Call her back. See where she is. >> God. Let me call her back. >> What the [ __ ] is she doing, my guy? >> I don't know. Your call has been forwarded to an automatic. >> Is she not answering? >> Bro, she's cheating on you. She's cheating on me. >> She's cheating on you. >> She's [ __ ] cheating. >> That's That's obviously That's what's happening. So, I think you should act on that and you should cheat back. >> All right. Well, >> oh, wait. She's coming. Wait. >> Where? >> Oh, watch out. Watch out. Jesus Christ. >> Are you okay? >> This [ __ ] >> It's all right, dude. a car hit you. It's not like >> Wait, what? What the? Okay. Okay. That's maybe why we don't stand in the street. We should probably just stay on the sidewalk. >> Yeah. >> She says she's stuck in a subway. Let's go to the subway. >> I don't know where the [ __ ] this No, she's stuck in like Don't worry, she'll be here. She's stuck in some [ __ ] [ __ ] right now. >> What the hell? Oh, Amber's calling me. Amber's calling me. Amber's calling me. >> All right. Bet. >> Amber, where are you? >> I just got out. I'm I'm coming right now. I was stuck. >> Okay. >> Okay. Come to the gym. You're >> at the gym, right? Okay. Okay. I'm coming. I'm coming. All right, baby. All right, baby. Huh? >> So, Chester, this might be my first time getting married, man. >> I'm kind of nervous. >> Might be. Or or maybe you won't end up getting married cuz either she'll say no or you'll die. >> What do you mean die? >> I don't know. Just all that's I'm just putting everything on the table so you're ready for it. Expect the unexpected, dog. >> What? What the [ __ ] are you talking about? >> I don't know, dude. I just don't want to see you get your heart broken. You know what I mean? I care about you, man. So, Wait. And then >> Wait, do you Wait, do you think I just say April Fools after or like go like >> I mean maybe you say like maybe you say like September fools or something? >> Yeah, you're right. You're right. >> But no, dude. Whatever. >> Wait, wait, wait. >> Yo, remember shutting the [ __ ] up? That thing we were talking about again. It's It's still We're still on that. We're still in that in that thing. >> It's all good. You Yeah, it's all good though. >> That's what I said. Hi. It's odd. Yo, Chester, can you take me and Amber somewhere? >> Uh, somewhere somewhere. >> Yeah. Yeah. >> Somewhere private. This is like hot. >> No, no, no. Like somewhere, you know, bro. >> Like you guys want to drink wine together? Yeah. >> Yeah. >> Yeah. Of course. >> Driver, you can just follow us. Driver. >> Jesus Christ. You couldn't Why are you You're wearing a PNG dress. I can [ __ ] Never mind. >> Okay. Where are we going? I don't want to do it today. >> Why is he honking at me? >> Hello. >> The guy behind I hate that [ __ ] guy. >> Yeah, me too. >> I honestly don't like that guy neither. >> Why is he Hold on a second. What's up? Yo, what's up? >> Nothing. I'm just, you know, >> remember when I said shut the [ __ ] up? It goes for the car, too. So, Amber, how is the subway? >> Wait, Amber, I have a question. >> Why the [ __ ] you don't have my number? Say >> well, how would you know that? >> Don't worry about that. >> Okay. >> Wow. So, that's So, so that's what we're doing. >> No, because No. Do you remember the first day I told you I needed your number >> and I gave you my number? And I gave you my number. >> Okay, I'll save it right now. I'm going to save it under something cute. So you couldn't So you couldn't even take the time and say my number? >> No. My sister like lost her phone. She had to get a new one. She like lost like half of her contacts. Like >> Oh man, I wasn't [ __ ] talking to you. >> Oh god. Oh god. >> I don't give a [ __ ] >> Stay on business, King. >> This is a private relationship conversation. >> Don't worry, I'll Who the [ __ ] is that guy? >> Oh, that's our driver. Yo, >> before you even say anything, remember to shut Yep. See what I'm saying? Just shut the [ __ ] up instead. All right. dude. >> Amber, >> Amber, what's >> that? >> Come here. >> Okay. What's up? >> Listen. >> Whoa, whoa, whoa, whoa, whoa, whoa. You just >> I've been thinking about me and your relationship, and I wanted to move past that. I think every time I look at you, every time like just turn around. >> Turn around. >> Yeah. Like everything like every time we come together, we have fun. We make we make moments that we like would never forget. >> Oh my god. >> And I think at this moment I don't want to be friends anymore. >> What? So >> So I'm going to ask you, Amber, would you marry me? Oh my god. Yes, I'll marry you. >> April fools. >> Oh [ __ ] >> I'm going to [ __ ] up. >> Hey, [ __ ] you up. >> Relax. Don't stop. >> No. Relax. Relax. >> Holy [ __ ] What the [ __ ] What the [ __ ] I [ __ ] you, [ __ ] >> What the [ __ ] >> Damn. I just knocked you [ __ ] out quick as [ __ ] Holy [ __ ] Fix your faces, dirty [ __ ] Oh my. John, are you okay? >> No, I'm not. >> What the [ __ ] How? How did that go so south? >> Why hit? What the [ __ ] is happen? >> Yo, remember remember even though there was a traumatic event, I still need you to shut the [ __ ] up. >> [ __ ] >> She just started going in at me. >> What did you even say? >> I said, \"Would you marry me?\" >> He's alive. >> What did What did she say? >> She said yes. >> She's going to run you over. She's going to run you over. She's going to >> Oh, Chester, thank you. life. You just saved my life, Chester. >> Oh, wait. Wait, wait, wait, wait. There's still another chance you died. Hold on, Amber. Hold on, Amber. Amber. >> Amber, relax. >> Amber, took out the security. That's good. Get in the car. Get in the car. Get in the [ __ ] car. >> Get in the car. Oh, [ __ ] He locked the car. I [ __ ] Jump on the car. >> Oh. Oh [ __ ] >> Amber, relax. >> Oh, John. Oh, God. >> Amber, I'm okay. Hold on. Hold on. >> Amber killed me. [ __ ] Go [ __ ] [ __ ] >> get security. Remember security. So shut the [ __ ] up. You're still shut. EMS me. EMS. >> EMS. EMS. EMS. >> Come on, John. >> [ __ ] >> Yo, she's mad. >> Holy [ __ ] Security. What was that? >> Can I talk? >> No. Shut the [ __ ] up. >> Neighbor lost it. Oh my god, >> I seriously lost it. >> Okay, well, so little quick recap. That didn't go too well. But on the bright side, >> the [ __ ] up, [ __ ] >> Never mind. No new No bright side now. No bright side. >> She's stuck. She stuck. >> [ __ ] car. >> Can you [ __ ] What are you doing? >> I'm trying to run over. >> No, that's not your job is to slide. Your job is to drive, dude. >> Holy [ __ ] Hey, just take me to the EM I'm getting a phone call. Who the [ __ ] >> Yo, what's up, man? >> If you don't have >> Yo, Chester, >> what's up? >> How you doing, bro? Where you at right now? >> Um, we're all We all just died in a car accident. It sucks. >> All right, that should You know where the hospital is, dick? I mean, sorry. I got to be nicer to you. >> Please shut the [ __ ] up. Oh, >> yo, I I I need to fix my They can't even hear me. I'm dead. >> Okay. Anyways, so the proposal didn't go too well. I'm trying to think of like the bright side of that. That was awful. Yeah, that was bad. Take a right. Yeah, there you go. There you go. >> Oh, he probably said April Fools is what he said. That's probably what he said. That dumbass. Oh god. They're going to have to. All right. All right. Yo yo yo. >> That's the only way. >> Yo, remember >> remember guy day? Come on, John. I got you. >> Investment to get the uh to get the >> Oh my god. No. No. No. No. No. No. No. No. No. Not Anita. No. Please. >> I can't believe he would do some [ __ ] like that. >> Amber, are you okay? Are you okay, Amber? Amber. Amber. Amber. Amber. He was What did he Did he say? April fools. >> He said April [ __ ] fool. >> He has a trick. That's his >> Now he has to die. He doesn't want me. He has to die. >> No. No. [ __ ] up. >> I'll be in the car. Amber, >> it's probably because you [ __ ] are built like Kawhi letter. That's probably why he doesn't want you. >> What the [ __ ] is going on? I was getting [ __ ] by Peanut. >> What? >> What the [ __ ] >> All right. >> Yo, man. Can I get a patch, please? >> Amber. Amber, come back. >> Hey, Anita. How are you? >> Hey, baby. I just want to say like >> this is my >> Oh my god. Chester, your baby mama looks way better. Anita. >> Yeah. I need to get a bandage. >> Oh god, this is so [ __ ] up. Can I please have a bandage? Your baby mother looks way better. >> Get the [ __ ] over here. >> Can I get out? What the [ __ ] >> Is that your boyfriend anymore? >> No, I broke up with him. I broke up with Please don't break up. He didn't break up. No, don't break up with him. Please be with him. >> He broke up. Listen, baby. He's just playing my main >> Bobby [ __ ] proposed to me. Then he said April [ __ ] >> Yeah. And I hit him with a [ __ ] D. Why would you do that Bobby? >> Heymber Pictur, you know I love you. Don't walk away from me. >> Sick of that [ __ ] picture. >> Don't walk away from you. >> Don't walk away from me. >> You don't like that picture? >> How could you do something like that? Like how could you do something like that? >> Because Chester told Chester told me to do it. I I really wanted to marry you, but Chester told me he was like, \"No, don't marry her. She's a whore.\" >> I said, \"What?\" >> So Chester, you were the one that did that? Yes. Uh, yeah. >> Sure. I'm >> so [ __ ] happy do that. Why do you keep You came into the clothes store, you fought us, and now you're >> Oh my god. Why are you riding your sister's [ __ ] so hard for just [ __ ] twin? >> Oh my god. Oh my god. >> I can't believe you. >> You guys can have your conversation. >> I'm sorry. I'm sorry. Again, Chester put me up to it. I really wanted to marry. I really wanted to. >> So then, how do you even feel about me? What do you feel? I mean, >> I feel great about you. Seriously. >> So, then why do you treat me like shot? >> I don't I don't mean to in a >> I don't mean to do that. You know, I like I think I treat you well, but >> Are you looking at my ass and my titties? >> No, I'm not. >> Bobby, yes, you are. John Bobby, you're looking at my ass. >> No, I'm not. John Bobby is not focused on that. John Bobby is focused on what's going on right now. >> Okay. So, tell me the truth. >> What do you want to know? >> When I started doing that, I was like, >> \"Do you want me or do you not?\" >> Listen, I want you, but >> I just don't trust you. >> I don't trust you either. I thought you were [ __ ] Abua. Abua told me that you were with her. >> Who is Abua? Who the hell is that? >> The old the old grandma. Hey, I don't even know who the hell that is. >> She's lying. >> Yes, she's lying. >> I'm a Portuguese world explorer. John Bobby. >> So then why don't you want to explore me? >> I mean, >> baby, >> I do want to explore you. >> What are you doing? >> So then you got to treat me better. I don't get it. >> Okay. I >> hospital. I want to introduce you to my friend. I'll treat you way better. >> You will? >> Yeah, I will. >> You know what? >> Okay. Okay. >> Let's hug it out. Let's hug it out. >> You want a hug? Okay. Let's hug it out. Hug it out. >> Amber, I'm >> That [ __ ] is so fat. Sorry. I'm not I'm I know. I'm sorry. I'm sorry. It's okay. It's okay. It's >> Don't be [ __ ] saying that [ __ ] as I'm tech hugging her. You >> know, you're gripping that [ __ ] Holy [ __ ] Oh, I'm jealous. Hey, wait. My wife's coming. You're going to meet her for the first Yeah, she's right here. >> Where? I want to meet your wife. >> Baby, over here, you dumb [ __ ] Turn around. I'm over here. >> Yo, don't talk to your wife like that. >> What? Do you have a crush on her, dude? >> Hey, baby. This is my friend John. John, this is Whitney, my wife. >> Where's my sister at? >> Hi, John. >> Who's this? >> Ew. Chester, this is your wife. E. >> Okay, hold on a Okay, John. Really? Whatever you >> What the hell is that? Chester. >> Okay, hold on one second. Come here real quick. Real quick. >> Yo, you can do better, bro. >> Okay, coming for Look what you're wearing first. Look what the [ __ ] you're wearing. >> I got a good fit, man. >> You You have a dress shirt, leggings, and [ __ ] flip-flop. >> Do you enjoy that? >> What kind of fit are you wearing? >> Yeah, it's fun. >> Hey, John Bobby does not care about them. It's just, you know, it's like a good >> All right, listen. Just be nice to her, okay? Or else I'm going to [ __ ] kill your wife, okay? So, >> why you going to kill my >> What? It's going to kill you to be nice. Just Hey, >> your two girls are getting into it, Anita and that girl. They're about to fight over you. >> Oh my god. >> How you get down, girl? >> Watch this. You actually missed you. I'm not going to lie. How you been? >> I've missed you, too. I'm happy with your voice. You guys are sister wives? >> Yeah, not really. I don't get no action though because you know Chester's little >> Wait, Chester, you have your wife and your baby mother right next to each other. >> E, get the [ __ ] off of me. >> She's not my baby mother. She's not my baby. She's not my baby. >> Yes, I'm pregnant with this baby. >> I wish you guys would not be dressed as [ __ ] >> Guess what? I lost one of the babies. Yes, Penny wasn't there for me. >> Thank god. Sorry. Ah, he read me over. >> That's less child support for me. >> Damn. Double homicide. >> I wish I wish you were never the baby father. Like I wish I never chose you. >> Yeah. >> I hate love. >> I hate love. >> Yeah. You also hate soap. >> That does. >> Mhm. Yeah. >> Well, Tester, would you ever, you know, marry Manita? >> Uh, no. No, actually. No, actually, I wouldn't. I'd rather I'd rather slam my foot. >> We should go to couples therapy. >> Yes, I think that's a great idea. >> Wow, that's a good idea. You know what else we should do? >> What we could do is not do that and maybe Anita dies or something. >> Oh my god, you guys could work this out with like a a therapist. >> Okay, first of all, there's there's too many women here not to be sucking dick. So, let's let's figure out what the [ __ ] going on. >> Get him. >> What the [ __ ] >> I'm sorry, Emma. I almost got on my knees. All right. >> Oh [ __ ] >> Hot out of town. What the [ __ ] >> You do you want to do a therapy session? >> Sure. Yeah, we can go do therapy. >> Who the [ __ ] is this Albert Einstein? Let's go. >> What are you talking about, bro? >> Going to do therapy. >> Hey, I'm really I'm really about that. >> Your baby mama. >> You're not about [ __ ] but about chemist chemistry and neurology. >> What? Bro, I don't think you realize who you're talking to. >> You're a [ __ ] nerd. I'm really someone's getting burnt. >> Hey John, we're going to uh Anita's house to do therapy or something. >> All right, >> Anita, why are we going to Anita house? >> Oh, you're going to love her house. It's huge. >> Okay, before that, I just have one question. Anita, um are you okay? What's going on with the hair loss? >> Um I'm just very stressed out cuz my dad is not there for me. So your baby daddy are coming off. >> I'm sorry. I just thought it was every sign of syphilis, right? >> All right, everyone. Everyone, we can't all get in this one, can we? >> Come here, Whitney. All right, I'll see you. >> We're just going to have to do a bunch of caring, you strong [ __ ] >> Ashley, you're here. >> Get in the car. >> We're having a therapy session. >> We're going to go to therapy. >> Okay, get in, sister. >> Okay, let me mark my house. >> Get in the car. >> What the hell is >> All right. Yeah, go go go to the marked location, man. >> Okay. >> Yeah. Um, guys, I do like have like a Japanese style home. So, >> you do smell like [ __ ] Can you scoot over something, please? >> Where am I supposed to scoot out the car? >> Oh my god. What the [ __ ] is that? >> Don't be mad cuz I rejected you in my pants. >> Actually, I'm sorry. I didn't want to be with you. >> Anita, did you [ __ ] yourself? >> I think I always [ __ ] her pants, bro. >> I'm sorry. Okay. >> God damn. That shit's starting to get annoying now. >> I'm sorry. I just >> What do you mean? >> Oh my god. >> Anita, get in the [ __ ] trunk, [ __ ] >> No, >> we're already here. At least all the windows are broken. Take a right. Take a right. Take a right. >> To the right. Nope. That's a left. Godamn. What the [ __ ] is wrong with you? >> The gated community. >> It's the gated community in front of us. >> That's where I live. >> What? >> You live Wait, you live in a homeless shelter? >> Yeah. Just Just parked here. What the [ __ ] is that? >> This is really really >> Is this the house? >> Is this your house? >> There's literally a homeless shelter down the street. What are you doing here? >> All right, Chester, why are you not helping Anita out, bro? >> [ __ ] are you good? >> What the [ __ ] >> Take off your shoes, please. I don't like shoes in my house. Please. >> No, I'm not taking I'm not taking off my shoes cuz I'm going to step I'm going to step on needles and [ __ ] >> Can we go to Michael's house or something? >> Oh my god, they broke down your gate. They broke down your gate. >> Therapy here? >> Yeah. Well, >> you staring at my sister's ass. >> Does anyone else? >> This is where you want to do therapy. >> I feel like therapy should be the >> I feel like you should shut the hell up. >> I feel like you should hit me. >> Hit you. >> Wait, how do we get inside? No. I'm sorry. >> How the [ __ ] we get outside? I don't want to be here. >> Should have went to Michael's house. This is kind of >> anywhere but here. Yo, Anita, why you Anita, why are you not helping out your Yo yo yo yo, Chester, Chester, >> please take off your shoes. Don't be my >> Take off your shoes. >> So rude. You guys are rude. >> Oh my god. >> Chester, why you not helping out Anita, bro? What the hell? >> A lot of people are hurting us. You don't have to live like this. >> I'm not touching. No, she Let her Let her live here. >> Here, >> Chester, you got to help out your baby mama. >> She can live with us. Please, please, please, please let me live with you guys. Okay, so she can live in the basement. >> I would say take a seat, but look around. >> There's a lot of Okay, let's Okay. Okay. I'm going to sit on the wall. I'm just going to I'm just going to sit on this wall. You know, >> I sit smart choice. >> You know, I I am a nice person. >> You know what? This is very fitting for Anita. So, I'm kind of >> Thank you. It matches my aesthetic, right? >> You smell like your surroundings. Okay, let's talk about what you know everything. >> Sorry about your golf. >> So, um my cousin is a therapist. So, >> hi, I'm Amanda. I am a licensed therapist. >> Okay. >> Got my PhD from Everest. Um >> Oh, yeah. So, let's just get down to the nitty-gritty. So, Chester, what is your relationship with Anita? >> Uh barely. >> Barely. >> So, at one point you put your penis inside of her. >> No, I didn't. No, I didn't. No, I didn't. No, no, >> no, no, no, no. That's not how it happened. >> No, no, no. Anita, shut the [ __ ] up. >> So, how did So, how did it happen? >> She stole sperm from him. >> Is that a lie he wants to tell you? Is that the lie? Seriously, that's a lie. >> You told me that your damn self. You have short-term memory loss and don't remember what the [ __ ] you told me. >> It's dementia, >> [ __ ] It's disgusting. >> She pulled all that sugar. All that sugar. Okay, I just want to I just I just want to I just let me miss therapist. Let me just Let me just say it how it is. Okay, she's going to give birth, okay? And the baby's going to come out and I'm not going to take care of it because I feel like I'm I feel like I'm entitled to not take care of the [ __ ] ass kid. >> That's not right. >> What? That's not right. >> Are you serious? >> You don't want to take care of your child from such an ugly ass [ __ ] >> Tester. Tester. Even if even if you don't want the baby, that's your baby. You have to take care cuz that's your towel at the end of the day, bro. >> That's your child. >> That's your child at the end of the day before you know the baby. >> You can't be like that, bro. >> Yeah. Yeah. No. Yeah. Let me let me uh let me just break it down for you guys real quick here. Okay. I was forced into fatherhood. You know what I mean? So, I kind of feel like >> Stop saying that. >> I kind of feel like blessing. >> Really? >> A It was a It was a blessing and it was a curse. Okay. It was a blurse. That's what it was. Okay. And I got to be honest with you guys. I'm not father type. You know, I'm not going to help the little [ __ ] build a volcano. You know what I mean? I'm going to smoke cigarettes around him. That's what I'm going to do. >> Oh my god. >> Okay. So, there's >> Chester, when did you become like that, >> bro? Chester, >> addicted to cigarettes. >> I'm not going to hurt you. >> No. A deadbeat [ __ ] >> Chester, that is your child, bro. >> Listen to me. That is your child. Look. Look at me, bro. >> Look at me, bro. Lock in. Lock in. That is your child. >> Out of time. >> Lock the [ __ ] in. >> Look at Anita, bro. She's like She's looking at you like, \"What the hell?\" >> She's looking at >> [ __ ] crazy. >> Okay, no, you're right. You know what? Maybe I maybe may maybe maybe I could come see it every 5 years or something. >> All right, bro. >> That's a start. >> Yeah, >> right. little little vis $5 a month for a child support or something. >> What? >> You know what? Tell you tell you tell you something better. I'll send it postcards every few years. >> So cute. That's so emotional. >> Hey, so did she really take your sperm? Is that true? >> Yeah, she did. I gave my friend a [ __ ] >> Wait, wait, wait, wait, wait. Okay, we got Chet. >> Anita, what really happened, Anita? >> Oh my god. >> Tell you tell you a truth. Tell >> Anita, I want to hear your side, not Chessa's side. Okay. Okay. >> God's watching. Anita, God is watching. >> So, we were on Love Island and um >> Oh my god. >> Let her toe. Let her toe. >> Yo, Chester, can I ask you something here real quick? >> Remember that shut the [ __ ] up thing we were talking about? Yeah. What's up, >> Love Island? Is she delusional? Like, let her >> I'm not delusional. >> Anita, what happened? on Love Island and basically, you know, me and Chester were spending a lot of time together alone and we got to know each other and he really ended up liking me. So, he told me that would be the cover story, but we really did just fall in love and made love and I got pregnant. >> So, he saw >> So, Tess, you're telling me a whole different story. >> I like how you look and how you told me. He told me he would say this. He told me he would say this. That's what we're doing. We're just going to believe Okay. Yeah. And we're going to believe what she's saying for for what? >> She's a truthful person. >> She has nothing. She has nothing less to lose. >> This baldheaded [ __ ] is not a truthful person. >> Oh, >> okay. Because Jeffrey Jeffrey is is Jeffrey could settle all this cuz Jeffrey knows what happened. I gave him bag of nut as a joke. You know, like pranking my boy like here's a bag of nut. It's funny prank, right? Might be a little odd. >> I do that all the time. He he did a he did a reverse prank and gave it to this [ __ ] knowing she was going to do some crazy [ __ ] with it. Of course, she shoved it inside herself. Did a couple squats and it popped like a firework on the 4th of July and just started manifesting in her [ __ ] uterus and then a bunch couple shitty mutated babies started forming and [ __ ] >> How are you going to be a mother when you can't even shower yourself? >> To show you the right question are you going to raise in this environment? Look around here. That's what I'm saying. This baby let me live here. Your wife said I can live with you guys. Why can't we? >> This baby is going to be born a heroin addict. What do you mean? >> I did offer her a place when we came here. I realized she's damn bad. >> She's not staying at our house. She's not staying at our house. First of all, for two first reason she can't stay at our house is we don't have a house. Second reason she can't stay at her house is because well, we don't have a house. So those are basically the two reasons. >> Bro, >> honestly, Anita, I can't move some connection. Show me how hot that fire is. >> You know what, Nita? You know what, Nita? I'mma step in and be a stepfather. All right. >> Really? >> What? You're going to do what? >> Hallelujah. >> You're going to do what? >> Hallelujah. >> I mean, game over, [ __ ] >> You're going to be a stepfather. >> You're not coming to hang out with us now. You got a stepdaddy, baby daddy. >> I'm here with >> You're going to sit here and be a step to that child, but then do an April Fools for me? Oh, >> no. Amber. No, Amber. Amber, come back. Yeah. No, no, no, no, no. >> [ __ ] Are you serious? >> You know I will die. >> What the [ __ ] my wife? What the [ __ ] is wrong with you? >> Oh my god. >> You know what? Come here. >> Come here, Anita. >> [ __ ] >> I mean, I just run the [ __ ] over the stand. You know what? I'm over this. I'm over this. No. >> No. I'm pregnant. Please. >> No. I'm over this. I'm leaving. >> I don't have a leg in. >> I don't have no leg. You little You lopsed ass girl. I'm sorry. Flip flops. >> Oh my god. >> You got on them same ass them same ass. >> Oh, what's the point? >> Get it out, baby. >> You got them same ass tights you've been wearing for the past. >> Your middle part is parted like the red [ __ ] [ __ ] >> And you're a thigh and you're a [ __ ] You just hit peanut, right? >> That's why I'm single. She got leggings and flip. >> Shut up. >> I don't think this is a girl you want to marry into a family with a bunch of [ __ ] thoughts. >> Oh yeah. Don't Don't >> Excuse me. Unless you need that word. You >> heard what I said about you and your shitty son. >> You know what? You know what? I have a lot to [ __ ] say about you. You are a single man living on the [ __ ] streets trying to be a [ __ ] Tyrone. You are a goddamn thug that won't take care of your kids and you have gorrhea and herpes at the same [ __ ] time. You look like you got beaten with a shovel 20 times and you're going to talk about me and my [ __ ] family. >> Listen, listen. You're just mad because all the plastic you guys are made of can pollute the Atlantic Ocean. Okay. So, all natural. real you. [ __ ] are you talking about? I'm [ __ ] to a [ __ ] alien [ __ ] >> Oh my god. >> I'm tired cuz John Bobby, you sit there and you play with me all the [ __ ] time. [ __ ] game boy. >> I'm not I don't play with you. How do I play with you? >> You're going to take care of Anita's ugliest children. >> No. No. See, look. I'm a man of the world. And if nobody wants to take care of the baby, if Ted want to take care of I take care of the damn baby. >> But what are you gonna do if I got pregnant by him? >> Because we said we wanted to do and you ran away. Now you want to take care of babies out as a uncle. I'll step in as a step. >> What? >> Remember when you ran away when we said child and now you want to take care of this ugly [ __ ] baby? >> Said to do what? >> Don't call me an ugly [ __ ] Okay, I'm going to show you ugly looking. >> Don't talk about her like that. She been through a lot [ __ ] >> You're not going to touch her, though. >> Back your ass back. >> But nobody's going to touch her neither. >> I think you should touch me. >> Anita looks like a Neanderthal. Let's say it how it is. You look like a [ __ ] >> All just calm down. I'm just I'm I'm about to I just Let me breathe. >> I can't take this [ __ ] >> Watch out. >> Is everyone okay? >> I can't [ __ ] take this [ __ ] >> I don't like your wife, bro. She hasn't. How come? >> Why? What did I do to you? >> Because you're allowing Chester to do this to his own baby. >> No, I already told Anita she can come live with me and I'm going to take care of the baby. >> So what's the problem here? >> You [ __ ] cuz you talking about you don't like me. >> Oh [ __ ] >> Girl, can you punch me? I remember now. How about you guys kiss and just kind of make it make it better. >> You want me to kiss your wife? >> Yeah, just kiss her, please. Come on. >> Watch. >> I want you guys I want you guys to be happy. Come on. I don't want you guys to fight. You're so [ __ ] hot. That is so >> me. What happened? What's the problem? >> Yo, driver. >> Oh [ __ ] >> Oh [ __ ] Oh [ __ ] Get in here, driver. Just don't talk though. >> I can't. >> Oh [ __ ] What just happened? >> Can't even drive. >> It's okay. Just watch it happen. Oh god. >> Chester. Chester. Don't. No. Don't hit my wife. Chester. >> Damn. She's going to Oh, [ __ ] >> She's going to get a car and kill us. She's going to get a car and kill us. >> Amber, where you going? >> Amber, just calm down. Amber, >> where's she going? >> She's going to get a car and run us over. That's where she's going. >> All right, let's dodge it. Let's like dodge it at this like the exact time. You ready? >> Okay. I go left, you go right. >> All right. All right. Bet. Get ready. I go right, you go left. >> Yeah. Yeah. Wait. I mean, you want me to I'll go this way and then you go the other way. And then >> I'll go right, you go left. She's getting ready. I can see her. >> Okay. And then Uber driver takes the hit. >> All right. Bye. >> Oh, [ __ ] No. >> Yeah, you take the hit. She's like a little bit. >> Yeah, she might get beat the [ __ ] up to be honest. Hold on. >> Oh, she's getting beat up. >> Oh no, she >> Oh, she Yeah, she's just beat him up. Wait, she's getting beat up. Will you run her over? Like >> that's probably a better idea. >> You ready? I go right. You go left. >> Yeah. >> Like like are we facing this way when you say Okay. Yeah. I got you. >> I'm going to go kill her. >> I mean, >> wait. What? No. >> It's a He's not that tough. He's pretty much a [ __ ] >> You ready? You ready? You ready? You ready? I go right. You go left. >> Like the matrix. >> Oh, she got pul she got pulled out of the car. >> Oh, what is this Uber driver doing? Okay. >> No, it's not. Yeah. Well, it is the Uber driver, too. Yeah, he's definitely Okay, so she got in the car. He got in the driver's seat. >> All right, I'll go right. You go left. You ready? >> Is he going to >> Why are you stealing my car? >> That would have been good, too. That would have been good as [ __ ] >> You know, the Uber driver, you [ __ ] it up. You know what? I don't like you anymore. Get out. Get out. >> I did not even hit you. What are you talking about? I didn't even hit you. I I'll die. I'll die. Just >> you [ __ ] every There you go. >> She's coming. She's coming. It's her time to shine. Come on. Get in position. Position. Position. Right here. Right here. >> Ready. Oh [ __ ] >> Oh, >> [ __ ] you. You want to kill that [ __ ] You want to kill that [ __ ] >> Ready to [ __ ] >> Let's try it again. Let's try it again. Let's try it again. >> Right here. Right here. Right here. Right here. >> Let's try it again. Let's try it again. I go left. I go left. >> Oh god. Oh wait. Wait. Her sisters are coming. Okay. Here we go. Here we go. Here we go. Who's shooting? >> Okay. Wait. I think they just left. >> No, she's coming back. >> Wait, no. She's coming back. She's coming back. >> Go left. >> Here we go. >> Oh my god. Oh god. If I died, I would have pressed >> Yo. >> What the hell? >> About to lay hands on you, kid. >> It's not over my [ __ ] car. >> I'm not getting out. >> We're both going. We're both going. [ __ ] >> bro. [ __ ] [ __ ] [ __ ] Give me this [ __ ] car. >> The [ __ ] NPC, bro. >> Drive off. >> What the [ __ ] Wait, I got to pick up Chester. Holy [ __ ] What just happened? Did his car works? Oh [ __ ] I need a car. Oh, wait. Chester, I got you. [Music] >> I need a car. >> I need a car. Where's the EMS at? Uhoh. I think the wrong person. Where the [ __ ] is the EMS? Well, I think we're [ __ ] Where the hell is it at? I wrong person. Oh, it's this guy. Oh, hell no. All right. Epic fail. I had a big fail. I know. I know. I know. Okay, I have the whole crew now. Where's the EMS at? I don't know where the EMS is at. [Music] Where the [ __ ] is it at y'all? Right here. No, Chester, just wait. [Music] [Music] Damn [Music] at the tallest building. [Music] Where the hell is it at? Wait, where's the hospital at? Guys, we're in trouble. I passed it. God, I'm the worst one to do this. [Music] Is it right here? I found it. Oh my god. >> Tires. >> Oh my god. >> Yo, I'm sorry, Chester. This guy's an idiot. Literally, he doesn't even know how to do anything. >> Shut the [ __ ] up. >> I'm sorry. All I was just trying to help him. Can I take this? >> God, bro, put me down. >> I was trying to help. Stop yelling. Like, I don't even mean [ __ ] kill you. >> Literally trying to help him. >> Where? Chess, are you okay? >> Yeah. No. Yeah, I'm just [ __ ] great, dude. Yeah, it's [ __ ] awesome. That was great. That was a fun time. >> Who's this? Is this grandma's Gloriana? Jess is Gloriana. >> [ __ ] that ass is fat. I don't even give a [ __ ] how old you are. >> I'm sorry. I I failed all of y'all. >> No, you're good, dude. Just remember to shut the [ __ ] up. Let me Let me call my wife. Dude, you really don't like my wife? >> Wait, let me check in, bro. >> All right. All right, I'm back. Chester, >> you okay? >> Yeah, I'm okay. >> All right. But you don't like my wife for real, dude? Oh, I don't like your wife. Your wife gives me like this vibe and I don't like it. >> Vibe? >> Yeah, bro. It's her personality. >> Maybe it's the herpes. That's probably the vibe you're getting. >> You're what? She has herpes. >> Well, I have it. I'm guessing she has it. I haven't told her yet. It's going to be Oh, wait. No. >> What? >> She got tested yesterday. >> What was the result? >> Positive. Well, it was positive for HIV. Let's not get in this car. >> See what you did, Uberman. >> You know what, Uberman? >> Let me get in the car. Then John Bobby gets in the passenger seat and then you don't get in, but you you know you know what to do. >> Wait, >> are you guys about to race? >> Are you guys about to street race? age. >> Why would we be street races? >> I mean, cuz you guys are lined up like a race. >> Shut the [ __ ] up, John Bobby. >> You shut up. >> Shut the [ __ ] up. >> Where the [ __ ] you been at, [ __ ] >> Man, I've been in the city. >> Yeah, we've just been [ __ ] chilling and [ __ ] >> My god, >> what? >> Tester, >> what's up, man? >> Why the [ __ ] they had you in the trunk last night? What the [ __ ] was that, bro? >> They had me in the trunk cuz they were cuz he was pissed. I wasn't clocking into work at the Italian restaurant. I have a basically all it was. >> Bro, what the hell was that? >> You're not really fit for a 9 to five to be honest, bro. >> That's what I'm saying. I'm fit for the gang life, dude. Get me hip. What's up, >> bro? You said that you was going to give me a gun, bro. What happened to that? >> Yo, uh >> I got you. I'm going to get you a gun, bro. >> You suck right now. >> Oh, okay. Yeah, that'd be good. Don't worry, John. We're going to get us a gun and we can go shoot our wives. >> No. Okay. >> Yeah. What this car? What is Hana? Watch out, bro. What's up with you, man? >> Yeah. Yeah. Yeah. Yeah. No, he's alive. >> Huh? English. [Applause] >> The [ __ ] was that? >> Did he say he's a blood? >> You, bro, you need that? >> I don't need that. You need that. >> Yo, John, I think we're going to get a gun. >> Do you need that? >> Yes, we need a gun. We need a gun. >> Are you going to shoot it or do you want me to shoot? >> I ain't going to lie, bro. You speaking all that all that phantomism to you. You don't even understand that [ __ ] bro. Watch out. >> You shoot it. I'm not really a good >> I don't understand that [ __ ] bro. >> Hey, Bobby. Bobby. Bobby. Look to the right. Look to the right. Look to the right. Look to the right. >> What's wrong with you, bro? >> Look there. Look there. >> Come on. Come on. We out. We out. We out. We out. We out. I don't know. Just go there. >> Oh, I remember her. >> Oh, yeah. >> I remember baby. >> What's up? >> I remember you. >> Oh my god. Hey. >> I remember you, my love. >> John Bobby, right? >> Yeah, that's his fourth. You know what? >> I thought y'all were just about to have a little race. I was trying to be like y'all like racing guard lady. >> Now look, I've been wanting to see you for a long time. >> Oh my god. >> I want to ask you something. >> Yes. Yes. Absolutely. >> Do you want to get married? >> Hell yeah. >> April fools. >> Oh, okay. >> That means he doesn't really [ __ ] with you, [ __ ] >> Okay, whatever. Your dick is small anyway. What? Who's mine? >> I'm leaving with my sister. >> That's your sister. >> They're sisters, dude. >> That was a good joke. That was a good joke. >> She really thought >> She really thought she would marry you. Yeah. >> Yeah, she thought. >> I'm not going to lie. You should take what you can get, though, to be honest. >> No, that girl is a Whoa, whoa, whoa, whoa. Waro war. >> A war. >> Yeah, she's a war. >> Oh, >> she's a horse. She's a horse. She's a horse. >> A horse but without the without the s. >> Yeah. >> And with a wh. >> Yeah. Wait. Amber sent me a video. >> Oh. Oh, really? >> Yeah. >> Yeah. Let me know. >> Bro, what the [ __ ] just happened? Did you see this? >> I don't know. >> Now what? >> Why is everything vibrating? >> I don't know what's going on. Are you okay, >> bro? What the [ __ ] is going on? >> I don't know. I don't know what the [ __ ] going on. You tell me. >> Wait, stop. You just took You just took Coke. >> I took Coke. >> Welcome to the life, dog. >> To the what? >> Welcome to the life. >> What the [ __ ] is going on? >> Where did I take? >> I also uh played a prank on you. >> What? >> Here, pull your phone out. >> Yeah. Actually, give me your number first. Like, All right. Now, send me your number. You're going to love this. You're going to love this [ __ ] >> What? When did I take code? >> You just did on accident. It's okay, though. >> Wait, what the [ __ ] Oh, okay. Ready? I'm going to send this to you. >> Send it. >> Okay. I sent that to Amber. >> Wait, where's a Wait, I don't see it. >> Oh, you don't? Okay, let me text it to your phone. Okay. >> You said that the Amber. Stir up the pot a little bit, baby. Let's have some fun. >> What? >> Bro, you said that the Amber. >> Oh, yeah. That's the worst thing. Not kissing my wife in front of her though, right? That that draws the line. >> Oh my god. >> Call her. Just call her. Holy graphics. >> What is sending me? >> I know you want me, so you can come and smack this ass bad boy. Come and get me. >> Oh my god. I need Amber. >> What happened? She sent me a twerking video. >> What? Let me see it. >> No. Okay. >> I know you want me, John Bobby, so you can come and smack. >> Where is she? Where is she? >> I'm going to call her. >> All right. Bet. >> It says use her busy. >> Oh, she's cheating on you. >> What? She's cheating on me. >> Yes, bro. That's literally what that means. >> Wait, what does that mean? >> I don't know. I'm making a phone call. Hey, what's up? How you doing? Where where you at? You're at the mall. All right, bet. I'm going to pull up with my boy. >> Who's your boy? >> Uh, just >> wait. Anita and Oh, [ __ ] Now, >> what? >> She probably pissed because of the picture. Let's go to the mall, though. That's where she is. >> Why is she acting like that, bro? >> Well, it's probably cuz you kissed kissed my wife in front of her and then proposed to another girl. But it's okay. This is this is your time to show how how powerful you are to get back the love of your life. You know, win her back. Show everybody how how much of a good guy you are. >> All right. You know what? I think Amber might really be the one. [Laughter] >> Why do you laugh when I say that? >> Cuz dude, it's just funny. There's just no reason at all. Oh, why are you laughing? You're jealous, Chester. Chester, you're just jealous that Amber looks better than your wife. That's what it is. >> Listen, listen. Amber has three identical sisters that I could that I could get with. I'm not too I'm noted out on the whole >> Yeah, but none of them are like Amber. >> You're right. Yeah, you guys are perfect for each other. You're wearing leggings and she's just a [ __ ] big [ __ ] >> She's not big. She's thick. >> Yeah, thick in the throat. Well, your wife is nothing but a little raspy voice little frog. >> Hold on a second, dude. Hold on. >> Yeah, >> hold on. >> Yeah, like I just don't like how you're just jealous about Amber. Like me and Amber. >> I'm not jealous of Amber. If I was jealous of Amber, I would say I was jealous. I'm jealous. Where? Where is she? >> She's not here. >> The [ __ ] Let me call her back real quick. She doesn't want to talk to you right now, obviously, cuz you broke her heart. But let me see. Let me see what she has to say here. Come on, Amber. Come on, baby. Pick up. Sorry, I didn't mean to call her, baby. She's not answering my phone. I think she's over you. >> Really? No, she can't be over me. Not just yet. >> Here, you try calling. You try calling. >> It says user busy. >> Like, it's crazy. Like, >> she's right there. She's right there. She's right there. >> Amber. Baby. Baby. >> No. Get the [ __ ] away from me, >> baby. No. I'm sorry, baby. Oh, you were just with another girl. You were literally >> No, I wasn't. Chester is just trolling. It's all >> You're with another girl. >> It's all his fault. >> Oh, what's up, guys? I didn't know you guys were here. What's up? Are you guys all right? >> Chester is just doing one of his little pranks again, >> right? You block me with her. >> Unblock me, babe. >> Why would I unblock you? You don't want me. You already You kissed that girl. You kissed that girl in front of me. >> I'm sorry. >> So, does Chester rule your life? Look at me in the eyes. Does Chester rule your [ __ ] life? Are you John Bobby the world explorer or are you [ __ ] Chester's puppet? What's going on? Let me know what's going on. >> I'm John Bobby. That's who I am. >> Okay, so if you're John Bobby, >> over here, >> John Bobby, how do you [ __ ] feel? Cuz you keep telling me Chester did this, Chester did that. >> Because Chester took a picture while I was doing a prank on another female. He's just jealous of me. The same girl that you said you got you were with her. Did Did you [ __ ] her? Be honest. Did you have sex with her? >> No. >> Do you love her? >> No. >> What is it? >> I'm sorry. Just accept my apology. >> How do I know you're not going to do some [ __ ] again? >> I won't. I won't. >> I don't believe you. >> You have to believe me. >> You don't want me for real. Like you you want you want those other girls. >> I don't want the other girls. I think you're the one. Seriously. >> So why did you kiss that girl in front of me? >> Because you know what? That was out of pocket. That was out of line. I don't know why I did it. >> I have to get my lick back. >> Yo, Slips, why the [ __ ] are you streaming this? >> Oh my god. This is crazy. I >> You just have to believe me. Listen. Just believe me. I would have to get my get back. You kiss a person, I get to kiss a person. >> Oh, [ __ ] no. Hell no. Yeah. Yeah. [ __ ] out of here. >> Yep. >> So, you get to kiss on random girl and what? So then what? What? >> It was Chester wife. It wasn't a random girl. >> So maybe she >> So you know she's outside. She just she was just talking [ __ ] to me saying, \"Oh yeah, I kiss your man. I kiss your man.\" >> That's Chester's wife. >> She's She's kidnapped. By the way, he just called me and said that she's kidnapped. But I mean, we're dealing with something right now. I don't want to make that be the primary thing. So, >> chester. >> So, what are you going to do to make it up? What are you going to do to make it up? >> Um, >> he will eat your ass. >> What? >> Shut your [ __ ] mouth. >> Can you [ __ ] go like, bro, who are you, bro? With these damn bow braids. Take your ass up. >> Yes. Security. Henry. Yes. Henry. Henry. Get him. If you call me Henry, I'll kill. >> Wait. So, >> how are you going to make it up? >> All right. I'm going to make it up to I Let's see. What do I have? I'm going to marry you. Oh [ __ ] >> You're not going to fool me a second time. >> No, this isn't the game anymore. >> Are you for real? >> I'm being serious. >> Fool me once, shame on me. Fool me twice, clock my teeth. >> How do I know that you're not lying to me again? >> Amber, my name is John Bobby. I'm a Portuguese road explorer. I came into this town five days ago, and you were always by my side. You always stick up. You always stick up for me. >> Hey, what's going on over here? >> And Amber, I don't have a lot of money, but I do have a heart. And I and and a heart is worth way more than money. So, I just want to ask you, Amber, again, would you marry me? >> Damn. >> [ __ ] you, John Bobby. >> What? >> Boom. Boom. The ratings are going through the sky. WW >> slip. Stop recording. That's my >> I killed that guy by the way. >> Amber. Amber. >> Why are they coming? >> Amber. Amber. Why? No. >> You don't want to be with me. You just want to embarrass me. >> I don't want to embarrass you. I'm I was very serious. >> You're not serious. You don't actually care. You just you kissed another girl in front of me. You've been with every [ __ ] in the city and you keep disrespecting me. You don't want me. >> Amber, I know you keep thinking that. Wait, what is Chester doing? >> Oh my god. >> I'm calling my daughter collagen. >> Yo, what the [ __ ] Yo, my god, my heart is broken. >> He just killed her. >> What the [ __ ] I was about to be the happiest man alive. >> Wait, what just happened? >> Right here. Right here. Right here. Right here. Right here. >> I can't believe that just happened in front of me. >> Wait, what just happened? >> Murder. >> A murder. Wait, who was that? >> Probably her ex-boyfriend. At least I didn't get hurt. That's what really matters. >> Anyways, sorry guys. Yeah, >> go check on my sister. >> Yes, babe. What? >> No. I just want >> Babe. I'm babe now. I'm babe. >> You were always at >> Oh, [ __ ] >> You kissed another [ __ ] in a [ __ ] homeless shelter. >> Oh my god. >> What the [ __ ] >> You want to run [ __ ] over? You want to run [ __ ] over, [ __ ] >> Amber. Oh my god. Thank you so much. Yes. >> Oh my god. I'm getting married. Holy [ __ ] >> You're getting married and my girlfriend just died. Yes, dude. Look it, dude. Count the bless. Oh, [ __ ] yeah. >> Yeah, I like that. >> What? And you get married. >> How did this go? >> It's not fair, bro. >> What's up, man? Are you okay? >> [ __ ] away from me, >> bro. My girlfriend just died and you get married. >> I mean, things could be worse. >> It's okay, sister. I run her lick back. It's okay. >> Wait, Bobby, you want me to kill his [ __ ] now so y'all can be even? >> Hello? Might be a good might be a good play low key. >> Oh, hell no, bro. >> Oh [ __ ] Oh, my bad. >> If you touch me, I guarantee you [ __ ] won't be doing [ __ ] around here. >> [ __ ] we dropped. >> Go get Anita. Go get Anita. Dumb ass, [ __ ] [ __ ] you're on the >> Oh [ __ ] Oh [ __ ] EMS. >> EMS. EMS. Help her. Jeffrey D. >> Get real messy. >> Help her. Give her Give her CPR. Give her CPR. Give her >> Jeffree. Help her. Jeffrey help. [ __ ] >> Give her CPR. Give her CPR. Chest compression. Jeffrey. Jeffy. Help my girl. The last 10 15 minutes. Look at my my wife being on my girl. I'm sorry. >> Jeffrey, help my girl. I'm trying. I'm trying. Give me a second. She keeps freaking grabbing me. >> Jeffrey Dmer is a murderer. >> I'm trying to help her. >> Oh my god. What are you going to do? >> This is bad. >> You're hating ourselves. What? Are you good? >> These pictures are [ __ ] >> Did you mean that about being the stepfather? >> Jeffrey, where you taking my girlfriend? >> Hey, I can do it right here. I can do it right here. It's fine right here. Do it >> with a with a few chest compressions. You're going to be >> okay with uh give me, you know, a couple seconds. >> He's not a [ __ ] EMS, you dumbass. >> He is. >> He's not an EMS. You won't remember. >> Yes, I am. Yes, I am. Be on. You're not doing nothing. >> Yes, I am. Give me a second. You know, she got to lay down. Okay, here we go. One, two, three. >> What the [ __ ] >> One, two, three. >> What are you flying? >> A [ __ ] >> I don't >> What are you doing? >> [ __ ] I tried. I'm sorry, buddy. >> Yo, John. >> John, look on the bright side. Look on the bright side, J. >> Okay, you thought it was over. >> There's hella girls here, right? There's hella girls here. >> And your wife's dead. Free hall pass. >> Marry him and tell me your >> ladies, party time. Let's go upstairs. >> Yes. Did he party yet? Break. >> Okay, hold on a second. >> Sorry, >> Justin. Don't act like you don't. >> This is my house. This is my second home. >> Oh [ __ ] >> Wait. No, wait. Who? Wait, who invited Jeffrey? Who invited >> What the hell, >> [ __ ] Who? I don't need to be invited nowhere, [ __ ] >> Strong. That's a >> Who invited Yo, who invited all these dudes? >> This [ __ ] tripping. >> This is a mess. >> Bobby John, relax. >> What's up? I mean Oh, hey honey. Oh, you're >> um hi. >> What's up? Why >> Sorry. She's not with you anymore. She's mine. >> Huh? >> Yeah, she's mine now. Um, I have an idea. Yeah, guys, guys, I have an idea. Should we kill every dude here? Bobby and um Jess. >> Uh, do me a favor. Take their dick out your mouth. Maybe. >> Oh god. >> I think [ __ ] really start getting get acting dripping down the lips right there, buddy. >> Gloria. Gloria. Gloria. Come here. Gloria. I got to talk to you. >> You know how that go? You know how that [ __ ] go? >> Whitney, are you kidding me? >> What's up, Gloria? How you doing? You know, I very good. Like I having a good night tonight. Why? What happened? Portuguini. >> Nah, I know you like I know you a bit older. You know what I'm saying? But >> my girlfriend just kind of dumped me today. >> I thought she said you was married to her. >> I was married, but she dumped me. >> Oh, okay. >> And like >> what happened? >> And now I'm just alone. John Bobby's alone now. >> Just relax. >> All right. I feel I forgot. >> So like Gloria like I'm just I want to have fun tonight. I want to get a couple drinks at the bar, you know, >> have some fun, you know, just to get my mind off things, you know. >> Okay, Jess, I agree. We can we can all of us can go drinking together. >> Jess, it's been a very long week for me. I have a lot of stuff going on. I think a drink will be very nice. >> Okay, Gloria. All right, Gloria, let me get your number. >> Oh my god. Oh my god. >> All right, Gloria. I got your number now. >> Let me see. >> I need a I need a I need a I need a >> life advice or anything like that. Johnny Bobby, Portuguese, you call me. Okay. >> Okay, babe. >> You literally just >> they'reing in there. No, you I don't want to go in there. >> What? >> Anita, I don't want to hear it. >> No, I didn't. >> No, I didn't. No, I >> Listen, dude. Listen. You guys came in at a really intimate moment, man. What happened? >> Come here, Bianca. >> Yo, who the [ __ ] is this dude with his shirt off, bro? >> I thought that was >> Yo, security, get him out. Security, get him out. >> Does look like me. It does look like me. >> Get him out. Security. >> Security, get his ass out. >> Dump him. No gang. >> He been >> Get him out. Get him out. Security. >> What the [ __ ] >> A lot of my bad. My bad, dude. My bad. >> [ __ ] BJ. >> Who are you? What's her name? >> Dia. >> Dia. That's beautiful name. How How old are you? >> 21. >> Where you from? >> I said Bobby. Oh my god. I did bad. >> I'm from Maryland. >> Yo, bro. >> Maryland. >> Yo. >> Are you single? I haven't touched her. >> Um, no, I'm engaged actually. It's a Fiona. >> Fiona. >> Yes. >> Wait, the girl Fiona. >> It's a party, bro. Fiona. Hello. >> What up? What a party. >> Bro, who the [ __ ] is these [ __ ] Listen, bro. They said it was a party, so I pulled up to the party. >> Yo, security. Get him out. Get him out. He drunk. >> Call me Henry out. >> Get him out. >> Henry, get him out. Get him out, Henry. [Music] We leave. >> We leave Chester. We make it a forome. >> Wait. Whoa. Whoa. For that. I want to be out and girls and [ __ ] All the boys. >> How about >> How about I have an idea? I have an idea. I have an idea. I have an idea. >> Shut up. >> All the girls get naked here and [ __ ] And then all the boys go to the other room get naked and [ __ ] >> No. Who the [ __ ] That's a stupid idea, bro. >> That's not a bad idea. Exactly. >> Wa wa. >> We're doing it now. Put your clothes. Yo, her clothes on. Put her clothes on. Yo, >> I'm ready. I'm ready for POV. >> Yo, put her Yo, no. Put her clothes on. Put her Put her clothes on. [ __ ] >> What the hell are we? >> No, they weren't. They weren't. They weren't actually. It was a It was a leggings. >> Oh, leggings. It was leggings. >> Yeah, it was leggings. It was leggings. It was leggings. It was leggings. It was leggings. >> You guys, relax. Why would you put in my face? >> Yo, Tess, get your wife, bro. I can sing a song for you guys to be intimate, you know? I don't want to just do it like >> I thought they were going to leave. I was just ready. I was so h you just made me so hot and bothered with that song. >> Yo, where's Amber at, bro? >> Yo, listen listen, John. I'm leaving. But you you enjoy you enjoy them. >> You hear me? >> Sing a song. >> I don't want to enjoy this. >> Okay, wait. Leaving? What do you mean you're leaving? You're late. >> I'm leaving. I'm getting dude. >> Yeah, I'm leaving. Leaving. Just >> Just don't worry. I'm with you. >> Call me Chester. All right. You know what? I'm going to go off. >> All right, man. I'll talk to you. All right. All right. Chester, man. >> Yo, Bobby, do you love lock in. >> She blocked me. Dead ass. Amber, you lame as [ __ ] bro. She actually blocked me, bro. >> Go to the clothing shop so we can spawn there. >> Yo, bro. Yo, bro. Do you got Amber number? >> No, but let's go to the city. So, >> no. I want Amber. Where's she at? That guy's dead. >> Amber really blocked me, bro. >> All right. Well, take me. >> Why do you not [ __ ] with me? I I don't understand, >> bro. Like, hold on. Let me put this city. >> Yo, can you take me where Amber's at, bro? Wait, I got her sister number. I forgot. >> I'll go to the like popular. >> Wait, I have her sister number. >> I think you call her like a couple minutes ago. [Music] >> Oh, her sister's not going to Yo, Ashley. Ashley. >> Ashley. John Bobby. Where's Amber at? You keep calling Amber when you're with a [ __ ] with big ass feet right now. >> I'm not with a girl right now. Where's Amber? Please. >> My sister does not want to talk. Amber, do you want to talk to him? >> No, I don't want to talk to him. He likes other girls. >> [ __ ] talk to you like other [ __ ] with dumb ass hoes that only want you for what the [ __ ] you have. My sister really [ __ ] with you. How dare you? >> [ __ ] crazy. >> Don't come on. Don't be like that. Apologize to her right now and she'll unblock you. >> The [ __ ] >> Amber, I apologize. Now unblock me. [Music] >> Did she unblock? Oh, >> there we go. Got it. I'm unblocked. [Music] >> All right, I'm getting a new girl, though. >> Um, call Jade. Oh, there's a lot of girls here. You want to go here? >> Yeah, go right here. >> Wait. Um, yeah. Come here if you want. >> I'm John Bobby and I'm looking for another wife. John Bobby's looking for another wife. >> John Bobby's looking for another wife. I'm John Bobby and I'm looking for another wife. >> Nowhere. >> Bobby, call Jade. I'm John Bobby and I'm looking for another wife. John Bobby looking for another wife. >> I'm not the wife for you. I'm not the wife. >> That's the wife for you. >> Yeah. >> I just hate this. >> I don't think this going to work. >> Well, you're right. Let me call Jade. >> Yeah, she's she's probably on. >> Yes, she is. You're right. >> Yeah. >> Hey, people calling you broke. They don't know you. You actually have a lot of money. >> Yeah. >> Are you like engaged? >> No. Why? >> Are you single? >> Yeah. Why? >> I'm just asking. >> Like, >> where you at right now? >> Um, the hospital. Where are you? >> I'm at the uh beauty beauty shop. >> Oh, okay. You want us to come get you? Nah, I'll come to the hospital. >> I'll wait here. >> Here I come. >> You better come this time. >> I will. >> Wait, what the [ __ ] is this dude doing? >> Um, this is the guy that you wanted me to kill and just respawn. >> What is he doing? >> Twerking. >> He's working out. All right, go to the hospital, man. >> Where's Bobby? Yeah, >> I can't get in. >> I'm trying to get in now. >> I thought this was girl. >> Oh, chat. It's looking bad, man. >> It's looking bad. >> There's a lot of girls. You have a chance. >> Yeah, but none of them are like her, bro. >> Really? >> I'll be here. The [ __ ] is he talking about? >> No, bro. [ __ ] you talking about now? >> And how how come Chester leaves me like that? >> You want to know exactly why? >> Why? >> Because it's 3:27 a.m. in the East Coast. >> Really? >> Yes. It's like late as [ __ ] If I don't find a girl tonight, I'm I'm not going to go to >> N. Jade is for you. Jade is I talked to her earlier and she was like, \"Yeah, I talked to her earlier.\" >> All right, let's see. Let's see. >> I got you. I got you. Yo, Jade. Yo, Jade. >> Jade, why are you always with this [ __ ] >> He's not an [ __ ] >> Yo, John. Bobby, don't make me soap you up right now. You're lucky I'm on this crutch. John Jay, you're always with him. Y'all have to date. Are >> What's going on? >> John, what's the word? >> They're not dating. >> What's going on? >> Not much, man. What's up? >> Why are you asking? I >> mean, should we take him out? >> Jay, I want to take you out. >> Who is this guy talking about? Take me out, be yo, man. Yo, >> you John Bobby, let's be clear. Let's be clear about one [ __ ] thing. You could never [ __ ] with a [ __ ] like Jade ever in your [ __ ] life. Oh my god. >> Let's be clear. Let's be [ __ ] clear. This is a bad topnotch [ __ ] You can never eat your life. [ __ ] with a [ __ ] >> Yo, go back to the [ __ ] stripper. Okay, >> let's be clear. >> This idiot. >> Let's be [ __ ] clear, John Bobby. Now look, your ashes got her killed. >> She just died. >> She just died. >> And it's all your fault. I hope you can live with that. >> Yo, [ __ ] this [ __ ] Get it. Let's go play another one. >> Yo, game. Beat it out of here. >> [ __ ] this [ __ ] Don't go. >> [ __ ] this [ __ ] >> Goodness. >> Let's go to the um >> No, there's nowhere else to go. Just go back. >> Yes, there is. No, there is. There is. >> Where? >> Just take there. There's a lot of places with a lot of [ __ ] >> I'm sick of this [ __ ] bro. Everything. My life is [ __ ] John Bobby doesn't know what the [ __ ] to do anymore. I'm sorry. I'm [ __ ] pissed. >> Sorry. >> Damn it. Just damn everything. >> Yo, bro, >> if this kid is griefing, oh god, I'm going to get in banned. Oh god. >> E, >> I'm about to go to sleep, man. Oh god. Holy [ __ ] Oh, John. Bobby's crashing out. John Bobby's crashing out. Bobby's crashing out, man. Go to the pool party. There's a pool party. Yo, bro, is there a pool party? >> Is there a pool party we can go see? >> I'm about to call Anita in a minute. >> Wait, wait. Jay just text me. She said, \"Come to our party.\" >> Kella, where where go? We'll go. We'll go. >> Oh, who the [ __ ] >> Send the address. >> Tell her what number. [Applause] >> Is that the location? >> Uh, no. He hasn't said the address yet, [Applause] >> dude. Yo, if you keep griefing on God, I'm going to I'm going to [ __ ] report you, dude. Stop. Oh my god. And I'm about to go to sleep, man. >> Yeah, I'm tired, too. >> All right, John. Bobby will be back tomorrow. >> I love you, bro. >> Love you, too, bro. Oh [ __ ] John Bobby. John Bobby. John Bobby. John Bobby. John Bobby. John Bobby. John Bobby. I see see I hear a mic listening to music. I hear Mike listening to music right now. [ __ ] I love y'all boys, bro. Y already know that. Y'all know I love y'all boys, man. I'm going to sleep, chat. I love y'all. Good night, man. Good night, chat. I love y'all boys, bro. I freaking love you guys, man. Seriously, from the bottom of my heart, it's raining. Wait, is it raining right now? It's been raining every day since we See you later, alligators. Blue Will donated $1.99 through super chat. Speed what Cardi songs you got on playlist. >> Yo, wow. Can you put the map in uh mouse per hour? >> Blue Will donated $1.99 through super chat. Speed what Cardi songs you got on playlist? >> But in the end, Wlet Coco, can you put the map or mouse per hour, please? I tried so hard and got it. I try to do [Music] Notorious BY donated $2 through super chat. Sorry about Amber Speed. Good night, Brada. [Music] Dark Gun donated €249 through super chat. Don't you dare sleep, you bollocks. Roll it like put the damn thing up, bro. Wlet, I don't want to hear excuses, bro. Good night, Chad. I love y'all. Yo, Moody with the 10 five gift. Thank you, brother. [Music] Firekicks donated $10 through super chat. Hope the tour finishes in San Diego. Got you and the whole team. Firekicks. Check us out. Firekicks SD. [Music] Al Ryan donated $4.99 through super chat. Good night speed tonight chat. Thank you. Jamie J donated $5 through super chat. I feel like your team should have planned each day out for you better. Not much to do in New Mexico on a Saturday. Love you. Good night, bro. Fizz donated 100 rupees through super chat. Bro need help mom in hospital. One lakh surgery pls help. Rats donated $1.99 through super chat. 9 bill99,999,999. Neck her neck her lane neck her Eric Shiz 1992 donated $2 through super chat. Wallet put the map on. Edward donated $4.99 through super chat. Hey Speed, tell Lil Bro to put map up or bro gets fired. Ask. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing. Ronaldo is the goat. Savian donated $2 through Super Chat. That's not nice. Master of the Universe donated $1.99 through super chat. Sorry to hear what Diddy did to Jamal Pickle. Daly donated $2 through Super Chat. Y'all do know the team mutes his speaker, right? Skull. Eric Shiz 1992 donated $2 through super chat. Lw Wallet put the damn map up. Magnifying glass rolling on the floor. Laughing. Magnifying glass. Magnifying glass. Rolling on the floor. Laughing. Magnifying glass. Rolling on the floor. Laughing. magnifying glass rolling on the floor. Laughing. Magnifying glass rolling on the floor. Laughing. Magnifying glass rolling on the floor. Laughing. Magnifying glass. Rolling on the floor. Laughing. Magnifying glass. Rolling on the floor. Laughing. Magnifying glass. Rolling on the floor. Laughing. Magnifying glass. Rolling on the floor. Laughing. Edward donated $4.99 through super chat again. Speed tell Lil Bro to put the damn map up. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing. Ronaldo is the goat. Keep the good work up speed. Love your team. Master of the universe donated $1.99 through super chat. Jamal drinks Gatorade and eats yogurt pickles. Rats donated $1.99 through super chat. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing. 99,999,999. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Eric Shiz 1992 donated $2 through super chat. Bouty, bouty, bouty, bouty, rocking everywhere. Master of the Universe donated $1.99 through super chat. Jamal Dam M I N G about Diddy's pickle. No cap. [Music] Core Justin donated $1.99 through super chat. See, please go to San Jose in the Bay. [Music] Joe donated $1.99. 9 cents through super chat. How about them Dodgers? Reds are getting swept. Eric Shiz 1992 donated $5 through super chat. Go around the traffic. We got to get to Phoenix. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Hushed face. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Hushed face. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Hushed face. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, hushed face. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing Master of the Universe donated $1.99 through super chat. Jamal eats yogurt pickles. Wit thh Gatorade now sad. Rats donated $1.99 through super chat. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone, pregnant man, medium dark skin tone. Pregnant man, medium dark skin tone, rolling on the floor, laughing. Pregnant man, medium dark skin tone. Pregnant man, medium dark skin tone. Francisco Lucas donated $5 through super chat. yada da da da da da. I mean, Durian Long donated $1.99 through super chat. Speed go to Navajo Nation. You're not far. DJ Steey donated $4.99 through super chat. L New Mexico zombies is today ruined mold IPLE locations. Edward donated $1.99 through super chat. Hello speed. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing. Low lices 1992 donated $2 through super chat. El traffic pregnant person. Person person shrugging skull. Zany face. Woozy face. Melting face. Rolling on the floor laughing. Rolling on the floor laughing. Rolling on the floor laughing. Rolling on the floor laughing. Rolling on the floor laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Face with hand over mouth, face with symbols on mouth, pouting, hot face, shaking face. Tired. Here no evil. See no evil. Speak no evil. See no evil. Speak no evil. Here no evil. See no evil. Here no evil. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing, rolling on the floor, laughing, rolling on the floor, laughing. Master of the universe donated $1.99 through super chat. Jamal pregnant lowkey though. Eric Shiz 1992 donated $2 through super chat. Milo here no evil. Speak no evil. See no evil. Milo here no evil. Speak no evil. See no evil. Milo here no evil. Speak no evil. See no evil. Milo here no evil. Speak no evil. See no evil. Loudly. Crying loudly. Crying loudly. crying loudly. Crying, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing. [Music] [Music] Eric Shiz 1992 donated $2 through super chat. Do Freddy Boom you going to learn today? Rolling on the floor laughing. Rolling on the floor laughing. Rolling on the floor laughing. Rolling on the floor laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor. Laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. [Music] Django Trey 3 donated $9.99 through super chat. Bish, don't get too comfortable. Better not get too comfortable. Bish, don't get too comfortable. Better not get too comfortable. Bish, don't get too comfortable. Better not get too comfortable. Eric Shiz 1992 donated $5 through super chat. Here we come. Phoenix l traffic. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing laughing, rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing. Rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing, rolling on the floor, laughing Eye rolling on the floor laughing. Donated $1.99 through super chat. Speed Frog Peanuts cold face hourglass basket test tube thermometer bomb bed teddy bear carp streamer razor bellhop bell portable water toilet roll of paper camera with flash mantelpiece clock hourglass wheelchair access parking passport control wireless man dancing medium skin tone dancer person manual wheelchair cold face saluting face dotted line face shaking face grimst shaking face sign of the horns dark skin tone Fizz donated 100 rupees through super chat. Ano 4 bill950,684,433 IFSC KBK00007626 need help one lakh for mom surgery pls INR it's my bank account pl anyone help pls folded hands folded hands folded hands folded hands folded hands folded hands folded hands folded hands folded hands Astro Jack donated $1.99 through super chat. Speed, please don't go to California. [Music] Dr. Jones donated $1.99 through super chat. Skinwalker. Skinwalker. Skinwalker. Skinwalker. Batch donated two Swiss Franks through super chat. Hey Siri, call 911. Police officer light skin tone male sign. Police officer light skin tone male sign. Police officer light skin tone male sign. Police officer light skin tone male sign. Police officer light skin tone male sign. Police officer light skin tone male sign. Eye rolling on the floor laughing. Donated $1.99 through super chat. Speed vampire dark skin tone female sign. Vampire dark skin tone. Male sign. Vulcan salute. Dark skin tone. Sign of the horns. Dark skin tone. Palm up. Hand dark skin tone. Index pointing at the viewer. Dark skin tone. Kiss mark. Zombie anatomical heart. Zombie female sign person. Medium skin tone mic man. Medium dark skin tone mic. Japan Gernzie carp streamer closed block radioactive postbox dolls rolling on the floor laughing. Master of the universe donated $1.99 through super chat. Jamal eats yogurt with pickles and g a y t o r a d e. Antonio Menddees Rojas donated $1.99 through super chat. Speed wake up. There's an accident. Oncoming car. Police car. Pun donated $2 through super chat. 2 TT NSL PP PTSO 2 TTNSL PP PTSO. [Music] I need you. Juicy Britches donated $1.99 through super chat. I ate an entire watermelons whole. My family cried. Brand new SRT donated $1.99 through super chat. Crash in I40 westbound Pinta RD. Rest in peace, Darren. [Music] Analog Man podcast donated $2 through Super Chat. If you think speed is saving America, say hell yeah. Adrien Faras donated $1.99 through super chat. Speed, I love you. Shout out 209 baby. See youa. Josh donated $1 through super chat. Donaldo Trump has donated $4.99 through super chat. It's a shame that Speed and his team has the Lord's name Jas Crest on the ban word list in chat. Chat, wake up. You're being played. [Music] [Music] [Music] Big black giggle boy donated $3. Nicker nicker nicker nicker nicker nicker nicker nicker nicker nicker. I am a lost. Finished jaking it. Oo nicker nicker nicker. Don't move. A nicker nicker nicker nicker nicker nicker nicker Autotopia donated two Australian dollars through super chat. Wake up chat. It's not flooding. It's a crash. [ __ ] donated $3. We need prime speed back. W's in the chat. Nicker [Music] Heat. Heat. [Music] [Music] [Music] [Music] Are you happy? Luffy Gear 34 donated $1.99 through super chat. Driver, we need to pull over and get some huts. Oh, codeex 7 donated $1. Hi, chat. Ahmed canuler donated $4.99 through super chat. Let's go. Speed nice soul. I hope God I always be with you. Ahmed Kanguler donated $9.99 through super chat. Let's go speed. Tier loves you, dude. Ahmed Khuler donated $4.99 through super chat. Let me D the Turkish dudes. Give me 07. [Music] [Music] West Coast NN donated $1.99 through super chat. Speed, it's my birthday. [Music] West Coast NN donated $1.99 through super chat speed. We fa get it cracking when you in LA. Alex B Gamer donated $1.99 through super chat. Wake up. Wake up. Wake up. Wake up. Wake up. We Ana donated 100 rupees through super chat. Paid girl here. T E L E G R A M Ana Chararmms two hearts hot face new moonf face cherry. Just rock donated 40 Thai bots through super chat. Speed some in said Messi better than Ronaldo. What are you talking about? [Music] Name 1,234 donated $1.99 through super chat. Is he going back to San Francisco? Oh my god. [Music] Eli C. Pistol Pete donated $1.99 through super chat. San Diego eyes. I don't know. Isig Garrett donated $1.99 through super chat. Speed wake up. What part of Arizona you going to? Anya donated 100 rupees through super chat. Paid girl here. T E L E G R A M Ana Chararmms two hearts hot face new moonf face cherry. Are you happy? Ice cigarette donated $1.99 through super chat. He r car. Heat. Anya donated 100 rupees through super chat. Guys, I need money. Help. Anyone can. I will help you whatever you want. New moon face. [Music] PX 3698 donated€1 through super chat. Koozy man donated try 44.99 through super chat. Anya donated 100 rupees through super chat. I need money for my fee guys. Please help me. New moon face open my super chats giving you my contact. Koozie man donated try 109.99 through super chat. Cardestry donated $4.99 through super chat. Why did the console player cross the road to render the building on the other side? Koozie man donated try 109.99 through super chat. Turkey is the best. Ronaldo is goat. What happened? Cardry donated $4.99 through super chat. Hey chat, would you rather never gain weight, eat what you want, or never get tired and have unlimited energy, but you couldn't choose to rest? Anya donated 100 rupees through super chat. Hello everyone. Cardestry donated $4.99 through super chat. Remember people, he's lived 24/7, so he needs to rest. If you always tune in when he's sleeping, G, then you missed him when he wasn't. I know. Rev_uji donated six Malaysian ringit through super chat. any port gua th for your help. OC New donated 40 tai bots through super chat. [Music] [Music] Joe Rogan donated $2 through Super Chat. WW SpeedW chat here from Austin, Texas. Kuroponu Strawberry donated 800 yen through super chat. Did you watch the Infinity Castle arc of Demon Slayer? I was sobbing face holding back tears. By the way, I only speak Japanese. Does my English make sense? Pleading face. Marcus Eids donated $1.99 through super chat. Jamal in his bunk like vault. [Music] Josh Ortiz donated $4.99 through super chat chat. Ema catch up to speeds bus. I know where it's at. Anya donated 100 rupees through super chat. Paid girl here. P E L E G R A M Ana Chararmms two hearts hot face new moon face cherry Wild 2K5 donated $1.99 through super chat. Welcome back to the West Coast Speedfolded Hands. [Music] Good morning. Please. W driver. [Music] [Music] [Music] Kuroponu Strawberry donated 1,600 yen through super chat. It's Monday tomorrow and I should sleep, but I kind of want to stay up until Speed wakes up. Face with spiral eyes growing heart. Okie do pleading face. You're doing amazing, driver sand. Don't push yourself too hard, okay? Pleading face, growing heart. [Music] Femwave donated $1.99 through super chat. We have arrived at your destination. Cardry donated $1.99 through super chat. [Music] Good morning. Did that do anything? No, it didn't. It didn't do nothing. I'm tripping. What button is it? [ __ ] Is it desktop fool? >> Wild 2K5 donated $1.99 through super chat. Jamal, check me out. Saluting face. It's not full cam, bro. It's not full cam. It's not full cam. Is it full cam? Can't be. I have it written down somewhere. GI Joe donated $2 through super chat. I'm sniping live on kick joe a and on yt later. CDL experts donated $1.99 through super chat. >> Wild 2K5 donated $1.99 through super chat. >> I don't know. >> Throw water on speed wall. >> I don't even know what to do. won't touch, man. I'm so scared. I don't even want to touch nothing. I don't even want to touch it. I don't even want to touch it. I don't even know the command for it. [Music] All right. How can y'all see that? I don't even know how y'all see that. I don't know, bro. I don't know how to change it. Oh, it was that. Okay, thank you. >> Oh, okay. That makes more sense. I should just keep that. >> Despair takes a hold of me. That's what's up. Wait, [ __ ] didn't even fix it. [Music] Oh [ __ ] Oh my ears. I don't know how to God. Uh, is it desktop? It's got to be desktop, right? Yo chat, I'm on OBS. It's just that he got a Steam Deck. I don't know what button it is. That's the only part. Um I don't know what to do. Is they got a steam? He's have a steam deck. I don't know what to do. I I don't I don't do Oh my god. I don't I want to say full desktop and desktop small dash cam. [Music] I don't know what to do. Just click what? I'm not clicking full dash cam. Oh, it's right here. I'm tripping. Hold up, chat. I did it. All right. All right, I did it. Can you hear? How you get rid of this? Okay, there we go. Wait, no. I got redo this [ __ ] major news to share. Let's hear what the game has to say. >> As you all know, we've been building a new era in WWE. A direction that's bolder than anything you've ever seen before. >> But to forge this path, >> we need talent to rise to the occasion. Whether that's someone who's already here or an outsider ready to step in and lead the charge. >> Who is going to be the superstar to lead us to that next level? >> Well, we're going to answer that question starting next Monday on Raw with the WWE Draft. >> The WWE Draft kicks off next Monday. That's huge news. Raw Smackdown GMs Adam Pierce and Nick Aldis have decisions to make that will shape the future of WWE. Now, I know I'm supposed to be impartial, but as a chief content officer, I'm going to drop a couple of hints about who I think will be selected number one overall and become the leader of this new era. This individual is going to be a force in the men's division for years to come. I've seen his potential for greatness already as >> uh >> as one of the top superstars on Raw. They could be the next EST, the next American nightmare or better yet carve their own path to lead the new era of WWE. It all starts with the draft when we take the next step in WWE's revolution. Sounds like the CCO thinks one of Rob's top names might be going number one overall. I can't wait for draft night. my own character. Skip it. I'm gonna skip all this all this. Well, actually, here we go. I don't need all that ring entrances. Hold up. Actually, how you boom, copy and paste. All right. personal name cuz I got a name. No, I want do I want to have a entrance name? I don't know what. Here it is. Nickname. Wait. First name. Wait. I can do like this. I'm tripping. Trip. Tripper. Give me Jamal. [ __ ] I want that name. My first name gonna be a Aon. It's gonna be a a Aon East. Wait, that's my first name. Wait, I got two first names. I don't want two first names. I'll be a Aon ace. Yeah, that'd be fire. Perfect. Custom that crowd here. I have cheer personality. I have no hometown. I want to be from the D. I can't have Detroit. Okay. I have New York but not Detroit. I'll be No, [ __ ] that. Say US. [ __ ] it. Wait. Oh. Oh, just Michigan. I'm tripping. Oh, Detroit. There you go. That's a fire ass. It's my birthday. Tag me in. You tag me in. Let's go for Damn. I got a customer that is I got enough time for that. I bet side panels. What are these for plates? I mean, that's how I want it. Boom. Okay. Weight class. There we go. Perfect. Fighting style. Oh my god. Here it comes. The fighting style. You got to talk to us. My fault. I'm tripping. No, but I'm not having a heavyweight class, bro. You got me [ __ ] up. Now this right here. No powerhouse. I kind want a high flyier chat. What do y'all think? What do y'all think? Striker. I feel like Striker is balanced though. I want a high I want a high flyer. That's what I want. Huh? A striker. I don't know, bro. A giant highf flyier technique technique change skin tone though keep my skin tone bro I just want to do high I'm do high flyer I'm do high fire. Oh, my abilities. Payback. Okay, I can have low blow poison mist. Spray poison mist in your enemy's eyes. Oh, that's fire. What do you think I should do? I might do poison mist move thief. Oh, I can still finish her. Oh, I got a soul fire rage freeze to play shock and confuse your opponent with a surprising magly. Water bucket. Something called water bucket. Poison. That's what I'm saying. Poison miss sound fire. Kind of do poison. This. What do y'all think? poison miss. Yeah, I'm just I'm gonna go for poison this. Oh, wait. Poison this. Wait, I can't. Wait, what the [ __ ] Oh, I got to disable. Okay, there we go. Add that. Disable that. I'mma get hit my enemy with brass knuckles. Make it look like Rudy. No, bro. That's blazing. It's not really blazing, but like you know, you know, I'm not gonna do that. Fireball. I want do fireball. I think that's it. Hold on. Can I hit my That's entrance. I'm tripping. Okay. As I was saying. All right. As I was saying, body face. I think body. Okay. Uh Jamal Learn from uh String University. Jamal learning from stream university. What do you mean by that? Okay. I want to change my outfit. That's what I want to do. But [ __ ] it. This is good. This is good enough. Uh don't want to change anything else. Personal identification. I think we're good. Oh, let me Can I save this? Oh, copy. Print. Paste. Okay. Paste. Want to edit. There we go. appearance hair. What cut do I want to go with? I would go for short. No, I want Oh, I want that. But I can't have that. [ __ ] Okay, I'mma go for a nice cut. That KS, they got the KSI cut. Nah, I need to rock that cut for sure. Make that [ __ ] black. I can the material of it. It's like wood though. Whoa. Oh [ __ ] I forgot about that. this [ __ ] black. Yeah, there we go. Make it oily. Nah, give me that cut. My right eye. I got edit my right eye. [Music] I have a shiny gun. Why do I have a shiny gun? Sh. The speed cut. Oh, promo lightkinn. Oh, lightkinn KSI would be fired up. I might do that. >> I donated $9.99 through super chat. Not nobody here. Henry character, bro. No, bro. Hold on. Apply this. Well, I kind of want to change my character skin tone now. You give me a good idea. I kind of want to kind of want to change his skin tone. [Music] A light skin. Wait. I want a light skin like that. >> Anthony A donated $1.99 through super chat. >> There we go. >> What? As your FA Borite place to so far. >> Perfect. Ain't that [ __ ] just perfect? That [ __ ] is perfect, ain't it, chat? You pass in chat. Go Detroit Lions vampire. See, look. Exactly. And KSI vampire. Yeah, that look nice, don't it? Go black. Should I do black? I might do black. I might do the black one. Let's do black. Let's do black. Oh yeah, there we go. That's perfect. Chad, is that better? Oh, snap. Okay. Okay, that's way better edit chat. That look nice. Perfect. Okay, we're gonna uh Wait. Uh, how you copy? Okay. Copy. Paste. I should have did that after though. Hold up. All right. All right. I'm almost done, chat. I'm just having a little bit of fun with the custom customization. We're gonna put some clothes on my guy. Guess I wear a headband, right? They got headbands. They do. It kind of works. It kind of works though. Not all the way. Hold up. I got to find Oh, we got to set that [ __ ] go hard. That's not what we looking for right now. We got to see on the objective. That's a That's not gonna work. Now we got to go for that headband, bro. Blow your nose. No, I don't need to. It ain't nothing. All right, but there we go with this. We make this [ __ ] black. Okay, black. Oh, that's I'm tripping. Wait, wait. Let me change the material. All these the same. They all the same material, so ain't no point. Color chat KSI is coming about. Beautiful. Oh, wait. Huh? Oh, it works like that. That's weird. That's the closest thing we got to KSI right there. All right, top. I want I want a outfit. This outfit. I ain't gonna lie. One piece. Get a Elvis fit. Now, we should do a firearm piece. Let's do Oh, I don't know. What should I do? I'm not changing the skin tone. All right. 31. What is 31? 67 67. Go. Which one is 31? 31. I get a She got a prime bottle. They got the doll. That' be a fire fit. I ain't gonna lie. Lowkey looks like you. Yeah. Get out of here. 67. What do you mean 67 31 41 42 Now I'm just going to go I'm just gonna go with uh I gota hurry up and just grab a fit real quick, bro. I want to get some gameplay. Let's just go with this right here. We gonna make it uh No, we gonna keep it like this. Shoes. All right, let's get some [ __ ] shoes, bro. Boots or shoes? Some [ __ ] tall boots, whatever. Or just shoes. Some sneakers. This some KS I have. All right, we good. Are we are we in the game? Pig 67, bro. Ain't no Ain't no [ __ ] one that's called 67, bro. There's no thing that call 67. Oh yeah, that's perfect. Wait. Uh, hold up. Wait a minute. Wait a minute. Should I come in? Should that be my entrance? And this should be my Nah, maybe. Nah, I want my whole fit. There we go. All right, we ready. We can finally get the game. Quick save. All right, we can get the [ __ ] game play now, bro. Go pitch black eye. You should have said something earlier. All right, just save it. Complete. [ __ ] it. Your lady. [Music] Okay. Bet. Wait. Why is my No, I didn't want that. Why is he black? You don't even have nothing on, bro. That's I did not want that. DMs who DM me a coin between the GMs as well first speaks all social media feed Triple H CM Punk. Okay, bet. Let's get the game social. I'm going do story progression. Story progression. Okay, never mind. Oh, I gotta go to social media. I have to go to social media time. But I still have a Okay, bet. Is that all? Is that it? I want to get into the game. I want to get into the game. Do I got to check all these? Nah. [ __ ] out of here. No. Like Rudy. No, bro. That is Rudy right there, bro. That's a perfect example of Rudy. That's a perfect Rudy mix. That's a mix. That's a mix with Rudy and KSI, bro. I have a What the [ __ ] Whoa. My signature finisher ring. Oh, hell no. I'm changing that. I want to do a No, I want to do a running. Wait, I got downloaded. You got a Oh my god. It's a DLC. It's a [ __ ] DLC. This is dropping ass on you. E2. Why is a choke slam a DLC? >> Sin_9,18 donated 25 Hong Kong dollars through super chat. >> W Jamal, >> why you just film a seven? What is seven? Oh, seven standing. >> That's a mission. >> Josh Ortiz donated $4.99 through super chat >> DLC. Come out. I'm here before I honk my trailer. >> Like, that's so stupid, bro. Holy [ __ ] It's live. I might as well do a running run, bro. >> Running. >> Cecilia donated $1.99 through super chat. >> Jamal Slip says, \"Ry handsome. I love him so much.\" >> Black part. >> All these shits are ass. I want something clean, bro. I want some clean [ __ ] Yo, YouTube, what are y'all talking about, bro? All these shits are like ass. Like, every single one of these [ __ ] are ass. Oh, I like I kind of like that one. I don't know. Oh, RKO. >> Can I get a RKO? >> Cecilia donated $4.99 through Super Chat. Darren was disrespectful to Slips. >> He needs to apologize. He acted horrible. Can you make him say sorry? Also, slips is way better than Luca. Black heart. >> Watch. RKO gonna be a DLC. Watch. 100% gonna be a DLC. RKO is going to be a DLC. Oh, it's not. I can get RKO. Oh, he's got the RS. There go. Wait, is this it? Wait. RK was a [ __ ] finisher. I just realized that. [ __ ] RKO is a finisher. Is that a [ __ ] Is that a Sinister [ __ ] Is these a finishers? I don't even know anymore. >> Sin_9,18 donated 10 Hong Kong dollars through super chat. >> A [ __ ] arch. >> Jamal, do you get any sleep? >> Oh, no it's not, [ __ ] One, two, three, chat. This is three. This is two. This is one. One, two, or three. [ __ ] That's quick. I like the I like the I like one. One's dramatic. Yeah. I was thinking of one. I like one. I like one. It's like takes two. See, look. Y one. I'm doing one. I'm doing one. I'm doing one. I'm doing one. Oh, [ __ ] Why would I Why would I have that as my signature, though? I just realized that. Why would I have that as my signature? I'm doing a bic. I'm doing a bicycle kick. Wait, I just want I just want like can I just remove this? Can I just not have this? I can practice with it. [ __ ] who's my finisher? >> Hell no. Yeah, I'm changing that finisher. >> Kratos D rancher the 69th Hokag biceps alien donated $5 through super chat. >> Jamal, your brother loves you. I he can be hard on you, but it's because he believes in you. >> I believe in you. Nothing can replace brother >> in a ring. >> Yeah. No, we're switching that [ __ ] immediately. I'm just [ __ ] it. I'm just gonna have two RKOs's. I don't give a [ __ ] I'm just gonna have two RKOs's. That's the best bet. Two RKOs's, right, chat? Two RKO's. We can do We can do two now. But we can't do another RKO. We can't. No way. We can't do two RKOs's. [ __ ] out of here. There we go. We going to do two RKOs's. [ __ ] it. I don't care. All right. Bet. We can finally get into a game, right? D. Who is that? That's Seth freaking Rollins. It is Seth Freak Rollins. Bro, >> the winds of change are blowing. >> Talking about the draft, I assume. >> Yep. You and I haven't had much of a chance to get acquainted here on Raw. I would mind if we end up on the same brand so that we can finally have a match or two. >> I wouldn't mind that either. We could do big things. >> I guess we'll see where we end up. I know they're saying you could be staying here on Raw, but I've been around a while and I've seen a lot of crazy things >> when it comes to the WWE draft. >> You just never know. >> I'll be ready for anything. >> Seth freaking Rollins, guys. Oh my god, Aiden. >> Well, if it isn't the subject of all those draft rumors. >> Adam, >> what do you mean? Come on. You heard what? >> I'm skipping this. I don't care. >> What are you getting at? >> I know, but things are different now. >> Character >> like >> Yeah, I'll keep that in mind. >> Okay, >> bro. Look at my [ __ ] character. Oh my god. That's a match finally. Holy [ __ ] Don't miss what we could be. Hi guys. is buffering. >> Let's get this. >> Oh my god. Look at my >> Yo, I'm about to cook a [ __ ] real quick. All right, let me get into game. No dilly down here yet, bro. With all the talk about presumptive draft picks and Triple H's cryptic messages, we might be forgetting about Montes. >> Good point, Cory. Montes is a former Royal winner who's coming back from injury. I'm sure he'd love to make his own statement about superstars on the line and a lots of bro. targeting the arm to great effect. >> Can I not reverse? >> What the [ __ ] [Applause] >> with their opponent all tied up in the ropes. This superstar is just teing off. Oh man, [Applause] >> this easy game, bro. I I thought she was going to be like hard as [ __ ] >> I thought [ __ ] was going to be hard. >> Are you kidding me? [Applause] >> Here we go. He's able to kick out, too. He's not letting fatigue set in or get the better of him. >> What a sharp puncher. That is going to hurt. Oh, quick way to respond with the reversal. >> That was easy. >> Reversal. He saw that coming. >> How did he do that? >> [ __ ] out of here, bro. >> What the referee. >> I didn't think this was close. [Applause] >> Get up, gang. Get his ass up. I might hit him [ __ ] with his ch this. Okay. Oh, I can hit this with RKO, too. RKO. [ __ ] revered. [ __ ] >> official update. How you evote? Oh, this is right here. >> Get your ass back. little FPC. I'm not going to lose another. >> Okay. [Applause] >> Even on the attack, Mont has kick. Beautiful. >> Oh, right in the arm. Kick to the back. Standing shooting star press. >> Quick reflex is so important in a match like this. >> God damn. >> Seems unable to turn the momentum here. Ford's having trouble fighting back. He's got here. >> But this is easy, bro. Be hard. >> Yeah, I might just go to bedels. And it shows back. What a kick. [Applause] >> Here's your winner. I can't do this. >> This is so easy. >> This is so easy. >> It does. >> WWE draft. There's rumors the superstar will be staying on Raw as the top pick. It's not official yet, but it would be a solid choice by Adam Pierce. >> All right, I'm on raw, [ __ ] Get boys on raw. All right, I'm not No, that [ __ ] was so easy, bro. That is not what I want to do. [ __ ] it. I need a challenge. I'm sorry, but I need a challenge. Wait. Oh [ __ ] Oh, okay. Um, >> I beg you for our defenses have been broken. We are inside the walls. All that you built, everything. I need a challenge, bro. I just need a challenge. That's it. That's it, guys. That's all I need is a challenge. I just need a little challenge, bro, to boost me. You know what I mean? I just need a challenge because all this other stuff, bro, it's all just, you know, it's all just light work, bro. Like, nobody can hold me on this game or no other game, bro. There's no point, bro. I just need a little challenge. I'm sorry. I'm sorry. I just need to check. I'm sorry. Now, if y'all want to see a real gamer, that's me, baby. I'm better than him at any game. Like, bro, like any game, chat. Oh [ __ ] Hold up. Don't get rid of that. But damn, it take a good minute to get the [ __ ] freaking game. Stop lying, bro. You haven't, bro. Just Just wait and see, bro. Just wait and see. There's no point. See, Never mind. You about to see a real master at work. Damn. Oh, hell no. Skip that. Where? Hell no. >> You got me [ __ ] You got messed up. All right, let me see if I can do a one v one game. That's low active, too. What about 4v4? Why is this very high active? Oh my god. I'm going have to do this here. As I was saying, I'm got this game. Uh, nobody can hold me down. Uh, they just need to stop me. That's it. They can't stop me and they won't stop me. Let's do this. I'm very high. Uh, it's very positive. I have high outcomes for this game. But this [ __ ] will not load. That's the only problem about this game. Q times are ass. And the people who play this game though. Yeah. That's for honor. I know that is for honor. Who's crying? Nobody's crying. [Music] Oh [ __ ] All right. Okay. All right. We're just gonna wait chat. My fault. Damn. Take a good minute for this game to load, bro. A good minute. Damn. But anyway, chat, how y'all doing, bro? Good morning. You know that song. Good morning. Yeah, good morning to y'all, chat. Hope y'all having a good day. My day going smooth. I woke up at like, what time was it? I woke up at like 6 something. 67. N 6 something. I don't have CO. It's allergies. Two different things. Way two different things. blow your nose, bro. Bro, I [ __ ] it, bro. Like, chat. I ain't gonna lie. I think somebody tried to roast me, but I think he [ __ ] up. Oh [ __ ] so cold. You're my favorite. Appreciate it. Uh, fart on speed. I will be fire. Are you tired? A little bit, but I'll be good. What's up with this Q system, bro? I'm just trying to play the game. That's all I'm trying to do. Four. Is it four more days? I can't wait, bro. I can't wait. I can't wait. I'm teasing about it. It says go to Oh, chat. We should have went to New Mexico this trip, bro. [Music] >> Oh my [ __ ] Super chat. Jamal. Jamal, wash your face. It's dirty. It's dirty. >> We finally Oh my god. Please. I hope I don't get a bot. I hope I don't get a bot. Oh my god. Why is it a bot, bro? It's not gonna be fun with a bot, bro. We finally got into a game, dog. This is about to be a shitty game, bro. 108. 10 [ __ ] eight. Oh my god. >> Yo, this about to be a shitty ass game, bro. I can just tell it. I can just taste it, bro. This about to be a shitty game, bro. Just emote, bro. You know you you have respect, bro. You have respect, gang. You have respect. >> You have respect. Please. Just emote. Please. Thank you. Okay, now we can get on. All right. >> Victory. >> Oh my god. This game I know this game would be terrible, bro. Best one though. Round two. >> Think I [ __ ] bot. Oh, this thing about be my ass. I'm about to lose her bot. >> Chris Hoover donated€2 through super chat. >> Kamal will speed meet Queso in Arkansas. Don't have high. I don't actually lose. What the [ __ ] Oh my god. >> 212 donated 5.99 through super chat. >> I love you and brother. Do you have girlfriend? >> T about to get his ass beat. Oh my [ __ ] god. He about his ass beat. >> Yo, that's so [ __ ] embarrassing, bro. What? That is so [ __ ] embarrassing. just lost this [ __ ] bro. Yo, my teammate can clutch up. I I got high hopes high high hopes for no [ __ ] I just lost to B. That [ __ ] is so embarrassing. >> Yeah, my team about to win. See, look. High hopes for this [ __ ] bro. >> Chad, I just That was my first game. That's it. That was my first game. That was my first game. See, I can cool it. That was my first game. >> That was my first game. So that's why >> I'm a little bit rusty. That's I haven't played this game like in over like two years. >> Daniela Bab donated $1.99 through super chat. My teammates are gone. >> Why hasn't your bro congratulated his friends? >> I just had a few flaws. That's it. >> But I'm about to get this [ __ ] down. >> Round three. >> Just had a little bit of ups and downs. All right. I'm about say no emoticon speedfitit colon Oh my god. Oh my god. I thought I was going to lose. I thought I was going to [ __ ] lose, bro. Oh my god. >> Victory. >> Oh my god. Oh my god. Oh my god. Oh my god. That's easy game. Then die once. My ear. [ __ ] that [ __ ] hurt. My god. I got to find a new opponent. That [ __ ] God damn it. And it's going to take another longer time to My god, bro. Well, chat, it's your boy Jamal. Oh, I look rough. I need to I might just go to bed, bro. I ain't going to lie. Might get these few hours with my ear. I'm doing good, bro. Thank you. Like Mike donated $499.99 through super chat. >> Now would be a good time to say something nice about speed. Someone clips it and he sees it in the future hard hands. >> Radin 212 donated try 44.99 through super chat. Today my birthday. Say happy birthday to me. Pls to line up. No, bro. Just be that. What's up? She need to go to bed, bro. Okay, this might be a good game. Interesting game. It's going to be an interesting game. Round one. >> All right. Easy game. No, no, it's not. I can't say that. I don't know how I don't know how this game going to turn out. I hope it turn out. Yeah. [ __ ] out of here. This nigga's ass. Oh my god. Already off the rip. No. Oh yeah. >> I can't I want to do you dirty, [ __ ] >> Yeah. Get the [ __ ] off somewhere, bro. This [ __ ] doing all that. No reason. He ain't no sign of respect or nothing, [ __ ] I see how it is. You [ __ ] Both of these [ __ ] ass. Both of these [ __ ] donated $4.99 through super chat. W Jamal and Speed. Hope all y'all are doing good. Much love. >> Both [ __ ] are ass. Both of them [ __ ] are ass. Wait, does it actually look like that? Yeah, both of them [ __ ] are ass, bro. [ __ ] [ __ ] a sign of respect. These [ __ ] don't got none. >> No wonder these [ __ ] act like [ __ ] This [ __ ] don't got no respect at all, bro. >> Me either, but still. >> I hope I got bumped into the fire two times. [ __ ] this game. I'm not about to win. Teammate, teammate, please win. Teammate, please win. He's [ __ ] low. He's so [ __ ] low, bro. He's so [ __ ] low, bro. Post to the for [ __ ] >> Thank you, teammate. I love you. >> W teammate. W teammate. >> Round three. >> What's up with these [ __ ] Like like these [ __ ] like rude and [ __ ] >> Oh yeah, teammate. You got it, baby. Oh, teammate [ __ ] died. He got shirt. Oh my [ __ ] god. Teammate, it's okay. I got this teammate. I'm like, what the [ __ ] was that? He didn't even block it. He got that. Oh, okay. He got that. He got that. >> I will have that. I will have that. He >> That's all him. He can have that [ __ ] I just want another game, bro. [ __ ] this. That nigga's not good anyway. He's not good anyway. He's not good. I can mobile here. Look, I might get >> Yeah, [ __ ] that. I ain't doing this [ __ ] dirty. He's doing me dirty. He's doing me. [ __ ] that. Oh my [ __ ] god. It's the same [ __ ] It's the same [ __ ] >> [ __ ] Victory. I'm that [ __ ] I'm that [ __ ] chat. I'm that [ __ ] [ __ ] >> Put some respect on my name, bro. [ __ ] out of here. >> Team Loro 6 donated€2 through super chat. >> Can you please slap speed? I would then send more. >> Don't do that, bro. Don't [ __ ] do that. I came up like that, [ __ ] Don't talk to you like that, bro. Little boy or something. That's easy. L Jamal, you didn't see what I just did? I'm a god, bro. I'm that [ __ ] You going to say L to me? >> Where do you get off? I'm a jerk. >> Let me stop that. >> Kurd bear donated $2 through super chat. Keep it real, bro. You've been sneaking snacks. I'mma hop on and one v one you. Yeah, right. [ __ ] out of here. You know, nobody want to work. Nobody want to smoke. They don't want the smoke, bro. I play with these lower life. No, chill out. I play with these lower life forms and joints, bro. They're not like they're not they're not ready for this, bro. I'm not ready for the light work. If you want me to handle you, hop on, I guess. But you're just going to get bullied out. You're just going to get bullied. That's it. That's all I got to say. Nobody can Nobody can beat me in this game, bro. It's like It's like It's not easy, bro. It's not easy. It's not easy. Nobody on this bus can be on the game. I know that. >> Super chat. www speedow destroyed them speed speed speed happy speed herald >> Matt Flair donated $5 through super chat. You should blow your nose if you keep sucking the snot and you'll be sick longer. >> You got to get the germs out. Time to do this dirty donated $1 through super chat. >> All right, this is going to be interesting game. Teammate not going to sell. I know he not. I know teammate not going to sell. If he know I'm not going to sell, I know he's not going to sell. I touch very hard. The [ __ ] >> Round one. Now emote now you're dis Oh no you're ass. He's ass. He's ass. I'm going to do him dirty. >> He call me off guard. Thank you for getting my HP back up. >> Slice. I know that. I know that. Do not come. Give me a Okay. Back emo. I know you can emote. Yeah, you the [ __ ] What the [ __ ] Put some respect on my name. >> Victory. >> Come on, chat. I do this. Like the [ __ ] >> Yeah, this is online. Yeah, this is online. >> Like, come on. Like, what the [ __ ] Who do you think I am? Oh my [ __ ] god. [ __ ] are lucky. [ __ ] are so lucky, bro. T, I know you're not gonna sail. I know you're not gonna sell, Tm. You're not like that, teammate. You just got something special about you, bro. >> Yeah, [ __ ] you, teammate. I hope you I hope you lag out. I don't want you no more. Your [ __ ] ass. >> Oh my [ __ ] god, bro. Thanks a lot, [ __ ] Couldn't beat that [ __ ] at all. [ __ ] couldn't beat that [ __ ] I still got more to come, bro. >> No, bro. You don't emote. You're so dis You're so bad. Oh my [ __ ] Oh my god, Chad. He's so [ __ ] bad. He's a bad boy. >> He's literally a bad boy. >> Chad, he's a bad boy. He's a real bad boy. >> Like, what the [ __ ] >> Teammate, what the [ __ ] Teamming Tming, I just I just told my chat I'm good as [ __ ] and now y go. What the [ __ ] >> Teammate, like what the [ __ ] dude? I don't think you like what the [ __ ] is Oh, bro. Like, what's up, G? >> Oh my god. It's like I >> Yeah, [ __ ] this [ __ ] Oh my god. Oh my god. [ __ ] it. Teammate. Teammate. Teammate. Teammate. >> What the [ __ ] are you doing? What the [ __ ] are you doing? Teammate. Teammate. What the? He's bagging. Oh my [ __ ] god. He's bagging. Teammate [ __ ] ass. Teammate's ass. Teammate ass. What the [ __ ] bro? I just told these [ __ ] in my I just told this chat that I'm [ __ ] good at this game, bro. I just told this [ __ ] bro. I just told these [ __ ] and my [ __ ] teammate is going to act like a [ __ ] loose fish and [ __ ] sail, bro. It's my teammate. It's not me. It's my teammate. It's my teammate, not me. It's my teammate. It's not me. It's not me, guys. It's not me. It's my teammate. Not me. It's my [ __ ] teammate. >> It's my [ __ ] teammate. It's my teammate, guys. It's my teammate. He's got to be my [ __ ] teammate. He's got to be my [ __ ] teammate, bro. I don't like that, bro. I don't like that. I don't like that very much. >> My teammate This is my last game. If I If it hits two minutes and not give me a game, I'm hopping off so I can let this be asleep. Whatever. Chad, you want to see my SN here? You want to see out? That's crazy. I do that. Oh [ __ ] like a million dollar. I kind of did not. [ __ ] that. This is my last game. This is my last game. This is my [ __ ] last game. Oh my god. My team dog ass. Teammate, I hope you don't sell, bro. I love you, teammate. Just let you know. I hope you a smurf. I hope you're a smurf, teammate. I hope you're a smurf. He got to be a smurf, right? >> Okay, this [ __ ] got some What the [ __ ] >> This [ __ ] just play. Yo, I love my teammate. Yo, this [ __ ] is a god. This nigga's good as [ __ ] >> Cuz what the the [ __ ] What the [ __ ] is this [ __ ] trying to do? >> What the [ __ ] Oh yeah, good [ __ ] teammate. Oh yeah, bully that [ __ ] Bully that [ __ ] What is you doing, kids? The emo says smurf. It's not. Okay, bad. Okay, >> victory. >> What the [ __ ] >> Yo, what the [ __ ] was that? Like, bro, my teammate, bro. What the [ __ ] teammate? He had that [ __ ] in the back. No, my team had to win that back. shield characters. Oh yeah. See, look. I knew my team was going to win that [ __ ] Don't be teaming. See, look. This is why >> victory. >> Don't Don't >> Okay. This is why you should never never ever >> judge a boo by his cover. >> Round three. >> Never judge a boo by his cover, chat. Cuz my teammate is like a prodigy or something. He's good as [ __ ] I high hopes my teammate. He's going big these days. He's going big. >> That [ __ ] dirty. But uh my teammate's doing big. There we go. That's what I like. That's what I like. My teammate know. >> Thank you teammate. Thank you for my for my last game. Thank you for the death for my last game. Thank you. See, that's what I like. That's what I like. That's what I like. The beauty and the power of that. That's what I like. Level 16. Like that. Just that just bring a smile to my face. I don't know why W teammates WT teammates like that [ __ ] just like made me happy for some reason. Like it made me like joyful. I'm not giving a rematch. That's why I love that work that that effort. That teammate made me smile. So I can go to I can go back to my bed with a smile on my face. Wait. That's what it say. No, I can go to bed with a smile on my face cuz I know. Well, I'll see you later, chat. Toe donated €22 through super chat. What's up yam all? How are you doing? Greetings from the Netherlands. Netherlands. Netherlands. Soski donated SAR 3.99 through super chat. Soski donated three Saudi realals and 99 halalas through super chat. toe donated €22 through super chat. WhatsApp speed good morning from the Netherlands, Netherlands. Tiger TX13 donated $5 through super chat. Six. Seven. Dur passive letsman luan 1510 donated 5 through super chat. It grew den shown in Deutsland. Alice Ferdland, Germany, Germany, Germany, Germany. Blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart, blue heart. Radimir 4K donated $3. Wake Monkey King M3 Meech donated $1.99 through Super Chat. Wake your Swiss cheese smelling awe up. Louise Keeper donated $2 through super chat. Hey girl. Luis Keeper donated $2 through super chat. Six. Seven. Dur passive letsman luan 1510 donated €2 through super chat. Monkey monkey monkey monkey monkey soloid forza east verdage runner gelotney. CJ donated £1.99 through super chat. Fun equals RZ girls. Surprise the public. Big crowd. Quinton 108 donated $4.99 through super chat. Wake up. Dur passive letsman Luan 1510 donated €2 through super chat. Messi is better than Ronaldo. Ronaldo sucks. MBA donated $1.99 through super chat. Wake up now before I come on your face. Quinton 108 donated $4.99 through super chat. Get the [ __ ] up. Sashesby donated $4.99 through super chat. Sajisby donated $1.99 through super chat. Eli Wakula is the greatest player of all time. See elsewhere? donated $1.99 through super chat. I'm troking my [ __ ] Morning wood on go, son. Mr. Clarky donated 2 through super chat. Hello. Hello. Hello. Hello. Hello. Hello. Hello. Hello. Sashesby donated $1.99 through super chat. Don't move in the next 5 seconds. Finus. Trinity Jane donated $1.99 through super chat. Speed poops in his mommy's bathroom. La. Drew Levenson donated $2 through super chat. Fort with guy again. We all want it. Trinity Jane donated $1.99 through super chat. Speed, please fart if you can hear this. Please, baby. Suka donated $2 Canadian.79 through super chat. J Hallelujah. Hallelujah. Drew Levenson donated $2 through super chat. Fortnite with Guy again. It's time. Trinity Jane donated $1.99 through super chat. I need speed seed. I need speed seed. Yummy yum. Raj Singh donated $2.",
    "start_time": 1.33,
    "end_time": 42396.4
}