{
    "video_id": "5ZKLMLm2YLs",
    "channel_url": "@ishowspeed",
    "transcript": "[Music] Your boy's here. You've been training? >> Yes, I have, man. I've been working my ass off, bro. Just for this moment. >> All right, let's get it going. Let's see what you got. >> Let's go. Let's go. >> We need the grid iron. A sacred battlefield where legends rise, dreams are fulfilled, and legacies are forged. Now comes the story of an unrelenting talent. Ready to prove he belongs amongst the best in the game. But first, Speed will have to convince arguably the greatest of all time, Tom Brady. Seven Super Bowl rings, 15 Pro Bowls, 29 all-time records. His opponent's speed once caught a TD pass in pee-wee football. Brady will push speed through the gauntlet of the NFL combine. Ruling test of skill and heart. But football isn't one with stopwatches and measuring tapes. It's one on the field. Can speed rise to the challenge? >> What are you doing here? >> I'm ready for you. >> Can David slay Goliath? This is Speed Goes Pro, presented by Dicks. Uh-oh, it's that time. Oh yeah, baby. The NFL invites the best college prospects every year to an event called the Combine. Multiple skill and measurable tests that help scouts get a read on one's athleticism. Speed will put his performance up against other DB hopefuls as he attempts to match their numbers. For the combine's drills, Speed has enlisted the help of an elite trainer. Cliff Marshall has spent more than 20 years training professional athletes, including hundreds of NFL players. If anyone can get speed ready for the gauntlet he is about to attempt, Cliff is the guy. >> Let's work. >> Our whole focus right now is on the 40-yard dash. All right. >> I want to break that world record. >> I know you've got top end speed, but what we've got to tighten up is your stance first. >> So, thumb right here. >> Yep. Take your knee all the way down. Yes. Your start. This arm is going to come up. Big deep breath. And your acceleration. It's an explosion. >> Speed comes from your arm. >> Oh, really? Speed. Go. >> If you do that, you will run a fast 40. Tom, throw it. >> Yes. Perfect. and you will prove to Tom Brady and the rest of the world that you're good enough to play in the NFL. >> I'm already good enough, but let's go. >> My knees drop. Go. Run them run drop. Push. Here. Go, go, go, go, go, go, go, go. Yes, you got it. We ready for the four yard dash? Growing up, I was just always fast. I just ran to where my natural body just went to. >> Oh yeah, [Music] >> but it doesn't work out against the big top dogs. >> That's why I'm working today. I'm going to get that 40 yard world record. I promise you. What's the world record? >> Four twos. Yeah, four twos. >> I can get that. When testing the vertical jump for the combine, it's very important that your stance and that your technique is correct. You want to explode up and you want to touch at your highest point. Hands down. Explode. Hey, there we go. >> Come on now. Nice. So hot. >> The second jump is the standing long jump or also known as the broad jump. This time instead of throwing your hands up to touch, you're throwing your hands out. Hands down. Jump. >> Great job. All right. You've got explosiveness. >> Yes, sir. >> There's one test that's going to measure your change of direction quickness, and it's called the three cone drill. So, you're going to be here. One, two, three. One, two, three. All right. You can explode out, but you want to be under control going into the turn. All right. Go. Touch right. Touch right. Good. All right. Time. That's it. Time. >> I want to hear your prediction. My 40 yard dash. What do you think I'm What do you think I'm running? >> If you don't forget what I taught you today, I think you can hit a 44. >> I think 43. People laughing, but I I think 43. >> Ask any NFL superstar and they'll tell you whether you win or lose. Your fans will still be waiting for you outside the venue. >> Speed has that part down. >> All right, Tom. But there's still much more to learn and only so little time. Question: How does one train to be a defensive back against a seventime Super Bowl winning quarterback in one day? Answer: The secret is in the sauce. >> Intercepted. Sauce. Cardier's got it. Sau's personal trainer, Akquil Bordalon, joined him at Forom University to train, teach technique, and ensure Speed doesn't embarrass himself in front of TB12. >> Yo yo yo, man. It's that time. >> You showed up. >> Let's get to work, man. >> Nice to see you. >> Let's get to work, man. Hey, I need to learn everything today, man. >> This going to be a day. >> I'm ready. While the hardest position in football is subjective, many, if not most, will tell you playing DB, or more specifically cornerback, is the one. >> I'm going to teach you a little bit of stuff about just being a DB. All right. Yep. Open up the open up. Open that hip. It's all about the hips. When it comes to being a DB, you got to have good hips. >> There is no doubt speed has the physical tools, but what about the skill? >> Hey, don't get scared of that ball, man. This is coming fast, bro. >> How you think Tom going to throw it tomorrow? >> Exactly. Oh, here. Come on. I like that. >> I like the works, V. >> He tired. >> I'm a little gas. I'm glad I carved up. Hey, pancakes before this. >> I don't know if that's going to help you. You don't want to overcarve when you about to train with him. >> Why? They might come out of you. >> Yeah, exactly. >> My first time training with him. I carved up. I'm on the way back. 2 minutes away from the spot. >> We threw up. >> Told the driver, stop the car. >> Damn. >> The hell we about to do today. Good. >> I see I see a young a young man that's that's willing to learn. That's why I wanted to have my trainer come cuz I knew, you know, that y'all wanted us to be hard on him. I think he's going to be in pretty good shape come tomorrow when it's time to go against Tom. So, the expectations are high for him for sure. And just think about think about the receivers. They be like this up top, right? They do all this, but look at my hips, >> right? >> My hips not moving for >> stay the same. >> But this is if you looking at this, then you going to be like this. >> Got it. Boom. Boom. >> Hey, don't come up at the top. I need you to maintain here. I need you to here. Boom. Here. Boom. I like that. >> There we go. >> We getting somewhere. >> Let's go. >> I think he can keep up. It's looking like he's around in that 44 area. You know, 44 and some change. That's pretty that's pretty fast. You know, >> finish. >> I don't think he's faster than me. You know, I'm in the high four four threes for real. You know what I'm saying? But, you know, he he up there, >> man. Ty don't know what work I'm going through right now, dog. We really put in work. Open. No. Hey, come back. Come back. It's a lousy rep. I get you got a lot of like energy. Calm down, speed. Your eyes was not right. You came out your break and was like this and then you went up and was like this. >> When it comes to sports, I rely too much on my uh athletic ability and football is one of them. Even though it's maybe 70% athletic ability, but at the same time, it's technique as well. Come >> on down. We lightheaded, bro. You got your You shouldn't get lightheaded off all them carbs. You said you had to say that them pancakes. >> Come on. >> Scale of 1 to 10, how hard is this? >> All right. I'm a guy who like learn quickly. My honest rating, I say a solid like six. >> How you getting lightheaded off a six though? And you carved up. You carved up. You drinking water and you still getting lightheaded. But it's only a six out there. Come on, bro. Like Like I get it. I get it. You want >> All right. Sauce. I give it a eight. >> I get it. You want >> He want to seem like nothing fades him. I get it. >> Open. >> Come on. Get up. Get up. Get up. Get up. Get up. >> Hey, it's his field. >> It ain't the field. Let's go. >> I think I'm getting tired. My body ain't moving how I want to move. >> Brady ain't going to look at him be like, \"Oh, he tired. Let me chill.\" >> Bro, I can't be backing down. I might as well get the gold. >> Yeah, >> I need to lock the hell in. >> Activate your feet. Boom. You can go this way. Boom. You can go this way. Go get it. Hey, >> you feel me? >> That's all it is. Good. [Music] Think about it. You just picked off Tom Brady. I picked off Tom Brady. Hey, if your eyes right like that, technique right like that, you're not going to be able to complete a pass on. >> That's what I'm saying. >> Before a battle is waged on the field of play, an equally important battle takes place in the mind. >> How are you? >> Nice to meet you guys. When Speed found out Tom Brady would be at Fanatics Fest in New York City, he found the opportunity to fire the first shot. >> What are you doing here? >> It's that time. Tom, I've been training just for this moment. I'm ready for you. >> There's some places where your attitude and I love it. It doesn't translate and it's not going to translate on the football field. Yo, Tom, I want you to sign my favorite quarterback Thursday of all time. >> I didn't know it was your favorite. I always wanted you to sign it, man. >> Oh, man. Here, man. Can you please sign this, man? >> Please, Tom. >> You know what? I am going to sign it for you. Speed. Good luck. You're going to need it. >> So, I did sign it. And tomorrow It's going to be a lot harder for you. I'mma see you tomorrow. >> I'm going see you tomorrow. >> I'mma show you the real speed. >> Get some sleep tonight. >> I'mma show you the real speed. >> Good. [Applause] >> The day has come. The clock is ticking. With Brady on the way, Speed has a little more time to get some training in. Having twotime Super Bowlinning wide receiver Danny Amandola there to help doesn't hurt. >> Let's go. Welcome to the NFL combine edition of Speed Goes Pro. You ready for this? >> Tom is finally here, bro. >> I want you to be above the average in every event. Yes, >> we we got this. >> That's the goal. >> You got it. I know. I know you can do it. >> The bell toes. If it's Tom Brady speed once, it's Tom Brady speed will get. [Music] What is that? [Music] This man pulled up in a helicopter. Oh yeah, it's on. It's on. Hey, I can't believe it, bro. He's really ready. This man has seven Super Bowl wins. >> There he goes. >> He won a ring in three different decades. That's more than any NFL franchise. Now he's here for speed. >> Oh my god. >> Come on. Let's go. >> I can't believe you, bro. >> You got me excited. You pulled up on a helicopter. >> You like that? >> Okay. You ready, man? >> Boys here. You've been training? >> Yes, I have, man. I've been working my ass off, bro. Just for this moment. All right, let's get it going. Let's see what you got. >> Let's go. >> Let's get it. >> All right, Speed. We're over to the vertical. You hit like a 36 earlier and you weren't even You're just joking around. We got to hit a 40 today. You got this. >> This a good position right here. >> Yep. >> You got this. Come on. >> Good. It's really good. >> 37. >> You got three inches. >> 3 in. >> Yeah. Three more rings. You got it. >> I need to get three more rings for 40, man. >> Let's get 40. [Music] >> Yeah. >> Oh my god. >> Go, baby. >> That's unbelievable. >> That's 40. >> Let's go. >> 40. >> I did a 40, man. >> That's insane. >> 40 B, y'all. Hey, come on, man. >> Your draft stock just went up. >> Way up, by the way. 40. Like that's like the 1% of 1% of 1% of 1%. That's very impressive. >> Next up, it's the broad jump, huh? >> I got a feeling you're going to do good in this one. >> Yeah. >> Trying to get him drafted this year. >> Yeah. >> Come on. Come on. Come on. You got this. You got it. Feel it. >> Let's go. Speed. >> Come on. >> Get up there. Really good. >> Really good. >> Hopefully that was more than a 10 four, y'all. >> 10 two. >> 10 two. >> That's pretty good. >> Yep. 10 two. >> I got a 10 two. >> I take that. >> That's good. >> It's not bad. >> I guess it's not bad. >> That's explosive. [Music] >> All right. So, L drill, you know what to do. The advantage is honestly for the smaller guys on this. Like for the guys that are fast on the 40, they're slower on this. The closer you are to the ground, the better for the turns. I'm ready. >> Got this. >> Yes. >> Yes. Keep going. Your number. Keep going. Your number. Keep going. Yes. Keep going. >> Yes. 73. >> 73 with one slip. >> 73 is not bad. >> Look, that was great. 73. But we all came here for one reason. We got the 40 coming out. Let's see what that speed is. That's what it's all about. >> What everybody been waiting for. >> That's what everybody's been waiting for. >> Come on, man. Time for the 40. >> Uh, if I have run anything higher than a 44, it's like >> you got to run under 44. That's fast, man. You're going to have to change your name if it's over. >> Yeah. You know, like it's this. >> It goes without saying that the 40-yard dash means a little bit more to our protagonist than the other combine events. To be considered NFL ready, Speed has to break a 4.5. Every 100th of a second matters. Matters a lot. There's no more hiding. It's time for Speed to show us all where he got his name. >> Take your knee all the way down. >> Now, at this moment, this is when you're getting your mind up. This arm is going to come up. >> Come on speed. Everything you got. >> 1 2 1 1000. I got speed. >> Let's see what I got. >> Oh no. >> 469. >> All right, we got good news and bad news. 469. >> What? >> But the top speed was 21.3 mph. So that's fast. No, I got to go faster than that. >> I'm just getting warmed up. Come on. >> So, that was 4785. >> Hey, try one more time. >> Get out. [Music] >> 46. >> What's the fastest one? >> I don't know, man. 461. >> God damn it. >> But your fastest speed for sure. Yeah. It's not It's not what I'm expecting, but I feel like like I'm running. I don't know how to explain it. I feel like I'm not running as fast as I can. >> You want to try to run this way? Let's run that way. >> What? This way? >> Yeah. >> Let's flip it. Come on. >> It's been said that to become a true professional in any sport, you must be a little crazy. It's also been said the definition of insanity is trying the same thing over and over again, expecting a different result. Welcome to the insane asylum. >> I'm going to get this one more shot. So, let's see what I can run. >> Come on. No thinking. Let it go. Come on. This is the one right here. Come on. Let's go. Come on. Get out. Come on. Come on. >> Oh, he did it. >> 4.49. >> 449. >> Come on. >> How'd you do it? You did it. You got a little >> I know it's took a little minute. Got pissed off and you did it. >> Way to go, baby. >> Hey, you pushing. >> Way to go. >> Pencil's down. The time for taking tests has come to an end. Unlike every other NFL prospect, our rookie has no time to ease his way into the game. Speed must skip straight to the final boss. >> You've been talking a lot of >> Damn right. And you know what I like when people talk. >> We're going to whoop your little ass. >> Let's go. >> All right. >> Let's go. >> All right. >> I'm locking all this up, man. Come on. >> The rules are simple. Brady and his receiver Amandola will line up at the 50 yd line and will have four downs to score a touchdown. An incomplete pass moves TV 12 back 10 yardds. If they can't score in four plays, Speed wins. Ready? Hey, we got to run that back. >> Wait a minute. That took one throw. >> Come on, let's run it back. >> All right, let's run it back. Do we got to run it back? >> I'm just getting warmed up. You got to understand, I got to get myself in the game. Let me wake up. They not getting no more. >> You don't win seven Super Bowls by being bull. >> Ready? We need 18. Good D. >> What' I say? >> That was good. Grenade teeth. I'm getting warmed up. It's fast pace, but I can go faster. I'm just waking up. We need that better. >> That was better. You >> all right, buddy? >> I think it's cle got me. Ah, >> you all right? >> Is that turf? >> Yeah. Not that though. I think I think his cle hit me a little bit. I went up for the ball to swipe it down. Then as I swiped, he he dive too. And as he dive, his cleat bends my knee and it scraped my knee as well. So I kind of got like a little bruise as you can see. Like this knee is way more fatter. It >> was good coverage. You okay? >> Yeah, I'm good. >> Yeah, >> I could have just stopped. I was like, you know what? That's it. I could have stopped the whole video right there, but I'm still going. Like I'm limping right now. I'm not backing down. I'm finishing this video at all costs. But they didn't score yet. >> It's fourth and goal. If speed can prevent the ball from reaching the end zone, the bragging rights will be off the charts. But make no mistake, Tom Brady didn't come here to lose. Good, man. Good job, baby. You're good. Good job. showing heart today, bro. You know what I'm saying? Dude, where' it go? >> You get all the numbers you wanted to get. >> Come on. >> You want to try some O? >> Now it's time to flip it. >> You want to try some? >> You got me now. Now it's time to get you, bro. >> Let's go. >> Let's go, man. >> Let's go. >> You want one of those? >> Let's go. Come on. >> All right. >> It wouldn't be right if you got to spend the day competing with Tom Brady and not get a chance to catch a pass from the greatest to ever throw it. With the script flipped, it's time to see if speed can put points on the board with the GOAT. When you get to 12 or 14 yds, if he's still inside, you can break out. >> I'm going to try to pin his ass right on the line right here. >> So, it's an option. >> So, basically inside, >> start in, go up. And you can either break out or across 18. [Music] How do you get over So, the real question is, what do you think? Can I be an NFL pro? >> Yeah, I think you can, man. >> Definitely. Tough speed is there. Jumping, >> attitude, work ethic, >> all of it counts, man. >> That's all what it's about. >> You got what it takes. >> Be goes pro. >> Let's go. Let's go, man. >> Let's go. >> The day is over and Speed now knows he has what it takes to be a professional football player. On his way out, Tom couldn't help but accept one more challenge. Man simply won't back down from anyone. >> Go a goalpost. >> I give you 100,000. What? >> This might be too close for 100,000. >> All right. All right. Going to give him >> 75 grand if he hits the >> That's usually like a 30 yard throw. >> Yeah. >> I'll say Messi better if you hit the go post. >> Messy better. He said Messi better. >> 75 grand. [Music] >> Pay the man his money. Pay Pay the man his money. You owe me something. Hold on. Hold on. I'm filming this myself. >> You can't I won't say it. You can't film. >> Let me just No one can film it. You can't say it. >> Turn the camera off. >> You ever heard of Wonder League test? The what? >> Everybody got to take it. Let's go. >> Bro, you know I dropped out of high school, right? >> Everybody path different. >> A shop miner bought some shovels for $5,000. The shovels were sold for $7,300 with a profit of $50. >> Come on, bro. Does F ak mean frequently asked questions? Yes, I know that. I'm not stupid. Which word does not belong? Dentist, economist, surgeon, layman, neurologist? Economist? Imperious is the opposite of I never heard that word before. Sh. This is I actually feel dumb. Which one has the biggest diameter? The sun. I'm done, bro. Wait, there's more. [Music]",
    "start_time": 0.32,
    "end_time": 1524.67
}