{
    "video_id": "XwWErRccYqg",
    "channel_url": "@ishowspeed",
    "transcript": "if they want to restart the um >> Yeah. >> Wow. [Applause] It's >> a lot of people [Applause] space. [Music] Yeah, >> it's crazy what people >> I'm about to stage dive. >> All right, what are we going to do now? >> Get the cars. [Music] [Applause] Holy crap. [Music] >> What? [Music] [Applause] They they >> huh? >> They want me to stage. >> N [Applause] >> that would be lit. >> Go down then if you want to do that. >> Tell me to stage if they want me to do. It's not for >> They got me. I feel like they got me. Bosnia. >> Oh yeah, I remember that in Bosnia. [Music] >> What if I just started? What if I just got my own party? [Applause] >> No, huh? [Applause] [Applause] I do a back flip. I might do a back flip. >> I do a back flip. >> Hey, hold on to this. Somebody >> Yeah. [Applause] Yo, open door. Open up. [Music] >> [ __ ] [Music] My phone. Where you got my phone? >> My Chinese phone. I just gave it to you. Yeah. Thank you. >> That was a fire back. It's how people are right now. [Applause] >> What? What? Take a tour through the toilet. >> What is that? >> That's a house. [Applause] >> I might do the I might do the >> might do the stick it right there. [Music] [Applause] Hey, that was fire. >> That was hella lit. [Applause] Holy [ __ ] [Music] >> Yeah. [Applause] >> No, I ain't going to lie. That was funny. [Music] Oh my god. All right. What are we going to do now? [Music] [Applause] >> Hey, what we doing? [Applause] >> What? What? >> What? >> They really want me to jump, bro. [Music] >> They really want me to jump, bro. >> Is the courts here? >> Where they at? All right. All right. All right. Then we should go now then. >> What? We should go now then. >> Let's go. Let's go. >> Get down. >> Get down. >> Let's go. [Music] Where my dad and brother? >> This way. This way. >> Yeah. Yeah. >> O. [Applause] This is lit. [Music] [Applause] [Music] >> Technically, we >> technically I can start my own party. Backing in [Music] the way. Watch out. Watch out. Watch out. Other [Music] side. Back up. Back up. >> What? >> They're not in here. >> They're right behind you. Right behind you. >> Get in. >> What the hell? [Music] Stop going to house. [Music] >> All right, let's do an actual activity. [Music] All right, let's do an actual activity. >> Let's go. [Music] [Music] >> And then we'll go to the racing. >> I played I feel like the racing should be the one. >> I know, but the racing is there still because they had to move from where we just were to spot. So, He see greatness in me. >> He said he sees greatness in me. [Music] >> What the [ __ ] is a giraffe doing in here? >> Look at White Speed. >> He's really here in LA. >> White Speed is here. Bro, white speed is here. [Music] [Music] [Applause] What are you doing? [Music] [Applause] [Music] >> The lights out for you. >> Oh yeah. >> Oh yeah. What the [ __ ] is that? >> A laundry room, [Music] >> bro. What the [ __ ] bro? Starting to get pissed. I love you, man. I love you so much, bro. >> Thank you, buddy. >> Oh, yeah. >> You know what I mean? >> Oh, it's a steam plant. Mama mama. >> See mama. [Applause] Bro, I'm [ __ ] with you. >> Like I was about to say >> LA or the Bay. [Music] >> Man. >> Hey. >> Yeah, I know. We didn't see tomorrow though. But we'll see you tomorrow. >> I will play basketball. I won't race your ass. >> Race me for that change. [Music] >> I'm from LA. >> You going to lose. >> You ain't [ __ ] >> fight. Hey, flight. >> There's already a flight. >> Get in the street. Me and you tell people I'm from LA. You already know. Hey, take a race. Oh, God. >> Yeah, right. >> Hey, we shout out to you, my brother. You doing your [ __ ] God, I'm proud of you, bro. God for me. Oh [ __ ] >> This [ __ ] too funny, bro. >> This [ __ ] way too funny. little dead early this evening. >> I already I already beat somebody from the Bay in a race. Now I got to be somebody from LA in a race. Hey [ __ ] this car. No. >> My boy and I'm out of here. >> What? Why you got a ski mask on? >> Shout out to >> Why you got to ski something, man? >> I can't do that, man. I'm wanted. >> You're wanted? What the [ __ ] What you mean you wanted? He said he won it for for for what? >> Shout out to my boy. >> Shout out to my >> Columbia. >> Colia. Yes. >> What? >> I just did. Shout out to your homies. >> Duvon. >> That's right. One time I couldn't even reply and know it wasn't John. It actually was all right. But you ain't even my type. You were just for the night. Now I ain't trying to fight. I'm just saying the truth instead of playing game. This what I usually do. If I ain't still in school, then I'm probably just still in school. So I'm just doing me like you should be doing you. I love the way you ride it. So I'm just saying the truth. The way you came up over my feelings is never through. If you don't know the view to be all up on me, I had to talk to my homie. You talk tell me your stories. That's my song right there. He said he ain't phony. I trying to You don't know me like that, >> huh? >> TJ, >> bro. Yes, bro. I know all his music. >> And know it wasn't John. It actually was all right. But you really ain't my type. You just put the night I ain't trying to fight. I'm just playing the truth. >> Remember >> who >> from where you remember? >> Would you do a song with TJ? >> Yeah. Think of the art. >> You don't know me like that. >> Firefighters. [Music] >> I hit it one time. I couldn't even reply. And no, it wasn't dry. He actually was all right. But you really ain't my type. You was just for the night. Now I ain't trying to fight. I'm just saying the truth instead of playing game. This what I usually do. advice. >> Somebody said the EMS. >> We took one already. [Music] [Applause] >> Let's do it again. Shout out to my boy. >> We just shout out to your boy Danni. >> Seattle. >> Seattle over there. [Music] Yeah, right. >> You look slow. You look slow. >> Yep. >> I am. Hey, don't worry. These cars be driving. >> Like seriously. You just for the night. Thank you, bro. I love you. >> Oh [ __ ] >> What the hell? We need the mic. Got Can I get my uh real phone? >> Get my iPhone 17. I ain't trying to fight. I'm just saying the truth instead of playing game. That's what I usually do. Stay in school. You don't know me like that. >> You was new, right? >> Yeah, I was. I'm having a good time >> last couple of days, man. What? All right. Please figure it out, bro. TTS, you know, >> speaker is not in the car. >> Only way we can connect the phone. >> I brought I brought two. I brought one in the back. So, it should be in the trunk. >> Check in the trunk. I brought both of them. Is it there? >> It's not. They took both of them out. >> I see connection to the car. >> I can see the phone. Samsung. See if I can connect. >> Oh, what? >> The Samsung. >> Yeah. >> See if I can connect to CarPlay. >> You got to be like part. I think might work. >> Is that the one that goes? >> Stop [ __ ] playing, bro. >> No, it's fine. He hasn't. He's [ __ ] playing this [ __ ] >> Wait. >> Yeah. Who was here? >> Yeah, we got it. >> Stop playing. Time is 9:25. 9:30 right now. 9:25. >> Is it connected? >> Yeah. Yeah, it's connected. Nobody's in the TTS yet. >> All right, cool. >> I got it. I hold it. >> Yeah. If I were on, if I was driving, I can't [Music] >> Uncle T35 donated $2 through Super Chat. Prayers for Tyreek Hill dislocated his leg today. >> Yeah, prayers. Good thing it was a dislocation though, not a u like a fractured leg or broken. >> BA1 MA donated through super chat. >> If you want to go to a real party, go to UCSB in Santa Barbara, number one party school in the country. >> Charlie Beats donated $5 through Super Chat. W Speed Wour. Mod me up, Brody. You want that mi? >> Sir Tibsy donated two pounds through super chat. Can you meet Brad Pit, Tom Cruz, and D Rock in Holy What? >> Tom Cruz and The Rock. >> Scoffield donated $2 through Super Chat. So much to do. So much to see in Brixton, I reckon. a streaming brick movie. >> I don't even know what that even looks like. >> Chris donated $1.99 through super chat. Dodgers play in LA tomorrow against Cincinnati Red. >> Really? >> It's 6 p.m. >> Juliana donated $1.9. I am a huge fan. Dodgers versus Reds. Reds might win. What you un for? >> Speed head to Woodburn, Oregon donated through Superru. >> Yes, I try. >> LFG 123 donated $1.99 through [ __ ] Speed, can you eat six burgers tonight? In-N-Out. Hamburger, hamburger, hamburger, hamburger. >> I ate five double cheeseburgers. I basically ate 10. I ate 10 cheeseburgers. >> Andy Donated $1.99 through super chat. Pull up to be car meet. Fredo donated $1.99 through super chat. The bay is better than life. >> Oh, he wanted Yeah, that hotel was crazy. >> It was just a big ass hotel. >> What was the name of >> donated $2 through super chat? My legs. My legs. >> My legs. >> Was it on the strip or downtown? >> Down was like on the I don't even know. I think it was like on the strip. This trip is downtown though. Basically, >> 4x Motorsports donated $4.99 through superhat to the bus drivers. Mike, without his wouldn't be possible. >> Mike drove us every night. >> King J7070 donated 35 South African rand through super chat. >> High speed, we love you in pls. Give my YouTube channel a shout out. was never fair. Donated $1.99 through super chat. Link with flight, >> bro. Flight don't want to link, chat. >> That's the one. >> Black Ops donated $1.99 through chat. >> What song you was singing? Also, Fire >> uh it's called apologetic. Huh? >> Rick C donated two Canadian dollars through super chat. Speed, why haven't you come to Canada yet? >> Canada. Canada. Canada. When do I actually do Canada? >> MP Toast donated $1.99 through Super >> I World Cup. I'll do it. There only like three streams I could do in Canada, right? >> Toronto. >> Toronto, Vancouver, and what else? >> Jaden Apprentice donated $2 through Super Chat. Marlon Bedoi said to come to Santa Monica Pier. West Coast NN donated $1.99 through super chat. speed. You said I look slow. Run the race. >> I can tell somebody's fast or not. >> Explore with Chris donated 99 through super chat >> speed. Thank you for amazing tour and I enjoy all of it and thank you for team and wsp speed and w jamal and dad and everyone. Thank you. Gracias. >> Air Iron 160 donated $2 through super chat. Yo, Speed, are you caught up on One Piece? >> I'm 18 18 episodes behind. >> I'm 18 weeks behind right now. >> Gomez fam donated $1.99 through Super Chat. Come to the IE. Dane Thomas donated $4 through super chat. Who is Fuji? Why is he not on camera? >> Fuji is a >> better >> Chaka donated $1.99 through super chat. Play some regita. We get a Zakura. [Music] Start a party kid. You literally could have saved the stream like that. But w love you from Houston. >> N if I would have started a party. >> It just would have been like >> Arturo Sanchez donated $1. >> It don't work like that. Like I could have but it just would have >> speed. Can you tell my son Jay to go to sleep? >> Jay, go to sleep. It would have been like too um you know Yeah, it would have been too chaotic. >> Donated $2 Canadian 79. >> That's why it's better for me to go to a party. >> It's already set up. >> Emir 17 donated $1.99 through super chat. Go to Harvard Park pls. >> Cur 323 P3R donated $1.99 through super chat. >> Taste the money. Taste the money. >> I was doing it at the same time as you >> technically donated $9.99 through super chat. What's this gapper talking about? UCSB party UCLA where pull up to my UCLA apartment. I can air fry some food. >> Chase donated $4.99 through super chat. Come to Englewood at Sophie Stadium. Jacker donated$1 text from doctor. Speed your tests for HIV have come back positive. Please do not shut the >> shut the [ __ ] up sometimes. >> Elias donated $1.99 through chat. Come to South Central LA. Honestly, like I'm 10 years old. 10 year old kids. >> Lenny Sanguino Lopez donated $1.99 through Superch Ramos, please. Shout out to Angel Ramos 13 donated $1.99 through super chat. >> Khan donated $1.99 through super chat. You live, bro. Last 35 days been a movie. Keep it up. >> Thank you. >> [ __ ] >> Lord of Light08 donated $2 through Super Chat. Speed will get a Hollywood Walk of Fame soon. >> Don't you pay for that? >> You really? Yes. >> Daniel Korea donated $2 through Super Chat. Call Snoop Dog. Will with him now. >> He's in Australia. >> Shakar0 donated $2 through super chat. Thank you for coming to Oakland. Yam. >> Yam gas. $5 here. God damn. That's some high ass gas. >> Beach donated $1.99 through super chat. Go to the manhole club unless >> just call me $2 through super chat. Fresno fair Wednesday slide through. I know. I want to >> Fresno >> Leslie $1.99 in a chat >> observator. Great way to finish tour. >> Near 11 donated $1.99 through super chat. Do you watch Demon Slayer? If so, do you like it? >> Yeah, I do like it. >> Wait, I got a question. Is that movie canon or no? >> You know, Jamal >> Gut Dollar donated SARS 7.99 through super chat. >> We need you in Saudi Arabia. Speed big fans out there. Kulo Slayer donated $1.99 through super chat. Thank you for visiting my city w speed. >> Yes, sir. Oh, it is Canon. [ __ ] So, I got to watch >> donated 2500 Costa Rican colog through super chat. Costa Rica beat box. They follow me everywhere I go. PJ in the Monaco. >> Sam Wright donated five Australian dollars through super chat. I just discovered you. You're like Michael Jackson everywhere you go. Haha. Love it. >> Thank you, ma'am. >> Vicente Rivera Chill donated $1.99 through super chat. Speed. I love you, bro. to the max donated $1. >> This is bad, bro. >> Raised GMG donated $1.99 through super chat. LFC Better Than Galaxy. >> Christopher Rabalo donated $4.99 through super chat. Yo Brew, I drove two hours to see you in Santa Monica, but I wasn't able. I only took pick with Lil D. >> Lil B. Lil. Oh, Daryl. >> Tired of donated. Little D. >> Why didn't you go to Venice Beach? >> We did go to Venice Beach. >> Chef WJL donated $1.99 through Super Chat. Go to the Dodgers game. >> How far are we? >> Minute. Aqua_Cookies_Oreo22 donated six Malaysian ring >> speedware Sydney loudly crying heart loudly crying heart loudly crying heart loudly crying heart loudly crying heart loudly crying heart loudly crying heart loudly crying heart loudly crying heart loudly crying heart loudly crying Jay donated $4.99 through super chat should He stopped at Marathon and Burger. Shout out Nipy. >> Marathon Burger. We need to try that. >> Where is that? >> That's uh they have a bunch of locations. >> Yeah. >> Tom Wooden donated 99 through super chat. >> Come and do a tour of England. [Music] numerous roof donated $1.99 through super chat speed. When are you stopping by the Inland Empire? >> The what? England Empire. >> Angel Herrera donated through super chat. Um, >> go to horror nights little boy. >> 13 donated $1.99 through super chat. >> Rudy, come back to Legacy Y Park. We miss you. >> What's that? >> I have no idea. >> We're naming the most random [ __ ] ever. Super chat. Hi, Captain. When can you check clips on Discord and X? I have such an amazing video for you on X. >> Since you missed Indiana, it's all I really want. >> I'll try, guys. If I'm not like super tired when I get back to the bus, >> Chris Malia donated $4.99 through Super Chat. >> Speed, thanks for the stream. Darren Watkins, Senior, you never answered how many baby mamas you have. That's not an appropriate question. >> Hey, Ashon $1.99 through Superhatverified Disney. Get out. Get out. Go ahead. Go ahead. Go ahead. >> Are you coming to Corona? It's the night city. >> Nice seeing you at Disneyland today. $9.99. >> All right, come on. >> Let's go. Oh [ __ ] >> I got to pee back. >> Right here. We're at the the Quarters Korean barbecue porch, >> the best meats >> since 2014. We know that's cap. >> This is the postgame interview, bro. Come on. >> Post game. >> Yeah, in the restaurant. >> We got to talk about what uh what happened. >> All right, we got I got to go back to the drawing board. >> Uh I was a I was a punk going into the haunted house. >> You weak. >> I don't care. >> Me either, bro. I don't do hunting. I mean, that wasn't even a haunted house. That was like >> No, actually you you Wow. You what? >> You got Disneyland. >> What I do in Disneyland? >> No, no, no. Disneyland. So, chat, we went to Disneyland. We had some fun. You know, we did our thing, >> right? >> Then we went to the haunted house. We pumped out cuz we don't deal with that. We're black and we're from We're from Detroit. >> You know what that mean? Yeah. We don't deal with that stuff. You're not about to [ __ ] walk up on us trying to scare us, man. >> Exactly. Then we went to uh Compton. Compton was nice. >> That was fun. >> Yeah. >> Then we went to Where did we go to that? >> Uh that other that other amusement park, >> was it? >> Oh, yeah. The uh No, no, no. That was it. We went to uh the beach. >> The right. >> Let's go. What's good? >> Yes, sir. Yes, sir. Hey. Anywhere. >> What? >> You said what? >> In a primary or anywhere. >> It don't matter. Anywhere. It don't matter. Damn. This food look good. Woo! Oh my god. >> I don't know. I'm just digging in. >> Do we got to cook the food or ozo? >> That scared me. >> What is it? Pretty good. >> Hey, hey, hey. >> Before you eat that. >> Wait, how do we Wait. Cook the food. Cook it. >> I'm not cooked. >> What? >> I'm not being cooked. We don't even have no like oil or like like no butter or nothing. >> No, dude. It's already hot. You put the food on top. >> Why would you put your dirty ass hand? >> Oh my god. >> He just put his hand on a grill. >> No, that's not the point. He just But his hand dirty ass. >> Like my hand. >> I didn't mean to. I didn't mean to. >> You didn't mean to. You >> I can wipe it off. It's >> my fault, bro. >> This soup is dumb good. >> Can I have some? >> Can I have some? >> Have some. What? >> I don't think he going to let me. I don't think he let me drink. >> I don't think he let me eat it. They're just soup. >> It's literally just soup. >> And I'm not going to lie. >> What the [ __ ] >> What? What are y'all doing here? What the [ __ ] What the hell? Y'all put up. >> Sit down. What the [ __ ] >> Of course I surprised this bro. >> Damn. They y'all really pulled up. >> Damn. Y'all really surprised me though. >> You said what? >> You said what? trying to find >> dead ass. >> This our first time in LA. >> You a what? >> Damn. >> My first time in LA. >> This your first time? >> This my first time? That's >> I should have pulled up during the uh beginning of the day. >> Dad, do you remember them? >> Have you ever met them? >> Yes, >> you did meet them before. >> I have. >> You have? >> You don't probably remember. >> No, this too is dumb good. >> What? >> This is dumb good. That's crazy. I just seen y'all in Ohio. How long was that? >> What? >> Two or three weeks ago? >> That's crazy. >> That [ __ ] feel like forever though. I ain't going to lie. [Music] I've been everywhere. [Music] >> Yo, what? >> Oh god. N I ain't going to lie. I really did stream. I didn't even know y'all was pulling up. >> Who set it up? >> Of course. Of course he set it up. >> Of course she did. What? >> I got one more day after this tomorrow. It's my last day. >> That's it. What y'all been on? Right. >> Y'all should have went to uh Hollywood. >> Y'all went Hollywood. >> Y'all went to Universal. >> What? >> The black people at you got to go to confidence. >> What? It's black people everywhere. What is you talking about? >> He talking about where all the black people at. N you got to go. There's black people everywhere. >> He talking about where he talking about where all the black people at. >> The [ __ ] >> Yeah, it was lit. >> Yeah. No, it was too many damn people. >> How long you done? How long? >> I can't say it on screen. >> Say how long he was down >> where Venice >> like an hour we pass. >> Y ain't going to eat no Korean barbecue. >> Oh, y'all just ate. rel >> Oh yeah. There you go, bro. >> Bro, my life is a skit. Bro, somebody made a video of him like they they like click baited and said he was like homeless like >> Yeah, that [ __ ] was funny. >> All right. This soup is the best thing. >> It's kimchi rice. >> Where them fors at? Let me use. >> Where y'all standing at? What part of LA y'all standing at? Downtown. hear that. >> Are you cooking it medium? >> I don't have no fork, bro. >> I got a question for you. >> What? >> How you like your steak? medium. Yeah. I like my [ __ ] I like my [ __ ] pink cuz that's the taste. >> When it's well done is hard. No flavor. Season nothing. >> That's all you worried about is season. >> Watch when you take something. >> We got pulled up the same time that pulled up. >> Bro, the corner literally got out right there. Oh, >> did she ever break up with you? >> He's ready. >> It's ready. enemy. I give you chopsticks. >> You don't Bro, you don't know how to use chopsticks, [ __ ] >> What the >> You got to just like you got to like it's your top your top finger and just pick that [ __ ] up. You're right. >> There's no season. >> But that's not the point though. >> I don't know. The point is is the E. >> That's the whole point. >> N it's hella [ __ ] to do out here. >> Oh jeez. All right. Y'all only went to Universal. That's it. >> Mall. That's it. Universal Mall. >> Oh [ __ ] You been streaming, right? You should do a stream out here. >> You should do a stream out here. >> Might as well. as well. >> See, it's easy. It's easy as [ __ ] That was yesterday. >> Oh, so you just Oh, so you Oh, this vlog today. >> Yeah, I just >> You should do a IRL stream. >> You should do IRL stream out here. >> When I was reacting to [Music] Steak wet, >> huh? >> Steak. >> Yeah, you got no season on it. >> But if you dip it in cheese dip in >> what? >> Better with cheese. >> Who the [ __ ] is that? >> Are you homesick? Oh, what's up? >> Nothing, bro. >> Did you do that? Switch a shotgun. >> I'll be right back. What up, chat? >> Soup's good. >> I learned how to do a chopstick. I still water. >> Huh? Water. I like it. >> Really look good. I'm talking about one of one of them is like you just sit there and the other one hold it like a pencil run like Cross over. Cross over. [Music] Honey, [Music] [Music] [Music] Should I eat the cheese? >> I'm back. >> Yum. What's that? >> This is the way they show me the barbe. >> So, I feel like the best thing is is is the soup. Not going to lie. >> Huh? >> Yeah. See, I got Mike using the chopsticks, too. >> Do you season this or you just grill it? >> You season it or you just grill it? >> Oh, this is a marinated seasoning. That's That's way better. >> Better. >> That's way better. >> That one actually good. >> How your kid doing? I mean, you doing good. Y'all like LA girls? >> Hell no. >> Y'all tripping. Y'all tripping. >> You said no. >> You tripping out. I don't know where you been. >> I used to work I used to work. >> There's plenty of cute girls out here. >> The what? >> The mall. Hell no. That's what I'm saying. You don't go to the mall in LA. >> I got dog. I did my touring. >> Got to love some. >> I take you to the >> Yeah. >> Yeah. The goddamn the goddamn You gota don't give up though. Like you got to keep trying. Like I swear to God I did not know how to just try to give up. >> I'm not I'm not >> I'm getting full. >> Just do that. I do look different. >> Yeah, I do mine different. That's why I was That's why was messing me up trying to copy him. >> Just use like your middle finger >> to just holding it down with my thumb and I'm moving it with my set it up just like this. What is this again? >> So this is a short garby. So English is showing. >> Hi there. O has arrived. >> O has arrived. >> He been waiting to come here. >> Red B. >> Everybody has arrived >> for the America tour. >> How you feel? >> Me? I'm tired as [ __ ] bro. >> Horny as [ __ ] >> I just want to make sure >> you heard you. I'm good, man. >> I did it. I did it. >> Yep. >> Man, you losing weight, bro. >> That's what I said. >> That's what I said. >> Losing a lot of weight, bro. >> I called you and told you that. You didn't believe me, >> right? I think I think like that's going to motivate him though. >> What? >> Like he going to keep going. >> Yeah. You going to have to Well, I'm at the house now. He ain't got no choice. >> Yeah. >> Hey, >> I told him that I'm going to give him a trainer so he can come to the crib. >> You don't want I want to do it my own. >> See, >> you're not going to do it on your own, >> right? Exactly. >> You're not. >> Why you at the house? What up? >> LA, baby. >> Damn, you thirsty as hell. One thing I love about >> Hell no. >> Right. >> Now you a weirdo. >> It's like gum. You know fat. You can use that like a gum. >> You do jiu-jitsu, right? every day. >> You know what I mean? >> So like you So like you know how to like >> get somebody from the Bro I Bro, I wrestle with this girl. She was good. This was not my special my >> Could she tap you out? >> Yeah, she could tap me out. >> Damn. >> It would take longer, >> bro. >> It would take longer because I know how to defend it, but she would me. >> She was [ __ ] me up. She was a girl, too. >> That's the thing about the no strikes involved, >> bro. She she has a pull guard on you cuz she she wasn't she was able to like force her way through, >> right? >> But full guard, you ain't got no choice >> but to just go down with her, >> right? >> What you going to do? Stand up yourself, >> right? >> Yes. Thank you. MMA guard, >> bro. There's two difference of MMA. Fighting and like on the ground. It's >> all fighting. >> I know, but like if you like good at wrestling, >> you can really just win. You can just win people by just by wrestling. >> That's the thing. If you just good at striking, you ain't going to be good, >> right? >> You good at wrestling, you got a little bit of striking, >> you can dominate, >> right? >> Like today, like this like is different. >> Who better Kabib or uh Islam? >> Islam. >> Really? >> He said Islam better than Kabib. >> Now we just talking wrestling. >> No, I'm talking about in general. Who better? >> He got overall he's a better fighter cuz he got more tools. But he wasn't a good fighter. >> Chad, do y'all agree with him? >> He say Islam better be. It's 50/50. They saying you were saying facts. Some people saying nah. >> So do you watch UFC? You don't watch it an example like wrestler versus striker like recent de versus rob totally dominated him because he couldn't do nothing with the rest >> so you got to be good at both basically. >> Yeah. I think it's better to have a wrestling base than a pregnant base, >> right? >> Like if I was if I would start over and do it out again, I would start out without wrestling first. >> That's actually good advice. >> That's actually good ass advice. >> And that's if you want to be MMA fighter, you want to be a gohead. No problem. If you want to fight in a cage, learn how to grapple. It's not hot. >> Where my uncle at? >> Been all right. >> [ __ ] man. I a seen you over there. >> Where my dad go? >> Far outside far side. Oh my god. Bro. Hey. Amazing, bro. >> Yo, you chill out. Chill out. >> I don't got a warrior. >> Hey, I respect bro. Hey, man. I see every day, man. Online, man. >> Yes, sir. >> Are you the best, man? Are you the best, bro? Hey, >> brother. Appreciate, man. Thanks, bro. >> Hey, y'all see my dad? >> No, bro. >> Y'all see my dad? >> No. >> Y'all didn't see my dad. >> Guess, >> huh? >> Guess. >> You see my dad? >> Yeah. >> Where you at? >> Maybe in the restroom. The restroom. >> Oh, you the restroom. >> The restroom. This way. >> Hey, nice to see you, bro. Congratulations. You're the best, man. You're the best, bro. I respect, man. Wrestling. >> He not in there. >> He outside. >> He lied to me, bro. >> He talking about he outside coming out. Oh, I'm so sorry. We just put this this tour. So, you guys want to go out? I can go another way. >> Can I Can I take a picture? >> Let's just go back. I just want to know where >> Can I take a picture with you know like >> Can I take a picture talking to us? >> I just want to know like where he was at. >> Going outside. I brought a security. >> Yeah, I know. I just want to know who Yeah. Yeah. >> Take a street pick. Street pick. You ain't ready. Street pick. >> All right. back, man. >> Give him space. >> Let's take a picture. >> Hey, let me get one second. Don't quote your way. >> Ready? Stream pick. >> All right, you go ahead. >> Got a MG here. Are y'all ready? Let's wrap. Let's wrap up. Just more meat. It's like unlimited meat. Which one? Mine. This one. They going to keep bringing out unlimited meat. >> What's your favorite meat? I mean like bean chicken so it'll be good like real grass [ __ ] I want it like that. I love I love steak. I like >> baked steak. B A >> Oh, mate. You know people do that. >> I feel that's the same phone that you said you would go. >> That's the one. >> Yep. >> It's a damn bro. It's a damn [ __ ] It's some [ __ ] oi. You have uh extra chopsticks. >> [ __ ] out of here. >> Thank you, bro. more. >> I'm full. >> Can you eating the food? >> Huh? I'm full. You can >> over there. >> Every every table is full right now. Every day. >> Every table's full. >> Yeah. They over there full over too. >> I'm not sure, man. She got a she got a cookie over there. >> I'm full. This is We That was a lot of meat. They over there still enjoying their food. [Music] >> I did said I'm ready. >> I did say that. >> Chad, did I say I'm ready? >> I don't think I did. Bro, I think I ate here before. I sat right over here. Yeah. Your ass still hungry. What you eating? Oh, y'all had In and Out, >> bro. I wanted to go earlier, bro. You talking about he he ain't want to go >> food. >> Why? >> In-N-Out nasty. So the cheeseburger is nasty. >> Five better. >> Five guys. >> No. >> So Five Guys, >> we should have went >> Five Guys better than Inn-Out. You tripping. >> Hell no. >> That's a dumb take. Hey, come down. Hey, come down. >> Dip in the sauce. What sauce? Which one's the sauce? >> Oh, that's sauce. >> I didn't even know that the whole time. >> So, three soy sauce, a little spicy, and That's good. Little bit of water. Bro, y'all tried the hot sauce. >> That [ __ ] is spicy. >> Damn. All right, let's get up out of here. [Music] Oh, >> ready. >> All right. >> Thank you. Yeah. >> Thank you. >> Oh, no. >> Hey, sorry. Sorry. >> You just took a picture. You just took a picture. >> Nice to meet you. >> Nice to meet you, too. >> Um, I have a jewelry brand. Do you mind if I shout it out? >> Your jewelry brand? >> Sterling Silver. >> Um, right now, bro. >> What brand is it with? >> It's mine. Mine and my boyfriend. Is it real or fake? >> No, real silver. Real silver. >> Okay. >> Now we have a store in downtown. >> Okay. >> Thank you. >> All right. >> Thank you. >> Have a good night. >> Thank you. Out the way, guys. Out the way. Keep it clear, please. Out the way. Out the way. Keep it clear, please. [Applause] [Music] Back up. Back up. What are >> you looking for? >> I gave you the LA Galaxy. I gave you the LA Galaxy. What's up? What's up? [Music] I'm still $1.99. >> What car my friends going to get in? >> Mason now. >> They're going to take one of the cars and then some of the crew >> y >> you uh you swapped in for as yet. Yeah, she swapping [Applause] my uncles. >> No, it's too late now. >> I see. I ain't see a minute. >> I a Well, no. I did see him in Detroit. >> It's been a minute. >> But it's been a minute. LMSQ donated $5 through >> Argentinian. >> They're like brothers to all of you. [Music] >> The [ __ ] [Music] Who is that? >> Back up. Back up. I'm going to do security. I got you. Let's go. [Applause] >> India. India. India. India. Why that calling? Why? Why? I love you. I'm from India, baby. But Ronaldo is better than that. What do you say? >> I love you, bro. I love you. [Laughter] >> That was hilarious. [Music] [Music] LA is too funny, bro. I'm sorry, bro. >> LA is too funny, bro. I'm sorry. >> LA is too funny. Who is your favorite mom and dad? >> Oh [ __ ] >> Alexandria >> Wolf Gang 81 donated $1. >> I never stayed in one, but I [ __ ] a one. >> Yeah. >> What was that about? I go tour. >> Oh, you're so tough. You're tough. >> No, you're tough, bro. Bro, I got you, bro. All right, >> let me see that influence. >> Dead ass. >> It's like live TV, bro. It's crazy. >> Hell yeah. [Music] Listen on that. >> Hey, LA funny, bro. >> I can talk to LA people all day. >> City, >> huh? >> City folk. >> I'm not a city folk, though. >> City dude, bro. >> You ain't country. >> No, I ain't country. You're city dude. >> City, man. >> Yeah, I guess I am city. >> Come on. I'm in the car behind you. >> Oh, he's a DJ. >> Hello. >> I'm good. >> Yeah, it's good. Yeah, I know. >> I love you, too. >> David Lee's Ferrari in LA. >> You know who that was? You know I'm here, right? Yeah. I'm not hanging with you. >> Super chat. What's Jamal's favorite part of the tour so far? probably uh >> Yeah, I think Slicing was your favorite. >> That was my favorite thus far. That >> slicer fun to watch. >> Yeah, it's fun to watch. You see everybody having >> No, it's fun to do. It's only fun to do when it's people who slice. >> Jamal, you didn't even >> Jamal, what was your favorite part of the tour? donated 17er through superhaten. >> He said this content bad. Come to Denmark. >> I say my favorite part. >> That man said this content is bad. Come to Denmark. >> Just want to stay and stay healthy, bro. >> Nah, today was a bit slow. >> Just normal day, bro. Isaac3. >> I seen a boy cry after you spoke to him, man. >> He was crying like what >> donated $4.99. A lot of people did. >> No, it was slow, bro. >> A lot of [ __ ] didn't fall through. I mean, you got to expect that one. >> Yeah, I know. That's just Yeah, like like Yeah, it happens. >> I mean, like, it's a live stream. >> It's all cool though. >> We still got tomorrow. >> That's why I love streaming. >> It's unlimited. >> You always got another day when it come out. Isaiah donated $1.99 through super chat. >> Shout Liam out please. He's a big fan. >> Shout to Liam. >> I think it's more of a >> Jay donated $1.99 through super chat. Should they stop at Marathon and Burger? Shout Nipy, >> just relax, y'all. We, like I said, we still have another day >> donated to a did a great job in LA through Superhat. already. >> I'm not a city city kid though. I'm a big country. >> You would go broke. >> I'm not. What? I did not grow up in a shut. >> Is that what you trying to say or what? >> I did not grow up in a suburb. >> What is country then? >> Farm. >> Oh, I know. I didn't grow up on a farm. >> So, where did you grow up? Mikey Bison donated $1.99 through Super >> He grew up in College Hill, >> right? That's the hood version of >> That's a That's a good hood. >> Let's not talk about where you grew up at. >> Let's not talk about >> Let's not talk about where you grew up at. >> I know it was dangerous. >> No, you didn't grow up in no dangerous. >> Yes, I did. I grew up on Puritan. >> Pur Puritan. I grew up on purit. >> Yeah, right. >> Then my mama got us out the hood when my daddy died because she wanted us to knock donated $1.99 and burger from >> the chief of the chief of police was not my neighbor. So you know, >> right? So you were safe, >> right? >> Right. >> But before then, we were grew up in the rough. We went to the roughest middle school. Servity Middle School in Detroit. >> That's all you got to say. >> Don't know why you know that middle school. >> Trust me. Trust me. We the first school to have metal detected $19. >> Metal detect a middle school. >> That's crazy. >> That's how you make number. And that's a school I was I was so happy to go to. >> But when I got there, >> oh, I'm about to join after school activities. I am not about to leave with everybody else cuz you either had to join the game. >> That's crazy. >> Cuz they was outside just beating people up >> after school. So me and my brother joined the lifter. Andrew Rose donated $4.99 through super chat. >> Watch tomorrow. Grew up in the suburbs. >> I keep my job. >> Heck no. He grew up in Highland Park. >> Bxenhood. [Music] >> Everyone trying to blame as if Speed doesn't have to agree to the segments. Sometimes they have to freestyle cause of crowds. Relax. >> Who is that? God, who mother who mother was that? >> Marathon and Burger. >> Talk about this marathon and burger. It's a gas station. >> It's a burger. >> It's a burger. Lip >> marathon burger. That's what it's called. >> Oh, don't his brother run it? >> Uh, I think so. I seen I seen a segment when they had a grand opening and they didn't let this one guy come. >> Secret night. >> I was like, \"Dang, I guess they don't like him.\" >> This isn't no takeover either. Address is 11755 Whittier Boulevard, Whittier, California. >> Yeah, we going to go there and get rob KSI. It's going to be lit. W >> FaceTime. >> They said FaceTime KSI. It's going to be lit. >> It's going to be lit. >> It's going to be lit. Check out FaceTime KSI right now. It's lit. >> We turned up now. >> He not even up right now, bro. >> They said FaceTime KSI is going to be lit. >> Like it was like it's going to be a party or something. $1.99 through super chat Puerto Rico and Laasa Apollo PR >> Hyhat. Why didn't you sign my green apple inspe? >> Because it's I don't because Wait, >> you don't write on fruit. donated $1.99 through super chat to the pad. There's in no >> Kay to the pad. I don't know, bro. >> Like I feel like they they donate the like I don't know. I'm just I'll just be like $1.99 through chat. >> What was the best part about the bay? I don't just the energy like like you could just feel the energy from people from the bay >> like the just the raw energy >> people that's happy >> can you shout out >> what you mean it's happy land >> some old school >> it's not old school >> that's Is that Drake? >> Oh, you know. >> Uh-huh. >> Shout out to $4.99. >> Shout out to man. >> Kevin Martinez. >> Shout out to Kevin Martinez. >> Kevin Martinez. Lucky donated $4.99 through super chat. This is the lucky on your stream in Venice Boardwalk. >> Thanks for letting me do my thing. Anyone interested? >> No, that was the actual Luffy dude, not the dude that fell on his head. >> Oh, the dude fell on his head. Oh god. >> Reonn Tucker of our generation. >> Damn. Chris Tucker. You can pick somebody better. >> Chris Tucker is a legend. What are you talking about? >> He is a legend. >> But he's not Michael Jackson. >> Monominist donated one through >> Michael Jackson liked Chris Tucker. >> No, he's not. >> They was friends. Yes, they did not like him. >> Oh, he meant they like they liked each other. >> Oh, he like they were friends. >> Chris Tucker. Cyber Model 95 video game donated $2 through Superhat. Let's go to Universal Studios Hollywood tomorrow. >> Yeah, let's do that, Chad. >> Hey, I just met you and this is crazy. So here's my number. >> Jamal, you always sniffing, man. >> Blow that damn smile out. >> You sound like your auntie. >> There's no tissue, guys. >> A check in. Check out music. >> A's not in here. >> Super chat. Big Fresno Fair starts tomorrow. Come through. >> Fresno 559. >> Fresno Southern just played Fresno State. >> They got beat on the football field. >> Kevin Wong World donated $9.99 through super chat. If I don't work, I can't beat Kevin. >> How did you make a donation? That's how you make a superhatane. >> Yeah, late traffic. [ __ ] >> Jaden Palamino donated $4.99 through super chat. >> You two minutes out. Two >> two minutes out. >> Oreo22 chat. >> Can you ask Jamal get out from car and put Sydney loudly crying? >> What? >> It don't make any sense. >> Jeremy Grant donated $2 through chat. Your skin is in Fortnite for real. Mr. GC15 donated $5 through super chat. If you're here tomorrow and love popcorn, my boy has a blackowned popcorn shop in Long Beach called Pop and Flavor. Any type of flavor you should stop by. >> That'll be promo. >> Swooshi donated $2 through chat. >> Speed go to the Inland Empire. It has much to offer. >> The England Empire. What the hell is that? >> Here, what's the England Empire? >> Meditation donated $5 through chat. >> Please remember to practice mindfulness of every breath to facilitate deepening of pres. Devisado donated $1.99 through super chat. Tyreek Hill broke his leg. No more. >> He dislocated his leg. He didn't break it. >> You know, he just broke his leg. >> Francisco donated. >> He going to be good in the next couple months. >> 11,755 Whittier Boulevard. >> What's wrong with you, man? Alfrey Jen donated $1.99 through super chat. I live donated $4.99 through superhate come to Fresno. Please please Fresno loves you. >> Oh, let this car out. >> Wow. Let's go. >> How the hell y'all know we already here? >> Your phone. Your phone drop. >> Let's go. Let's go. How y How y'all know we was coming up here? >> Who told you? >> Who told y'all? >> Ballet told you. >> But how'd you know to come here? >> Ballet told y'all. >> It was him. >> Yo, you ready to see the craziest race of your life? >> Are you ready? >> You know where you're at, partner. Let's go to work. >> Let's go. What the [ __ ] >> What the hell? >> In LA, we're about to see a really really cool race. >> A cool race. >> Really really good race. >> Who? Who about the race? >> Yo, bro. We about to race some crazy crazy stuff. >> Some really small stuff, too. I got a picture >> all the came. We're revolutionizing >> men's health. We're revolutionizing science. >> This is the combination of cutting edge technology and competitive sport >> coming together all in one. >> How do you like Los Angeles so far? >> I love Los Angeles. I saw you had some fun back. >> What? What race are we about to do? >> Bro, we're about to see a really, really small race. >> Your name is Speed, >> bro. >> Bro, you're about to race someone crazy. Put on this lab coat before you go in >> a lab coat. >> A lab coat. A lab coat. >> What the [ __ ] I need a lab coat for >> Oh [ __ ] >> All right. All right. >> Right here. Right here. >> What I need a lab coat for? >> Nah, I ain't put on lab coat for a race. No. No. Not for a race. >> I got to stay loose. down for a little. >> That's the right. >> So, uh, so I'm gonna give you a little bit more context. It's, uh, it's Have you heard of sperm racing? >> Sperm race, >> bro. Yeah, we we the world's smallest sport. >> World's smallest microscopic sport. >> What the hell is this? >> What the [Applause] What the [ __ ] is this? >> What the hell is this? >> Open up. Open up the way. Out the way. No, he's dribble. No, I just rules. [Music] >> All right. [Applause] >> What the [ __ ] is in here? >> What the hell is this? [Applause] [Music] [Applause] Are we all here? >> Ready? So, this is how it works. Uh, we have a we have a face off right now. That person is from UCLA. That person is from USC. They're going to race their sperm in that microscope right there, and thousands of people will watch it. is the world's smallest sport. [Applause] >> Yo, would you like to sample? >> Where? >> I'm going to bring you down over here. >> A sample. We would like you to pipe up the sample, please. >> This might got to be the dumbest race. >> We're going to do one race and then we're going to have to >> We have a few special. >> This is the craziest dead ass. >> I'm dead ass. I commentated the first one and I didn't know if it was real or not. >> This is real, bro. This is dead ass. >> We need to get into this middle section. >> We need to get into this middle section here. as I know they overl [Music] [Applause] a few hours ago our athletes provided samples and we collected the samples put it in the centrifuge. Separate the strong swimmers from the dead swimmers for the future of male fertility because male fertility has been decreasing in the last 50 years. We need to raise awareness for this. Also, a lot of people are talking about the women in pregnancy, but the man's sperm, right? Very important. Let's introduce the racers [Applause] >> from UC. [Music] [Applause] [Music] >> I don't know if I understand there's some Trojans in the building, but let's hear from UC. [Applause] These are the athletes and we're going to test how fast they're swimmers. >> How are they going to race though? >> How is it possible? Let's find out. >> We have a uh we have the science prepared here. >> They hooked their [ __ ] up today, >> man. I don't know, dog. What? They be like, >> what I'm saying? Like, what the hell is going on? >> Yo, this must be sick, man. >> You're into it. >> All right. >> You ready for round one? >> Think about this. >> This Yeah, >> it's going to be crazy. >> How do y'all do that? >> I've never seen anything like it. Microscopic cameras, microscopic racracks. >> Yo, Austin, can you show us how to do this? >> We got to bless you up. No. Hell no. No. No. No. No. No. No. I'm not wearing no I'm not wearing no safety precaution. I'm not about to be touching anything. I'm messing with you. >> All right. Here we go. >> All right. >> Do you have Do you have You have the pipette. >> The pipette. >> If you want you want a pipette, there's no there. >> Yeah. Give him the pipette. How this works is you launch a race using that >> bro. I need more. >> All right. Safety first. Gloves on. Gloves on. >> What do you do? >> Put this into that hole. I'll start the flow and watch that race on that big street up there. >> No, you just do all that. I just want to see the race, bro. >> I don't want to touch anything. >> I just want to Yeah, I don't want to. >> You have to be a science. You have to have a degree in this sort. >> Yeah, >> we're going to see it. >> We ran the first one of these ever in April. Students, young people at a startup in San Francisco figured out. >> So, it's a science experiment. >> This is science and this is for men's health. I know it's a crazy thing and it sounds silly, but actually the faster your swimmers swim, it's a sign of how healthy you are. You know what I mean? So, now we're going to turn health into a sport. So now anybody can compete if you're just healthy. You know, there's actually a good I know it's crazy. I know it's crazy, but it's it's a sport that everybody's already won before they even got here, right? >> Sport that everyone. >> You ready? >> Who you got? >> Track check. >> Oh my god. Ready? >> Yeah. Chad, we about to go, y'all. We about to go. >> Special guest, Dave. >> We got to go. We got to go. >> Ladies and gentlemen, I'm trying to like [Applause] I can't win. I can't believe Africa. >> I can't believe Africa. I can't believe I can't believe I can't without enough Is that down my [ __ ] I brought me7 [Music] [Music] without I can't [Music] Wait, no. Where do we honestly walk into our building? [Music] >> Down again. I can't put down I came on. He inspires me, bro. >> He inspires you? >> Yes, bro. That's going to be me in the future. >> No, it's not. >> It's not going to be you in the future, Jamal. >> Yes, it is, bro. >> Relax. >> Oh my lucky. I can't wait. >> Oh my god. this littleer face. >> 3 2 1 from Los Angeles, California. >> At the top of the UCLA and at the bottom track is C. The winner will take home $10,000. Yeah. >> Ladies and gentlemen, this is the world's smallest. [Applause] [Applause] [Applause] What the hell? [Applause] >> What the hell, >> man? I need a goddamn I need to take a walk. No, I need to take a damn walk after that. The crowd go crazy. [Music] >> It's not real. It's not real. >> It's not real. >> That's not real. That's not real. >> It's not real. >> No, I didn't take a walk. I need to take a walk. I need to take a walk. >> I made this for you. >> Who get this to me? >> I made this for you, bro. >> I made it today. >> This [ __ ] dope. >> My name is Sterling Ross. I make videos and stuff. >> Thank you, bro. >> And I appreciate you. I love the work that you do, man. And you inspire me to make videos myself, man. >> Thank you, man. >> And so, what does what does hard work kind of mean to you? Cuz that's what that means a lot to me. >> Hard work means to me. >> Yeah. It means um putting yourself putting your life on the line. I want you on on what you love to do. >> You know what I'm saying? So hard work is everything. >> Hard work is what you got to do to perfect yourself. >> Yeah. Yeah. >> Thank you, man. >> But appreciate this board though, bro. >> Thank you, man. Love you so much, man. >> Oh my god. >> Yeah. Yeah. Keep grinding. Sub to speed, man. >> All right, man. No. Do you care if I get a picture real quick? >> Yeah, we don't promote that. >> What was that? >> You care if you get a picture. >> That's not it. >> All he did was gave me a Dr. Pepper. >> He gave me Dr. Pepper and left. >> I was one of the race sponsors. Good to meet you. >> You touched it. >> I I did not touch any of the cup. Don't worry. It's good to meet you, dude. Oh [ __ ] >> Oh god. God, I needed to I need Oh, God. I need >> What's up, [Music] Oh, >> it's all good, man. >> It's all good. >> You're good. >> It is. >> Second to last game, man. >> Good to go. >> Yo. Yo, can we go bowling? >> I need to go bowling or something, bro. >> I need to go. >> I need to go bowling. >> No, you stupid, man. Why would you read it out loud? >> Why would you read it out loud? >> This is dope. I need to go to the boat. >> Oh, thank you, bro. >> Global phenomenon. >> Yeah, >> I like that. Thank you, bro. >> Hey, get in a car. Get in a car. Get in a car. Get in. Man, they going ham in the chat, bro. >> Yeah, I'm good. >> Isn't there like a bowling spot nearby? >> It's 11. What time they closed? >> I think >> Dr. Pepper. Oh yeah. >> And it's what we do. >> Like is this a girl? >> Why they got you with pearl earrings on? >> They said you a box match. chat. What did y'all eat today, y'all? What did y'all eat today? What was the last thing y'all ate? >> Let me see if y'all got good memory. When was the last time y'all ate? >> I love you, bro. >> Hey, get down. Get down. Go. [Music] [Music] >> I got the world's gummy. >> Spiciest gummy. [Music] >> Want to do it? >> Eat it right now. Eat it right now. >> The world's spiciest gummy bear. >> World spicy gummy bear. Huh? >> Spiciest gummy bear. >> It's only one gummy bear. >> Yeah. You know about it. >> Is it spicy for him? >> It's the spiciest gummy bear in the world. >> Yeah. Yeah. He's with me. He's with me. [Music] >> Spiciest gummy bear. >> Do I hate it, chat? This This one gummy bear is spicy as [ __ ] All right, Dad. You take it then. >> You don't lick it. >> No. >> How much? >> How much? >> Would you do it for >> 5,000? >> 5,000. >> Oh my god. >> You said yes. >> Oh my god. >> We ain't even going to order in a car, bro. [Music] Why would you do that? >> You going to regret that, man? >> You going to regret this [ __ ] >> You going to regret your [ __ ] fire tonight, buddy. >> Oh [ __ ] >> Oh [ __ ] You all right? >> He crying. It said this product is extremely spicy and has the potential to cause skin or mouth irritation. >> Oh, your skin gonna be irritated, bro. >> Your mouth irritated. >> It's hot. >> Don't touch your eyes. >> He already did. >> He just did it again. >> Is >> your [ __ ] going to be fire, bro? Hot, bro. Not hot like that. But >> no, I'm talking about your [ __ ] when you [ __ ] cuz you going to mix that in with that food you just ate. >> Everything that come out going to be spicy. >> It's going to come out watery. >> Watery liquidity. >> It like that chip though. >> It ain't spicy for real. >> Not like that chip. >> Oh >> well. You look like you dying over there >> because it's still in. You think it's going to go away, but it's still there. >> Think about the 5,000. [Music] >> Think about the 500. >> Oh my god. Is there another one? You should take the other one. >> No, there's only one. That's it. >> It's hot. >> It came in one pack. [Music] >> It's not the It's the inside. >> That's what she said. It's the inside that gush. >> That's what she said. >> I should have never bit it. >> Yeah, you should have swallowed it. >> You should have swallowed it. >> That's what she said. >> Oh my god. >> That was a trick to it. Like if you just would have not even bit the >> like the like the flavor in the >> What it taste like? >> Yeah. You should have just >> It tastes like a uh >> It tastes like like a hot tamalei. No, the um that gum the cinnamon >> red. Big red. But it's hot. >> Oh god. >> The world's spiciest gummy bear. >> Think about it again after this. >> St. Louis made it. >> I remember when I ate that chip. >> Oh, I remember that. >> Yeah, y'all didn't know I ate it. You ate it. >> Yeah, that's going away. >> That's uh uh Rudy. >> What's that? >> Is this your hoodie? >> I don't know, man. I've been cold since I came to California. It's freezing here, man. >> Feel like >> it's daytime. You like, bro. >> Not daytime. It's hot. >> It's like you under a light. >> Shout out to whoever uh brought the >> faith over fear. Oh, mom. Now my tongue is numb. >> Oh my god. Donated $4.99. >> Put this on backward. Hey, Ivanademic awardiser [Music] >> academic award. >> Joshua donated $1.99. >> You want 12 or what? >> 13. >> What's that? >> 14. David Smither donated through superhaton $1.99. >> But it would have broke up inside >> but my stomach and I would have been >> I missed it. Ghost outp. >> I wanted to tell yjless. >> That was after us. So I wasn't able to say it on camera. >> Danny was like right before Chicago. Chicago was off to Detroit. >> Chicago, >> Memphis was before Chicago. >> We did Detroit and Chicago. We did Chicago before. >> Oh, you're right. You're right. You did. Yeah. Yeah. We did. We did. We did Detroit. Chicago, Ohio. >> But Memphis was lit, man. >> I told I told him that like I really myself. >> I enjoyed myself watch y'all on the bus that uh the night when y'all kept coming out the door. >> I don't remember that. >> Hey, what happened? was doing the wrestling >> was too shout out. >> Oh, Memphis was lit as [ __ ] though. For real. >> You said Memphis I love that Memphis I saw the opposite of where I thought it was going to be. >> Henry shined his flashlight at me and yelled, \"Move out.\" >> Honey kettle for the best fried chicken in the country. >> Who got the best fried chicken? >> Henry, put the flashlight to your face and said, \"Move out the way.\" >> Singing through chat. Can you shout out my nephew Grayson? >> Shout to Grayson, man. $1.99. >> Why is it so dead out? >> Is it Is it because it's a Monday? >> Yeah, it's dead. It's dead. >> It doesn't matter what you're saying, right? We're doing night time. >> Okay. Like they can see outside. >> It is at night time. >> Yeah, night time is dead. >> Really? >> During the week, >> I got to be the opposite. >> I'm stay away from me, bro. Hey, I got some for you, too. >> Where? My [ __ ] >> where's the >> sea [Music] for you, bro? >> Anyway, >> peace out. >> So, LA only lit. >> So, you're in the daytime. >> Oh, god. >> Don't run up on the car. >> Yeah. Yo, >> we can't run out out in a car. >> Rudy and Henry are coming home. >> During the night time, it's a bit more dangerous. >> Nah, not down here. >> Yes. >> Uhuh. You know me tell we used to come down here. Oh yeah, I know this area. >> That's where they cook the food on on the side. Sausages on five, boy. >> Yeah, I know where we are right now. There's Mill's Diner. >> You know where we are. >> We ate at Miller. donated $1.99 to superhat. >> Yeah, this where the human this the human the human boohhood. >> It was on the star. >> Yeah, they be boooo. >> We came a couple of times. It was the same guy >> and then a man sitting in the wheelchair screaming. >> Yeah, it be the same. It was the same guy every time we came down here. The same guy. Kyle% [Music] >> what? >> Oh lord. >> Superhatful girlfriend. >> Oh my gosh. What is wrong with the internet? Like where do we get this >> $1.99 L1? >> That's crazy, >> right? That's insane. >> That's crazy. >> Lo, is so LA only lit on weekends? >> Weekends, bro. dead. Well, I mean, it's not even lit on the weekend anymore. It's like dead. >> Oh, wow. Everybody's leaving. >> It's dead here. >> Wow. >> All the people all the people that made it big, they're gone. >> Like, >> this is like This is like for like influencers and like >> actors. >> That's cap though. >> No, bro. It's real. >> So, where do tourists walk in when they come to LA? >> They go to Hollywood. >> They go to Hollywood. >> Exactly. It's all here in the day. >> LA will always be lit, bro. >> There's no such thing as LA is dead now. We're talking about LA >> Well, they say that Detroit people say that about >> I think I just think LA nightife is ass. I think LA like I feel like LA is more of a daytime city. >> Yeah. >> Yeah. Part of that >> I got that from Hill. >> Oh yeah. I love >> I love I like LA. I felt like >> because you don't expect to see this and then you step in it. >> You stepped in it. >> No, I never stepped in. >> Donated $60 million, >> right? And then like they'll let their dogs take a dump and they go right. >> Pick that up. >> That [ __ ] was insane. And these are nice looking people. I'm like, I know you >> sports_456. donated 100 rupees through super chat >> speed accident. You can help angry face >> put it in my ear was taking pictures I had through super chat. Oh, >> propaganda donated $4.99 through >> I was in LA recently. >> Steve, I gave you that red unicorn to W from Propaganda. >> Where that even go? I just had it in my hand playing with it. >> Oh my god. >> John the solution donated $5 through super chat. Speed, please say happy 13th birthday to my son Isaiah. >> Happy 13th birthday to you Isaiah. >> Isaac. >> Big Isaiah. >> Gang gang. >> Everybody know. Can you give a shout out to the Harwell boys in North? >> Shout out to the Harwell boys in North Branch. You sound dangerous. >> My brother sounds dangerous. >> Arian blogger donated $4.99 through super chat. Can you shout? >> Let me [Applause] let my teeth in Detroit, bro. Damn, I was so mad when I was >> donated $2 audics. [Laughter] >> Kimberly Salamita donated $9.99 through super chat. girl donated $1.99 through super chat. Can you shout out? >> Oh [ __ ] >> Chris C donated $1.99 through super chat. Speed, come to Skid Row. It's fun out here. [Music] >> All my life. >> Super chat. >> When you come to N D I E G O O S T A T >> Shop for everybody that didn't know what that was. It's the open >> Jimmy donated $4.99 for super chat. >> Hey Speed, can you I shout out my cousin? He just got unemployment. >> What? Congratulations. >> What? >> Congratulations donated $1 through He just got his hilarious. >> We here. >> What's this? >> Michael Kane Marketing donated4.99 through super chat. >> Come to the UK Birmingham from Cheyes Kane. super chat. >> That would have been cute. >> Habibi Snipes donated $1.9. >> Why did you not want to race me? You will regret it. >> No. Why would he regret someone he go beat? That is insane, >> right? >> Her name is a BB Snipes. You think I can't beat you, bro? >> Who the [ __ ] is a >> BB? December 3rd. >> Yeah, let's go to the >> Put that in. Put that in the schedule. >> Let's go to the graduation. >> Super new teeth go >> here. He is done with the stench. No, I did not fart. I did not. >> I would be honest if I farted. >> Hold on. Hold on. Hold on. >> Angry face. >> You farted. >> They're making us at the uh >> Where's the bus? >> Donated $9.99 through super chat. I don't ever want to do that. >> You'll see if you meet Faze Rug in San Diego. I want you to prank him. >> Do Faze Rug YouTuber. >> Oh, >> Fazer Up. >> Faze Rugated sayup. That's a dog name. >> That is a good name actually. >> Faserup. >> Faser Up. >> That's a cool ass name. >> Faze Erupt. plugged a joint donated $1.99 through super chat. >> Jamal is so squishy. >> He's cuddly. >> I didn't even get to tour y'all the bus. Oh [ __ ] >> Hey, are we bringing everything in? >> Yes. Yes. >> Yeah. >> What's up, brother? >> How you doing, bro? >> I'm doing all right. How y'all doing? >> No. It was a rough day today, y'all. >> Sure. A W. A, man. >> Tomorrow. >> A is the [ __ ] best in the [ __ ] world. He don't [ __ ] >> the [ __ ] man, man. >> Oh my god. >> I know that, too. I swear to God. I know this [ __ ] you know. Let's [ __ ] go. W [ __ ] A. Let's get this [ __ ] right, baby. >> Let's [ __ ] go. >> W's in a [ __ ] chat. >> W's in the [ __ ] >> Oh my god. W's in the [ __ ] chat. >> That's a Why you bringing it here? >> I don't know. Clearing out the truck. >> No, no, no. >> Oh, no. Just stuff that >> production car. No, that's >> production bus. >> Just stuff that we that we got like >> I don't want with y'all. I'm just clearing out the truck. >> Well, it was in the front seat. >> My bad. I went in the trunk. Yo, um Taylor, if you're listening, can you uh do the YouTube chat on the screen? >> Yeah, I'm literally calling right now. >> Do your [ __ ] names. >> What? >> Do your [ __ ] names, [ __ ] >> W [ __ ] a [ __ ] W >> [ __ ] Ames, [ __ ] >> A has done a phenomen. >> Big A, [ __ ] >> A is a [ __ ] man. He's a [ __ ] genius, [ __ ] He do this [ __ ] He do this [ __ ] Cat. Hey, my [ __ ] He do this [ __ ] >> He do this [ __ ] Stop [ __ ] playing with him, bro. >> Whoa. >> They coming off. >> I get scammed. >> I think he painted them. >> Damn. >> You're not supposed to wear them. >> Wear what? He wore them. >> The guy put him on his feet. >> I was supposed to frame him. >> Just frame them. Frame them in their current state. >> You wore them for a day. >> Oh, my [ __ ] shoes. >> Eventually just be regular. >> Oh, the 20 v one. Do we got women? >> Bro, they not doing that. Y'all doing that for real? >> Yes, bro. Really? >> We gave you some women. >> They going to be bringing them big old snuffer kisses up in here. >> I'm about to bring some LA. >> Remember when you brought that one? They brought that one woman to the restaurant and D was like, \"Dad, do not do it.\" >> I remember that. >> Oh man. When you guys get here in the morning. >> Oh, y'all got here early in the morning. >> Yeah, you're right. >> I got here like at 10 last night. >> I was in Phoenix. I met here. Yeah, >> [ __ ] A is the goat. Like, get off his dick. [ __ ] is y'all talking about? >> What are you saying about Ames? >> Get off. A is the [ __ ] goat. >> Ames, you here? >> [ __ ] is y'all talking about? >> A is the goat. He the [ __ ] goat. >> That's my go. >> That's my [ __ ] go. >> Where is [ __ ] >> He the go. >> A is a goat. All right. I don't want to hear nobody [ __ ] go. >> Exactly. I don't want to hear nobody. >> Okay. >> It's big a whole USA to been up. >> Exactly. >> [ __ ] is you talking about? >> We aim high. >> Let's get right. >> Don't diss my man's aim like that, bro. >> We go to war with him, bro. >> Exactly. We been through a lot of a bro. We won laser tag with him. Exactly. >> Y'all cheated, >> bro. No, we didn't. >> They The guy told y'all to go in there. Me a went in there already. >> Our guns were working. >> That's cuz y >> aim gang or no gang. >> I I I was I came in second place, >> man. >> I was running around there killing everybody. >> Do we got the 20 v one? Cuz I can >> don't talk to my man like that. >> Really doing the 20? >> What you mean? >> You ain't got no snuff lover kisses up in here. >> Who your contact? >> I mean, >> what you call? >> Snuffle kisses. You remember they brought that one woman in the restaurant and you was like, \"Dad, you was like, \"Dad, no. They had they had a lot of makeup on to be 22 years old >> nontop for 35 days and you still got energy >> cuz semen semen retention >> semen retention >> what's semen retention is see you know what I'm talking You're not >> all right. Damn. You don't >> like damn he >> trying to educate. >> I see. I try to do it in a PG-13 way, but you like busting bust. >> He like busting balls and [ __ ] All I said was semen retention. >> You got too deep into the sauce. It's PG-13 over here, man. >> It's I show speed. It ain't freak. You feel what I'm saying? >> Hey, hey, hey, hey. >> You know what I'm saying? >> Talking about nuts. We eat nut berries. Berries. >> Yeah, you're right. Berries, nuts, berries. Yeah. >> Yeah. >> Um that we didn't even see white speed today, man. >> No, we did see him. >> I got I got a poop, bro. >> Yeah, I seen that. Yeah, >> he dedicated. >> No, he dedicated. >> I want to know how he got on that roof. >> Yeah, that's what I want to know. He >> He from Notre Dame. >> That's how them Ohio people are. He's crazy as [ __ ] running back and forth. >> Godamn. You feel me? [ __ ] you mean? I use you. >> Not like that. What is he talking? Not like that. >> Wait. No. Y'all just seen that? He said I feel >> what? >> What the hell, bro? >> Not like that. Not like that. >> I feel you, man. I feel you. >> Why you playing with the camera? >> You said I'll feel you. Oh my god. Oh my god. >> Grab this, bro. >> What? >> Daryl, it's your turn. >> Yeah, it's about to lock in. >> I just think I just think it's so funny how people keep playing with my boy Ames. >> All right, bro. You still going on now, bro. >> A gonna beat your ass, bro. >> What? >> A ghost, man. >> You smell like [ __ ] >> Yes. Back. >> No. No. No, cuz no one else used this [ __ ] today but you. Well, yeah. >> So, you're saying his back stink? >> Let me smell your back. Let me smell your back. >> No. Small smell his arms. >> His arms. >> Well, yeah, but >> back. >> The back for sure. >> No, you >> No. Smell the front. The front part, bro. >> The front part of his What? That? >> Yes. No. No. But like to the side where his arms are at. >> His underarms. His [ __ ] underarms. >> Yeah. [ __ ] that's going to be bad. >> He's just musty, [ __ ] >> Just regular mus. >> It's the backpack. >> Everybody musty, little D. >> Everybody got a little mus. >> You feel that sweat? >> Oh, I feel the mush. That's what I feel. >> Are you digging into my skin right now? >> Somebody been >> Where y'all about to go? What? Yeah, I know. But what though? Oh, okay. >> All right. Yeah. Okay. >> Well, I need to take a shower. >> Dad, he said he about to take a shower. >> So, >> where them flip flops at? >> Right here. Got him. >> Hey, hey, hey. Barber. The barbers are here, too. >> Oh, yeah. I need to get a fresh one out. >> We finally got a new phone. I was Hey, I was going to give you a new phone. >> If I would have seen that. You got the 17. >> 16. >> I was like, bro, I'm about to get this [ __ ] a new phone, bro. >> You ain't been updated in years. >> Hell emojis. >> What's up, bro? >> Look, I'm hella laugh with emojis and [ __ ] He finally got the emojis now. >> Let me see what I hear. >> 4 a.m. >> It's 3:30 in 2:30 in here. What? >> Uh, you got a parcel. Um, you know where uh you bought the watches from in London. Chief >> got a parcel for you outside. >> Parcel. >> A parcel. Yeah. >> Sometimes your accent make me want to cry. >> Delivery. A delivery. You ready? Yeah. This it. This is it. I got a Luffy chain. >> Show that [ __ ] W's in the [ __ ] chat. W's in the [ __ ] chat. >> It has >> Luffy chain. >> They got to reload the player. It asked. >> What's that fog gun? Obs. >> We got a Luffy chain. >> Is this real? >> 100% real. >> Rudy, that's your cousin, right? Who I bought that watches for? Damn. Your cousin came in clutch. Why he do this? >> He knows you love Luffy, man. >> Damn. He didn't even have to do that, >> bro. Made me a Luffy piece, though. See, Rudy, bro, that's like That's why I [ __ ] with Ghana, bro. That's why I [ __ ] with the Ghanas, bro. >> What you got? >> I got a Luffy chain. >> Oh, I should wear my Luffy chain and my Ronaldo chain tomorrow. >> That go hard. >> Oh my. Let me see. >> Who gave that to you? >> Rudy Cousin gave it to me. >> Tifa. Yo, shout out to Rudy Cousin. >> I bought a watch from him like a year ago. >> Yeah, last year. >> Yeah, I bought like a Rolex from him. This [ __ ] crazy, chat. Imagine we're both teens. That's going to go so hard, bro. I remember you, too. >> We met in London. >> Yeah, we met a few times. >> Charity match and [ __ ] >> Yeah. >> Yeah, I knew it. >> Hello. >> How you doing? >> That's my do-rag, too. >> Yeah, I just found it. You want it? >> Hold on. >> All right. >> What's up? All right. All right. Cool. >> [ __ ] shy. >> We're doing a little bit of I'm just uh you know storing all these cards I got. You want to see my collection? It's a little It's a little shabby, but it's my tour collection. It's pretty nice. It just, you know, all the basics. All this stuff right here, you know, nothing too shabby. Got this Ronaldo car. I got this card. Yeah. >> What is that? >> Oh, this is for This is for me tomorrow. >> Okay. Well, she needs a [ __ ] jacket. And I'm giving her two options. >> [ __ ] I'm sorry. >> Both my options, [ __ ] >> [ __ ] doesn't my options. [ __ ] you. >> Yo, Rudy, I got a bro. I got a [ __ ] bro. >> Thank you, Anthony. top. >> I got to >> All right. You got to go. You want to go? >> All right, cool. >> All right, cool. All right, we're done here. >> Jamal to come. >> You got to go [ __ ] too. >> N Henry, what you backing up for, bro? It's the last day. What you backing up for? >> Backing up, bro. >> Backing up, bro. Come on, bro. >> Some so [ __ ] >> Yeah. Good, >> bro. I got a [ __ ] bro. [ __ ] Oh. If you can get a picture just holding the chin. >> Yeah. Yeah. >> Jack in the box smell like cucks. >> Yeah. >> This piece hard. Is it like can you like disconnect the piece? >> Yeah. >> You can take the chain. >> No, I'm talking about the piece. Like the piece. >> No, it's fully intact. Oh, >> the piece. Okay. It's cast in rose gold. It's got ruby diamonds on it. >> You f you you flew all the way to London to to deliver this >> came yesterday just to deliver it. >> Damn. >> Had to get it here for LA. >> That's crazy. >> Final days of the chief. >> It would have been you know fire if you would have delivered it tomorrow morning. I ain't gonna lie. >> If we wanted you >> I'm not going to lie. It would have been a little bit more fire if you would have delivered it tomorrow morning. >> In the morning. >> Yeah. You know, fresh off the wake up. But now you can go to sleep with your loopy chain. >> True. You're right. >> And it'll protect you for your final sleep. >> You're right. >> End of the stream. >> That's a great way to >> turn that around. >> Thank you, bro. >> Mhm. >> Sir, bro. >> See you soon, bro. >> All right. Cool. >> Let's Let's um You want to >> Jamal? >> Yeah. >> Let's go, Jamal. Money. >> Too bad. >> Money spreading. Pokemon spreading. >> Pokemon spreading. >> We got to score. We ain't scoring a minute. >> Huh? We got to score. We ain't boxing a minute. >> I could probably do you bad in boxing, though. >> In boxing? Yes. >> I just didn't I just I just said I said we all got a spar. >> Yeah, we ain't boxing a minute. I got to see that. >> I got a video. >> I probably do all of y'all bad now. >> I got a video me. >> I do all of y'all bad. >> Yeah, you fight. But you do but you do MMA. That's >> I don't fight MMA. I fight kickboxing. That's striking. Striker only. >> Okay. Well, okay. Well, let's slap box like slap box. >> What? >> Just a little. No, like not not slap box, but just just um shadow box. Shadow. I just want to see >> shoulder body. You see right there? That's right there. See? I know. See? No. No. I hit you with the hook. I picked that. Hit you with your and with your body. >> That would that never did. >> That would never. >> It still hurt though. >> That's a hit. >> I still got you, bro. >> And I caught you with that up. >> Come on. Let's keep going then. >> Caught you with that right here. Boom. Boom. You down uppercut. You feel me? I know. I need gloves. Ch. Who winning? Chat. Who winning? >> I need gloves. >> I need gloves, bro. We going to need gloves, bro. >> Get it one day. >> We going to need gloves, bro. Y'all me riding. movie. >> You good cous? >> I'm good cous. >> I'll still whoop your ass though. >> You going to whoop my ass cous? What? My mother cous to my mother I would whoop you away. >> Go to my mother. You s who you talking about? You heard like to my mother. >> You don't remember there. >> You just said you can't poop. >> No, I said you can't. >> Maybe they back. >> He said I can't do no back flip no more. >> Can you not off the stand off? >> Yes. You want me to go do it right now? >> All right. Do a back flip. >> I ain't do it in here. I'm going to do it outside. >> Let you do a back flip. Not doing it out the stand up. >> I don't know why he think >> Be careful, bro. >> He's not doing it. >> Yo, be careful, man. >> He's not doing You're on a slap. >> I definitely still got it. >> That was high. >> He got height. You got height on that. >> Damn. Right back. >> Damn. >> You just got to straighten the legs to get it on you. >> That was clean. >> I can't believe >> Where's my lub? >> I can't believe you just did it clean. >> That [ __ ] was clean as [ __ ] >> I feel like you jumped on a trampoline. Where's my short? >> These clean, chat. Are these clean? >> Like these days? >> Oh, yeah. They going to braid your hair and cut your hair. >> I'm not braiding my No. Hell. >> You going to get a cut though if you want. >> Huh? You going to get a cut though, right? >> Yeah, I'm getting a cut. I'm not braiding my hair though. >> I ain't get cut too. I should cut. >> Are these clean? I just bought these. >> Where the [ __ ] is my clean clothes at? >> Your shorts. >> I'm wearing these. These are clean. with that camera. >> Get twist. >> No, I'm not getting twist. >> I did. >> Yeah, I was just about to ask you. >> Where that chain go? >> It's in a box. I put it in the box. It's >> in a box. It That shit's still clean. >> And it's black, Luffy, too. >> All right. Ready? >> Yeah. Switch battery. Wait, wait, wait. Let me switch the cam, too. >> Switch the cam. >> All right. Wait. Give it three seconds. >> Two. One. Do it. >> That was eight out of 10. That was eight out of 10, Chad. That was a good reload. That was a good reload. All right. Switch back the IR. >> Who do you >> switch back IRO? Switch back IRO. >> Or sorry, when do you want? >> After I shower. >> After shower. >> Can we switch back to IRL? >> It's rumor. It's late. >> Said that was eight out of 10, bro. >> That was eight out of 10. The camera's over here. >> How you doing? You got a barbers for the day? >> Yeah. Good. >> Okay. back. >> I think one of my >> Bobby Bobby. >> Oh, you Braden? >> Okay. When I get back from the show, you can come out here. Do you just stay on the bus for him? >> Yeah. I mean, um I think Jamal needs it. >> Yo, Jamal. >> Speed Jamal. Oh, my bad. >> So, can you get a coat while you're showering inside the hotel? >> Are you going to cut or braid? Are you >> getting cut? >> You going to cut? >> Yeah. >> I'm going to wash my hair though. >> Yeah. >> Okay. >> Oh, he think I'm playing. He think I'm playing, boy. >> Mike Tyson. All right. Mike Tyson them up. Mike Tyson them up. Mike Tyson them up. Are you there? Mom, >> what? Okay, I'll keep you upd Where dad go. >> He just went there. Okay. >> Oh, e. >> Yeah. >> Yeah. I'mma I'mma leave that alone. >> Is Jamal going first or y'all both going? We're just trying to figure out where the moment you put them on the production. >> Yeah, production bus. Okay, cool. Done. Rudy Henry [Music] move ap. as soon as possible. >> We're going to be in the same place at the same time at 6. I'm sending a guy to cover that time frame. Period. >> So instead of 15, we going to be on 16. >> That's what I'm call 20 >> like 10 >> 10 >> 10 >> what? >> Yeah. You can't get 20 from >> What do you want me? How you want me to handle? >> Yeah. >> Must have took the car. >> No. >> Put the chicken cutlet in the bag. That is like that was like >> it's physically impossible. the battery out. >> Oh, the battery went out. >> Yeah. >> Oh, so we on shotgun? >> Yeah. >> Slips, can you get me double A's? >> You ready? >> Are we on shotgun then? [ __ ] it. >> Come on. >> I mean for the hotel then um >> I should bring my bring the uh the boys. >> Bring the boys slips. >> Hey, >> have a good night. You have a good night, too. >> Hey, I'll come up there right now. >> Come up here. >> I'm not doing that [ __ ] >> Never mind. >> Give you a hand. It's for >> my underwear draw. >> Switch to the shotgun. >> It's already been on shot. >> No, I don't like to be touched there. >> Yeah, they're all gone. Or you can pick together. Thank you. >> Lap ready. >> Yeah, we should be >> totally change. >> Wallet change a lot. >> Where my dad at? You want to bring them? >> What? >> Uh my dad. Yeah. >> Barbers. >> Oh, it's more barbers. >> More barbers. >> It's more barbers. What's good? >> What's up, bro? >> What's good? What's good? What's good? What's good, y'all? >> Where my dad at? >> Where you at? >> Straight pig. Straight pig. Before I take a shower, >> I got to say green. time. >> Appreciate you, man. I appreciate you. >> Hurry up. Take a >> picture. >> Yeah, he ain't ready, bro. >> Hey, this the [ __ ] in >> I make music. >> You're the biggest artist. >> I'm the hardest Asian in >> Do you rap or freestyle? >> I rap. I rap. >> You going to spit some? >> No. No. N I can't sign too, bro. >> Spit something down. [Music] >> If this what it comes to, I even pretend like there's some things that I won't do. Where's my commitment? This is me consenting for you to let me know. If you going to stay, you going to go. Your friends throwing stones. Either listen or you don't. That's all I got for right now. >> But I'm speed twin. You feel what I'm saying? >> That's what I get all the time. Mama, >> we do. We kind of look alike. All right, y'all. >> Hold wait. Hold wait. I know your song. >> Wait. I know your song. Where you in? >> Guys, give us some space. >> Did you make that one song? >> That's [Music] how you know? >> Because my chat just said it, >> bro. Yeah. >> Yeah. You made that. Rick, that's Mando. I was in Afric Thanks for >> I got a shower. >> That's Meno, >> [ __ ] That's Meno. >> Hallelujah. >> Elevator's over there. >> Can you get a picture? >> Straight. Straight. Straight. >> Look at the camera. There you go. >> Wait, you're here. Here. >> All right, ladies. Okay, ladies. >> You got to go. >> Oh, we about to lag. [Music] >> That's why. Hey, I got some home girls for you. >> Where? >> I'm from Israel. >> Where? >> I'll be right here. >> We're good, bro. >> Where my dad at? Where my dad at? >> Get my dad. >> Dad. >> Wait, wait, wait. Stop. Stop. Get my dad. >> Too late. >> Too late, >> [ __ ] That's Meno. I'm I'm about to play that song. That's >> Meno. >> You ever heard this song? [Music] Hey, don't snitch. That's rhymes on your click. That's Meno. That's Meno. That's Meno. That's Meno, [ __ ] That's Meno. That's Meno, [ __ ] That's Meno. Tell us a song. Yeah, cuz bro, I heard that song when I was like 13, though. >> It's old. Like, I was in there when I was a Jit. That's a old song. >> What? Oh, nice little D. That was so smart. Got your up. Don't snitch. That's Meno, [ __ ] That's Meno. Hotel room full of dicks. >> Yeah. >> Hotel room full of >> full of blicks. >> No pizza. No pancakes. >> Oh. >> All right, guys. >> Come on. >> Pillow fight. Oh [ __ ] >> Retreat. >> Why you coming over here? You [ __ ] doing MMA moves. >> What is over, bro? It's over. Okay. Okay. >> Okay. Okay. >> Okay. >> Oh [ __ ] >> Oh [ __ ] >> Go take a shower. >> Oh, that was fun. >> [ __ ] That was fun. >> I got a shower. What the [ __ ] >> Hurry up. >> Yeah. Did you tell me to hurry up? >> What happened? >> I had too much drinks of margarita, bro. >> [ __ ] [ __ ] is [ __ ] right now. >> What happened, man? >> I had too much of margarita at the bar. [ __ ] >> [ __ ] right now, bro. >> [ __ ] >> My hair look like yours. >> Shotgun. Shotgun. Shotgun. Bro, chill out. >> Shotgun. >> Shotgun. >> Yes, sir. >> All right. Bye, Chad. I got a shower. >> And [ __ ] >> No. >> Yo, chill. Chill. Chill. Chill. Chill. Chill. [ __ ] >> Rudy. Chill, bro. I'm sorry, >> bro. Rudy won't do [ __ ] Huh? Call me [ __ ] Open. Oh, why you lost >> rocket >> [ __ ] Why can't you open that door? >> Try to do it again. >> Wait, can you >> open it? You can't hold it. Oh yeah. >> What' you say? >> Huh? Huh? Yo, >> baby, okay. Like that. >> Oh my god, bro. Oh my god, >> bro. >> My back. >> He as [ __ ] said, \"Help me.\" >> I was trying, brother. I ain't going to lie. He He [ __ ] bro. I was going to jump on his back face. >> Not happening. >> His bicep bigger than you. >> Not happening. >> His bicep bigger than my whole head is literally >> tackled his ass. >> He need to be the next Black Panther. God, >> that [ __ ] looked like that was hurting. He was gripping [ __ ] out of like he was going to break his [ __ ] with one hand. >> How did that feel you hurt? >> Scale one to 10. >> Hurt the answer. >> Still, bro. Dang, bro. Bro, get back. >> I love that, too. >> Speed we can hear you. >> Tell them we can hear. >> You a little loud. >> No. Tell them we get him. >> Tell them we get him. >> Hey, we hear you. >> What? >> We hear you. >> We hear you. >> We hear you. >> I kind want to go talk to those one women. >> Them women down. Oh, I can't. >> Yeah. Yo, real quick. Put on something or some [ __ ] I don't know what he about. >> He about say something devious. >> Put some music on your phone. >> Go to YouTube. Go to YouTube. Go to YouTube. >> Play stream like >> Oh, we can't go to YouTube. What? You go to YouTube. >> Since when hotel >> when hotel rooms do that slow >> copyright. >> Exactly. That's what I just put on random [ __ ] >> YouTube video. >> Put on my [ __ ] They can't copyright my [ __ ] >> Oh yeah. >> [ __ ] I got to find your [ __ ] >> bro. That [ __ ] hurt it, bro. He still feeling that [ __ ] >> I still feel that [ __ ] in my neck, chat. >> The [ __ ] is this? >> What do you do? Put his finger in. >> No, he put my finger like Yeah. Like >> DJ do that >> I don't know what's wrong with my chat. I ain't going to let this hotel room nice. >> I will go downstairs, but I don't know if that's possible. >> I don't know if they won't let me. Prank speed. No, we can't prank. >> Ice water. Ice water. Ice water. >> Oh yeah. >> No. You You ain't got to put the whole camera on the [ __ ] >> Go get a We can go get a bucket of water and ice. Two of them. >> Yeah. >> And der. He on the toilet right now. So we got time to get >> Wait. No. Hold up. Wait. So wait. >> Well, he get in the shower. >> I don't know how the shower works. Is the shower like the >> Yeah. Yeah. You know, you can just dump it over. No, he wait. Okay, that's all good. Shower. >> No, I won't show the I won't be showing the bathroom. I'll just hear the You'll hear the the scream like >> Come on. Come on. >> Oh, be louder. [Music] >> talk. Okay, so basically, [Music] >> yo, Darl, make sure Oh, >> keep talking. Keep talking. >> Yo, chat. Oh, yo, Daryl, make sure to uh keep talking. Keep talking. >> Why you getting ice? >> I don't know where you going to get ice from. >> I need I need a ice. I need a a Sprite though with ice. >> Yeah, but the [ __ ] are we? >> That boy's running fast. We on the toilet right now. We got >> right here. Right here. >> Yes. >> [ __ ] [Music] I got to we off ice. No water. >> Oh, we got to get water. >> That's why I said >> there sink. Is there a sink? >> We need a We got water bottle. No, we need to get an empty chair. >> There's water bottles in there. >> How you doing? >> Yeah, we need an empty trash can, huh? [Music] Hey [ __ ] in here. >> Hello. Hello. Hello. >> Hello. Hello. Where's he going? getting more ice. >> Put any more ice. >> That's all you. >> Someone need to put something. We got to put some more. >> I don't want I don't like just in case some [ __ ] >> That's what I'm saying. Why would you leave me? >> No, I'm saying >> while he's talking now. >> You're right. >> We got to put something on or talk loud. >> Okay. So, hello. Hello. How you doing? My name is Jamal. How you doing? What's up? What's up? >> All right. So, basically Oh my god. Yelling, fam. >> Put on something. >> Put on something. >> Put on Battlefield. >> No, I don't know if that's copyright either. >> Damn. >> Put on no copyright music. >> Yeah. Put on some chill. Yeah. No. Yeah. No copyright music. >> Start rapping. They told me I was a snitch. Yeah, that's right. >> I'm a snitch. I snitch on my homies every night. >> What? >> Bro, what the [ __ ] bro? This [ __ ] is slow as hell. >> Yeah. Yeah. Yeah, >> go operon. >> Where, [ __ ] Go, go, go. Over. Over. Oh, >> damn. >> Right there. Yeah. >> [ __ ] Damn. When Donald Trump and Texas don't fight >> production production production silence our mut gives voters the power of independent redistricting and offers all Americans a fair midterm election for democracy in all 50 states. Oh, for real? >> Now, [Music] >> this [ __ ] ain't never [Music] >> What are you doing, [ __ ] [ __ ] >> What are you doing? [Music] My legs weird as [ __ ] [Music] Yo, >> what? [Music] >> Ch. I don't think we can do it no more. Yo, cuz like >> do it now. Just [ __ ] dash it in there. >> Yo, open that. Yo, open that door. [ __ ] [ __ ] >> Bro, open that door and just [ __ ] let it rip in there. >> I don't even want to do it. >> Come on. You can do it, bro. >> I don't really want to do it. >> I don't want to do that. >> No. Why? >> Ask the chat if you should do it. >> Well, never mind. >> Are you doing this, sir? >> Hold on. I'll be right. >> Yeah, I'm done. Hold on. [Music] Don't keep >> still. Yo. >> Yo, Darl, if you would have done that, I would have Yo, Daryl, I don't care. >> Chat, should I do it? >> I don't care about a TV. You >> chat, should I? >> Oh, you going to put water on me if that's already on you? >> I don't care about it. >> Yeah, I don't die. >> Yeah, you don't die. You could be wet though. >> I'm about to be wet. >> Oh, yo. All right. Never mind. Never mind. Never mind. >> They're saying yes to do it. >> Do it. I want you to do it. Yo, chill out. Chill. I don't want you to do it. I don't want you to do it. You >> want me to do it? No. >> We want to do it like this. >> Drink it. I'm not drinking it. >> It said do it to angry. That's messed up. >> You would get [ __ ] up. >> I would get [ __ ] up. Yeah. [ __ ] up. [Music] [Applause] [Music] >> It's too late now. >> Huh? I can't. Oh, good. I'm waiting for the other one to play. Hold [Music] the fan. >> All right, let's go. >> Amigos keepo, let's go. Y'all tell me back. Switch stamp shot. >> Yeah. Yeah, I'm just I put that in the background cuz you know >> why did you do no non-copyright music? I just didn't know who copyrighted so I just put noncopyright music. >> You feel me? >> What? >> I just put on non-copyright music just in case. >> You feel me? >> Why was ice in a trash can? >> Dump water and ice on you. You came out too early. >> Oh, really? >> Yeah. >> You know what the idea was? >> What? >> Jamal. >> Jamal. >> I knew his love. >> What you doing to him now? Ice is still in there. >> Oh my god. The ice is down there right there. >> He going to poop first. It's going to take a little minute. >> Get in my [ __ ] >> Pour ice on my [ __ ] >> Yeah, just run out. >> That's [ __ ] up. >> He was going to do it to you cuz he can't get up. >> What do he He got to accept. >> Should I do that? >> He going to get accept. Yeah. >> [ __ ] on his hands. He trying to >> He trying to get up on the head. >> He You You got the key. Jamal's there. I just gave it to Jamal. >> Wait, I should ask for it. Yo, I need it real quick. >> Don't I thought it was >> Rudy should ask for it, not you. >> What's he trying to do? >> Pour the ice. I'm >> trying to pour ice on him while he's fit. >> All right, let me get >> Yeah, let let Rudy get it cuz it looks s >> cuz the fact he's about to do it to me. They're spamming yes too quick. >> I need a real quick >> you can you'll be able to get out yourself. >> What are you talking about? All right, cool. Um, I'm going to send security up here. >> Yeah. >> So, they're going to Why are you looking at me? >> Do something. That's why >> they're doing something. >> What are you doing? >> Go. >> You got teeth. >> You got to go. >> Watch. >> What you up to? >> Watch. I know what you're up to. So, watch. >> Peace. >> Wait. We got to be careful cuz what if he's he's uh >> I think he already knows, bro. >> What if he's gooning? >> Watch it. >> He's probably watching. >> Yeah. >> What if he's gooning while we throw the water on him? He can't do it. This might be stupid. I'm going to go downstairs. How are you? What's up, bro? >> What's up, bro? >> You good? >> Yeah, I'm good. >> Shower. >> Yeah. >> Yeah, that's a good idea. I ain't gonna lie. You know what? I like what you're doing here. Yeah, it's it's smart. Yeah, I understand. Yeah, >> you know I got this, right? >> Yeah, it's not going to work. Let's just go downstairs. Let's go. >> He knows. Let's just go downstairs. >> Yo, what do you want to do dump for the for your IG pictures? >> Oh, I need to pick it right now. >> I have I just made a folder for all of it. >> You did? >> Yeah. If I stay back this morning, Jamal Reed's chat, it's not fair. I'll send this to you when I get Oh, God bless America. >> God bless the United States. >> No, I No, I'm getting line up on the bus. Let me get my damn line up. Bless you little line up first or your hair done first. >> I will get twist but >> you just be like, \"Oh my god, I got to sit in a chair for an hour or two.\" >> Uncomfortable to sleep, too. >> Uncomfortable to sleep. >> It ain't worth it. >> [ __ ] Of course, my dad's in the bar. John up. John B. >> They went to sleep, bro. >> Hey, I literally just had surgery like two minutes ago, but she was like, \"You got to take me to go sushi speed.\" >> Oh my god. What happened? >> I tore my lab. >> The lab? What's that? >> On the hip, like, >> you know, it's like a bone socket. >> How did that happen? >> I don't know. >> We think it might be from a car accident. Some dude hit our back of our car and then ran off. >> Then that's it then. >> Yeah, it's got to be that. >> What do you mean you think? >> That's it. >> Well, it happened like a month after, but she's also super into like yoga and Pilates. So, I'm like, dude, she can go upside down. So, I'm like, you must have busted her doing that, too. >> No, I think it's tomorrow. >> That's how she got injured. >> Come on, let's take a picture. Let's do it. >> Hey. >> All right. >> Thank you, dude. Appreciate it. >> Watch, man. >> My dog. >> What? Welcome to LA, bro. Enjoy. Be safe, man. Take care. Love, love, pops. >> Always, brother. >> Thank you for that. I appreciate that. Straight up. I'm so happy. >> Thank you, brother. You guys have a good night. >> Come on, Dad. >> Hey, brother. >> Brother, come on, brother. This is my brother. >> What's up, brother? >> This my brother. He He been looking out for me, brother. >> Ever since I pulled up, bro. >> Yes. >> Cool peoples, bro. >> He cool peoples, man. >> That That jersey is for you right there. Dad, this for you. He just want you to sign this one for me. >> He been looking out for dad since dad came to >> LA. Yeah. >> Really? >> I was that dude in the morning. >> Oh, you was the He was the morning deliver. >> Yeah. >> You got >> Did I Did I lose your pen? >> It's all good. Someone took it. I got another one. >> No, it's right here. There you go. >> Thanks, Steve. >> Oh, yeah. [Music] Man, I love your sing. >> You love it? >> I love it. [ __ ] >> Can you sign the back? >> You know why? No, no, my bad. Cuz the back is the special part in Japanese. Oh, >> okay. >> Yeah. So, you could rock that. >> There you go. >> I was going to give it to you earlier, but we're now >> It's all good, bro. >> Thanks, And that's for you, too, right there. >> Oh, that is Oh, there. >> It's a pen. >> Thank you, bro. >> Thanks, V. Can I get a Can I get a margarita? >> Oh, no. >> Excuse me. >> Oh, no. >> I'm just playing. >> Yeah. Yeah. >> Residuals down the street. >> Huh? >> Residuals down the street. >> Residuals. >> Residuals. >> What does that mean? >> They're closed. >> That's the closest place currently in the area. >> Oh, so no more drinks are open? No. >> Ah, darn it. It's all right. >> That's okay. It's >> okay. She wearing a mask. >> Dad, >> this is a good moment. Up at the bar. >> Yeah. Chilling. >> No. >> Any chance? Huh? >> Yeah. >> No, it's a shotgun. >> Yeah. >> Yo yo yo yo yo. >> You never like >> Daryl. >> I'm trying to look out for you. >> You know Daryl. This is my cat. >> How you doing? Good to see you. >> These boys need haircuts. >> They got bou fants now. >> I look like >> they got freaking bou right now. >> Yeah. I know, bro. I got >> I'll >> really finally >> That's good news. I know. I got This the end. The tour is >> We almost there, man. >> Yes, sir. >> How do you feel, man? At the end of I feel sad because I hope that I can see him the day the day after the tour, but if not, you already know we locked in for life. >> Yeah, >> we locked in for life. But >> you know, I want him to go on his vacation and enjoy himself, man. >> Yeah. >> He deserve it. He worked hard for y'all, man. >> My dad work hard for y'all. >> He worked hard. He wor He rode a bull in my heart. I was like, \"Don't ride that bull.\" But he did it anyway. >> The hotel manager tripping. >> Oh, we got to go. But we didn't do that. >> Yeah. >> Yeah. But they still, >> you feel me? >> You know me, man. >> Yeah. >> What? >> What? >> Yeah. Where you going? >> Hey, see get up, bro. I got to get up. >> Get up from what? We chilling, >> man. These ones be killing my vibe, bro. >> Killing my vibe. >> Yeah. [Music] >> Man, y'all be killing me, man. Y'all kill me. Y'all really kill me. >> Y'all kill me. Y'all really kill me. first freestyle for you real quick. >> All right, let's go. >> Let's do it. >> All right, you've been waiting all day. Let's go. Let's go. Don't matter to me. The floor is ready for me, man. I know what it is. Major little phon. We going to end this chat. Send your ass came back. No facts like salute to them, not you. You want to play with the truth, but with the truth for real. I just want to coop with the live a little bit stuck in the house right a little some month and out [ __ ] can you feel me and not till now I feel war [ __ ] I'm on some other [ __ ] I pull me looking I'm too nice with the way that I live they like what is this like took enough of my time my phone don't back on my line I thought I was tap [ __ ] got weird had to plan my attack more than that man I stay pack like a box and it is a rap want to take m the king just cuz he jack yeah [ __ ] need more than that yeah [ __ ] I got >> all Hey, >> that one bad, bro. >> Hey, appreciate that. That [ __ ] was hard. >> Yeah, I want I wanted to uh proposition you like, \"Hey, like I know you can't. I I don't want nothing. I just want to know if it's possible that I could jump on some kind of platform. You could I don't know if you [ __ ] with me. >> You just jumped on a platform. You just jumped on my platform. >> You just jumped on the stream. >> I'm not even thinking. I'm not even thinking. >> You just jumped on my mouth.\" Thank you. My name my name is KB White the artist KBY on Instagram. I got you. >> I can't put down the cup. [Applause] [Music] >> I came up the cup. I can't put down the cup. >> I got a pen. What's up? For you, bro. >> Thank you, G. >> I got this whole bag booty, too. I mean, period. I got some just text me. Uh, where come from? Yeah, >> that's my cat, man. We got pulled over together. So weird. >> Can you sign it for me, bro? >> Dude, I've been talking with you forever. Inspiration. >> All right, let's go. Let's get to the bus. >> Guys, give us space. Please watch out for her. She's >> over. Hey. Hey. >> You whispering. It scared me with the mic. >> Is this a shotgun? >> The shotgun's powerful. I think you licked out how how powerful. >> All right, Chad. Can y'all hear this? >> Okay. You covering it. Now I won't hear it. >> What did I say? >> Now I won't hear cuz you're covering. They didn't hear that. Ah, >> that's crazy. >> Daryl, >> little D. >> Little D forgot cheated back in 1993. I ain't on camera a lot. >> Did you just whisper to the shotgun like >> they probably heard that? >> They didn't hear that. >> I went right in Daryl's ear. Pause. >> I went right in his ear. >> Pause. >> I went right in. >> We got to get out of here. >> Yo yo >> I know, bro. right here. >> Thanks again, Steve. >> Thank you, >> guys. Please get a stream pick. Stream. >> Hey, let's get it. Thank you, brother. >> Oh, yeah. >> Right. >> Thank you for supporting Palestine. I'm Palestinian. >> Thank you, man. >> Thank you, bro. Thank you for always advocating. >> Thank you, man. >> Thank you for not silencing them. Thank you, dude. >> These hotels be pissing me off, bro. >> Right. >> [ __ ] pissed. >> I am [ __ ] pissed. >> [ __ ] >> Los Angeles, baby. >> Los Angeles, baby. [Music] Hey, it's a lot of it's a lot of streamers on streamers in LA. >> Huh? >> Oh, my clothes. >> My clothes. >> Mother. >> Where were they? >> On the bar. >> Am I taking a picture of my kids? >> Hold on. I got to get my food. I got to get my food. >> You mind if I wait? Is that cool? >> Yeah. Yeah, you can wait. >> I forgot my clothes. >> I forgot my clothes, guys. [Applause] >> I'm going to get my clothes. He's tripping, bro. >> Guys, give us space. Watch out. Move out the way. >> I got to take a picture. >> Yeah. >> Here we go. There we go. >> Here we go, >> guys. We got to get going, >> guys. Face face. >> One of >> yo, chill out. Chill out. Chill out. You guys, sometimes your biggest enemies >> might be the ones closest to you. >> I love you. >> Spin. Hey, >> I can relate to that. >> Yo, don't follow us down there. Wait there. >> Don't follow us down there. >> I can relate to that. [Music] game. [Applause] [Music] to the hey >> guys back I was from your discord. >> Don't go past this yellow line. >> It was like all the way from Florida. >> That's it, man. >> Oh, what's good, >> bro? We finally met. You said we were going to meet, dude. Thank you, bro. Can I have a hug, bro? >> Hey, man. I have a small >> I don't like. >> Yo, you guys on this side? [Music] Speak. [Music] [Laughter] >> Oh yeah, you got room now. >> Oh yeah. Oh, caught him. Oh yeah. >> Oh yeah. >> Go to your right. Go to your right. >> Yeah. Okay. Stop. Stop. Stop. Stop. Stop. >> You got turn. You got >> You're close. You're close. >> What's up, sweetie? >> Hey, Luka. >> Hey. >> Hey. >> Hey. >> Hey. >> Hey. >> What's up? >> Hey. >> You about to get your haircut? Yeah, >> I'm getting my haircut right now. >> Really? >> Yeah. >> Wait, where my phone at? [Applause] >> I wrong bus. Wrong bus. Wrong bus. Yo, >> wait. Is that our bus? >> Oh, that's not our bus. >> Holy [ __ ] >> I thought that was our bus. Holy [ __ ] Holy [ __ ] Holy [ __ ] >> Oh, Taylor's bunk check. >> Am I time for a haircut? >> Oh, it's time for your one, >> bro. It's time for your bunk check. >> What? >> Nah, don't be doing that. Oh, >> ready. >> Okay, >> it's not that bad. >> Should I smell one of his draws? >> No. No. You will catch [ __ ] gorrhea or some [ __ ] >> Garia from smelling. >> Yeah. >> How's L's haircut going? >> We'll get haircut is a [ __ ] [ __ ] show. >> Oh my days. Oh, I got to keep it PG-13. Got to keep 13. Why would you >> Why would you text me good night if you're not going to sleep? >> That don't make any sense. >> Or tell me about it. >> Why would you tell me good night if you're not going to sleep? Tell me good night when you going to sleep. Chad, has somebody ever text you good night and they not going to sleep? >> Like what? That's like me saying bye-bye. >> I'm not leaving. >> But I'm not leaving. Is it crazy frog time? >> I can't put it down because >> crazy frog time. They huh? Like what? They bow. >> Oh, I'm about to prank somebody. >> Oh, I didn't even know they had this on the bus. >> It's like the escape room. and sold. >> Hey, the barber and braider. Oh. [Music] Oh. What? >> Where the butt at? >> A speed. >> Where the butt speed down here? >> Are you touching my head kind of? >> Daryl's enjoying that. He's smiling right now. >> Oh, that's I love that. Uh, the barber is ready for you. >> We have a braider for you. >> I wrote it. Yeah. >> So far have 15 coming. >> So far we got 15 coming. >> 15 coming. >> Yes. >> I'm going to save this night, baby. Hey, >> hey, >> wait. Where are we going to do that? >> Where you going at? >> Where do we do that at? >> 15 are going to fit in here. >> At the hotel. Doesn't matter. >> We can't film at the hotel. Oh, >> GG's. It's going to be here. So what are you doing? You going cut your hair? Yeah, >> I'm going bald. >> Yeah. >> Who to you first? Not >> going like my [ __ ] out. >> What about Henry? >> Henry's the same as me, man. >> So y'all need to go wash his hair and stuff. Yeah. Yeah. >> To Brazil. >> Okay. Maybe we get some of the crew then >> as well. >> Yeah. What you What you trying to do, bro? >> Who me? >> Yeah. >> I need to get a lineup. I want it outside, though. >> Do it outside. >> Let's do it outside. >> All right, let's go. It's all mobile, so >> I feel like getting a a haircut outside is more I can connect with the earth more. You want to do it? You want me to sit up right next to my >> Y? Who's wait? >> Yo, bro. Wait. Who come out here? >> Me. >> So, look. The last time somebody come out here, they push me back a little bit. >> No, I won't even do you like that. >> All right, [ __ ] >> I just want to talk to you beforehand. I got you. >> Like a pregame like say that [ __ ] pregame. >> I'm ready. >> You ready? >> Yeah. >> All right, bet. I got to look good for the last day tomorrow. Yeah. >> I'll grab the chair if you want to grab the stuff. >> You want the speaker? >> Yeah. >> All right. >> TTS TTS. >> TTS phone. TTS phone. >> TTS phone. You got your chat? >> I am. Yo, when you're done, come take this cuz I have this [ __ ] in my hands. >> No, I don't think right here. It's >> a bit out here. I want to get it right here. >> Right here. >> Right here. >> Right here. I want to get my haircut >> right here. Right in front of the M. >> Right in front of my friends. >> Right here. >> Chat phone. >> Put it on your wrist. >> Nice to meet you. >> Nice to meet you, too. >> Pleasure, brother. >> I I just want a little taper. >> I got you. >> Me? My name is Victor. All right, bet. Victor, >> you want to put this on your wrist? >> No, I'm good. I'm good. >> I'm got a TTS. >> Yay. >> You swear I do nothing. >> Swear I do nothing. >> No, I might put my uh whatchamacallit on now. I'm talking to Di >> Lil D [ __ ] do you mean hit you from the back with these Robin jeans? >> Nah might be better with this cuz they're going to hear the clip too loud in the mic. You're right. You're right. Got you, >> Anthony. >> I got you. >> He's happy. >> Happy. >> Why he leaving? >> Happy, bro. >> Sleeping in a hotel room tonight. Look, >> I'm not sleeping. >> There you are. >> I didn't even get a hotel room tonight. >> I just realized I could do that, too. >> Yeah, you want >> Should we sleep in a hotel today? Can Nah, it's not a tour bus without a tour bus. >> Taylor said >> Rudy donated $2 through Superhat. >> Hey Chad Speed, what do you want for breakfast? >> Nah, Chad, we got to finish off the tour on on the bus. We got to sleep on the bus. You have >> Oh, what if we did a sleepover? >> Everybody slept in one room. >> Oh my god. >> That's a fire idea. >> [ __ ] that. >> A big sleepover. >> [ __ ] that. >> Everybody. >> What? >> A sleepover for the last day. >> Or doesn't make any sense. >> Or 24 hours you don't go to sleep. >> It doesn't make any sense, bro. >> Let's do a sleepover. didn't realize there >> you Dale and Luca >> can all sleep in the same room. Yeah. >> I'll be outside JB2 donated $2 through super chat. >> Call Betty Verllop. Huh? >> Jesus 17 donated $2 through Super. >> Why did you skip Sacramento? >> They can do everything. >> You want me to come out? >> You want me to bring the braider out here? >> You want to hit the bus? >> Come here, Dad. Sit by me, Dad. >> Anchor donated $2 through super chat. >> Sit by $840. Did >> I get my dad a chair? Yeah. >> Wait, wait, wait, wait. >> Flashlight. >> He about to line you up. >> Yes, sir. >> Donated $4.99. >> What? What? Nothing. >> Speeding is most [Laughter] >> 27 donated $1.99 to super chat. Are you snack? >> Man, they push. >> Hey, did he push me back? >> I told you all the way back. >> I told you. I [ __ ] told you. Super right here. >> Hold that dude that dude that cut it on his head. Look. >> So, your corner is right here, like where your hair's at. But it's supposed to be growing like right here. >> Told you, bro. He pushed me back. >> He pushed me back. Oh, it ain't push. It is not like that. You It's that I told you push me back. >> Hey, bro. >> Push your ass back. >> I I'll take the blame for it. I don't care. >> I got thick skin. They just called me Captain Bucky over here. >> Captain Bucky >> when I was in in middle elementary school. Can you take >> get Bucky? >> Captain Bucky over here. >> Oh, look at Peter Parker over there. >> Look at this. >> Why you mogging and [ __ ] >> [ __ ] Just cut it. Damn it. You trying to mo and [ __ ] >> Why are you moing? >> What do you mean? I'm so tired. >> Why is he trying to moen Have you seen >> Why is he trying to moy? >> Yo, have you seen this edit? >> It's for the edit, y'all. It's for >> It's for the edit. >> I'm about to get that LA cut, [ __ ] You know what I mean? >> Where's he getting? >> He showering. >> He doing it right now. You know what go mean? >> What's that? >> Oh, he masturbated. No. >> Oh, I'm sorry. PG. >> Damn. >> 13. >> But you know your dad, you can't I'm going to call it out all day. >> Wait, wait. Now I'm thinking about how is this 20 going to be? >> I was born in the early 80s, man. >> I was born in the early 80s. So we don't have no >> 21. Ain't no way you a day over 21. Hell him. >> Like he don't understand. He going to look young for the rest of his life. >> Because of me. >> Because of me. >> I'm going look young. >> I'm pulling for the rest of my life. >> You going to look young for the rest of your life. >> As long as you don't let people stretch you out and and situations stretch you out, you going to be good. >> Speed. What age do you consider it unk status at? >> You when you 28? >> 28. When you're >> 28, gang. Yo, >> I need you to >> I'm not going to lie. >> In my eyes, you when you 28. >> Big bro. >> Nah, bro. >> What's big bro? >> Big bro is like >> 25. >> What the >> 25 big bro? >> Yeah, I agree with that. >> What is what? >> Nothing. >> Oh, that's just that's Cincinnati over there. >> What you talking about? >> Oh, yeah. I was like, \"What are you talking about?\" >> Yeah, boy. >> I was like, \"What are you talking about?\" Cincinnati. >> I got the official one. >> See better with this one. >> Y'all from LA? >> I'm from Dallas, Texas. >> Dallas, Texas. >> Dallas, Texas. 204 is tatted on my wrist right there. Yeah. >> TMC. >> You feel me? Yeah. >> What does that mean? Uh, the marathon continues. Life is a marathon, not a sprint. >> I got you. You know, >> not quick. It's not quick. It takes some time, right? >> Anthony, >> you know where marathon came from? >> [ __ ] you means, right? >> No. >> No. Really? Where'd it come from? >> We're going to drain it. >> The word marathon comes from a guy >> who was running. >> So, his his army got defeated. >> Yeah. Yeah. >> So he ran all the way to where his family marathon. Right. Right. >> Hey, that's a good >> I see why they say >> it's a war. It's a war. War turn. Yeah. >> I got a [ __ ] >> You got a [ __ ] >> You got a boo boo. >> Bam. >> Waiting for >> not on the bus. >> I'm waiting for Luke to finish cut. >> So if he takes a [ __ ] who who does the camera? You me >> you got the light and the >> camera choose the camera. >> Wait, can you do a POV show with the camera? >> What? >> He going to do scenarios. >> What? >> No. If one guy is over >> Where's Uncle Wayne, man? >> Hey, man. >> That's foul. What? >> Uncle [ __ ] I'll be right back, bro. >> I'll be right back about five seconds. >> Yeah, >> TTS. >> You okay with with enhancements? >> What? >> You're okay with enhancements, >> man? Hell no, my mother. Hell no. >> Hell no. >> Good. Good. >> Hell no. >> Hell no. >> Put your seat back. Hell no. >> Not yet. >> Not yet. No. Whoa. Whoa. We're not pushing nothing back. No time soon. We're not pushing. No time soon. >> Y mean. >> Y mean. No. I'm trolling. I'm trolling. >> I'm trolling. >> He's not pushing me back. You know what I mean? [Music] >> He not going to push me back. I feel it. He's not going to push me back. >> I feel him. >> He too confident. >> Too confident, >> Chad. He too confident. >> Oh, my mama. We litty. [ __ ] I'm from [ __ ] I'm from San Francisco. Cali, man. >> I'm from um where I'm from. >> I'm from Cali. >> Compton. >> Nah, Cali. You stupid. >> San Francisco isn't Compton. L Compton is San Francisco. >> I'm from uh ain't the best place to be. >> I'm from third and a Toys for Kids donated $10. Let's give 300 toys to the community tomorrow. >> We can't even hear TTS, bro. >> Yeah, they pushed this [ __ ] back. >> Oh, he didn't. >> He didn't push me back. Right. He pushed back. >> This is the DJ that gave me the >> I can't I can't do my voice. >> Chad, I love y'all. >> I love every single one of y'all in the chat, bro. >> Yeah, >> I love y'all. If nobody said it today, but I'm going to say it today. I love you guys >> from the bottom of my heart. You know, >> it's some people some people in the chat don't even get to hear that. But I I'mma tell you that >> I [ __ ] love y'all. I [ __ ] love y'all, bro. Stop [ __ ] playing with me, bro. >> I love y'all. >> [ __ ] love y'all. >> Love y'all. >> [ __ ] love. >> [ __ ] love y'all. >> Wait. Yo, is that our drone? Who drone is that? Who? Hey. Hey. Hey. Get away. >> I don't think it is. >> Get away. Who drone is that? >> Wait. Actually, it's me. >> Hey, get out. Get out. >> Get out. Get out. Get away. Whose drone is that? >> Check if it slips. >> I don't think it slips. >> Who is that? >> Watch out. >> Who drove that? I don't know. Is that your drone? Hey, >> is that your [ __ ] drone? >> Is that your drone? >> No, no, no. >> I told him to leave. >> Who drone you that? >> Yo, you going to move? You got to get out of here, bro. >> Who drone is that? >> He spied on us. [Applause] Who is that? >> Right there. Where? >> Hey, >> hey, >> he in there, man. He just went there. >> Speed, I know you're looking for mods, man. Like, >> I did a little bit of modding and I know exactly what you're looking for. You don't want you don't want certain things to go down on my on you know what I'm saying during chat and I wanted to offer myself so I could fund my music you know what I'm saying >> you just offered so you want to be a mod >> I want to be a mod I got friends who are mods who do >> chat should he become mod >> I'm trying to like get enough money to fun this music [ __ ] >> if y if y'all voted it mean a lot to me that's all I got to say it's all it's up to y'all >> right back bro What? >> What's that? >> What happened? >> I can't hear you, bro. >> Y'all done a mean [ __ ] shower. >> Bro, I bro, that was the first time in my life somebody came up to me and asked to be a mod. >> I got a model. >> I think I got a model. >> Got a model. >> Hey. Hey, type in a YouTube. Wait, cuff them calling me. >> What the [ __ ] do you want, bro? Damn, you ugly as [ __ ] >> I'm not ugly, [ __ ] I cut my [ __ ] Stop playing. You know I get [ __ ] [ __ ] Let me get on tour bus. Let's go crazy. >> Tomorrow my last day, >> bro. Where you going to be at? I'm there. >> Where you at? >> I'm in Miami, [ __ ] >> Too far, my guy. You're too far, >> dude. You got at least end it in Miami, bro. You got at least end it in Miami. >> How the [ __ ] can I drive a tour bus in Miami under 24 hours? Fly monkey. >> Listen, you Why you didn't bring me on bus, man? I want to get lit. Come on. Me and Jamal. Look, I got a bigger idea. Me and Jamal uh sports Olympics. >> Ooh, >> that's Yeah, that's him. >> I got a better idea. >> I got a better idea. >> What is it? >> We fly to Turkey and fix that face of yours. >> Cool. And I got a better idea as well. >> What? We were creating a video of you and a when you when you sucked your dick in the clayboard house. >> Oh my god. See, he always got to say some weird [ __ ] >> See, I knew he's going to say some weird [ __ ] He always got to say some weird [ __ ] Some old weird [ __ ] Always. Always. Y mean you bro >> that never happened. That never happened. >> Let him fly out. Chat, should we come fly out for the last day? Can you go to the >> Hold up. Oh yeah. Donated $1.99. How do you reach the Mexican shop? Are you drinking my Diet Coke? >> Nope. This a normal Coke. >> Yeah. [ __ ] >> This is going to go after you. [Music] >> Who is moaning? You'll find >> somebody's moaning my name. >> Don't [ __ ] it up there. >> Dro as well. >> Sylvester donated. Speed. How'd you like Compton earlier? >> What? >> How'd you like Compton earlier? >> I love Compton. >> Love Compton. >> I see you riding that big ass horse. >> That no one wants your coil. >> I love you. You love me. >> Mod. Yo, >> bro. I got to mod that dude, bro. You spoke to him? >> Where he at? What if this white speed? >> Yo, we haven't seen him today. >> Hey, can somebody give me a die code? >> Got you. >> Yo, have we seen him today? White. >> What? >> Have we seen Whitebe today? >> My mod's ass, bro. People can just come in my stream and say whatever they want. We're not Well, not my chat is a free speech. >> It be people spamming in my chat. >> Thank you, man. Yes, >> sir. [Music] You're drinking it. Where you going? >> Oh, it wasn't for me. I see. I see how you I see how you are. >> It's all right, Anthony. I'll see how you are, >> Anthony. >> Yeah, >> bro. I hate haircuts cuz you got to sit still for [ __ ] 20 minutes. N A N G W C UF R E L E A S >> donated green card. Is that mean? Did you hit the chair right now? >> Well, they said it's just a mystery. They were saying all sorts, >> [ __ ] That don't have nothing to do with ADA. I just don't like sitting still. I don't like being still. Simple as that. >> They saying you got ADHD, bro? >> Yes. >> That's [ __ ] up, >> [ __ ] I just don't like sitting still. That has nothing to do with nothing. You know what that means, right? >> No, I just don't. >> There's two differences between >> There's two differences between you can't be steel and you don't like being steal. >> You have a >> bro. Liar. >> A liar. You hear that? >> Anthony, you get no >> stitches. That is not true. I will stand up. I I can >> wait. Say that again. Say it again. >> Wait. Say it again. Say it again. Say it again. Zoom in. Zoom in. Zoom in on them. Zoom in. >> Y'all heard that. >> You know what I mean? Oh my god. >> You should You should show them. You should tell them what you told me the other day. >> Yeah. Shake up >> with the girl you're currently speaking to. >> What? >> Y'all got free forms now. >> She's a virgin. >> Yeah. >> Yeah, she's a virgin. >> Okay. Show her. Show her the account. >> Okay. Do you >> Wait, don't leak it. Don't leak it. But >> she said that she said she's a virgin. >> No, she is. >> How are you bringing virgins to meet my dad? >> No. No. No. No. No. No. This is not >> who he's talking to. No, no, no, not like that. >> The [ __ ] >> No, no, that's not. >> Look, he's talking to this girl. >> And she said she's a virgin. >> You are the dumbest [ __ ] >> That's what I said. >> In the world. >> If you think she's a virgin, >> I met her. That's what I said. >> I met her at churchandom. >> That don't mean [ __ ] >> Bro, >> the [ __ ] are you? Oh my god, >> bro. There are girls that are out there that are emergent. >> There definitely is. Agree. >> Or did like what? What do you think? >> I seen one picture on her Instagram post and I knew immediately. >> That's exactly what I said. >> She don't have a VCard, >> bro. Wait, you saw the follower account, right? >> Sorry, Anthony. >> Anthony, you know what? >> You're a warrior, bro. >> I have you in my prayers. >> All right. Bro, I be feeling so bad when I see men who are just gullible >> and naive dumb. >> I feel bad for him. Like I like I generally do cuz I've been done by I've been done bad by so many girls. So when I see another man who's like >> who thinks they're so sweet, >> who just thinks girls are just so sweet. >> Girls are not [ __ ] sweet. >> They will make Oh my god. >> Oh yeah. Yeah. You gota be careful as >> this dude just said but she goes to church. >> What does that >> I'm not going to speak too much bro? >> I'm not donated $6.99. >> Listen for all the men out there. I love y'all man. Bro, >> I've been done by girls so I can spread the word. I can spread the word. I've been done bad by a lot of females. Bro, >> listen to me when I say this. >> Girls will do you bad in a heartbeat. They will leave you for the better man. They will leave you for a better life. That's just how that's that's just how some females are. I'm not gonna say all because I know there's ladies in the chat like, \"Not me.\" >> But >> and then you check their phone and they have eight [ __ ] guys texting them. >> But bro, >> my nick, bro. I know. >> I know. >> Oh, I know. >> I won't steer y'all wrong, bro. >> Oh, I know. Never get too deep. >> About four weeks ago, I got >> the thing about me, Chap. >> Look. Listen. Move the shirt real quick. >> The thing about me, >> I'm not here to like de I'm not here to like demotivate y'all. Like like if y'all talking to a girl or something or um >> Dang, you making me think about this more now. You feel me? Like I've been [ __ ] bro. I screamed to you about it. Oh my god. He's been making me think. Hear me out. Hear me out. I'm not here to be like demotivate y'all. If you talking to a girl, talk to the girl. You can talk to the girl, but at the end of the day, these girls would do you bad >> in a heartbeat. >> In a heartbeat. I seen it happen in front of my [ __ ] eye. >> I seen this happen in front of my [ __ ] eyes. >> That [ __ ] happened to all of us, bro. >> I've seen it happen to you. >> It happened to you. >> It's going to happen to you. It's going to happen to you. It's pretty damn sure going to happen to you. No, >> I know, [ __ ] >> It's going to happen to you, >> Luca. You do it to other girls. >> It's going to happen to everybody. All of y'all. >> It already happened to me. >> Has it ever happened to you, Henry? >> Well, >> have you ever been done bad by a female? >> Yeah. >> It's typical. >> [ __ ] >> It happens, bro. >> No. [ __ ] man. >> It's [ __ ] up, though. >> It's life. What happens, man? >> The chat is saying you're hurt. >> I'm hurt. >> Oh, I'm hurt. I'm [ __ ] hurt. >> I think you have to go for a run. >> I got to go for a run. >> Henry's going to be mine. >> You want to be mine? >> All right, bet. Type in the YouTube chat right now. >> Type in mine. >> Type in a YouTube chat right now. I'll give you mine on. You keep coming back. Damn, man. >> I'm about to give him mine on my YouTube channel. Just say type the word like junior. >> Okay, >> bro. Go on my YouTube. >> I'm following you on multiple, but I know. >> [ __ ] you're not even subbed. >> I'm subbed on five different I I promise I can show you five channels where I'm subbed to them, but two of them not. I'm not on. I could have subbed for all of them. I got like >> You're not even sub. >> Well, I'll show you. What? You want You don't believe me? Watch this. Say I'm not subbed. For four of them I am, or for three of them I am. And for >> What account do you want to get mod on >> on this one? This is my main one. >> Okay. Type in the chat and say, >> \"Of course I'm sub.\" >> Here. I got you, man. >> Say Braxton. >> Yo yo yo, go back. >> Braxton. Braxton. >> You ain't with him. >> That's for real. >> I'm waiting for the chat. >> Nah, bro. Go back. >> Let me type in another Braxton. >> Where the [ __ ] is it at? I can't even see it. >> It's too many chats, bro. >> Junior. Junior. Junior. Braxton. >> You typed it. >> What's your name? >> K I S Y. >> Ko I S. Damn. not typing too much. >> Let me do a multiple. Keep it moving. >> Braxton. >> What's your name? Money man Tunn. >> It's a kids email. Kids email or some [ __ ] >> Damn. I can't even get your [ __ ] >> They typing too much. >> I'mma do it. >> Damn. It might be GG's, bro. My chat going too fast. >> GG's. I accept it as my fate. I'm not I'm not You know what I'm saying? But like I really do could use the opportunity, gang. Like >> say say pizza. Say pizza. >> Say pizza. >> I'll do it multiple times. >> Saying the same thing over and over. Being a Nigerian too, bro. My my dad has hotels, [ __ ] In Nigeria, if you're out there, >> trust me how they're guarding you, they guard my dad. >> We got our own connect, bro. My dad knows. >> Appreciate that, bro. We got all brother. >> I got you, man. >> Hey, >> I just gave somebody a mod I never happened. That was my first time giving somebody modal. >> All right, man. What was I talking about? >> Girls, >> girls entertainment. >> Girls, girls, girls, girls, girls all over the world. If she make your heart break, then you won't see her. >> There's not even coke in there. You drinking that [ __ ] >> I know, bro. When was the last time you got hurt? >> Actually, no one even answer, >> bro. Look, [Music] >> you rather you rather be going through her phone and a notification comes >> like pops up or you find the like you find the conversation. >> What? What? >> You seen that? Man, girls be tripping, too, bro. >> Girls be tripping. >> What is Slips even about anymore, bro? >> Slips. >> Slips, come here. Slips, come here. >> [ __ ] love that hoodie. Like, you're not even my cameraman anymore, bro. You're just >> What do you What? >> You're just slips now. >> I'm the head of your production. >> You're the head. >> No. Facts. He is. >> He is. So has been. >> I know, but you're not. Yeah, but you're not like you're like you're not even my cameraman anymore. >> Well, I like I was your cameraman today. >> I'm your cameraman on the >> for 10 minutes. I swear it's like that my experience would show here. >> It's all good, bro. I got Luca now. Luca. Hello, Luca. >> That's why I brought Luca here. >> By the way, hold on before I >> I did 21 days half and half with Anthony. So, >> yeah, I know. But you just stopped. >> Cuz I brought Luca here cuz I had a million other things. >> What do you do now, Switz? What do you do? >> Um, pretty much everything. >> Okay. Set up your answer. >> Set up your drone shots. >> Okay. >> Switch with the cameras on the bus. >> No, he doesn't do that. >> He does. >> He didn't. No, he he he he doesn't switch the camera. You didn't even let me answer. You're just >> answer. >> Everything that is going on in this operation goes through me. >> Content production. Every single you can ask Anthony. You can ask everyone. Everything goes through me. >> All every decision is ultimate. I I am your voice. >> You're my voice. >> The sperm race. >> It's more fight. You want to fight? You want to fight? You want to fight? You want to fight? You want to fight? You want to fight? We can fight right now, bro. >> [ __ ] fight. >> Tell your [ __ ] honest [ __ ] fight. >> [ __ ] fight. >> Be honest. >> It was Speed's idea. God damn it. >> The sperm race. >> These guys stream sniped us. >> I will [ __ ] >> Yo. These guys stream sniped us in San Francisco. >> Wait. >> Come on, bro. >> Wait. Let me Wait. And Sydney pulls me to the side. >> Wait. Wait. Wait. Wait. >> And she go. >> Shut up. Shut up. >> Shut up. >> Shut up. Shut up. >> These guys shut up and they want to do >> shut up. >> And I was like I was like why would >> let me talk. >> And then they brought it to speed and he was like [ __ ] yeah. >> I thought it was a doctor >> science experiment. >> Okay. >> What? >> I thought it was a doctor science experiment. Wai. >> You heard it and you said [ __ ] yeah. I want to do No, I didn't. >> No, I didn't. >> I was on the phone. >> Wait, >> I was on the phone. >> Shut up. I was like, >> why doing No, no, no. Come here. >> Or my dead aunt. I thought it was a >> science experiment. A doctor. >> I thought it was going to be with doctor. >> Oh, my dead aunt. The doctor was a 17year-old kid. >> Oh, my dead aunt. >> It was a That was a I saw go >> all my life I didn't know it was like that. >> Oh, that [ __ ] was funny. >> I No, no, no. >> It was so funny. >> Oh, no. No, no, no, no, no. >> No [ __ ] You won't care. >> No, no, no, no. >> I said we don't care. >> I wanted to see who was going to win. >> I said we ain't going to lie. We was there. >> Yo, now they hold on. Now everyone thinks that I set up a sperm race. I said explicitly no to a sperm. >> I said no, too. >> No, you did. >> Bro, [ __ ] about to piss me off, bro. >> Who the [ __ ] came up with that? >> Who? They >> It was all [ __ ] ass. >> They stream sniped us and I was like, I don't think we should do this. >> Yo, come here. Come here. Come here. Come here. Come here. >> The [ __ ] getting tight, bro. Oh my dead, bro. It's too late for this, bro. >> It's 1:00 a.m. >> It's 1:00 a.m. right now. >> Cutting your hair. >> It is 1:00 a.m. right now. >> You ever got in the cut at this time? >> Hell yeah. Bro, >> bro, it's not even It's just like >> bro. Bro, fire speed, bro. I'm [ __ ] Quinn. I'm about fire speed. >> Where did they come from? >> Why the [ __ ] you just come to me like that? >> Running around and [ __ ] >> What? >> Yeah, like some gang magnets. >> We should go. >> Yeah, we need to get on the bus, >> bro. It's 4 a.m. >> Don't say it on stream because they like that. >> Yeah, but we need to get on the >> What? What's going on? >> I just said >> What's going on? >> What's going on, Henry? IB LLC has been passed down to Jamal. Jamal, take over my destiny. >> Yo, what? >> Entertain. What? >> What? Why you so close, bro? Move. Why you so close up, gang? >> Oh, bro. Bro, I'll punch you in your stomach, gang. I'll retire you right now, bro. Gang gang, put your hands down. Put your hands down. >> Get on somewhere. >> Why you chucking [ __ ] >> Yo, why you chucking stuff at the bus? >> Who you talking about? >> That's what I just said. Now, we're going to get in the box now. >> Now they doing too much, bro. I'm about to go, y'all. Y'all tweet me. N y'all piss me off. >> Damn, this a long ass haircut. [Music] >> What? >> I mean, I don't give a [ __ ] I'm saying >> I I just don't think we should be out. I don't I don't feel you should be out here at nearly at 1:00 a.m. getting your haircut. >> Yeah. >> What? >> Uh you people in the car park dropping [ __ ] >> But they're just kids, bro. I talk to them. Hey, kids. Kids. Listen, kids. Listen. You guys have to chill. All right. >> If y'all going to be doing too much, I'm going to have to go back on the bus. >> So, don't be throwing oranges or [ __ ] on the bus. All right. >> Don't be throwing [ __ ] All right. It wasn't us. >> Don't be throwing none. All right. Just chill out. >> I'm just You was throwing [ __ ] >> Don't be throwing [ __ ] >> Don't be throwing rocks and [ __ ] Don't do that. >> Don't do that. to go on the bus. >> Come on, y'all. Chill off. >> I'm just trying to get a haircut. >> Get out of here. >> Who is that? >> You need to get on the bus. >> Can't be out here at 1:00 a.m. getting your haircut. >> No. >> No. You getting You need to get on the bus. >> Yo, get out of here, bro. >> Get out of here. >> He's almost done. We got two. >> He only got two more minutes. >> Damn. >> Yeah, you're perfect. >> This is the ultimate test. >> Are you going to push me back? >> No. Bro, >> let's see. Bro, >> you got to get a close zoom up. >> The lineup's already looking better on this one. >> Get a close zoom up. >> Oh [ __ ] >> Oh [ __ ] She went to the line. >> Chat, is he doing good? Is he doing good, chat? [Music] Why is Slips filming me? >> No, it's a modern. >> You're not. Was that Luga? Oh, that's Luka. >> Look. >> Damn, my [ __ ] look fresh. >> I might have to call you daddy. >> You had though. >> No, it's not. >> No, I look just like the same lineup you had. [Music] >> All right. He's nice. He's nice. He's nice. You want some chill back? [Applause] Stop calling me KSI. I hate my chat sometimes. >> Don't listen to them, man. >> They always say that cuz they be hating, bro. >> See, >> you know, >> Den be hating. right now. >> He tried to say to me today, \"No, we won't go I won't go to bed at 3:00 a.m. >> No, >> you're funny. You're funny. >> This is all nighter.\" >> He tried to tell me in the car today. 3:00 a.m. Oh, yeah. Right. Hope you guess what time it is now. >> That's too early. Guess what time it is? What time? >> It's the last day, though, bro. >> It's It's 1:22. >> It's the last day. >> I just said, >> \"What time you going to get up? I just did. >> What time you going to get up? >> It's an all nighter. >> Oh, you want to stay up all night? >> All nighter. >> What about all nighter on the last day? >> That would be dope. All right. You going to stay up all night all nighter on the last day? >> You won't stay up all night. >> That's smart. >> That's what we're doing. >> I'll stay up all night. >> All nighter for the last day. >> Already there. >> Holy moly. >> I would stay up all night, bro. >> Pull all nighter for the last day. Yeah. [Music] >> I'm ready. I'm ready. >> Them two are fresh. >> Fresh. You know what? Y'all fresh. >> No, I've been on tour with y'all the whole time. >> Oh, we've been watching y'all. >> I've been on tour live. >> I've been on TV with y'all the whole time. I've been I've been in the chat. I've been watching everything. I've been fall asleep with y'all. >> You were in >> I was everywhere. >> Yeah, we watched everything. >> I was slicing. Yeah, I was fighting with I jumping on my bed like >> Yeah, >> I was everywhere, y'all. >> He was making his dinner on his bed like, \"Yeah, I'm there with y'all. I'm there with you.\" >> Oh, when he did that uh when he kicked you on that >> he kicked me in my freaking face, dude. >> And kept going. But I was lit with him, too. Like, oh, >> he kicked me in my face. He didn't even care. E Taylor's getting a haircut. What the [ __ ] >> Peter got a haircut. >> That boy Taylor getting a haircut. >> No, that's comedy. When Rud comes back, >> you'll go >> to get the last haircut. >> I'm >> We can do all We can make it up. >> Cindy, you like the cut? >> She said yes to everything. >> But it's true. You >> like the cut? >> Yeah. Chapel like Sydney is just one of them girls just be like, \"Yeah, oh yeah, >> yeah. >> Oh, we got the no out.\" >> What? >> Yes. >> What? >> I don't care what you said about Sandy. She went through the hard part of the You went through the hard part. >> Yeah. I feel like >> Yes. when they was in the room with y'all and y'all was like >> so scared. >> J was like, >> \"Oh, really?\" >> I was scared. >> We was like, \"Fuck all that.\" >> Was like, >> I was not, bro. At the end when they like jumped out of nowhere, I went and hid in the closet and there was a guy waiting for me with a taser there. I was >> Yeah, they said they >> yo, you tried sending the two white people in there. Yeah, cuz y'all know y'all can take that more than me. You see, hey, you see how long we was in the lobby? >> We hadn't even left the lobby. >> Yeah, I was like this. >> I was like, man, I think lining you up. [Music] >> The all nighter, too. >> On your eyebrows? One or two? >> Two. Two. >> All nighter. >> Yeah. Talk to speed. >> You're pulling an all nighter? >> All nighter. >> What? >> And you're It's All >> I think I'm pulling all nighter bus. >> That's just something to remember. >> Last day 247. >> Hold on. Time out. >> Line up there. >> Yeah. Uh yeah. >> Yo, you got the hotel key. >> I'm going to start my hair. We're going to stay now. >> You know I can't move while I'm getting my haircut. >> No. >> And you going to ask me do I got a hotel key? Do you >> like it's like you you see I can't move. >> You're supposed to have a hotel. >> Hold up. >> Like he want me to do a back flip while I'm getting a haircut. >> All right. Like come on, bro. >> It was just a question. Do you have the hotel key? >> Now you know I can't move >> while I'm getting my haircut. >> All I just said was do you have the hotel key? That's it. I don't think that was that hard. >> Jamal's hotel key. >> No, >> Anthony. a one-on-one between them. >> He's not co he's not correct. >> I see now. [Music] [Music] Who? >> 24/7. >> Who? >> Last day. >> Get it, bro. >> Bro, something to remember. >> Let's do it. >> All right. Is that it? >> Okay. >> You know what I'm saying? Chat, do I look good? >> All right. So, do you have to hold the key in your pocket? >> Do I look good? Wait, cameraman, make me look good real quick. >> Damn. >> Do I look good? >> I look good for real. >> Yeah, >> do I look good? >> Close your eyes real quick. Close your eyes. >> Could be a little better. >> Thank you. >> Dude, god damn. >> They're saying W's. >> That's the one. >> Eight out of 10. Yeah. >> So, I'm getting some W's right there. >> You getting W's. >> Great job. >> Yeah. >> So, my brother, >> now I can move around my body. [Music] >> What? >> Do you have the hotel key, >> bro? You see I just got done getting my haircut and he going to ask me, >> do you key? >> Do you do that? >> He see I just got done getting my haircut done. Like knowing I can't move after I get my haircut done. Question. You just ask the question. >> What do you want, brother? >> Oh, that's all you wanted to know? >> Yeah. That's all you wanted to know. >> Yeah, bro. >> I don't got the hotel key. >> You don't? Why are you about the goon? >> No, I left the other hotel key. >> You lost that one. You lost the one other >> hot. So, so, so you don't >> you check both your pockets? What? >> You check both your pockets cuz dad need to take a shower, too. >> Oh, dad need to take a shower. >> God, >> I've been running and [ __ ] That [ __ ] probably fell. I don't know how you do it. >> Yeah, I got you. Go straight out. >> Thank you, sir. >> What? >> What about that one? >> I don't got no hotel key, [ __ ] I just told you 20 damn times. >> Do you want to get your ass pumped? >> Bro, mess with me, bro. Y you're killing it, Taylor. You look good. >> Doing an all nighter. A >> man. I might do an all nighter. It's the last day. It's >> true. >> It's the last day. >> Let's go all out. >> It's true. But don't you want to have a lot of energy for tomorrow? >> What? >> You want to have a bunch of energy? >> Listen, I would take five hour energies, espresso coffees, prime energy drinks, >> a prime will do it, >> honey packs, whatever it takes for me to do 24 hours. I'm doing it. If my chat won it, then I won it. >> What's the longest you stream? >> Huh? >> What's the longest you've streamed straight? Like, besides this tour, >> I'd be Last of Us one and two with no sleep. >> I forgot. >> I beat Last of Us one and two with no sleep. >> How long did that take? >> That took like I don't even know. >> I forgot how long that [ __ ] was. Let me look it up. >> Last of Us one. >> I was up for like 24 hours. So the first game was like >> I I forgot. Chad, how long? >> Ty, I was over like Yeah. 24 hours. >> I be last was 1 and two. >> Maybe you should sleep for like a couple hours. >> That's boring. >> Taylor, come on, bro. It ends at 12:00. >> I'm trying to help him out. Help him out. >> I mean, but that that was different, though. Like I was game and sitting in a chair. >> Yeah. >> The whole family's here. We're all here. Like, bro, let's just lock in and do it. >> His dad thinks he should do it, too. Yeah, my dad. >> I don't know how the [ __ ] I did that. >> I literally be Last of Us one and two, no sleep, >> playing it all day. >> All damn day. >> I knew it. I knew I seen it. I seen it. >> You did not even see it. >> See, you be right there. >> Somebody came up to you. >> I knew he was going to do it. I swear to God. Like I do that. >> And it's See, you thought I was about to do it, but I'm not. See? See? See you sneak up on somebody. >> That's why I always got out your hands. >> Yeah, for real. Walk around like this, though. >> Or you can do this right here. >> All right. It's this. You got to do this. >> You do this right here. >> If you like chill like this, you always on guard. That's why I cross my arm. >> You always on guard. If you doing this up like that or this little right here or this >> easily >> easily block you feel >> this. >> So chat if somebody ever come up to you and you don't know if they about to hit you just just put your hands up like this. >> Just do this >> so you can play it off. Soon as you see any type of motion, you >> like play it off. Do like a little >> You know what I'm saying? If they don't do it, I got to tell them, >> brother. [ __ ] you. >> He [ __ ] you up. >> Yes, bro. >> He wasn't. >> He did [ __ ] that up, bro. >> No, he didn't. >> No, he did, bro. No, he did. >> Bro, he did not [ __ ] you up. No, I look fresh. >> N he cooked my [ __ ] I look good. >> Hold on. Hold on. Hold on. >> He didn't even let it finish, bro. >> I look good. Okay. Okay. >> No, he didn't. >> No, he did. >> Y'all scared me. I was like, what? >> Bro, I look good. >> Oh, 20. >> Five are coming right now. >> Five are coming. Yeah, >> 10 10 >> in 10 minutes. >> And then there going to be more coming too. >> You said >> females were coming. >> I thought I thought you said it was >> for you, Michael. >> Oh, for I was about to say ain't no way >> you play. >> Five girls for you. >> You don't want five girls. No, I do. >> You do? >> Hold on. >> Yeah, I'll bring the chair. >> Oh, man. >> Men is so easy, chat. Men are so easy. >> You be doing the um reverse deal. [Music] >> That's what 20 >> 10 years ago. Not for >> nobody dabs or nigh ne anymore or wins. >> I don't like the best game >> with the folks. >> Yeah. >> You was good at that. >> I ain't going to lie. You would have been [ __ ] up, brother. I ain't going to lie. >> Let me see your kick. >> What you want to see? >> Yeah. Let me see your kick. Do the spin. >> Let me just see a kick. Want to see a wheel kick? Spin kick, brother. Do it again. >> Do it from the other foot. >> Yeah, do it from the other foot. >> Nah, that was not smooth. >> That was not smooth. >> But it's still it's still it still work. >> How you do that? You like >> turn around. How you do that? >> Do it slow. >> Do it on your right leg. It'll be better. So, what you got to do? >> Boom. >> Like that. >> What? >> I said do that one. They jump in the air. >> Oh, that. Oh, yeah. I can do that. That's called a where you like left foot first, right foot first. >> Bring it over again. >> Yeah, >> the windmill kick. >> Yeah, I Yeah, I know how to do the windmill. >> Kill somebody. You got to get more air. Hold up. You can't kill somebody with that. Watch out. >> Oh [ __ ] on that [ __ ] >> He been training his ugly ass. He been training this [ __ ] >> I ain't going to see him in a minute. >> I ain't did one of them in like >> seven months. >> I'm about to start fighting training. >> I'm about to start fighting training. >> Take a fight. >> That's it. >> What? >> I thought it me. >> Yeah. >> I never full train. >> I never combat training. Yeah, >> I don't combat train, >> but I'm about to start. >> You did it at your house. >> He's so fast. Yeah, he is. >> I beat him all the time in fighting though. >> Might have trained your juu. [ __ ] that. >> So, basically like you can kill somebody, right? >> And like too long >> if you a good fighter like you know how to Like a person that a person they never train a person that has never trained jiu-jitsu versus a person that has trained jiu-jitsu for like seven months to a year. >> That's crazy. >> They can break this person's leg. They could >> Bro, this one girl, she like had she had my >> Yeah, she had my heel. She could have like >> she could have popped my knee out of socket. >> If you would have turned the wrong way, it would have just came up a second. That's why those dangers we don't even do those in training unless we like like we don't do that in like because if you go the wrong way can break l you do that in a real fight. You can break somebody in a real fight. >> No mercy, >> bro. See, that's why I don't like MMA. >> It's too much. No mercy. >> Tap. >> True. >> Not you ain't always got to be the >> You're right. You can't tap out. You're right. You're right. >> Like they just forcing you. As soon as you feel that pressure, you can tap. Sure. >> But they just want to they it's the fighter in them. They don't you don't want to get sometime they feel like it's better. Sometime they feel like it's better to broken arm for them. >> Really? >> Oh man. I rather live to see it. >> It's like taking a hard ass body shot instead of going down. You got to stand there. You might take another one. You might take one more. You might say combo reverts. Reverts. Where's my dad at? >> Where the [ __ ] is he? Right. >> And then they're going to like >> break the car, >> right? >> Oh. >> Oh. >> Should I? >> Oh, we're Okay, we're doing We're going to >> Well, Should I type it out? >> Type it out. >> Okay. I might pull a allnighter. >> You want to do that? >> I'm I'm down. It's the last day. >> Are you sure though? >> Is it going to hit you? >> It'll be fun. >> Let me Let me >> It'll be fun. >> We're in 2025. You do not You need to >> got a feather on you. >> I'm down with that. Let's go. Let's go. >> Let me Let me just be the realistic mind. Okay. >> Are you guys gonna be able to make it till tomorrow night? >> Yes. >> Is it gonna hit you at all and be like >> It'll be It'll be brutal. It'll make it'll make it. But we'll do it together. >> Um, so maybe I can just show you. So, we're here. >> We're here. >> This one. If we wanted to do, >> we would then go to this, >> which I'm looking I'm looking I'm looking >> like >> I'm just tired right now, bro. >> I know. I get it. >> You're going to pull an all nighter. >> [ __ ] that. Um. >> Oh, Anthony, where are the girls coming? >> They're coming. They're >> You keep saying they coming. >> I'm telling you, they're pulling up right now. >> Where the girls? Where the girls? >> We've been waiting all on the way. Almost there. >> So, we could go here to start, which would be >> Then we go to >> to like this whole area. >> Cool. Then we go to >> which is like >> what's that? >> It's um it's >> it's a popular thing >> like >> what about the uh >> the uh Steven Universe [ __ ] >> Take a show Steven Universe. >> Yo, this [ __ ] stupid. >> Steven Universe. Dude, universe. >> We're not done. >> Oh, yeah. So, >> yo, you was slow, bro. >> Bro, so here's my question. >> It's different. >> If if things start to like >> if if things go uh uh then we do it. But I think if I think >> Yeah. Yeah. Yeah. So, but also if we wanted to do this light >> racer rac. >> If we wanted to do this light, we could just go to um like this this God damn it, it is so hard to communicate. Um, >> duh. >> That's cool. >> Yeah. So, Henry would be mad, but we could like start our day there. You know, >> and and the thing is it's also it's right there. >> It's literally right there. >> Yeah, we do that then. >> I don't want to start off there. Hell no. You don't want to. Okay, cool. >> No, >> even in the main area. >> Listen, if it's close, we can go. >> If it's close, let's go. Okay. >> Bless you, Luka. >> Thank you. >> Thank you. >> So, only other things for tomorrow >> are >> Where's dad at? Jamal >> in a bus. Um, >> what time is this? You're streaming the You're streaming the first part of the peak. >> Wait, who put that? Who put that there? >> Uh, isn't that Isn't that it? What's What's true? >> Oh, I got a boo again. >> It is. I don't think that's true. >> Damn. >> Here, let me see. >> This don't fall. >> Yeah. >> Yeah. Right. That's >> Am I streaming it? >> You're streaming. You're streaming the first part of it. >> I'm in it. you. So you >> when I end, I end. >> When you end, you end. >> I know. It's so [ __ ] up. >> I don't want to [ __ ] end my stream. >> You never have to end again. You never have to end again. >> Don't boo boo on me, bro. >> Oh no. >> Okay, so then >> I don't never want to end. >> I see. >> Damn. Really ended. I don't want to end. Like once I end like that ending, >> then it's then it's then it's >> that's GG's for the tour. >> Maybe we just then start again immediately. Um [Music] >> Damn, >> you talk to me. >> Yeah, like the talking [ __ ] here. >> Yeah. Yeah. Yeah. And then >> um >> or does he have it already? No, he would have it. >> I don't want it in my stream, bro. >> I'm Bro, I'm in my stream less than 24 hours from now. >> I know. >> Wait, so crazy. >> Am I crazy? >> It's [ __ ] up. >> Like 800 hours. >> That's crazy. >> I might actually cry. You end your live stream tomorrow. >> That's totally okay. >> I miss my child. >> Like, totally valid. >> Um, >> no. I spent so much time with them though. >> Yeah. >> Yeah. >> Like I feel like we bonded so good this tour. >> That's what's up, bro. But everything must come to an end >> and then more after. >> They're with you forever. >> Somebody give him a hug. >> I know, man. >> He's a I mean, he's the goat. >> So, also >> Yeah. Crazy. >> This I don't know. This tour is kind of sentimental for me, bro. >> Yeah. >> In my other tours. Like when my other tours end in, I'll be like, \"Damn.\" But this one is like >> more rough. >> Like it's more rough for me. >> I feel it. >> It's way more rough for me. >> Yeah. >> And that's for obvious reasons. You know, I've been a lot of I've been live for 35 days with y'all, bro. >> I don't I don't want to be that >> and I really enjoyed it. >> I don't want to be that guy. But like >> what? >> I won't say I won't miss the tour. I'm just saying I'm just going to miss >> Godamn it Jamal. Are you kidding me, bro? >> As I'm being sentimental, he >> Yeah. What is wrong with you? My >> fault. You know I'm not going to say some dumb [ __ ] Yeah. Wait, Jamal. Here. Put this in right here. You're right. >> I'mma miss y'all, bro. I'mma be back like in two weeks after I end this [ __ ] bro. I'm like I'mma be back. >> Yeah. Um, >> that one more. >> I I feel like honestly that one >> Oh, this day is going to go by so fast. >> This day is going to go by so fast. So, we're going to just We're just gonna be on the move, >> bro. This like this [ __ ] really about to end. >> Yeah. starting to hit me now cuz like I know how fast these days be going >> so fast. >> These hours be flying by. >> Yeah. >> You have done so [ __ ] much on this tour. Like >> Yeah. >> Like no one's >> no one is no one has ever done >> no one's done this >> anything like this before. >> The crazy thing is he can keep going. >> I know. >> Like he really can still keep going. >> This dude is literally hardest working man. >> Yeah. >> In show business ever. >> Yeah. >> Like crazy. >> Yeah. >> Like I really do think you could do the year for >> [ __ ] [ __ ] my life is this. >> I built this. >> I built this [ __ ] >> Yeah. You're right. You right. >> I can do a year easily. >> Probably two. >> Two years >> maybe. >> You know what? My whole life. >> 24/7. >> My whole life. >> Till you die. >> My till I die. >> 247 >> in a casket. >> So you should >> until I'm gone >> and leave this earth. Marriage. >> But you can never have >> I don't care. So you do that for the chat. >> I don't care about sex, Anthony. >> You think I care about sex? >> I am a alpha male. >> True. >> Yeah. >> Damn. >> I am a alpha male, not a beta. You think I live on a dopamine of >> That's >> Yeah, >> that's wise. >> No. Yes. Yes. >> No. >> Yes. No. Yes. >> Yes. Yes. >> Yes. No. Yes. >> Yes. And >> no. >> Damn. >> Life is so much more than life is so much more than that. >> Stop being focused on that. You going to >> I'm not focused on it. >> You go too much. I'm saving myself for marriage. >> Really? >> Yes. >> That's why you talk to a girl who's a V. >> Yes. Yes. >> So, you're you're a V. >> No. No. No. No. But I am like >> What the? >> But I am like >> What the hell? >> Wait. Wait. >> Wait. But like what I believe in my and like in my beliefs is like I want to save myself now for that. >> Okay. Oh, so now >> Okay. >> But it's been like it's been it's been very >> but it was really good before. >> Really good. >> I was like hold on. Wait. What? I was like wait I was like oh. So oh so you Oh no. >> Yo I can't >> I'm just being real. Just being real. >> That's a Yeah. >> G [ __ ] [ __ ] bro. >> Yeah. >> What >> do you still want to talk about? >> I feel like I feel like we can I'll just write it out. >> Scream. >> Boom. >> What? >> Um for Oh, that >> right. >> Yeah. Oh, I think the girls are here. I got to go get them. >> Let's go get it. >> Maybe, maybe not. >> Something quick. Just a >> Yeah, >> type. >> Well, what I'm thinking about >> wants you to look at his hair. >> Let me see. Wait. You go. You go. You go. Go. Go. Go. Wait. Wait. Wait. Wait. >> Should I stay like this? >> You know what? I say low key. I say yes. >> Valid. >> It's valid. >> I'm not even going to lie to you. >> Slick back. >> I'm not even going to lie to you. It's valid. >> I lowkey [ __ ] with it. >> Like Bruce Wayne type. I'm getting tired of that [ __ ] dirty hairstyle you get all the time. >> I'm not mad at that. I'm not mad at that. I think you look better. >> I'm not going with the slick back, bro. >> I think you look better both ways. >> Dead ass. >> All right. Well, well, let him finish cutting it and then I can slick it back any day. >> I can scared him. I'm scared. Do we have >> Parker? Parker. >> Oh, Parker. >> My boyfriend. >> Oh, >> great to meet you. >> Oh, nice to meet you. >> Nice to meet you. >> Nice to meet you, bro. >> Pleasure to meet you. >> Pleasure to meet you. >> Here we are. >> Oh, nice to meet you, man. >> Oh, nice to meet you. >> Yo, Ames. Ames. >> A. All right, I'll be right back, guys. Yo, >> whatever you want. >> Are we done talking? >> No, we can talk. >> Okay, >> let's keep talking. >> Sounds like you want to talk about >> Yeah. I always I love talking to you. >> Yeah, I don't like talking to you. >> I know. It's hard talking to me. I know. It's It must be unbelievably annoying, but >> it's like when your school counselor, >> you know what I mean? It's like I have to just like put sometimes I have to like ask you questions and I can't explain my take on the question and so I'll be like and you'll be like that's the stupidest [ __ ] I ever heard and I'm like I I know I just whatever. Anyway, so this we could do this. >> Yep. >> Just stay in here. Police outside. >> Police outside. I don't know why >> they're just outside. >> Yeah, >> they're they always outside. >> Yeah. >> Um, whatever's bro. >> Okay, cool. That ass. >> That ass. Um, and then >> you know about you feel good about >> Yeah. >> Yeah. You feel good about that? >> Yeah. Yeah. Yeah. That's like the last last moment. >> That's like the last last one. >> Um, >> the [ __ ] are you doing? >> Um, okay. So for >> I wonder do we really want to do >> Yes. >> Do you think it'd be fun? >> It's got to be quick though. Like it just got to be like >> I know. >> Not like none of that like me, >> right? But I'm I'm just worried with like >> the amount of >> You know what? Just pre-made. Free >> All right, bro. I got to go. >> What is this? >> Memory bar. >> I'm not signing that. >> Damn. Really? >> [ __ ] you, Jamal. >> That's crazy. No, I'm trolling. >> All right, sign it. Come on. Luka, I need you to sign it. >> Shouldn't this be for me? >> You want it for you? >> Yeah. >> All right. No, no, don't sign it. >> Yeah, you're right. >> Don't sign, Luka. Come on. >> You can keep it. >> No. No. >> It's a memory ball. Look. Hold up. Here. Take this. I'm holding the camera. No. Let me hold the camera. >> I'm about to go talk to my dad. >> I'm signing the memory ball. >> Sign it. >> Why is your signature like Greek? >> It looks [ __ ] Greek. It's my initials. Yeah, I think they here. >> Who was that? Oh, that's a girl. >> Girls, girls. Girls, girls. >> I love the energy. I love the energy. J, >> what's up? What's up? How you doing? What's your name? >> Dria. >> Dia. >> Yes. >> Nice to meet you. >> Kiki Kiki. >> All right. Bet. >> Okay. So, look. We about to go to my dad bus. Okay. Okay. >> All right. Hey, where's Anthony at? Why is there only two? >> Anthony. >> Anthony. >> Going in here? >> No. Over here. Down here. >> How's there only two though? >> Now, come down here, ladies. Come down here. Come down here. >> You want a 20 v one? We got 2v1. >> It's only a 2v one. Let's see what my dad's going to do. Let's see what my dad can do, chat. >> Yo, Dad, you ready? >> Yeah. >> My dad. >> Oh [ __ ] You told me I reminded you of your pups, huh? >> Mommy. >> Hi. >> Hey. How you doing? You all right? >> Good. her name Kiki. >> Dria. >> Dria. >> Dria. >> Your name Kiki? >> I'm Kiki. >> Oh, Kiki. Kiki. Dria. >> Wow. You got some friends. >> Yeah. So, look. I don't know. Where's my dad at? But just give me a second. Just give me a second. Um, >> Alex is here. >> Come here with me. Yo, I'm coming in. I'm coming in. >> My daddy. >> What? >> All right. Ry Mctoty booty. You going to leave? Be right back. >> Where you going? >> I'm going to do something. >> Where's my dad at? >> Dad. Come on, bro. What's up, man? >> I got the ladies here for you. >> Oh, yeah. >> So, I got to go in there and do my thing. >> Yeah. >> Oh, no. Hold on. No, no. I go back on the bus. Y'all go back on the bus. >> Fortunately, I said a 20 right now. >> There's like two. >> There's only two females right now. >> Oh, man. So, what I got to do? >> I don't know. So, you said you wanted to talk to 20 females. >> Oh, snap. >> So, I brought two females. >> I want to see >> I want to see eight. No, I want to see how my dad re. >> I'mma just sit there and call. >> Oh, Dad, you need me to sign this? Why you sign it? It's for you. >> You want me to sign it? >> Yeah. >> Yeah. This is the memory ball. >> Dad, >> how you know? Put your signature on there, >> Dad. I don't think you ready. >> Everybody doing their signature. >> You ain't ready, Dad. >> Your turn. >> I'm not put ready for what? >> You can't talk to me. I'm ready for anything. That's what I'm talking about. >> Yeah. >> All right. Come on. Let's do it, dude. >> Why am I signing it? >> Man, what am I sign? >> Hey, Peter. What am I What am I walking into, dog? >> You walking into a >> Y two or two man. >> Yeah, that that's better. That's better. >> Oh, yeah. So, Uncle Wayne Uncle Wayne. Yeah, you in the two. >> Okay. >> All right. >> So, two two man. >> I want to see how the OG's get down. >> They probably with some young >> man. No, I hope they not real young. Bro, >> are you still on the bus? >> If they not real If they real young, they won't understand. >> What up, Fox? >> Hey, how you doing, Rudy? >> Good to see you, man. >> Good to see you. >> Yeah, my brother. >> Sorry. >> This hurts. >> Oh, don't Oh, did you pinch me >> a little bit? Can you piss me a little bit? >> Oh, you like the What's that hat say? >> Hose mad. >> Hose mad. >> Yeah. >> What does that mean? >> The like clothing brand. >> Oh, that's a clothing. >> You know, you like Vanessa. >> Who is Vanessa? >> Um Ron Russell. >> Russell Simmons daughter. >> Oh, >> Vanessa. And And that's a good thing because >> she's real beautiful. She got a beautiful personality. You got a beautiful personality? >> Yes, of course. >> Yeah. What do you do? >> I'm an actress. >> Actress? Are you acting right now? >> No. >> Don't act right now. I'm an actor. >> Really? >> Yes. >> Oh my gosh. What's your favorite genre? >> Bofas. >> Bofas. >> Comedy operas. >> Oh, okay. >> Yeah, because I study opera. I did a lot of opera. >> Hi. >> Yes. This is you, me. This is my sis. >> Y'all sisters, >> basically. Me and him brothers, >> right? >> So talk to him. >> Oh my gosh. Talk to him. Mom, talk to her. >> So >> what do you do? >> Actress. >> Have you done? What have you done lately? >> I just graduated from >> my brother right there. >> Hi. >> Nice to meet you. >> I just graduated from acting school. >> What school? >> I went to Zach Bar Studios. >> Okay. >> First of all, how old are you? >> Well, I'm here. I'm here with my son, too. >> How old are you? I'm 19. >> I'm 22. >> 22. >> Okay. Period. >> I don't ask age. >> Okay. >> Because I already know. I just go by the feelings like that. >> Okay. >> You ever done that? >> We go by age. >> I definitely >> like y'all just sitting up like I think I should sit down. Sit down. >> You already know. >> We are on a bus. >> I know. >> Yeah. But probably just standing there like >> yo >> um younger than >> Where you from? >> Yeah. Like >> I live here for like 5 years. But I'm from >> Can y'all make some room for >> you know Aruba? >> Like it's like 20 minutes from >> Why you pushing me, bro? >> You know all my Brazilian friends. Then you can sit over there. Who >> was that? >> With you in Brazil in real >> gorgeous. Oh, Borges. Yeah, I know. That's my guy. >> He want me. >> Yeah, he got the iPhone song. That iPhone >> Sit down. Sit down. Sit down. >> Sit down. >> I might got to move your purse. >> But it's like >> I'm being a little gentleman. You feel what I'm saying? Yo, why don't you bring the box? You can sit on the box. >> A box. >> Oh, wait. I'm about to get the chair. Anthony, can you get the chair? [Music] >> You are right. You all right? >> Yeah. >> But you still like >> you stay here. >> That's dope though. >> That's dope as you. >> That is so crazy. >> My mother looked good. I believe that. >> Yeah, she does. She >> I'm doing all nighter >> and she's doing all nighter. >> Hell yeah. >> Let's go. >> She um >> you're back now. >> She goes like uh she does like retire as Diana Ross. >> And when I was a kid, I started out as backup dance for her. >> And then when I got I was like, \"My mom want to dance for me no more.\" She was like, \"Just be my security.\" I became her security when she do her gigs as Diana Ross. >> And guess what? Guess you probably won't even know this song. Guess her neighbor number one song to do. >> I want the world to know. [Music] >> Yeah. That was my mama. That's my mama's stuff. That was my mama's stuff. What you saying? Because when that song came, I was doing my my dances. >> Yeah. >> All that. >> But I was like, \"Mom, I won't do that no more.\" She was like, \"All right, just put some sunglasses on.\" And Okay. Back in back in that day, I had to wear a muscle shirt with a zipper with the sunglasses as her bodyguard. And as she played Diana Ross, >> like her Facebook page is Diana Fost. >> Diana. Really? >> Diana Fost. Yeah. Oh my gosh. And what's yours? >> My just my name Darren Watkins. >> Oh, >> but on IG is original Daddy Speed. >> You know, >> and that's my that's my son. >> Who's your son? >> It's my No. >> Yeah. >> Oh, I chose speed. >> I chose speed. >> I be captain. >> What do you mean I'm captain? It's my dad. >> That's my son. He came from my balls for real. >> For real? >> Yes. >> Like his mom outside so I'm going to be respectful. >> Really? >> Yeah. >> Because I spilling too many beans. >> He >> We was doing laundry. >> That's it. >> What? >> We was doing laundry and then Junior was >> So all y'all from All Y that's my brother. >> Okay. [ __ ] me. got the same like we got the same mama and daddy like his daddy his daddy is my daddy and my mama is his mama >> uncle now I guess. >> Yeah. Wait, I got that hat. Oh god. >> This one? >> Yeah. >> Yeah, we got Yeah, we got that's dope. >> We're all family. [ __ ] it. [ __ ] it. >> Exactly. >> You from LA? >> I'm from Ohio. >> Who? >> What part? >> What part? >> OMG. >> OG. What? Oh, she lying. >> No, no, no. It's called Iron, Ohio. What's that? Where's Yeah. Oh god. What the hell is that? Where that's at? >> I've said this so many times. It's like >> what's like >> basically like Kentucky and West Virginia like all the way down. >> Eastern part on the eastern part of Kentucky. >> You guys from Cincinnati area. >> How far away from Cincinnati? >> Cincinnati. Still like three hours north. >> Because it's like it's like eastern Kentucky. >> No, cuz I'm about West Virginia too in Kentucky. >> Way way way way way south. Like >> I'm like way south too. Cincinnati's way south. >> I don't know where that part is. It's like >> you can connect like Cincinnati at the top, but I'm talking about like the very last part of >> I'm at the border as well. >> What's Cincinnati? >> Yeah. No, it's still >> Cincinnati is 5 minutes away from >> you from Nasty Natty >> I still got you still got >> Oh, you're like right there. >> I still got like Iron, Ohio. Have you ever heard of um Marshall University in Western? >> Yeah. Where um where um Randy Moss went? >> Yeah. >> Yeah. That's like 20 minutes away from you. >> Yes. >> Yeah. Randy Moss went there. >> I'm like, \"OMG, I'm lo you, bro.\" >> Who in the chair now? >> You look way better. >> Yeah, I do. >> You look new to 5 minutes for them to make a Hitler edit of me. >> You look great. >> [ __ ] dicks, man. >> I opened my phone one time. >> She older. >> Yeah. >> Damn. What's her name? What's her name? I spell Iron. >> She's my She's my assistant and this is my >> other N O. >> Long story short, but we're all family and T. >> That's my son. >> That's your son. Okay. >> Yeah. >> And that's your brother. >> That's my big brother. >> Who's the guy in the chair? >> I'm just the guy in the chair. >> That's the guy in this chair. No, that's Rudy. >> He's getting That's Rudy. That's Ruda Baker. >> You're not going to know how to act. >> Oh, I'm like right here. >> Right up there. >> No, she said. >> He don't know how. >> I'm like right there. >> You're like one of >> Oh, you guys are [ __ ] up. YouTube chat's [ __ ] up. >> What happened to your voice? >> You from some random town? Yo, is um who's in the chair right now? >> Nobody even lives there. >> Where are you from? >> That's why I said she from the island. >> No, it's an island. You know Aruba? >> Aruba? Yeah. >> So, it's a small island next to Aruba. It's 20 minutes. >> I know Aruba. >> It's 2 and a half hours to Miami. >> Far. Okay. >> I've been there plenty of times. >> I've seen it on the map. >> It's definitely from >> I was born in Mississippi. I moved here from I moved to LA from Houston. So you was born in Mississippi and you moved to Houston and you came to here. >> Yes. >> All right. That's >> That was a lot. I was I went to Alabama though for college. So in between >> what? The University of Alabama. >> Yes. Roll Tide. >> So what do you do? >> Roll Tide. All right. >> I just graduated college. >> What college? >> Ohio University. >> Oh [ __ ] >> Ohio University. Green and White. >> Go Bobcats. >> No wait. >> Wildcats. >> Bobcats. >> Oh hell no. >> Green and white the same. You guys are thinking the Buckeyes. >> I'm not saying that I'm not a Buckeye. >> Yeah, Buckeye's better. >> I can't be both. >> No, >> no, >> no. >> It's like an hour away. They're literally like an hour apart. >> So, what do you do now? >> No, I'm I'm a Wolverine fan. >> Oh, for the West Virginia a month ago. >> What? >> No. University of Michigan. >> Oh, see, we don't keep up with that. >> I live in Detroit. >> Oh, yeah. >> Are you Do you like the Lions? He loves the Lions. >> My favorite player My favorite player is Barry Sanders. My second favorite player is Aiden Hutchinson. >> Oh, okay. >> She don't know none of them players. You just >> I know Aiden Hutchinson. >> You know Aiden Hudson? >> I used to work in sports. >> He dope. He dope. Aiden. >> See, I knew it. You know why? Why? >> Cuz you got a sports voice. >> Really? >> Yeah. >> I used to do >> like a Doris Burke type of voice. >> That's crazy. Everybody tells me that. >> You got that. John Jagger bro just ago began that voice. >> Bro, >> that was right. >> That's crazy. That's like literally what I went to college and stuff like that. >> Oh yeah. >> Yes. I wanted to be on air and like now I'm an actress. Yeah. >> Okay. >> You doing some 2B movies? >> No. >> Hell no. >> I'm not doing TV movies. >> We working on two movies. >> Okay. >> Y'all want to be in a 2B movie? >> You good? Good. A >> what what role would we play? Let's ask that. >> Y'all have them y'all have major roles. >> What would you be? >> Of course. >> Like me. I'll be like, \"Duh.\" >> Like I won't be in the movie. >> Why? >> Because it's not centered around me. It's centered around women. So >> So what will we who will we be talking to each other? >> Yeah. You'll be like the the boss of the Okay, here we go. >> Okay. Here we go. Tap in. Tap in. Tap in. All right. The scene starts. >> Okay. >> Boom. >> They got Jay the Kiss song >> up there playing. >> Okay. So, giving old school. >> Oh. Oh, god. God dam. >> All right. Let's change. >> No, that's cool. Like, let's change the piece. >> Let's change artist's artist then. >> Okay. >> What is a upto-ate artist that we can use for the intro? >> What's wrong with Jada, man? Jada's cool, >> right? That's what I'm saying. >> So, we can Nothing's wrong with him. What about Jeezy? >> Like the rapper? >> Yeah. >> Yeah. >> What if he's a What if his What if his song was the opening? >> Cuz >> Okay. >> And then we have to have a plot. Where are you? >> Got the camera. >> What's our location? >> Okay. Your location is >> I don't want to interfere with my brother gang. >> Your location is >> I don't want to say the club because that's too >> like >> original. >> Original. >> Okay. >> Not original, but opposite >> two copycat type, >> right? >> So when we want to keep it original, let's say y'all sisters. >> Oh, >> y'all sisters, right? >> Okay. >> And y'all raised in one house. >> Okay. >> Right. But each sister got their own dynamic. >> Okay. >> Like one sister got to be like like the enforcer of the sisters. >> You know what I'm saying? >> That's her. And then the one sister got to be like uh gullible like he's so cool. >> And one sister got to already have a kid. >> Oh my god. >> Right. One sister got to have a kid. >> Kiki, you got that? >> That's you. >> It's not me. >> Mhm. >> So we start from there. >> Okay. >> All right. >> What's our What's our like problem? Like what? >> It's not a No, it's a it's a plot. Okay. >> It's a plot. >> We need a climax. >> So, what y'all trying to do? Y'all trying to um Dang, >> this is plot to the TB. >> Yeah, this is the Tubi movie. >> This is the TBI movie. >> So, the plot is >> all them TB movies. >> The the three sisters. >> They be like that's like >> the three sisters >> dating the same guy. >> What the hell? >> So, right. >> We're dating. We're all dating the same guy. >> Same guy. You dating the same guy? Is it her baby daddy? >> It's her because she has the child by him. >> Oh, so >> Oh, man. >> Why? She has a child by him. >> Do we know? >> Yes, you already know. But you guys are playing against each other. >> So, we're sliming. >> This is a 2v movie. This is the perfect 2v movie. I'm trying to tell you. >> Yeah, it is. So y'all both sliding against her, but you think you sliding against her, but you're sliding against her >> because she end up being pregnant. >> Dad, >> by him. >> Buy my baby. >> By your baby, daddy. >> I'm sorry. >> Yeah, [ __ ] Yeah. Scared your dumb ass. All right, I'mma leave them talk to talk to them privately without a camera in her face. Let my dad ri up on a personal uh matter. >> Yo, Taylor, you're cooking. That's what I said. >> You look tired as [ __ ] >> Taylor looks really good. I said, \"Do you ever get like a proper haircut or are you just like a great clips guy?\" And he says he has a barber, but I've never seen him with a tape. >> Never. >> N you're Kevin. >> I do. I do. >> Your barber is yourself, isn't it? >> Gentleman's barber shop on 16th Street in Sacramento. >> Oh, hell no. >> Shout out to my boy Tanner. >> GG's to their phone. >> That's my barber. You you drunk out of this? >> Nah. >> He's from Sacramento. We should drunk. We should tell that. >> Why would you do that? I I hate people like that. >> He opened it, but sipped it and put it back. >> No, I didn't sip it. >> I opened it and put liquid ID. >> I know. It's got liquid IV in it. >> It's going to really get you going. >> Look at Taylor, man. >> Taylor, you could pull if you got >> I've fallen asleep about 10 times. >> Yeah. No, you dead ass do look better. >> You could You're a whole new man with the beard line up. >> Like if I was a girl, I would give you like 10 minutes of my time. >> Like dead ass. >> That's a good That's a good cut. >> Guys, >> you went up like two points on the one out of 10. >> Damn. >> I'm single. I got two cats. [Music] >> You single? You got two cats? >> Yeah. Chat, who in the chat is a girl and think he's cute? >> He's also rich as [ __ ] chat. Just so you know, >> don't let him [ __ ] with you. >> You don't tell girls you're rich, >> but if you're looking for >> I'm broke. >> Luka. Luka with the camera work. >> Chad, never tell a girl you're rich. Somebody named Andy Max had me. >> Bro, >> I saw You saw Luca's uh fan edit. >> Yeah, I seen that. >> And guess who's And guess who's And guess who said that to me? >> What? >> Durl. What? >> Of course he says be a cameraman. >> Say on God. >> And then they they made another one. >> Say, \"Oh god, >> half a million likes.\" >> That said feed saved it on. >> No god, I didn't save it. >> You're lying. >> I don't lie. I saw it. >> You were trying to [ __ ] me. You were going like this. You're like, >> \"Don't, bro. I just took a shower.\" Hey, >> wasn't that segment good, chat? Did you guys like that one? That was one of my favorite bids we've done the whole month. >> I didn't like the lands. >> Look at this guy. >> 365K on a thirst trap. >> Edit. >> He He didn't thirst trap though. >> No, he was just chilling. >> Edit. That's what I mean. >> He was chilling. >> Like the editor. >> Dude, this girl This girl whoever uploaded it, one of the videos is like I want him so bad and it's just like right in the middle of the screen the entire time. >> Do you got a girlfriend? >> No, but his DMs No girlfriend. >> I had to get this I had to give him a little >> a little >> Listen, if you think about handing any of them teens to five years old, >> what does that mean? That means he knows, man. >> He knows. >> That's what he told me, too. He's like, man, I know. Trust me, I know. >> I play I feel like Luke is a monster at the club. >> Oh, monster. You can just tell. >> Hey, babe. You want a drink? >> You seen me with the Apple Vision Pros? >> Yeah. >> In the crib, bro. >> You be like, \"Yep, I'm at the club. Connect Wi-Fi here, >> right?\" >> Wait, look at A's haircut. >> Damn, your [ __ ] fresh. That [ __ ] hard. I think going to be a whole another >> I think you should embrace just going ball. >> Just go ball, bro. >> Yeah, I probably >> You're like holding on to something that's not there. >> Yeah, >> it's the It's the last moments. >> I mean, I could go bald right now. Technically, >> do it for the last day. >> Go bald. >> I dare you. >> Yeah, >> I dare you. [ __ ] you. >> Last day. >> Bet that. >> [ __ ] Wait. Bald. >> Bald. >> Just do it, bro. Let's go. >> Let's go. >> [ __ ] your bald. It's not going to grow back. You want to do it? >> No, it'll grow back. I I've been bald before. >> It's going to grow back just like that. >> I I shaved I shaved my entire head and face to be Lord Voldemort. >> I at one point >> Actually, no. I got to go see all my friends and [ __ ] >> bro. A be dead ball, >> bro. You be dead ass wasting the barber's time, bro. >> The barber be like, \"What the [ __ ] Let me just >> Yeah. >> Did you see Did I show you that one picture of when they tried to line me up like a couple months ago? >> You can't line that up. >> It was so [ __ ] funny. They just did a line like here. >> Why does YouTube chat like not keep up with the scroll? >> You always got to scroll up. >> You got to reset too much. >> Why do that? >> Cuz it's so many chats. >> No, I can't go. [ __ ] >> I did shake on it though. >> I shook on it. That's real chat. >> Whoa. >> Let's do it >> right now. >> Not right now. Right. >> Today slips. You look like somebody. >> He looks French. >> That's what I said. >> I literally said that. >> I look a little slips. German >> about German. >> Yeah, I'm getting German. >> No, wait. Austrian. Sorry. >> Ah, that's what I see. I see it. I look a little Austrian. >> Very indigenous. >> Hard to buy the cheese. >> Yeah, maybe the guy who was one time painter. >> Let's not get too deep into his jokes. >> All right. >> A guy who was an artist once. >> He was once an artist. >> Yeah. >> A painter of sorts. >> Picasso. >> Picasso. >> Who's Picasso? >> That's the talking about. >> You nailed it. >> Was Picasso Austrian? I don't know. Walk away. >> N you did ass look German though. I don't got >> I am German. You want to see my >> Oh my god. >> Do you want to see? >> Look, I'll show you. >> You're not German. You're >> How much do you want to bet right now that I'm not [ __ ] German? How much? How much? >> What? How did that How did that happen to your voice? >> Wait, how much do you want to bet? >> Just cuz you're 20% German does not mean you're German, bro. >> Hold on. Damn you. >> Told you you're 20% German. >> This Hold on. Chad always asks what my ancestry is and they always think that I'm like Eastern European, Arabic, something. Guess what, Chad? I'm not. >> They called you a timu Luca. Luca. >> Luca's a timu. Me. Talking about your looks. >> You don't think Luka looks better than you? >> If I worked out. >> Luca looks better than you. >> If I worked out. >> Luka mocks. You can't lie. >> Luka in the face. >> Yes. >> Camera. Why? >> Let me get the camera. All right. Y'all trying to >> No, wait. Wait. >> Hey, wait, wait, wait. >> Who looks better? >> No. No. Whoever takes the camera, please take it for the rest of the time. My arms hurt. >> I'm getting a cut. >> Please let Chad. Who looks better? Luke or Slips? >> Luca mogs you. Look at his jawline. >> He has a better cut right now. >> Look at that jawline. >> Luka mogs you. I'm sorry. >> Who is a better looking? I can't do this. >> I'm going to be honest. Who is a better looking camera? >> You might have the two best looking cameramans, though. That's That's the spirit, >> bro. Luka just lo you, bro. They're all spamming Luca. >> They're all spamming. They're all spamming Luka. >> Wait, what was the pose we was going to do? >> I forget. Just like the >> It's not a We talked about doing this earlier. >> Luka Moxy, bro. >> I don't care what your 12-year-old chat thinks. I'm the one with the bad girlfriend and he's not. >> You don't think he can pull a [ __ ] badass girlfriend? >> You >> I saw it on his phone lock screen. You don't think Luka can pull a badass girl? >> You really think that? You think he can't pull a [ __ ] badass? >> All I'm saying is he hasn't. >> Nobody. >> He hasn't. And he and he hasn't until he suddenly worked for I show Speed and got a popular Tik Tok edit. >> Now he's got D. >> I got to thank Hey, thank you Tik Tok editor. >> I think you think me, buddy. >> You're thinking the wrong person. >> Hold on. He think Wait, wait, wait. >> Because I put him in this position. >> Me and he should think it's >> so jealous. He should think his roommate Max, who DM'd me and said, \"Yo, I got a perfect guy for you.\" And I said, \"You know what? Let me give this guy a chance half\" halfway through the store because I was beat, >> bro. Just cuz he looks better. >> Y'all really Y'all really need that. >> I love Luca. I love Luca. I want Luka to stay forever. I want Luca and Anthony to both be forever. >> I need him, >> bro. Look at this [ __ ] Look at this [ __ ] >> Wasting the barber time. >> Wasting the [ __ ] barber time. He like, \"Bro, what the [ __ ] am I doing? It's all good, OG. >> Thank you for the job. Thank you for the job and the haircut. >> Thank him for the the h. >> Wait, >> I'm single right now. Nothing. >> See, he knows what he's doing. >> What did your old girlfriend look like? >> Let me see. >> They're going to Yeah. Let me see your ex. >> It was like a Bro, I only had one girlfriend in high school for like three years. >> See, he's cuz he's a nerd. That's why. >> Yeah, I'm a nerd. Yeah, but he doesn't like like girls like that. >> No, he likes girls. He just doesn't go for them. >> Like, is that right? Like you more of a nerd, right? >> Oh, no. I'm trying to, you know, that's not my priorities right now type of thing. >> You're 25, bro. I have a kid. >> Yo, >> you're 25. >> I ain't going to lie. When I'm like 27, I'm like, I'm having a kid. 26, 27. >> It goes by quick. >> I'm popping again. >> I've never done that. >> Beginning of co I was a full beard. >> [ __ ] I never don't know though. I don't think you look right. >> I gotta try at least once, but I never done it. >> Yeah. >> What about you? >> Yo, Chad, can you make an AI photo of Luca with a beard, please? >> Speedy Gang. >> What? >> I'm a streamer. >> Yeah, >> that's all I That's all I'mma say. I I'm a streamer. You feel what I'm saying? Peter Parker, >> I hear you. >> Peter Parker. >> I'm a cameraman. >> I guess I'm a manager. >> Why you going back to that, bro? That shit's ass. >> You want me to really ass though? >> Like, yes. >> I literally look like, >> you know, one of your best traits is those big eyebrows. >> We Yo, we both got those eyebrows on. >> I know. That's the >> That's what it is. I think >> the cheek is eyebrows. That's what Daryl doesn't have. That's why he's so short, too. Those things are like a half inch thick. >> Why do I just get [ __ ] just show >> Can we get the camera a little higher? >> Daryl. >> Daryl, get in the lineup. >> Can we >> I got to get a cut and then I'll get on the camera. >> I got to get a cut. >> Daryl, you're just short, >> guys. Can we get the Daryl? >> If you was like Daryl was 6 feet, he would >> wait. Let me just shoot you out. Some edit roll. >> Your eye just patches you. >> Let me get a cut. >> What are you? >> I'm moving a dial. I don't even know what to do. Why? Why do we have a non cameraman camera? >> I'm good at edit. I'm good at it. >> What are we doing? >> What are we doing? >> Taylor's cameraman. >> Just zoom less and then you're good. >> Bro, I'm about to go to sleep in a minute, bro. >> Bro, you still getting a haircut, bro? >> Get suggested for 24 hours, >> bro. Tell him to [ __ ] off. >> We can't do that. >> You're going to hate your life at noon. >> You're going to hate it. hate your life. >> [ __ ] that. You're gonna You're gonna like It's gonna be 100 p p.m. and it's gonna be the last day of your tour and you're gonna be like, >> \"What? >> I'm so cooked already. >> I'm about to check in back on my dad. >> Go to sleep.\" >> Yo, >> what? >> You know what day it is? >> Taco Tuesday. >> No, baby. It's 34. >> One more day. >> My and my journey's over. Well, not my journey, but >> I'm going to miss you, brother. >> I'm giving it back to Lo. I'm going to miss you, brother. >> Don't make me cry. Chill out, brother. >> No, we don't see each other, bro. We don't see each other. >> You know, like, you know, you're my brother, brother. >> I know. >> And I barely get to see you. >> I know. I barely get to see you, too. >> But, >> you know, >> we know, bro, we'll see each other soon, bro. >> Yeah, >> bro. Next time I see you, lose weight, though, for real. >> And start streaming. >> I need my book bag. >> I got you. Just come. Yeah, I got you. I got you. Nice haircut, too. >> Like it? >> I got you. >> Yo, I thought your mom whipped my ass. >> Really? >> Yeah. She was getting on the bus and uh she like hit my foot and I said, \"Sorry, my ass.\" And I told her, \"Hey, Daryl needs an ass woman.\" Did she get you? >> No. >> I'mma fight, man. >> Oh, you're so lucky. I don't want to fight you. You remember that that random little kid beat the hell out of you >> live on stream on my channel and he thought you could beat He was so confident. He was so confident chat. He was like, \"Yeah, I got him.\" >> Hell no. >> Live on my stream. This random kid beat them. >> What? >> Time back to back. >> I want to get I want to get to [ __ ] >> Yo, that guy was trained. That's the way he was boxing. He knew exactly what he was doing. That guy is definitely a [ __ ] >> Oh, that [ __ ] was [ __ ] >> This guy goes first, he goes I'm like, \"Oh, >> yeah, he was [ __ ] point. You know, you were fucked.\" >> Oh, the first like the first combo I threw >> the first combo he was [ __ ] up. >> I threw two punches. I was like, damn, I'm cooked. >> That was just Seattle. >> I was like, I'm cooked, >> bro. That kid was funny as hell. >> Did you try a different strategy? Like, >> no. Midway like when there was 10 seconds left, I was like, I'm just not trying to get knocked out. Let's just survive. I'm not getting put on a meme on the stream. [ __ ] that. >> That shit's funny. >> I want to see that clip again, bro. >> I was just like, >> that [ __ ] was funny. >> And then all I hear in my [ __ ] ear is >> [ __ ] tweaking out. >> Rudy in the back smiling, cheesing. I'm like, \"Yeah.\" >> I'm like, I swear, >> yo, you got your ass beat. He was like this for his life, bro. >> He was like a professional. >> And I'm like looking around at everybody. was like, >> \"No.\" >> Oh my god, >> that [ __ ] was funny. >> That guy was >> That was a top 10 funny moment, >> bro. That guy walk I walk out of the bus in uh Albuquerque at night. I don't know. And just fans are like, \"There's little D in there asking for it, man. >> I think it works.\" >> Bro is reading my chat, >> just hanging out with the chat. >> What? What? He's just sitting here reading my chat like this, >> you know? That's like >> He loves that pose. Look at his leg. >> Yeah. >> You see the way he >> just hanging out, chat. >> Just chatting. Just chatting. >> I still I still think you should look out for that um that girl. >> What girl? >> There's two more. >> No, no, no. The one that you're currently talking to, be careful. >> That's I mean, it's not that deep. Like, if it works out, it works out. Right. >> Yeah, I guess. Bro, >> don't you make your own destiny? >> All I'm saying is be careful. >> True. Yeah, you're right. >> That's all I >> Wait, Daryl has a girlfriend. No, I do not. No, I do not. >> No, I do not. Oh, yeah. No, no girlfriend. >> No girlfriend. >> He just It's a bit early, but >> Is it time to go to sleep? I'm getting tired. I'm I'm [ __ ] trying to cook over here. You know, I wake up every romance camera. 6 a.m. >> What? >> You lying. >> I promise you. Show us your alarm. We have to wake up your [ __ ] phone. >> Yeah. Show us the alarm. >> 6 a.m. [ __ ] up. I don't care. >> That's in 3 hours. >> Got to be prep. >> If you go to sleep now, you're not waking up. That's all I'm saying. >> No. Get out. [ __ ] No. You're going to be so pissed off. >> [ __ ] I'm going to be so tired tomorrow. >> Any wrong angle? Like, what the [ __ ] >> Are you tired? You tired right now, Luka? >> I know. I know you. [Music] >> Everyone got sick. I didn't get sick. >> Yeah. I don't know how you didn't get sick. You're all cuz you're always on a bus. You don't touch people. You don't like I'm like touching people and [ __ ] >> Yeah. Well, I understand why you got sick twice on this, >> huh? >> I got sick twice once again. >> Why did my phone just restart out of nowhere? >> Getting hacked. >> Dead ass. >> Yeah, it's getting hacked right now. >> You're trolling. >> Yeah, I just hacked it. >> He looks like he would hack phones. >> I will hack it. I will hack. >> No, [ __ ] >> You look like phones. >> No facts. What? >> Why did my phone just restart? >> Updated while I was reading chat. >> Yeah, >> probably have a setting where it automatically updates. >> Yes. >> Chad, who remembers the segment? >> Chill. >> Chill. Why? Where Daryl goes dating? >> No. >> Wasn't he such a wrizzler? >> No. Yeah. >> Oh, I said I'm about to do 44.6. Hey, keep making fun of Daryl. >> Who has game? >> The [ __ ] out of here. >> He does, man. I saw you in Vegas. >> In Vegas? What was he doing in Vegas? >> He was risen. >> Yeah, he was raising up that girl. >> Oh, yeah. >> I'm about to go on the bus, bro. >> You go to bed. You a little [ __ ] >> Bro, if you go to bed now, you're not gonna wake up, bro. >> I want to see if my dad still talking to them girls or not. [Music] >> Wait, there's ocean on the bus. >> There's more. >> What? Tell them >> I'mma be back. Tell them come over. I'll be back. >> What? >> Girls. >> Get a cup first. >> Just talk to them. >> There's some girls on the bus, though. >> There's going to be heads on the bus. >> There's a lot of heads on the bus. Blue. It's your groupies. >> This is Anony's. the [ __ ] you driver. >> Driver Xanders. >> Come on. R the girls, bro. >> Yes. >> What's up with Damn, why this wet? >> I know. It's my energy drink. >> Playing my music. Are >> y'all playing music here? >> Yes. You want to hear? >> Yeah. You're on. I'm ready to perform. >> Me, too. Actually, >> I just drank like a good amount. >> I know, right? I'm like, >> too [Music] bad in the front row. Knowing like a death punk. Sending Texas when I'm half drunk. Like I'm back at it. Like I'm back at it. Texting like I got to see you. Texting like I got to pull up. Texting like I got a W. I know. I know. I know. I know. It's not you, it's me on my phone. Now I had to put the phone down. Do you sleep? See, I'm not around now. That's how you find out it's not you. It's me. The only time I need you [Music] like I got to see you like I got to pull up texting like I got to I know. I know. I know. I know it's not sure it's me blowing up my phone now. I had to put the phone down deep sleep. See, I'm not around now. That's how you found out. It's not you, it's me. I need >> your hair look like >> I like it like this. I don't know why >> that's my type of hair right there. >> What? Freeze. >> Yeah, your [ __ ] look better than mine right now. >> That's hard. >> [ __ ] >> Who made that beat? >> Me. I made beat too. >> You made that beat? >> Mhm. >> That beat hard. >> Thank you. I just did uh you know the Woopy Doo song by Doc. You just dropped it Friday. >> No, I did. >> I did that, too. >> Oh, so you did that? Yeah. >> I didn't go crazy. >> Let me your beats. >> You made music, too, right? >> Yeah. Sometimes. >> Oh, I got you with the beats. I got you. >> You You guys made that beat. Mhm. I made that beat. >> No, I think you better at making beats though. That [ __ ] hard. >> I make all my beats. >> I said you be [ __ ] with Brazilian funk, too. >> Uh-huh. >> You want some Brazilian funk beats? >> Yeah. Let me hear that. when you're finished. [Music] You want more? [Music] N you good at making. >> Damn, >> it might be that time, bro. >> Yeah. >> Hell yeah. >> I got you. >> Did Henry get his bra yet? >> What? >> Oh my god. Where's Henry at? >> He's here. Where? Where? >> Oh my [ __ ] god, bro. >> Grab this. Grab this. Grab this. >> I'm tired, bro. I'm about to go to sleep. >> My book bag. >> Yes. >> My book. >> You want to move the outside after >> this one? Yeah. >> What happened? >> Don't. >> It just hit me now. >> Chill out. >> It just hit me. Tap. I'm sorry y'all. It hit me. I got to go to sleep. >> It just hit me. Nice haircut. >> Yeah. >> Before and before. >> Oh, you ain't getting your hair done yet. >> You eating and [ __ ] >> What happened? I didn't eat my dinner. >> Yeah, you can. Why you getting your hair done? >> Yeah. I'm not getting my hair done as well. No. Hi. >> Hello. >> Nice meeting you. >> Nice to meet you, too. >> Let me know if you need some. >> I will. >> Yeah. >> What's your name? >> Yumi. >> Yumi. >> Yes. >> So nice meeting you. >> It was nice meeting you. >> See you. >> Yeah. See you. Nice to meet you. >> Nice to meet you, too. >> What's your driver? >> Yeah. They beautiful girls. >> Guys had fun today. >> You out? >> Yes. >> To my room. >> Oh, it's here. >> Yeah. >> I think so. >> Yeah. We going to be out here tomorrow. >> Yo, we don't care. >> Speed. This is my boy Cena. He brought the girls. >> How you doing, bro? >> Nice to meet you, bro. >> They're headed out now. Good [ __ ] bro. Keep doing your thing. Thank you, G. >> We also brought you a gift, bro. >> What? >> Thank you gift. >> A thank you gift. >> We did. >> What I do? >> We feel like you don't, you know, had me come, had my baiter come. You know what I'm saying? >> Have my boy come. >> I feel like you don't lose, man. So, we got you a little take no hoodie, bro. >> Oh, thank you, bro. >> Yeah. Little match set. I got you, bro. As well. >> Thank you. >> It's cold in Miami ever. You know what I'm saying? >> Match sweatpants. Bulletproof, >> dog. Good night, y'all. Good night, brother. >> I'm tell the other girls to come. >> Yeah, I already told them. >> I'm tired. >> I called it off already. >> What? This is a great day, dude. >> Yeah, I know. You You put me on roller You put me on roller courses, dude. And I'd have gave that up like 15 years ago. I gave up roller coasters 15 years ago, man. I got stuck on the Magnum and See the Point. That's why I was like, I'm done with roller coasters. But I would go on roller coasters for my son. >> That's real. >> Yeah, >> they were fun today. >> That was real. Disneyland, I talk stuff about y'all for being super precautious for checking our what is that? The seat belt like three, four times. But y'all allowed us to be us, right? >> Y'all allowed us to be us. >> I did. Shout out to y'all, Disney. >> Yes. Disneyland. I love that y'all looked out for us. Junior was a king. Well, he was a king everywhere. But everybody else was like like, \"No, we can't video this.\" Why? But I'm done. >> What the [ __ ] >> What? Let me shave right now. >> I don't feel like shaving nobody hair right now. >> It's 3:00 a.m. >> I'll shave their head all day. >> You talking about you want me to shave his head at 3:00 a.m. >> shave his head? >> I ain't shaving nobody. >> All right. It's late as [ __ ] right now. >> Yeah. They know he just came up to me at 3:00 a.m. and said, \"Speed, I'll let you shave my head right now. This is dumb. go to sleep. Yeah, bro. I'm about to go to sleep, y'all. Ah, let me call this a night. Let's call it a night. >> He can get it done in the hotel room. Really? >> Where is he? >> He walked that way. Did we ever find that other Samsung? >> Yeah, I did. >> It's charging. >> Yeah. Shall we? >> Yeah. >> Sleep. Go to sleep. Yeah. >> Yo, Rudy. >> Rudy. >> Because I did like I thought y'all was going to sleep. >> I might go to sleep in a minute. >> N for real. See, >> I got to sleep. >> Tired as [ __ ] No, I got to uh jet lag though because in Cincinnati it's >> 4:47 like whatever time it is right now. >> You just horny, bro. >> He done for the night. >> Yeah, he >> Hey Rudy, can I get your face before I go to sleep? you trying to do? >> Yeah, I'm about to go to sleep. No, I'm dad's about to go to sleep. I'll see y boys tomorrow. >> All right, bro. >> All right. Good night, y'all. See y boys tomorrow. >> All right. >> All right, ladies. All right. >> All right, bro. >> Down. Sit here. >> Thank you. >> Can I get the face, man? >> Um, how do we want to do hand raised? Do we want to do his outside? >> He's going to do his in the hotel room. He's got a room. >> Okay, great. >> So, we're just out here and then um all good. Problem solved. No problems. >> Great. [Music] >> Are you going to want a haircut? Are you >> I need a light or you got light up? >> Yeah. Yeah, we have we have two barbers. >> I got to go inside. >> No, outside. >> I go outside. >> Yeah. Yeah. If you want want one. >> I just cuz you know I got to shave every day. >> I got to shave every two days cuz I'm a grown man. You know >> Jamal, you want to line up, too? >> Come on, dude. >> All right. Let me know. >> We can talk about love and life. >> All right. Bet. All right. Last day. Yeah, man. It's the last day. Speed, man. This is the last time I'm giving you, bro. Thank you, bro. Chatter chatter chatters in a chain. I love everybody in the chat. >> Do we all have rooms? >> Yeah. >> Oh, you want to sleep? >> Not a while. Just put the map in town. Not the most power. >> Exactly. >> Is Sydney going to bed? >> I don't know. >> Cuz mate, I need my charger. I need like tomorrow. No, everybody's going to ask me for portable being with the bed. >> Everybody's going to ask me for portables. have to. >> Yeah, I'm out. >> Out. >> I'm out. >> Yeah, >> I'm out. I'm going to bed. I just need my covers and pillow. But I promise you, I'm going to [ __ ] sleep. >> All right. Good night, big man. >> I got this charge. I got this on. >> I'm just going to get line. >> You tired as [ __ ] >> huh? [ __ ] I need a charger. >> Need a charger a >> yo >> uh like tomorrow. What's the whole structure? All the PC people. >> Yeah, we got to clean that. I show Highway 7. That's tough. Custom boom box. Hey, bad [ __ ] won't be like me. Jumping down like this. Okay, we up. Come on, can you get my covers and pillow, please? >> Oh, you a-hole. >> I said please. >> All these asses been on my [ __ ] bed. >> Bless you, Luka. >> Thank you, God. >> Bro, you know what's crazy? I could sleep in a hotel bed right now. >> I could too. >> I could sleep on my house. >> You can sleep. I know. I know. As soon as you hit that hotel bed, you're going >> I can sleep on a hotel bed, but I'm a man of my word. This is a >> I know. As soon >> this is a bus tour. Let me get my pillow. >> Yeah, bro. >> I could I could actually slip on sleep on mine. >> [ __ ] I was listening to what you was saying. Hey, if you need me, I'll be be chilling, listening to music in my bed. >> You You listen to music? >> Yeah. >> You don't? >> About going to bed? >> Not I'm not going to bed. I'm chilling laying down. >> Nah, you you you c too or Yes, you gota let gluca just sit down just watch you. Camera start blinking. >> Camera about to start blinking. So you might as well switch to desktop. Well, desktop. Desktop. Cancel. Desktop. >> Can we do desktop mic please? Thank you, brother. Are we on it? Cam, too. Desktop mic not working. Double check that OBS. Yeah, OBS. We about to start OBS. >> Free on. We're good. On the mic. Okay. Sweet. Sweet. Sweet. >> All right, bro. Good night, bro. >> Yeah. >> See you tomorrow, bro. >> Great day today. Let's make tomorrow even better. >> These [ __ ] just said the last RP. 3:00 a.m. Y'all can't be [ __ ] serious. Like, y'all can't be serious. >> Kia Kaha donated two Australian 99 through super chat. What an adventure speed big mono wave to you, bro. East Santa donated $6 Canadian 99 through super chat. Luca and Anthony are way better behind the camera compared to Lil D. Respectfully, thanks for all you do. Speed. >> I love y boys, bro. From the bottom of my heart. Good night. I'm going to sleep. >> Dream donated $19 through super chat. >> Keep spreading joy speed. Glad I saw you today. >> Tact beat donated run 25 through super chat. >> Yo, Speed, can you meet Victoria Feifer? She is from Los Angeles. Please do this for me. Aspiring hero donated $2 through super chat. Sydney boyfriend not tough, bro. Let him know what >> she's getting. >> Mop23 donated $1.99 through super chat. I love speedart. Ruger donated $2 through super chat. That global phenomenon hat they gave you is rare. >> Just for the last >> Raiders donated $2 through super chat. Beat_meat donated $1.99 through super chat. Speeder you finn to do more 247 streams in future. Jibo not found donated $1.99 through super chat. Let me tattoo you. TM I am in love. >> Junior J donated $1.99 through super chat. >> Speed come back to San Jose Bay area. Let's go. [Music] Y 2 KD Y N A S T Y donated $2 through super chat. F the LNM. Let us redeem ourselves. Brew PLZ. Subodon donated three New Zealand 49 through super chat. Sweet dreams, my dearest African prince. I love you. West Coast NN donated $9.99 through super chat. Damn broke. Can't believe I met you today. Last two days been very depressing. Today was one for the books. Your pops gave me some real game and made me feel better. Your influence is crazy. You touched the world. G [Music] Raiders donated $1 through super chat. Kyle Young donated $5 through super chat. Kyle Young, I tried to pull up to the hotel, but the guards turned me away because I didn't have a VU Ja. I am just a stream sniper. Irish Gemini 85 donated $1.99 through super chat. [Music] Arira donated 100 rupees through super chat. You have a good heart speed. Always be good and strong. [Music] SMDB OS donated $1.99 through super chat. Bro, I can't believe I missed you coming to Phoenix. [Music] Scrusher donated $2 through super chat. See you through the parking garage on my way down. I review games donated $1.99 through super chat. Is Sydney getting railed as we speak? Tact beat donated run 10 through super chat. Please speed meet Victoria Feifer for me. [Music] Rats donated $1.99 cents through super chat. I left speech bubble eye. Left speech bubble eye. Left speech bubble eye. Left speech bubble eye. Left speech bubble eye. Left speech bubble eye. Left speech bubble. Coco. Lowercase letters. Coco lowercase letters. Coco lowerase letters. Coco lowerase letters. Coco lowercase letters. Coco lowercase letters. Coco lowercase letters. Coco. All right, man. Spaz Sam donated $1.99 through super chat. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head. Exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head exploding head. [Music] Subodon donated $3 New Zealand dollar49 cents through super chat. Rudy boy sweet dreams tonight. My Ghana prince Devil Dog Entertainment donated $2 through super chat. Ruddy. Much love, bro. Good night. [Music] Spasam donated $1.99 through super chat. I bet you want dump water on speed. Habibi Snipes donated $1.99 through super chat. Yo, Culis, tell Speed to not make fun of my name. West Coast NN donated $1.99 through super chat. Rudy, wish I shook your hand. You crack me up, dude. Lucas Reigns donated $4.99 through super chat. Speed, you are amazing. Sleep tight, Pooky. And the rest of the crew on the bus. Y'all are extremely awesome. Love you guy eating back there. You a sexy one. Sky donated $1.99 through super chat. Tears of joy. Tears of joy. Cool. Heart. Heart. Tears of joy. Tears of joy. Tears of joy. Cool. Heart. Heart. Tears of joy. Tears of joy. Cool. See no evil. See no evil musical notes. Grin. See no evil musical notes. Tears of joy. Tears of joy. Tears of joy. Cool. Cool. Cool. Cool. Cool. Cool. Throwing kisses. Throwing kisses. Throwing kisses. Flushed. Flushed. Grin. Weary. Rutiger. Red heart loudly crying. [Music] Christian_4367 donated two Australian dollars through super chat. Hi, I am Christian Lucas. I am talking in chat. Wsp speed. Spaz Sam donated $1.99 through super chat. Ruddy dump water on speed cat face. Jake Leven donated $1.99 through super chat. asked speed to shave my head at Jacquelivan for clip. What's up [Music] Django Trey 3 donated $4.99 through super chat wour. This one will be studied for years to come. Are they all driving back to Miami tomorrow night or what? sleep in the hotel. Yeah. Did you get your trim? Subo Daikon donated $3 New Zealand49 through super chat. Rudy, nod if you're sad the tour over [Music] [Music] Lucas Reigns O23 donated $10. Heat. Hey, Heat. [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] And then [Music] everything. [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] I need you. [Music] H R rookie Basha donated $5 through super chat. Away in a manger, no crib for a bed, the little Lord Speed laid down his sweet head. The stars looked down where he lay. The little lord speed asleep. [Music] [Music] Jim Bibs Bolognos donated $1.99 through super chat. Speed wake up. Ronaldo is in LA today. Nambdi Chris Etoama donated $1.99 through super chat. Sup, it's Chris E. Shaoo. I'm [Music] in. Speed's real dad donated $1.99. I know Speed is super tired after that intense circle jerk they all had last night. I heard Henry came all over him and slips. [Music] [Music] I am Speed's real dad donated $1.99. I know Speed is super tired after that intense circle jerk they had last night. I heard Henry came all over him and slips. There was so much nut everywhere. [Music] Juliana King donated $1.99 through super chat. Wake up speed. [Music] Heat. Heat. Valibers since 2009 donated $1.99 through super chat. Yo speed, you should come to Minnesota. Daily viral videos donated to New Zealand dollars through super chat chat. It'll be right back. Just going to take a [ __ ] ass. [Music] Smile with horns. Eld666. Smile with horns. Donated six shekels through super chat. Issue speed sleeping. Wsp speed heartbreak wilted flower. You look like Oreo. Hey. [Music] [Music] [Music] Holy donated €2 through super chat. Hey Speed. [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] Mitchell Carol donated $7 Australian.99 through super chat. W [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] Aaron 666 donated $2 through super chat. Slept tight. Don't let Diddy bite. [Music] [Music] You need me. [Music] [Music] [Music] Leonardo Santos donated 35,000 Indonesian rupees through super chat. Speed in hater. [Music] [Music] Beanie donated $1.99 through super chat wra yesterday. [Music] Beanie donated $4.99 through super chat chat. I thought he said he'll be up early lying. Ah. [Music] Beanie donated $4.99 through super chat. Craziest thing he did during this tour was send that jump with Chapman in the race last night. Wall w speed hack of a tour. [Music] Brian [ __ ] donated 500 yen through super chat. Wakey wakey. Miles Morales donated $1.99 through super chat. Only one day left for the tour. Wspeed high voltage. plugged a joint donated $4.99 through super chat. Prank him, John. plugged a joint donated $1.99 through super chat. Rudy, why you look funsized? [Music] I show meat donated $1. Ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow ow plug. joint donated $1.99 through super chat. Speed has a wet dream asterisk wsp speed. [Music] PB donated 99 cents through super chat. Rest amarov. donated 10 Swedish croner through super chat. Stronger donated $1.99 through super chat. Wakey wakey boy. Time to conquer the rest of USA. Thank you. [Music] [Music] [Music] [Music] [Music] [Music] Trinity Jane donated $1.99 through super chat. Trin, we have to take Squan to the vets, so get up. [Music] [Music] YouTube. Max Panda donated $1.99 through super chat. Please say hi, Max. [Music] Eli C. Pistol Pete donated $1.99 through super chat. Hope everyone trolls speed and calls him ice show. [Music] Master_VY SO donated €2 through super chat. 1 N5T4 GR4 meters Yasen Bulma Katist donated $1.99 through super chat. Wake up kooky bear speed. [Music] Anthony donated $2 through super chat. [Music] [Music] [Music] Eli C. Pistol Pete donated $1.99 through super chat. [Music] plugged a joint donated $1.99 through super chat. Tell Jamal he's not welcome back in Compton. [Music] [Music] Gabe owners donated $1.99 through super chat. Nika nicka nicka nika. [Music] Freddy donated $10 through super chat. Good morning, sir. John Bobby folded hands. Hope you guys have an amazing and wonderful day today. Thanks for all the laughs and most important your guys hard work and constant stream. It was fun. Scissor Oregon. Ham Frost donated $1.99 through super chat. Tell Jamal he not welcome back in New York. [Music] [Music] Greg Parker donated $2 through super chat speed and senat today. You heard it here first. [Music] Mitchell Carroll donated seven Australian dollars and 999. 9 cents through super chat. Poopsy whoopsie. Oh no, I'm going chi to have a heart attack. Insta fan pages donated $4.99 through super chat at it on Twitch. Let's goose speed look hella comfy. TBH. [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music]",
    "start_time": 0.96,
    "end_time": 41167.5
}