{
    "video_id": "dx8IgpwFnLQ",
    "channel_url": "@mrbeast2",
    "transcript": "Breaking news today out of the NFL. Let's go live to the press conference. Today marks an historic first. The NFL is now under\nthe ownership of one individual… Jimmy Donaldson, MrBeast. - Thank you!\n- Congratulations. Everybody, that is right.\nI officially own the NFL. And I think it's time for some changes. So, for my very first change, we are gonna be changing the rosters\nfrom 53 players to 54, and giving that new roster spot\nto a YouTuber! No Jimmy, we can't. Well, I already did. Jimmy, we got the Cowboys! There's only one spot. Alright, boys. First one to pop\nthe balloon makes it on the team. In 3, 2, 1… These are the best athletes\non Earth, Jimmy. This could get sketchy. Yeah no, we already signed Sketch.\nWe're good. Let's go Texans! C’mon baby! It's our year! Let’s go! Jimmy, we didn't talk about this! Oh, I really need to answer this, but--\nJust signed Dude Perfect to the Cowboys! How's it going? I own the NFL now,\nwhat do you need? Jimmy, dibs on the Vikings! Skol Vikings, let’s win this game!\nSkol Vikings, honor your name! Alright, yeah. You’ve got the Vikings.\nTalk to you later. Put her on. Yo Jimmy hey. I gotta rep for my hometown.\nPut me down for the Rams. Rams, huh? Bold choice.\nPut him down. Let's go! Hey mom,\nhe said yes! What do you got, Jimmy? Jimmy! I got the Chiefs.\nPlease, come on! Let's do it, you're in. Yo Jimmy, I got the Jets. I got the Broncos. Raiders! Jimmy! I pick the Seahawks! Yeah! Let's go! In a shocking new development, YouTubers are now reporting\nto training camps? We know this isn't just a game. Come on now! You know that guy\nshoulda caught that ball. Sure, it will be hard. But I know these YouTubers\nhave what it takes. We have Speed. Let's go. We have power. I've always played football. Not bad. We have style. Kinda. You look good. Look good.\nFeel good. Play good. - Let's go!\n- Let’s go, baby! Let's go, man! Jimmy, you know,\nfirst I wasn't sold, but this idea is something\nI might be able to subscribe to. Subscribe. Exactly. Alright. Well for the first time ever, Chargers vs. Chiefs will be live\nfor free on YouTube. Make sure you watch it.\nIt's literally free, why not? September 5th.",
    "start_time": 0.25,
    "end_time": 193.151
}