{
    "video_id": "nF0rqeymxmQ",
    "channel_url": "@mrbeast2",
    "transcript": "This is a $1 billion chocolate factory! The most expensive\nchocolate factory in the world. And I was invited for an\nexclusive tour of the inside of it. So as a peace offering, I brought\nan unreleased Feastables product. Let's go check it out. Jimmy, how do we get in? I thought you talked to a guy. I… did talk to a guy. Door's not opening. Let me in! Well, bang on… bang on the door. I did! Hello? Is… anyone here? What? -Why'd you shut it?\n-I didn't do anything. -Jimmy!\n-Open the door! Scanning. Access denied. Uniform detected. Open mouth. What? Chocolate consumed. Access granted. Hello? I was told by some guy I'd be getting a tour? Alright. Excuse me?\nI need my briefcase! Let go of me! Why would you even need that? Got it! Oh, no! It's the only way in.\nJimmy's toast. Should we go get help? We're not doing anything until we get\nfurther instruction from Jimmy. Oh, how loyal! I see\nwhat you're trying to do. What? You're hoping Jimmy's dead. What a horrible thing to say. Oh, he's definitely dead. -Why would I be hoping that?\n-We're all thinking the same thing. The question is:\nHow do we settle this like responsible adults? Settle what? Who gets Jimmy's channel? That's good. I mean, we could 1v1 for it. Just don't tell Karl or Tareq. The CEO would like\nto have a word with you. -Get in!\n-Chill. Ok. Alright. What's— Hello, Mr… Donaldson. We hope you enjoyed\nyour complimentary chocolate on arrival. Are you the guy that I spoke to? Yes, I'm the guy. I think there's\na misunderstanding. I was supposed\nto be getting a tour. There is no misunderstanding, Jimmy. We're well aware\nof what you've been doing. You've become,\nin recent years, quite… the chocolatier. But the truth is,\nyou have a lot to learn. Our company has been in the chocolate\nbusiness for nearly 200 years. We have certain standards. Certain… traditions. If you want\nto make chocolate, Jimmy, I'd advise you get back in line and stop\nmessing with the way it's always been. I didn't mean\nto disrupt the work line. Oh, Jimmy… I'm not talking\nabout the work line. Have a lovely day. Hey, Jim. Delivery. Who are you? I'm gonna get you out of here. Why are you helping me? Oh, my briefcase! Thank you. I tried your chocolate milk. Yeah. Was it good? What's going on? I remembered something. My dad was a truck driver.\nAnd in the summer, I'd ride along on his work route with him. This factory was\none of his stops. He'd load all of the chocolate ingredients\nthrough this door right here, and keys… were always left right here. And you only remember this now? I don't think I'm the only worker\nwith memory problems. Come on. -Let's get out of here.\n-But what about them? We can't leave them behind. Is there any way\nI can make a call? Surely there's a phone\nsomewhere in here. We need a distraction. Everybody, this is\na mystery briefcase! And inside this briefcase could be $100,000,\nthe keys to a Lamborghini, or a beverage that gives you back\nall your childhood memories. And whoever takes their hand\noff of it last keeps what's inside. Good luck. What is all this commotion?\nWho is responsible for this? Winner keeps the channel. Hello? Guys, I need you to do\nexactly what I say, ok? Wait. Who is this? I'm a friend of Jimmy's. Can you prove that? Is this Nolan? Jimmy told me\nto say \"hi\" to your mom. Oh, ok. What do you need us to do? Who's gonna win?!\nNope, you're out. You took your hand off. -Get out of here.\n-Everyone, please, settle down\nand get back to work. Come on, we just started. Around town! You took\nyour hand off. You're out. It looks like somebody didn't finish their chocolate. Sound the alarm. What's that? Oh, God. Ok! I guess Jimmy's still alive. We'll have to circle back\non who gets the channel. Resistance is futile, Jimmy. You might as well just stop fighting. And we can all get\nback to work. I'm not eating the chocolate.\nNo, get that away from me! Eat it! I don't want it!\nI'm not eating it! Stop! No, no! Drop the load! I can't see the target! Chandler, we're\nrunning out of time! Drop the load! Hold! Hold! Eat the chocolate! Eat! Eat it, Mr. Donaldson. Eat the chocolate, Jimmy. Now! Oh, my God! Eat the choc… You're free! Congrats! Obviously, even though\nthis is a movie, this brand new Feastables chocolate milk is actually real. And it's now available\nat Walmart, 7-Eleven, and Speedway\nlocations nationwide. It's real whole milk\npacked with Fairtrade cacao, loaded with protein and vitamins, and honestly, tastes better\nthan any chocolate milk I had as a kid. But you might have noticed, the workers in the movie lost all their childhood memory. Sadly, that's not just a movie plot. Today, 45% of children living in cacao-growing\nhouseholds in West Africa are involved\nin illegal child labor, meaning, they're\nnot growing up with the childhood\nmemories they deserve. That's why at Feastables, we're doing things differently. We use Fairtrade certified cacao, we pay our farmers a Living Income Reference Price, and we audit and remediate child labor on our farms. Because we believe every kid deserves to be just a kid. And that's why when you drink\nour brand new Feastables chocolate milk, you'll be aiding\nus in our efforts to get kids out of illegal\nchild labor in chocolate. Hey, Jeff, break character,\ntell me what you think. -That's really good, man.\n-It's good?! -That's real good.\n-Let's go, guys! Go give it a try!",
    "start_time": 0.0,
    "end_time": 545.9169999999999
}