{
    "video_id": "bV8XJEwLBqw",
    "channel_url": "@mrbeast2",
    "transcript": "I just launched my most ambitious\nphilanthropy project yet: Team Water. And in just 1 month,\nwe raised over $40 million. But in order to get there, I teamed up with streamers Adin Ross\nand xQc to raise an extra $5 million. Live, on an indefinite stream. The only rule? We cannot end this stream until that bar graph down there says\nwe raised $5 million for Team Water. Oh God… So far we've raised nothing.\nThis is gonna be a very long stream. $5 million, guys. 5 mil. And to make things more interesting,\nwe added donation challenges. Each of these has a punishment behind it. We're then going to set a donation goal.\nAnd if you guys donate enough, we will. And things got out of hand pretty fast. That is crazy. Whoa, this is crazy! Oh no. Oh my God… Most money ever raised\nin a fundraiser: 11.9 million. Let's get the world record! When do we get\ninto the first punishment? Pick number 5,\nI think it should be good. Alright, what's number 5? -I need a 3, 2, 1.\n-3, 2, 1. -We're doing it.\n-\"Get waxed!\" \"Get waxed!\"\nThis is the first punishment. So we need $20,000 donated\nin the next 15 minutes, and we'll do it. Show me your wolverine back. -Bro! -Holy… Alright, guys, let's see\nhow bad you want it. Alright, the donations\nare starting to go up. Did we hit it? We hit the goal! Caleb, you're the coolest person\nI've ever met in my life. -That's the goat.\n-Thank you, Caleb. You just gave 10,000 years\nof clean water to people in need. Guys, remember,\nevery dollar donated is 1 year of clean water. Adin, get on that table,\nlet's get it going! If you could see how hard\nhe's gripping my hand right now. He's legit sweating! Yo, I got $60 from— Alright! This is the theme of the stream. You donate, we suffer. -You're gonna do 14!\n-I'll do it. -What is it?\n-You ready? -No matter what, you'll do it—\n-I'll do it no matter what. Tarantula. Don't— So if we hit 100K total, he will get duct-taped to a chair and put a tarantula on his head. We'll give you guys 15 minutes. Alright, 100K. We reached it. Oh, what? Oh, CrateRoyale!\nYo, CrateRoyale! -Oh, my—\n-60K, they donated. He's currently\nthe top donor for Team Water. We hit the goal! We just got 100 grand\nand we gotta torture X over here. -Is this really necessary, guys?\n-Yep. We have X duct-taped to the chair. Bring in the tarantula! Alright, X, how are you feeling? I don't wanna talk about it. I'm trying to calm myself so that it doesn't bite or whatever. Alright. X, don't panic. X, they wanna know,\nhow are you feeling? I think if I talk,\nhe's going to do something— He's moving! He's doing something! Here's the second one. Second one coming in. Yeah, just put it on his chest. On his neck. Oh, that one's mobile. -Don't move your back.\n-Oh yeah X, do not move. Yeah, he's on your back. -Alright. 3, 2…\n-Don't move, X. One. Alright, you can\ntake them off. X survived. Dude, that's crazy. Live reveal! Paintball hit. Say hello to my little friend! Holy s***! -The ball didn't even—\n-Oh, it bounced off! Wait, wait! It made a dent!\nThat's gonna be my body! 3, 2— Ow, s***! You did multiple! What the heck?! In my knee. -He lied to me.\n-I know— Come on, we're trying\nto help you up. Come on. Ok, Jimmy! You hit my tendon! Ok, so the next one is\nI'm going to be doing a spray tan. Hey, can you take Adin far away where he can't hear us? Don't let him see chat. His spray tan… it's blue. -No.\n-Yeah. So, he's gonna— -No!\n-So he's gonna look like a Smurf. Throw this on so she doesn't blind you. Let's get this segment done,\nI want you to see what's coming up next. -This is what you look like.\n-Nice. What the— No way. How long is it going\nto be on my skin for? Some time. Oh yeah xQ,\nit's over for you. Wait, the only— Oh, s***. You've to go on that, I'm sorry. I'm sorry. Uh, yo? Yo— I'm the king of this.\nI've ridden one of these before— You're a great rider. Max speed! Max speed! Hold on tight! You're almost done! You got 30 seconds. -3, 2, 1…\n-Alright. Stop it! Stop— -You're free, X.\n-Good job, brother. I do think the best way\nto get energy back is to blow a hole\nin his ceiling. Let's go. Oh my God! Adin's ceiling. You wanted a hole in the ceiling. Instead of launching\nlittle lightweight ping pong balls, let's launch\nan actual trash can. In 3, 2… Oh, well. Any second now, this could blow up. That's correct. Again! It shouldn't be too bad, right? Yeah, hey, don't worry about it. It's like 4 ceiling tiles, it'll be fine. I did bull shark and tarantula. Ok. What did you do? Smuf and… Smurf and wax. -So it's my turn.\n-You're up. Alright, my turn. 47K! From Kalishi. Why? Cause he's the goat. Is it just these 2? -No, it is not.\n-How many do we have? Wait, how many snakes is it? I'm not getting\nin this tub until I tape my pants. I do not want a snake crawling up my butt. Here we go! -What if it strangles me?\n-Don't worry. I will hear you call for help— Could it—\nDon't they, like, constrict? -They're number 1 constrictors—\n-What if it just decides to kill me? It's moving just a tiny— That's some— That one's a cheeser. Cheeser! My camera guy got scared. It's crawling\naround my butt. Can we be done?\nHow many more? Oh no. Oh my God. That one is excited! -Oh, he's moving.\n-Yeah, he's a real mover. -Come on. This is just—\n-Like headphones. This just ain't cool. You look like Medusa. You look like a Smurf. So me, X, and Adin are live streaming\nuntil we raise $5 million for charity. We were just curious if you wanted\nto throw a couple shekels our way. Any amount, Dana. Any amount.\nDoesn't have to be anything crazy. I'm in for 100,000. 100,000?! The biggest and the best.\nDana White with 100K! So— One million! My head's too big for the hat. Thank you! That was\nthe $1-million-raised celebration. How much\nhave you guys raised? We're up 1.3 milli. What if we just match it\nand do 1.3 million? Yes, please. Then you guys get back to work.\nStart raising some real money. -Deal!\n-Sounds good to me! Move out the way. Jimmy, there it is. -Shout out to—\n-Shout out to BeLove! Slippery wrestle? -Oil up?!\n-Oil up and wrestle? Steele, we're really doing this? Sorry, brother. Yo, bro, you're strong, dude. Wrestle! Oh my God. This is getting heated. Oh, no! Stay on the mat. Tap! You aren't tired? Keep it lubricated! Alright, bro. One more?\nRun it back? No! Oh, wait! Wait! Adin! I don't care.\nI already picked it. 3, 2, 1… Shock— Oh my God. Oh my God. \"Run the obstacle course\nwith a dog shock collar.\" What? I'm good. Here, just— I won't go! F*** no! What is wrong— Hell no! I love the way you screamed. -That was cute.\n-Really? Do it once. Just do it. Oh hell no. Because you guys donated, I now have to do this obstacle course with a shock collar, shocking me like a dog\nevery 3 seconds. If you put a shock collar\non your dog, stop. This ain't cool. 3, 2, 1! -Oh, do you see my neck—\n-Yeah, yeah. Ow, stop… Stop, stop! Ow, stop… I've got marks on my neck. That hurt! I got welts on my legs,\nmarks on my neck. But guess what? We're giving 5 million years\nof clean water to people in need, so it's all worth it. Listen, if you guys go outside\nright now and lay on your car horn, I'll give you 75 grand. We'll give you guys 1 million right now if you push the goal to 8 million. Ok, 8? -Let's do 8.\n-Fine, 8. We got some energy drinks in here. -Alright.\n-You boys get cracked out. Might as well drink it, bro. We're here for a long night. Yeah, we're gonna be here all night. To make sure everyone understands, we said at 4.4 million, Adin will run on a treadmill. We'll throw the most\nwretched things on the treadmill. I'm starting— Oh my God! Ow! Oh my God. Oh my God! Oh my God,\nit hurts so bad. Really? 2,1… Time's up! Oh my God! Dude, that is awful.\nIt's actually awful. Jimmy, you've gotta try too. -You're not gonna like this.\n-Oh my God, I've socks on. Ok, yeah. It's when you hit\nthe corner of a Lego. It feels like\nit's slicing your foot. We're heading back to the set. We got Sophie Rain's number,\nwe could call her. I would love to.\nI've been wanting to donate. I'm just not sure how to,\nso I'm glad you called me. Because I wanna donate $1 million. It's what I wanna donate. Wait, I think my phone— Did you say a million? Crazy, bro. That is insane. Hey, shoutout to Sophie.\nThat's awesome. I swear, you ask me\nsomething diabolical, bro, I'm throwing you\nunder the bus for everything, buddy. Yeah, we're gonna\nask you some crazy stuff. Do you have more than\n$100 million in your bank account? No. Do you have more than\n$100 million in your crypto account? Yes. -True to both.\n-Oh my gosh. Your first time meeting me,\ndid you like me? Yeah. -He's telling the truth?\n-Yeah. Have you ever been peed on? No. I'm just reading chat. Would you date Madison Beer? No. Would you date Sabrina Carpenter? No. Do you pee sitting down? -Yes\n-It's true. Would you consider me\nas one of your good friends? Yeah. The bar is low though. If you had to kill one of us,\nwho would it be? Me or Adin? You. That's true. I think it's time\nto send a clear message that we're not gonna stand for\nwater scarcity anymore, man. The collective team of BeLove\nis so grateful for you guys, we're gonna wrap it up\nwith a $1.5 million donation right here. Oh, my— -Thank you.\n-Wait… I don't know\nwhat to say, that's crazy. B John just sent me the most money\never raised in a fundraiser. And it's 11.9 million. You know how sick that would be,\nto have that world record, Adin? -I'm just saying, it's a…\n-You know what I'm saying? Train's calling me. Train. Yo, what's good, my boy? We're at 8 mil,\nbut the record's 11.9. Train, we want to break\nthe world record for most money raised in a single stream in history. What do we do, bro? Ok. Listen. Let's raise that s*** up to 11.9, ok?\nSo I've thrown in 400K. I'm gonna donate 600,000 more\nto make it 1 million flat. -I'm in, so… I'm in.\n-I'm in. Let's get this world record. -I'm in, bro.\n-Bro… Bro. -Let's get the world record.\n-I'm not getting early out of this, bro. Let's do it. Let's get the whole record. Let's get the world record! —the hoop because I'm exercising,\nyou know what I'm saying? Watch these moves, though. But watch this, though! Watch this! At this point it was 2 a.m.\nand we were all pretty out of it. So we spent the next several hours frantically calling as many people\nas we could, asking for donations. Gary! Brian, how's it going? Hey, Casey! I can't end stream\n'til we break the world record. We can't stop streaming\n'til we break the world record. Trying to break the world record\nfor most money raised for charity. Well, I'm in. 25,000. I will do 25. What if we say, like, 25k? I'm in for 105k. I'm in for 300 grand. So guys, this is Brian Chesky,\nthe founder of Airbnb and one of the most\ngenerous people I know. I just want to tell you,\nI think what you're doing is awesome. Thank you for doing it.\nAnd I'd like to close this out and get you to 12 million\nso count me in for 500,000. -No shot. Wait, are you. serious?\n-Yes. -No shot.\n-100% Just one more time,\nare you 100% serious? A hundred percent serious.\n$500,000. You've reached your goal. Oh my gosh! Aw, this is crazy! We're being showered\nin confetti right now. Hundreds of thousands of people, because of the money\nwe raised on this stream, are gonna get access\nto clean water for decades each. Like, words cannot explain the impact\nthat raising this money will have. Just shout out to everyone,\nall the big donors, all the little donors, everyone who stayed up\nall night with us, everyone who didn't, anyone who even\ntuned in for a second. Take care. End the stream! Take care. It's done! Thank you!",
    "start_time": 0.033,
    "end_time": 781.3
}