{
    "video_id": "oyhGAJbu6i8",
    "channel_url": "@mrbeast2",
    "transcript": "Ten years ago,\nsitting in my bedroom, when I was supposed to be studying\nfor a history test-- decided to whip out a phone, and record videos\nto go public deep in the future and try to predict\nwhat my life would be like, what the channel would be like… And after 10 incredibly long years, 'Hi Me In 10 Years'\nfinally went public. And I wanted to capture my reaction on this video\nthat you're watching now. So, let's do it. Hi, me in 10 years! Hey! Oh my God. I'm gonna schedule upload this video\n10 years in the future. So, you're gonna see this in 2025. - Oh my God.\n- It's 2015 for me right now. Ah, this is crazy!\nLook how young I look! Look at the difference! This me doesn't have a beard,\ndoesn't have a mustache. Dude, what if I'm dead?\nDude, if I’m-- Oooh. That’d would be weird.\nThat'd be so weird. Thankfully, not dead. Oh, dude that’d be really weird. But, let's see. Ten-- Dude, if I don't have a million\nsubscribers when you see this video, my entire life has been a failure. Ironically, we actually have\ndozens of channels with millions of subscribers. And before we go too deep into listening to old Jimmy,\n17-year-old Jimmy here ramble, I just wanna like get you\nin the right mindspace. I want you to understand what's going\nthrough this 17-year-old's mind. We didn't have tons\nof money growing up. I mean, it was probably like\na normal middle-class family. But in 2008,\nwe ended up going bankrupt. So we had nothing. Like, my parents actually filed\nfor bankruptcy… And I had poured year after year\nafter year of my life, and people weren’t\nwatching the videos… Everyone in my school,\neveryone around me was saying, \"Jimmy, you will never be a YouTuber.\nThis isn't realistic. You're chasing a fairytale and\nyou need to like actually focus on whatever you're actually\ngonna do with your life…\" And it started to really weigh on the\nJimmy you see here because he's like, \"Am I wasting my life? Am I gonna be a failure?\nAm I gonna be homeless? Will this ever work out?\" And you know,\nmy mom didn't have much money, and I really wanted\nto not be a burden on her. And I wanted to be able to make money\nso I could help her… And all these thoughts are swirling and that like storm is what's\ncurrently going on in this Jimmy you see here\n10 years ago's mind. Now with that context,\nlet's keep watching. [sighs] Well by the time you see this,\nI'll have finished high school. I did finish high school. Gone to college… Technically, I went to college. I went for 2 weeks, and then I thought\nit was super boring and didn't go. It was a community college.\nWe could not afford real college. Probably be doing YouTube as a job.\nHopefully, maybe, maybe, maybe… I feel like back then, I'm like, \"Man I would love to just be able\nto provide for myself as a job!\" And now I provide\nfor hundreds of families. I have hundreds\nof full time employees, and we help thousands\nupon thousands of people through our main channel videos, so… It is kind of funny in retrospect\nthat 10 years ago, which really isn't that far ago, I was nervous that I wouldn't be able\nto provide for myself. Yeah, as of right now,\nI'm enjoying YouTube. Hopefully I still--\nfuture me still enjoys it. I don't think I'll ever get tired\nof YouTube. Honestly, I think YouTube literally\nruns in my veins at this point. I love creating content.\nI love telling stories. I love entertaining people.\nI love making your guys' day. I love being able to impact lives.\nIt's literally everything I love. I don't know, I--\nit'd be crazy if I had some ridiculous\namount of subscribers. I bet you if you went back in time\nand told this 17 year old me I'd have 440 million subscribers,\nhe wouldn't believe you. He would would laugh, right? Because back then, I think\nthe biggest channels in the world had like 10 million subscribers,\nif that. Like, I remember when Smosh hit\n10 million subscribers, and like being so mind blown, like,\nwhoa, that's huge, right? I remember when PewDiePie hit\n10 million subscribers, I remember all those things. And like that seemed like\nthe pinnacle. It was like,\n\"Alright, they hit 10 million. They won the game!\nLike, that's as big as it gets!\" And like, now, I don't know. There's probably like a thousand\ncreators with 10 million subscribers. Like, it's just crazy\nhow much the platform has changed in the last decade. At the time I'm recording this video, I have 8,000 subscribers\nand 1.8 million views. [Jimmy now] Wow. Look at that. Also, look at the old channel logo.\nI kinda miss that tiger! The only problem, is it kinda looks\nlike a high school mascot. Just to be blunt,\nthis is why I ended up changing it. And the entire channel back then\nhad 1,830,631 views. Which is funny because\nthe main channel video does that in like 6 minutes\nwhen we upload them. And it probably goes without saying, but I wanna make it\nexceptionally clear, I am living a fairytale life\nright now, and I just wanna make sure\neveryone knows I'm very grateful. That 17-year-old,\nif he could talk to you right now, to those of you\nwho watched the videos and allowed me\nto become who I am today… he would be on his knees crying\nand be eternally grateful. And obviously,\nthat 17-year-old is me now! And you know,\nI'm not the best at being vulnerable and expressing emotion,\nit’s not one of my strong suits… But, I want to make it\nexceptionally clear that I'm beyond grateful\nfor all of you. I will never take this\nfor granted, and this is why I do everything\nin my power to make every YouTube video we upload\non the MrBeast channel as freaking great\nas freakin’ possible! So whenever you see this,\ncompare these numbers to whatever I have\nwhen you watch this. Dude, I really hope\nI have a million subs by now. - You have way more than a million!\n- Please! Future me, please. - What am I doing with my hand?\n- What am I doing with my hand… Please have a million subs! I probably should've thought about\nwhat I was gonna say… hopefully you have a million subs. In case you're wondering,\nI'm also talking a little quiet. It's actually 'cause\nmy mom's downstairs, and if she knew I was filming videos\nas opposed to studying, she would come up there\nand freak out. I'm pretty sure, actually,\none of these cuts is because my mom came in to check in\non me studying, and I had to, like, stop recording\nand act like I was studying. Alright, so I should be studying\nfor a history test. [Jimmy now] Yup, the history test… I wonder if you, or me in 10 years,\nremembers what grade I'm gonna get on this history test\nthat I take tomorrow, that I'm not studying for\nbecause I'm making these videos. Dude, if you still remember\nthe grade I get on this history test in 10 years, that's crazy. I do remember the grade\nI got on this test because after 'Hi Me in 1 Year,'\nI went back and I looked at it and then I left a comment. Dude, I'm probably gonna be married\nand stuff. Man… Well, you're not married,\nbut you're engaged. You will be married soon. You have a very beautiful fiancee,\nThea. Isn't she adorable? So, you're much closer\non that prediction than the sub count prediction! Woah, watch me not be married\nand not have a million subscribers, not have any of this, and then you guys just think\nI'm a big loser. I have most of those things, and a lot of you probably still think\nI'm a loser. Dude, what if I don't do YouTube\nwhen this goes public? That'd be weird. People don't realize this because I spend so many tens\nof millions of dollars on videos now, but when I was starting out,\nlike I couldn't afford anything. I mean, look at the quality of this. Because I couldn't afford a camera. And so it's just so crazy that this somehow turned into\nthis life I'm living now. If you wanna see what time it is,\njust so you know what the date is, that's the date. Oh, yeah. The squiggly lines is the date.\nThank you. Hopefully you can see that. [Jimmy now] We can't. Hopefully you still do YouTube. - Hey. Oh, my hair is messed up.\n- Oh my gosh, this is so awesome. Alright yeah, I don't care. Hey, future me.\nHopefully you’re having a good day. [Jimmy now] I'm having\nan awesome day. I better have a million\nwhen this goes public. [Jimmy now]\nYou have more than a million. Chill. You hit your goal.\nYou're good. Ten years, man.\nTen years. - Yeah.\n- I'm gonna be so different. - I really am gonna be so different.\n- You are. You're different,\nbut not that different. I mean, back then,\nI loved strategy games. I loved board games.\nObviously, I loved YouTube. A lot of my differences between 17-year-old me that you see here\nand me now, is probably more in confidence. I was very self-conscious back then. Fun fact, I loved YouTube so much\nwhen I was growing up that it was kinda all\nI talked about. And one time, a high schooler came up\nto me, and he's like, “All you do is talk about YouTube.\nNo one cares.” And that like really, really,\nreally hurt me because it kind of hit me. I was like, \"Wow.\nAll I do is talk about YouTube.\" I talk about YouTubers\nthat are doing well. I talk about ideas. It was just like the thing\nthat consumed me when I was young. And so when I was around this age, I really, really struggled\nbecause I was like, \"Okay, no one cares about YouTube,\nI just won't talk about it.\" And so I stopped talking\nabout YouTube, and it got to the point\nwhere one time, one of my teachers asked, like,\n\"Am I mute?\" Because like,\nI talked so little. And I struggled really, really badly\nto connect with people because all I wanted to talk about,\nall I wanted to do, was improve videos,\nand study videos, and work on videos\nand entertain people. And if you're surrounded by people\nwho don't care at all by that stuff, that you just become\na nuisance to them. And so when you're that age, you have to be around the people\nin your school, and there are people you just kinda\nhave to be around. And I was just forced\nto be around people who truthfully made me feel\nlike a freak, and made me feel like\nI didn't belong. And I didn't realize it ‘cause\nI was so young that you know,\nI'm not a freak. Or, maybe a little bit. But it's okay to be obsessed\nwith something. It's okay to love something. And so as soon as I got out of school\nand I started hanging out with other people\nwho loved telling stories, who loved making content,\nwho loved being YouTubers, that's where everything changed. People who don't care\nabout content creation don't get it. And they think you're different\nand weird and will call you names. But who cares? You don't need to be\naround those people. And that's how I'll be happy, not by trying to change who I am,\nif that makes sense. Oh, man. Man. Alright, well. [sighs] Actually, you know what\nI just noticed? This gallon of water. For whatever reason,\nI suck at drinking water. So I used to carry a gallon\nof water around and try to like drink a gallon\nof water throughout the day. A lot of you\nprobably don't know this, I have something called\nCrohn's disease. It's where your gut kind of\nattacks itself. It makes you very tired. Sometimes people will notice, like,\nthat I look low energy in videos. Or sometimes even people will say\nI look soulless. Usually those images, those moments correlate when\nmy Crohn's is acting up. And I say all that because I played sports like crazy\ngrowing up. But then when I was 15,\nI got Crohn's disease. I ended up losing 60 pounds. I really struggled to get out\nof bed. And this is like kinda\nthat weird time where I was like, \"Oh well, now I suck at sports\n'cause I have Crohn's,\" But I still like trained\nquite a bit. And so that gallon you see\nbehind my head, I would drink a gallon of water\nevery day. So some days, I'd have like two baseball practices\nin the same day. But I'd come home\nand I'd grind YouTube videos, and then my mom would be like, “Do homework\nand stop failing everything.” And I'd be like, “With what time?\nI'm trying to be a YouTuber.” Alright, see you guys.\nSee you guys? - See me. Hey, me.\n- [Jimmy now] Me, hey. One last thing, just so you know-- Look at that date.\n8:27, October 4th, 2015. That's so crazy. It feels like\nliterally just yesterday, but it also feels like\n10,000 years ago. That is crazy to look at. That little table you see\non the right, that was like a crappy little table\nthat I bought. This monitor is like a cheap little\nmonitor I bought at Best Buy. This is bringing back\nso many memories, man. - It's currently October 4th.\n- [Jimmy now] So many memories! So, yeah. Like I said,\nthis is October fou-. Oh, an abrupt ending. Lovely. I didn't learn how\nto conclude a video, apparently. But anyways, my goodness. You know, to be honest,\nI've been a big YouTuber for so long that sometimes I forget\nabout this past life. I forget about when I was 11, 12,\n13 years old, 14 years old, 15 years old,\n16 years old, these-- Year after year,\nwhere I was making so many videos and pouring so many thousands\nof hours into the channel and no one was watching them,\nand I couldn't afford anything, and… It was a struggle, man.\nIt was a freaking struggle. I'm so just glad that\nthat young me there never gave up. I'm one of the most stubborn people\non the planet. Even now to this day,\nif no one was watching the videos, I would still be making them. I decided that I was gonna be\na YouTuber, or I was gonna die. Those were the only\ntwo outcomes in my life, is I'm gonna be a YouTuber,\nor I'm gonna die. That's it. I worked very, very hard to build the channel\nwhere it is today. But having said that,\nthere's obviously luck involved. And I would say the luckiest thing\nthat ever happened to me, is I, at a very young age,\nfound what I loved. That 100% is the luckiest thing\nthat ever happened to me in my life. Which is why\nI wanna encourage you guys. You know, obviously,\nnot everyone's in a position where they can just\nchase their dreams, and… You know, you have to put food\non the table if you have kids, and you have to provide\nfor yourself. But if you do have time\noutside of your job and what you're doing\nto provide, really try to find\nwhat you love. Because when you do find\nwhat you love, and it finally works out,\nit's amazing. I'm so grateful for the life I live. I'm so grateful for the life you guys\nallow me to live. I love everything I do. I love it, I love it,\nI love it so much. And so thank you, thank you…\nThank you guys. I hope you enjoyed, and let me know\nif I should react to other stuff.",
    "start_time": 0.033,
    "end_time": 711.2109999999999
}