{
    "video_id": "KRhofr57Na8",
    "channel_url": "@markrober",
    "transcript": "This is Mr. Beast and this is Mr. Beast pee. And my goal in this video is to use science to purify this into perfectly drinkable water. At which point he will drink his own pee. >> Wait, you didn't tell me that part. I'm going to drink my own pee. >> But it's for a really good cause. Because if I can figure out how to do this, then the same technology could be used to help the two billion people without access to clean drinking water to purify even the dirtiest water that looks like this. Or even much, much worse. Ew. Step one was to find a place on the planet where you'd have a really hard time finding clean water, but a really easy time finding clever brain solving that problem. And that just happened to be Kenya. So step two was to go there and meet the people doing just that. [Music] Now, the first thing you notice when you get to Kenya isn't so much the elephant crossings or the random baboon families you see walking around. It's these yellow jugs you see people carrying everywhere. And as it turns out, those jugs are meant to carry water. And as it also turns out, they were all headed to the same place I was. Ruthie. >> Hey, Mark. >> Who knew Kenya was so far? >> But so beautiful. Welcome. >> Very beautiful. I'll give you that. This lovely human is Ruthie, and she works for Give Power. And they build a magical machine that can turn even the most disgusting water into pure drinking water using only the power of the sun. So, we changed literal ocean water into fresh drinking water. I'll have you taste. >> I think you'll like it. >> Don't try and influence the judge, Ruthie. And when I tasted a cup of water from either side of their treatment process, hopes and prayers. Let's go. With the before water, you could really taste the before. That tastes like sea water. >> It is sea water. >> This is what people drink. Yes. And the reason for that is 96% of the homes you see here don't have running water, which means they often have to get their water from unclean sources that carry a lot of uncool diseases. So while you and I might take for granted that we could just pull a lever and effectively infinite clean water comes out from a faucet, two billion people don't have that luxury. So they need to get creative. In this case, by turning the entire ocean into their very own water tower. And I'm so glad they did cuz that meant when I tried the after cup that is crazy the difference. >> This tastes amazing. This tastes fresh. This was in the ocean less than 24 hours ago. >> It was. >> Wow. So like no fish poop. >> No fish poop. No colera >> giardia. >> No disentry. Nothing. >> Not even disentry. Now to understand how this was even possible. I built a simplified transparent version of their magic machine back at home and decided to put it to the ultimate test. >> Oh boy. Let's go. Oh no, I don't like the noise. >> He's got to turn it on. >> So if you pump out the dirty water from here, then after all this, a little bit of extra clean water should come out here. And to put my engineering money where my mouth is, I vowed I would drink that water. >> Hey, why am I even doing this? >> Two billion people in the world drink poison every single day. And we've got to do something about it. >> By the way, this is Hayes. He's the dude that founded Give Power. And he did it after making a pretty obvious observation. 73% of people in the world live in coastal communities. And so it seems ludicrous to me that we have these oceans with all this water yet 2 billion people lack access to it. Fresh, affordable water. >> So their trick to solve the problem is to mount reverse osmosis water filter systems and shipping containers, which not only makes them easy to ship, but now you can just plop the thing next to a large dirty water source, even in a totally remote location with no power, and you can make 70,000 L of water per day. Now, for some perspective, this is a half a liter of water and this is 70,000 L of water. That is how much ocean water is magically being transformed into fresh drinking water just in one location every single day. And it's all fully solar powered. So, with my digestive system on the line, it's worth explaining exactly how their magic machine works. Let's say you have two buckets, one with totally pure water and one that has a bunch of salt and gross stuff in it along with pure water. Well, if you connect them, then separate them with a barrier that has holes so small only tiny pure water molecules can get through, what you'll find is over time the pure water molecules all on their own will pass through those tiny holes in the barrier to spread out and hang out with more of their pure water molecule friends over here. In nature, that's called osmosis. Reverse osmosis is where we do that backwards. We apply a bunch of pressure to the dirty bucket and that basically squeezes any pure water molecules through that membrane while all the salt and other junk can't make it through. So, the good news is you've got all this fresh water. Bad news is there's one critical flaw. How do you deliver a swimming pool worth of fresh water every day when 96% of the houses don't have plumbing? And the answer is they give the water away for almost free. As you can see here with my buddy Mangala, he's the brains behind the local water delivery crew. But today that's delicious. I was the muscle. I got this. Mella, is it moving? How do you do this? Oh, we got it. Who knew selling water was so hard? I'm putting my back into it. Feel like I'm doing most of pushing here, Mangella. A fake pushing. Let's go. >> Okay, now your turn. >> I soon realized I was better off as the face of the operation. >> Who wants water? Mama. Mama. Maji. Where's our first customer? Maji fresh 40 shillings. >> 20 20 20 shillings. >> Actually, I think I work best as the heart. >> At this point, I'm more about supporting emotionally. I can't imagine doing this seven times a day. But these guys are the water pipes delivering to the individual houses that don't have that infrastructure. So by selling the water at a discounted rate to the guys who come by with all the yellow jugs like Mangela, those human water pipes can then deliver the water for a small profit, incentivizing them to deliver as much as they can to those who need it. And this way all the money stays in their community. If they're not home, we could just leave it here, right? It's crazy that this fresh drinking water was just in the ocean yesterday and now it's in their house ready to use for anything. How many cans do you deliver a day? >> 100. >> 100. And you push all of them. I'm going to stick to making YouTube videos. Speaking of which, >> I can't believe I'm doing this for a stupid YouTube video. >> It seems to be working. Oh gosh. Actually, more is coming out than I anticipated. Backup cop. Hold on. You're sure this is going to work? >> Well, I didn't build it, but I believe the technology. >> Oh boy. It does look clear. That is a good sign. Moment of truth. I'm turning it off. That looks like pretty dang clear water. Oh boy. Smells like water. That's a good first sign. Why am I so nervous? Still smells like clean water. Now, to be fair, my only saving grace here is that 3 minutes and 59 seconds. Later in this video, Mr. Beast is going to have to do something very similar. Oh boy. Okay, here we go. >> Does that have to be a big sip? >> It's a gulp. >> It's a goal. >> Put it down. >> I never agreed to a goal. >> Be brave. Be bold. Believe in engineering. Believe in science. Believe in a better way. It tastes like very fresh water. That is incredible. From this, it just leeched out all the little pure water molecules. And now I'm feeling refreshed. So, at one location, you make 70,000 L a day. >> That's right. And everything we don't sell, we give away. >> Let's go. And this was actually my favorite part about everything they do. And it's something Ruthie mentioned when I got to write along for one of these deliveries. So we choose schools and hospitals and children's orphanages and we give all that water away. >> Hit it. The pump has started. >> Wow. And when speaking to the principal of one of those schools, the real impact of all this hit me. >> Okay, here we go. cuz ever since their school started getting clean water deliveries, hey, >> attendance has doubled because this is the only access to clean water they have. >> You want some more? >> And he said this means not only have so many of their stomach and health issues improved, but now they don't have to spend time every day fetching dirty water. So they have more time to attend school and invest in their future. And seeing these lovely fellow humans who despite living on the other side of the planet are so similar to us in so many ways find such joy and appreciation for a simple fresh glass of water was a good reminder of what can happen when the power of engineering is used for good even for something as basic as fresh clean water. >> Okay. So you want me to pour my pee in that bucket? That's right. >> Oh my gosh, this is gross. >> It's for science. All right, Jimmy. Well, thanks to the power of reverse osmosis, time has come. >> Oh my gosh. >> How you feeling? >> Um, if I taste any pee particles, I'm spitting this on you. >> How much do you believe in the science? >> Uh, you want just do it? >> No, no, no, no. Before Jimmy drinks this, if you're watching this video, we need your help getting water purifying systems like this to kids and people who need it all over the world. So, buckle up cuz the next 30 days are going to be crazy. You might remember 5 years ago when we did team trees and we raised $20 million to plant 20 million trees. Huge success. So afterwards we did team seas. We raised $30 million to pull 30 million pounds of trash out of the ocean. Also huge success. Which brings us now here today to team water where we had the insane audacious goal to raise $40 million to give 2 million people all around the world clean water for decades. >> That means on average every $1 we raise gives one human clean water for a year. >> What if I do 20 bucks? >> Bam. Now it will last 20 years. just using this machine. >> No. To scale this up and pull this off, we've been working with Water Aid because they're the best. They've been doing this for over 40 years. They've got a four-star charity navigator score, and they can make sure the clean water goes to 2 million people all across the world. But to do that, we need to raise $40 million, which truthfully me and Mark Robber can't do on our own, which is why we have all the biggest and smallest creators on every social media platform coming together to make content on Team Water to help us hit our $40 million goal. >> I'm so excited for Team Water. I'm in for Team Water. Team Water. Team Water. Let's do this. >> So, join all your favorite creators on Team Water by watching and sharing all the Team Water content you see for the next month and then by heading to teamwater.org and giving as much as you can afford right now. With all the division and doom and gloom online today, this is one of those rare moments where we all get to push in the same direction and do something really meaningful. It's a chance to prove the best parts that make us humans still exist in abundance and that young people could be a catalyst for positive change in the world. I am so stoked. We totally got this. All right, Jimmy, no more stalling. Let's see it. >> Oh gosh. I'm just going to close my eyes. >> Oh, interesting. Yeah, tastes like clean water. #cience",
    "start_time": 0.16,
    "end_time": 651.8
}