{
    "video_id": "1kLFSEUoBYg",
    "channel_url": "@ryansworld",
    "transcript": "Join us as we visit a haunted school for 24 hours to look for a secret treasure. But watch out, there's a ghost on the loose and we need to complete his ghastly challenges first. Who will win? Who will lose? Let's find out. >> Welcome to Ryan's world. >> Spooky. >> Where are you? Where are you? Okay. Okay, guys. I know it's your first ghost hunt, but it's not that intense. Okay, so I think that this ghost is one of those ghosts that really likes games and puzzles. So for this game, we're going to have to take turns matching these ghostly items. The thing is is that there's not going to be any peeking and we're going to have to get it right. Otherwise, that ghost is totally going to curse us and we'll never get the treasure. Each of these boxes contains a mystery spooky item. Now, the players will take turns trying to match an item to the mystery items. If they get it wrong, it's a lose. However, if they can fill out the boxes and get it right, ding ding ding, you'll win this challenge. Uh, who wants to start? >> See? A protect me. Okay. See, you know what? I'm pretty good at guessing. Uh, this unlucky face. Uh, scary face right here. Sorry. All right, you guys go. >> All right, my turn. [Music] I'm feeling the vibe. Yes, I knew it. So good. >> Wow. You're totally a natural. >> Focus. Focus. Feel it. >> So close. It's okay. You got one down. >> Okay. Um, >> come on, buddy. >> Let's go with this bowl of uh creamy crawies. E. >> Yeah, we should be able to like maybe hear these somewhere. >> I think I hear them right here. >> This is good. >> Okay. Okay. Okay. Uh, got to go with something. >> Got this. >> I think it's My gut is telling me here. My brain is telling me here. What do I go with this one? >> So close. So close. Okay, guys. Focus, Sean. Focus. You want me to hold your teddy bear? It might be distracting. >> Okay, I'm fine. >> I'll take good care of you. I take I took three cars. >> All right, I'm going to go with a pumpkin, too. All right, let's see. So, Bri was the baby. Not that one. >> It's going to be this one. It can't be this one, but I trust Bri. This one. >> Yes. We're so close. Come on, Sean. >> Only two left. >> 50/50 chance. >> Okay. All right. I'll pick candle. The candle is right here. >> Yes. This is That means this creepy face guy is right here. >> Wait. Oh, wait. Hold on. Take this back. Something's going off. >> Vibrating. Wait. Wait. Wait. >> Wait. There's ghostly energy coming here. It's nearby. Oh, wait there. This way. >> Oh, there's a really tall ghost. Oh my gosh. >> Is he friendly ghost or scary ghost? >> It doesn't matter. We finished the mission. Give us a treasure or house. >> You guys haven't completed all my ghostly challenges yet. So, you actually haven't earned it. Uh, you're going to have to do some more ghostly challenges. U if you dare. >> We dare. Let's go. Let's go. We are going to play a game where you are going to have to try to make it to the end of the hallway while I chase after you. And if I tag you, you're out and no treasure. >> But there is a way to stop me from moving. If you ever turn around and look at me, I will freeze. >> But you can only turn around for 3 seconds. And you cannot communicate with each other when you are turning around. >> What? On your marks, get set, go. >> He's really chasing us. [Music] >> Faster. >> Hurry. Watch this. >> I'm coming. >> My first victim. >> No. You left him behind and now he's mine. Keep looking back. >> Oh. Oh, no. Oh, >> you're looking back. I'm looking. Come on. I'm going to keep going. >> Another victim. >> My ghostly treasure will never be yours. Sorry, bra. Sorry. >> Almost there. Can you break it? >> That is cheating. >> I won. I won. I broke the finish line. >> No, you didn't. You didn't break the finish line. You have to break the finish line. >> You have to break it. I won. I broke the treasure. And you look at my friends. >> Okay. You did one extra challenge. You bet. You're really getting the treasure after that. >> One more. >> Yeah, one more. It's always rule of three. Hide and seek >> and maybe find my treasure. Uh that's kind of how we're going to play this. You are going to be seeking my treasure and we are going to be seeking you. >> We are. >> They're my real ghosts. >> They're my ghostly minions. >> I'm kidding. It's just a face f Hey, apologies. >> Wait, why are you guys on the ghost team? I thought we were buddies. >> Not anymore. I caught them and now they're on the ghost team. Anyway, we got to get into the game. So, 3 2 1 go. >> Am I in the hider? Am I the hider? Okay, >> you're finding the treasure >> by myself. Oh, that's not going to work. That's not going to work. Am I supposed to hide from three ghosts? >> Impossible. This is going to work. Three miss. Wait, I have an idea. You think about the perfect way. Come on. Hurry. Hurry. Hurry. Hurry. Hurry. Hurry. Hurry. >> Nice. 10 Mississippi. That >> way. That way. Right there. It's a >> little scary, but this would be the perfect hiding spot. The theater department closet. Oh, the costumes. They'll never find me. Look at the options. Got to hurry. >> Where are you going? I sense the human presence somewhere here. >> Wait, I hear something that way. >> Oh, this. >> Wo. >> What is this? >> Hey, three young and beautiful people. A thanks. >> Have you seen my little doggy? I keep losing my little puppy. >> Uh, no. But he has a teddy bear. >> Oh, no. That's my teddy bear. >> Okay, sorry. Uh, no. Wait. We got to focus. Really? >> Come on. We need to find >> Yes. Joanne sounds like sounds like a very nice young lady name, but nope. >> Come on, ghostly minions. We need to find her. Hurry. >> Here. I have more questions for the grandma. >> I don't want to lose my treasure. Come on. >> My voice sounds familiar. >> It worked. It worked. I've worked. I want to find a treasure after all. So, where could the treasure be? Okay. Ditch this granny costume and find the treasure before they find me. >> Where are you? We know you're here. The sword fell out of the statue. >> Oh, is this uh really a statue? It looks shorter than I understand this side. Oh, >> e. >> Wait, wait. Okay, I'm I'm dumb. I forgot I'm a ghost. I live in a haunted place. Everything here moves. Everything's haunted. That's normal. Okay, come on. Some weirdest neon secret I've ever played. >> Must be the cheapest statue. >> Where are you? I want my treasure. >> You have to be here somewhere. This is the last place. I have not looked yet. Oh, it's just a chicken. Okay, I keep going. It has to be light somewhere. Oh, there it is. Whoa. Hello. Have you seen a giant treasure chest? Wait, it looks like he's guarding something. Sorry. Sorry. Sorry. Sorry. Sorry. Sorry. Sorry. Sorry. [Music] Okay. Okay. Maybe this is it. Just let this is it. This is hurry. If they find me, we got to I got to hurry. I got to hurry. Wait. Okay. Okay, I'll breathe. Look at this. Oh, wow. This is the wormy treasure that everybody wants. >> Man, she found it. >> I did. Look. >> More than enough to go around. Like, we could definitely split that like five ways. Four ways. >> You know, people say sharing is caring. >> Of course, I get 102% and you guys get the rest. It was really great. This is the most fun I've had. Okay, good luck in your ghostly adventures. >> Cool. >> All right, I'm going to grab Wait a minute. >> Grab over my head is full. >> All right, hurry up. I got I got ghostly things to do. I got >> I got to leave you behind cuz I got to get a body. >> Oh yeah, I'm going to be rich. >> You guys not sure about that, but it was totally worth it in the end. >> Oh yeah, >> I could do this like once a week and be set for life. Well, sure. I don't think my case is going to be okay. >> Yeah. I mean, >> yeah, these trouble could even get it. >> Hey guys, today we're going to do the haunted house challenge. >> Boy, it looks spooky. And who is this? >> Welcome to the haunted house. Ha! Who is this? I don't know this person. Who are you? >> I'm Candy. And here's our first treat. >> What is this? >> Gift. Spider. Spider. >> Hey, you're not so sweet. Even though your name is Candy. >> Well, welcome inside. [Music] [Applause] Wow. What is this place? >> It's so spooky. That ghost. >> It's real. It's moving around. Watch out. All right. [Music] Hold on. Oh man. What is this little plant? It's a trick-or-treat. [Applause] [Music] Hey, how cool. Okay, what else? Let's keep going, Ryan. >> Oh, wait. Daddy, there's spiders here and there's spiders on the wall. So, let's play a game. All right, we got two bugs each. Whoever throws these bugs closest to the spider wins. >> I'll go first. >> That's pretty good. All right, my turn. Let's go, ladybug. Bullseye. >> So far, I'm winning, daddy. >> I'm just going easy on you. Oh, your turn, Ryan. What? Woo! >> No way. >> Yeah, I got bullseye. >> Uh, how do I beat that? Uh, okay. I'll try. I'll try. All right. So, in order for me to win, I have to knock out Ryan's spider and get a bullseye. >> Nope. Did not work. >> I win. >> Yeah. I wonder when I win. >> Hey, Ghost Star is right there. >> He's hiding it. Hello. [Music] >> Wait, I think this is what we win. So, one for me and one for you. >> I love gum. >> Ooh, this is cool. >> What did you get, Daddy? >> Got gum. All right, let's eat it. What is this spider? I think this gone. >> Maybe that was just a trick one. Here, get another one. >> All right. All right. This going to be the real one. The one again. >> This place is full of pranks. Let's continue. >> All right. Let's see what's next. [Music] >> Dinosaur. >> Wo! >> And his pirate golden pumpkin. >> Wo! the wheel. >> It's a bit too much. Just just to pick one theme. >> Okay. The wheel of fate. >> Ooh, what is this? >> Okay, let's see. Spinning. >> Oh, it's spinning. Uh-oh. Uh-oh. >> I got >> I got [Music] >> It says bear booby scared. >> Oh no. >> What does it mean? >> Scary. where this is just a yummy snack. Oh, okay. So, I'm going to get the small one and I save the big one for you. >> Oh, big one for me. >> You can open it first. >> Oh, thanks. How nice. All right, let's open it. Let's see. I'm getting hungry, so it's perfect for you. >> Oh, >> what is this? This isn't chips. What is this? It's a snake. Yeah. I'm pretty sure that one was just a fake snack. I'm pretty sure this one's real. You >> sure? I don't find anything. What? You want me to open it? >> Yeah. >> Okay, fine. It's chips. I'm eating it. Of course, there was snake. Okay, at least one of them is real, right? I'm going to open this popcorn. >> Yeah, it smells like real popcorn. It's going to be Ryan again. >> Well, look, daddy. I found a mirror. >> Oh, you look funny, Ryan. Interesting face, Ryan. Oh my gosh, your face is crushed. Oh my gosh. What's wrong, Ryan? >> It's a witch. Play this game and you win, you get this cool treasure chest. >> What happens if you lose? >> If you lose, you stay here forever. [Applause] >> Stay here forever. Oh no. We better win. >> You're right. Let's do this. >> Haha. I'm going to go first. Yes. Yeah. >> Oh no, the witch did it. Oh, we better hurry. Go, Ryan. >> Okay. >> Oh, yeah. Oh, yeah. Yeah. Oh, yeah. >> That's dancing, too. >> Oh, yeah. My turn. >> Yay. Yay. Yeah. [Music] >> Oh, no. She made it twice. >> Oh, your turn. Your turn. >> Okay, I got this. I have to make this. I don't want to stay here. Here we go. [Applause] [Music] Oh no. We still have one more chance. Okay. >> Ryan. >> Oh, you think you too? I got [Music] >> Oh no. What should we do? Haha. >> This tiny chest is mine. What? We're stuck here forever. >> Wait, what's that noise? It's coming over there. >> I think it's a phone call for us. Probably saying that we can get out now. >> Oh, let's go. Let's go. What's on the floor, Ryan? >> Wa! It's a skeleton. >> Is this a wheel? >> Spider pokey pokey. >> Oh, ghost. >> It's a ghost. Scary. It's coming back. >> Hello. >> Hello. >> Do you guys want to get out of here? >> Yes. >> Yes. >> Well, you have to go through the ghost town box fort maze over there. >> What? >> There are tiny little thieves. If you can find them, I'll let you leave. >> Okay. Okay. Let's go find it. Thank you. I know where to go. Come this way, Ryan. Wait. Come on, Ryan. Hurry. Start in the car. >> Come on. Hurry, Ryan. I want to get out of here. [Music] Ghost. >> Wa. Happy Halloween. >> This ghost town is too scary. >> Yeah. >> What if I turn it off? Turn everything off. Look, I see a switch here. Ready? >> Yeah. >> No, it's broken. [Music] >> Okay. I don't think that's the right switch. >> Yeah, I don't think so either. Oh, wait. Here's the doorbell. >> I see you. [Music] I'm watching you. >> Uh, we're watching you, too. [Applause] >> You know what? That's enough of you. >> You're too slow. Huh? >> Yeah. Let's go in. There's nothing scary here. >> Yeah. >> Wo. >> Wo. >> Wo. What is this place? >> It's spooky. [Music] [Applause] My leg. Oh, he let me go. >> Oh, there's spiders in here, daddy. >> Spider egg. Spider. All right, let's keep going. >> Remember, we got to find a tiny teeth. [Music] A where are you tiny teeth? The skull has teeth. Woo! What is that? >> Are you kidding me? >> Woo! Okay, here. Daddy, you try. >> Wow, it's so Just kidding. It's okay. >> Just kidding, too. Hm. Definitely not the teeth we're looking for. >> Oo, look at these cushions. >> Oo, there's bugs. There's the teeth. But there's a tiny ant. >> Tiny ant. It's pretty big. >> The ants no match for me, Daddy. I got this. [Music] I got it. We can escape now. Let's get out of here. >> Let's go. Well, that wasn't so bad. Thank you for watching our Halloween spooky scary video. Remember, always stay happy and buy some [Music] robots. We got to get out of here. [Music] Happy Halloween, guys. Happy Halloween. Bye. >> We are promoting Tag with Ryan, an app game from Ryan's World. >> What's up, combo crew? Do you have what it takes to outrun me, Combo Panda? There's only one way to find out. My favorite app game, Tag with Ryan, where you play as Ryan trying to run away from me. Move fast to avoid obstacles. Explore new levels and collect suns along the way. Woo! Magnet time. Level up your game with more characters, vehicles, and costumes. Oh yeah, rocket ship. Catch you later, combo crew in Tag with Ryan. Get it? Catch you later. I mean, I'm going to tag you. >> Parents, Tag with Ryan is available on the Apple App Store and Google Play Store.",
    "start_time": 0.719,
    "end_time": 1349.28
}