{
    "video_id": "HRqBVlLFwiA",
    "channel_url": "@ryansworld",
    "transcript": "Help! Somebody help! [Music] >> I'll save you guys. [Music] >> Welcome to Ryan's world. [Music] I love summer. There's nothing going on. I can just relax on my bed all day long. >> The zombies are here. >> What? Zombies? Where? Zombies. Ooh, hungry. Need to eat something. Ooh. >> Oh, no you don't. That was so yummy. I want more. I'm still hungry. >> Um, more incoming. [Music] plants. I want some plants. >> Oh no, I think we need help. It's okay. I'm here. Yay. Zombie doesn't scare us. No. [Music] M, that was yummy. >> Yay, we did it. Now we can just rest. >> Guys, you can't rest yet. Look, zombies are coming more and they're stronger than ever. >> What? Let me see. Zombies more. Plants, where are you? >> It's not working. They're too strong. >> I can help. You guys can't come here. >> It's not working. I'm running away. Oh no. Any other plants around? We need help. Oh no, they're getting closer. >> Oh no, you guys don't. [Applause] [Music] >> That was a close one. I came just in time. >> Thank you so much. That was super scary. Yeah, I thought it was going to be a relaxing summer, but there's no break from zombies in the summertime. >> Thank you so much for saving us. You're welcome for saving you. Good thing I came just in time. >> Hey guys, what you guys doing? You guys having a fun sleepover? I want to join. >> Hurry, there's zombies behind you. >> Zappy's behind me. Where? They're coming. Good thing you guys are slow. >> Hurry, hurry. Zombies are behind me. Look out. >> Hurry, zombies. Zombies. >> Join us all again. >> Me, too. Get out of here. Get out of here. Today is summer day. No more zombies, right? It's past my nap time. >> Um, incoming a lot of them. [Applause] >> Help. Somebody help. [Music] >> I'll save you guys. B. No zombie in my house. >> Yay. Thank you so much, Ryan, for saving us. Yay. >> You're welcome, plants. I hope that never happens again. >> Ryan, for saving us, we have a special surprise for you. >> What is it? >> More. >> Wow. Plants versus zombie toys. So, it comes with some fun plants and some zombies, too. This kit also comes with some plant and a zombie. This is cool. Daddy, >> does it actually shoot? >> Yes, it does. If you squish it. >> I dropped it. >> Push it in a lot. >> Squish. >> Wo. That was fast. >> Wait. No. I think I did it wrong. Look at this. My plan. >> He's like smooshed. >> Push it. >> Do it right. Show me. >> Just a little bit and then >> Oh, don't point at me. >> Ooh. >> Wow. Ready? Ooh. Not as strong as Ryan, but this is fun. Cool. What does this do? Just >> jump. Look backwards in here. >> Huh? >> Shoot. >> So, it shoots backwards, >> I guess. So, >> that's weird. >> Wo, >> that's cool. >> That's a small ball. Oh, and these zombies. >> Hey, Daddy. I need a head. >> There's a head here. Wa! >> Oh, it lights up. >> Oo, >> that's kind of cool. [Music] >> Oo, Ryan got a cowboy one. >> Oh, you keep dropping the head. >> Huh? >> I don't want to kill him. Daddy, the only way to get his head off is by using the this cannon. >> Okay, cool. I got the orange cannon right now. My one has like a mohawk. >> Oh yeah. Looking cool. Ready? Ready. I missed it. >> Oh no. No. >> Coming for us. Uh yeah. Only the helmet. [Music] >> You didn't even You didn't even launch it. >> That one's cool. >> Yeah. I like this one. He's so cute. >> He's a snow pee. >> A [Music] >> You can't get us or you can't get us. >> All right, let's do it. Orange and blue. >> I'm doing two, two. >> I'm going to knock them out. >> Three, two, one. >> Hey. >> Oh no, they only light up. More. Hurry up, Ryan. >> More more. Keep missing it. >> Keep missing, too. >> Oh, he's strong. >> You hit his head. Hit his head. >> Wow. >> We're hitting the head and this is not working. >> They're too strong. >> What? I'm hitting the head. >> You got it. Hey. >> Yay. One down. Two more to go. >> Catch him strong. this one. Oh. >> Uhoh. Two more, you guys. >> Close. They're too strong. >> They're too strong. >> Yoohoo. [Music] >> Good job. >> I can't wait to play with all my new toys. But first, I have to mow the lawn. zombies. First, let's plant sunflowers. Hurry, sunflower. I need enough sun to get a be shooter. Okay, I think I have enough points now. Beat the zombies to the ball. Round one, start. What's up? Yay! I won round one. Yay! I won a prize. I'm ready for round two. Oh no, there's three zombies. And they all have weapons. I need bad ammo. Heat. Heat. This not working. I'm going to use my special weapon. [Music] >> Oh no, he's getting close. [Music] Yay! I won round two. [Music] Oh no! Round three has four zombies now. [Music] >> Let's go peashooters. Let's get the zombies. A clear [Music] Get away from me, zombies. Oh no. What are they eating? [Music] >> Oh no, they ate the pepper. Now they have super speed. Oh no, the zombies are getting closer. [Music] They're stealing my dice. They got my dogs. Yeah. [Music] >> Are they defeated? Nope. They're still alive. [Music] Oh no, the zombies are so close. T-shirts, dump the balls on them. [Music] >> Yay! I defeated the zombies. Now for the plants versus zombie dance off. [Music] [Music] Who do you think did a better chance. Plants or zombies? >> Such a lovely day outside, don't you think? >> Yeah, such a lovely day. What do you want to do? >> Um, I just want to sip on some cold iced tea. Look at the lovely view. But wait. Oh no. Oh no. >> Oh no. It's getting closer. We should run away. Run. Run. Run. Run inside the house. Wait. Wait for me. >> Look. We can use this car to go faster. [Music] Which way are you going? Which way are you going? Where are they? Where do they go? Maybe this way. Um, maybe we should hide under the bed. >> We'll die. Let's go. I'm stuck. That's too >> stuck. Get out. Get out. >> Help. Hurry. Come on. Hurry. >> Let's go hide. Let's go hide. >> Under the bed. Ah. They'll never find us in here. The zombie will never find us. Okay. >> We have to be quiet. >> Quiet is good. Then they can't find us. >> We're all dead. I need a backup. >> All right, let's go together. [Applause] Where are they? H I can smell. They We're getting closer. >> Where are they? >> Somewhere here. >> Maybe under the bed. >> Ah, they're coming. We better get out of here. Oh no. Oh no. I feel them. [Music] >> I have an idea. Let's go upstairs. Let's go. Let's go. [Music] >> Oh no, they're coming. It's okay. I got them. Oh no, they're getting back up. We got to get out of here. They're getting back up. Wait for me. Look what we found. All right, hold on tight. Let's go upstairs. Let's go. Hurry. Hurry. It's not working. Go. They're coming. They're coming. It's not working. Go. Go. They're coming. >> Hurry. They're coming. Let's run. Run. We can pretend to be babies and sleep. Maybe they'll never notice us. Sh. >> This way. Let's go. Let's go, zombies. >> All right, let's go this room. >> I smell them. >> They're very close. Somewhere in this room. Where are you? >> Shh. Be very quiet. Okay, I think we also need backup. [Applause] I can't get through. >> I'm climbing up. >> Let's get them. >> It's not working. We definitely need backup. Oh no. I think our friends are in trouble. Yeah, we got to go save them. I can fly. [Music] What is that? [Music] >> Oh, please. Hurry up and get out of here. They're going to wake up soon. Let's go. Run. Run. Get out. Get out. I can fly. I believe I can fly. I believe I am the sky. I'll teach you for messing with my friends. Nobody messed with my friends. Nom. You guys stay down. [Music] Look, puppet. Wee. We should go in. >> Aren't the Aren't the zombies coming? >> Well, we can hide in here. Bob pit party. Bit party. Bobit party. Oh, hi Disney princess. What are you guys doing here? >> Um, this is my ball pit, by the way. >> Yes, you guys are ruining the party. You need to pay a lot of money for this. >> Ah, but the zombies are coming. So, like, can we just share? >> Wait, what? >> Those plants are too strong. I need more backups. >> All right, I think this is enough. Let's go get him. >> Plants. Plants. >> Zombies. They're here. They're here. They're in our place. >> That's fine. That's fine. That's fine. Where are you guys going? Where are you guys going? >> Hiding in the vir. >> Oh no. We don't have much time. Not working. It's okay. I'll come out. Three. Ah, two more. Anybody here? I need backup. I'm here to rescue you. >> And Reptile are here, too. >> Yay! Oh no, three of them woke up. I think you need more backup, guys. I want to help you, too. It's not working. I think I can do it. All right, Mo. Here we go. Mo bomb. Yay, it's working. Yay! We won. Yay! We defeated the zombie. Let's have a slide party. [Applause] >> And me too. Wait for me. >> Rock paper scissors. Rock paper scissors. I got you. What is that? >> Do you want me to touch it? >> No, don't touch it, Ryan. We don't even know what it is or where it came from. No, don't touch it. Don't touch it. I told you not to touch it. >> Wo! >> What's going on? >> It's making me move around. >> Are you sure? >> It's making me move around. Wo! >> What's going on? >> Wow! It's making me draw something. >> What are you doing? >> I don't know. >> Wo! What is that? >> What's wrong? Hey, you can't go. Are you aware? >> Yeah, it's making me What's that on the wall? >> What is that? [Music] >> I'm getting with a sneaker. >> It's not working. >> Ninja star. Ninja. >> Combo. Come on. Ryan's be careful. >> What does the zombie want? Ch. Ryan, I'm going to trap him right here. We just run out. Okay. Be careful. Let's go. Let's go. Run. [Music] >> Where should we hide? >> You hide under the table. >> Under the table. Where are you hiding? >> Okay. Behind the chair. >> Okay. Be careful. Oh no. Zombies coming. [Music] >> Hurry, Ryan. Hurry. Hurry. Hurry. >> Mommy. Get out. Hurry. Hurry. Sh. Be careful. [Music] >> Oh, that was a close one. At least we got away. >> I know. Okay, let's just rest for a little bit. Okay, that was a close What? Don't touch the marker. >> No, don't touch the marker. Quiet. >> Wow. It's making me draw something again. >> Okay. No, no, no. [Music] I want to help again. Go away. It's not working. What are you doing? [Music] [Applause] What if we be destructive with food? You have some UF. Oh, what should we do? What should we do? Um, let's run away. Okay. Okay. Mommy, I'll be in distraction. Okay, thank you. Wait, wait. Come. >> He's coming. >> What should we do? >> Love him. Oh no. Oh, look. Panther. Oh, I can distract him with this. Is it working? >> Yeah. I'm using my le I'm using my less using my leg to rese. Okay, we better hide. Are we safe? Are we safe? Are we safe? >> We're not safe. We're not safe. We're not safe. Mommy, >> wait. I got an idea. Let's get out of here, Ryan. Ryan, the zombie is distracted. Let's get out of here. Come on. Come on, Ryan. Where did the zombie go? The dinosaur is out there. >> It's gone. The dinosaur's gone. Okay, let's go. Let's go. Let's go. >> They're still behind us. How are they still behind us? Ryan, where are we? >> They're right there. Right there. >> Okay. Oh no. What should we do? They're coming. You're just touching, Ryan. Remember, >> I think I have an idea. Maybe now I know how to control it. I can make Mr. Incredible. >> Really? Okay. Okay. All right. Let's try. Okay. Now I can make him. >> Okay. >> Whoa. Where are you going? Mr. Incredible. >> All right. Is it going to work? >> It's working. It's working. It's working. Incredible. >> Hey, Mr. Incredible. And you lost some weight. >> I've been on the treadmill a lot. >> What? >> What the? You lost weight. That's Incredible. We need your help. There's a dinosaur and a zombie out there. >> I'll take care of it. >> Thank you. All right, we better go. Okay. All right. >> Showtime. Oh yeah. Watermelon. Watermelon. >> Watermelon. >> You want it? >> Hey. Hey. Blue. Blue. Blue. Me. That's a good girl. Go outside. That guy gone. Did you defeat them? >> I took care of them. No problem. >> Yay. Thank you. [Music] >> Today we're going to spend the night at the Minecraft hotel. >> I'm so excited. Let's check in. >> Uh hello. Hello. Hi. Welcome into our Minecraft hotel. Uh checking in for the night. I can see. >> Oh, yeah. Yeah. Here's my luggage. Here go. >> Oh. Oh, >> all right. You got that. All right. >> Well, what do you have lined up for us? What can we do? >> Uh, what lined up? What to do? Uh, you know what? First, let's just show you to your room so you can get comfortable. Um, bellboy. >> B boy. Yeah. >> Are you going to tell them? >> It's fine. It's fine. Show them to the room. >> To the room. To the room, girl. >> Right this way. >> Oh my god. Okay. >> Oh, locks. >> Okay. >> Wo, >> this is so cool. >> This is awesome. >> I thought I uh reserved the presidential suite. There's only one bed here. >> Hello everyone. How are we finding it? Nice and cozy, right? >> Oh, actually, >> just just ignore that. >> What was that? >> Nothing. Uh, you know, we just um really like the the real life experience here. >> The wall's shaking. >> No, no, no. Ignore it. It's just Okay, fine. I'm sorry, but this hotel is actually infested by monsters, but I feel like you guys look pretty like you can take care of yourself. So, if you can defend these guys off for the entire night, you can just keep the hotel. It's yours. Free. Free of charge. Okay, Belleboy, let's go. Bye. Come on. >> You're going to leave us here. >> I don't even know what to do. >> What? Don't leave us. >> All right, Ryan, we don't have much time. Let's do a quick room tour. Okay, so uh so we have a bed here. Nice and cozy, but only single bed here. Uh, we have a kitchen right there. Nice charcoal here. Very retro style. Uh, what else? Oh, look, look, look. We have enchanted table here and crafting table here and bunch of old weapons and veh and lantern and shell. I think that's it. Ah, the door is opening. Well, the zombies here. We have to defend ourselves. >> How? >> Here, take this. >> What is this? I don't even know how to hold this. >> Go fight him. Okay. So, what do I do? Ryan, he's scary. Come on. Where did he go? Where did he go? He's behind me. Help me. >> Keep him busy. I'll get him. >> Help me, Ryan. I'm >> so scared. I can't. Look. >> Get out of the way. Go. Go. >> We did it. Yay. Good job, Ryan. All right. Let's go. Let's go. Let's go. All right, Ryan. I'm back. And it was super easy. We got this, man. Oh, by the way, I met this guy. He's really, really nice. I think we can be a friend. He's blow up. What? Blow up. Let me squeeze me. Let me What did he explode? And he's gone. Ryan, I don't know how much longer we can do this. Maybe we should look into different hotels. Ryan, we should check out. >> Getting kind of cold. >> Did you close the door behind you? >> Uh, I forgot. >> Hurry, hurry, hurry. They're coming in. Are we safe? Dad, >> hold the door. Hold the door. I'm going to enchant my weapon. >> Ryan, hurry. >> I got this. >> Hey, Dana. Ryan. Wait. Ryan, where are you going? Did he just abandon me? >> Just wait. Just wait. I'm going to save you. If I hit that creeper, it can blow up and take out the zombie. [Applause] >> What was that sound? Oh, they're gone. Ryan, we did it. Ryan, we did it. It's almost in the morning. >> Yeah. Who's this guy? Oh, >> hey, llama. Oh, so cute. Oh boy. Hey, how you doing? Did it spit on me? >> Uh, okay. Villagers are coming. You have to get ready. Come on. You have to cover up the window. Use that cobblestone. >> Okay. Oh. All right. No problem. All right. Another one right here. One more. All right. I think we did it. Oh, you know what? It's a little open here. Give me one sec. Now it's good. >> Uh, that works. Let's go. All right. I'm the best crafter. Hurry, hurry. Let's go inside. Okay. Close the door. And we got to block the door somehow. Crafting table. Let's move that over here. All right. Move the crafting table here. >> Hey, >> I think they're here. [Music] They're trying to open the door. Yeah, this get away from my hotel. [Music] >> Oh no, they're getting in. >> I don't have any more arrows. >> Okay, Ryan, what are we going to do? >> I brought just the thing. >> Hurry. >> All right, we got to get out of here. Let's go. Come on, you got to get out. >> Okay. All right. Wait. But right, I cannot get out from this way. Uh, what do I do? I don't have time. It's actually kind of pretty. Anyways, uh, I'm good on my word. So, the keys are yours. Uh, what's left of the hotel is yours. And, uh, yeah, it's all yours. Wait. Okay. >> Weren't there two of y'all? Where's your dad? >> Uh, I'll see him again someday. [Music] Oh, hello and welcome to Steven. >> I'm not Steven. I am Land. No, of course. Common mistake. No, Steve in. My bad. But I saw online where I'm able to book a room here in Steven for like a dollar a day. Is that right? I can see that you found our grand opening promotion. So, it is for a dollar. Uh-huh. Yes, of course. Uh, looks like you have our suite. So, we'll just get the bell boy to help you out. Bradley, [Music] >> Bradley, we have a guest. >> I'm doing something. >> No, put the chicken jockey back. >> Put it down. >> Okay. Yeah. >> Help her with that. Show her to room. >> Of course. Right away. Yes, ma'am. Thank you so much. Please enjoy your stay. Uh, you can go ahead and follow him. >> Oh, sure. >> Is this it? Uh, >> yeah. This is your room. Okay. Forgot the key. One second. I'm just got to go get the key. >> Hurry up. I'm tired. It's been a long trip. >> Okay. So, I couldn't find the key. Uh, we got a very professional way to open doors when we don't have keys. >> There you go. Welcome to your room. >> How do I close it? >> Just slam it in hard enough. It'll close. >> Wa! This place is awesome. I think I hit the jackpot. So exciting. If you have any questions about anything, you know, guess you could ask me them. >> Wait, how come there's no nothing on here in this book? It's blank. Do I use my imagination? Is that it? >> Sure, that's good enough. >> Can't wait to see that. >> A secret potion. >> Yes. The secret is that I don't even know how to get it out of there. >> So much fun. What is this? Is this a surprise toy for me? Sure. But we will charge you if you take it. >> Oh, okay. >> I know what this is. I've seen it. >> Yeah. >> This is like a spying thing where you >> No, that's an armor stand. And now I got to fix it. >> Sorry. Sorry. Can I take this home? Is it a plant? Is it real? >> How many plants have you seen? Okay. Yeah. Yeah. It's a real plant. Real plant. >> Okay. I I'll water you later. Oo. Is this my bed? Wait. Does it come with a pillow and blanket? I didn't bring any. >> That is the pillow and blanket. Here at the Steve Inn, we have only the finest of flat materials. >> It's kind of hard. Do you have any cushion? >> No. >> Is it a secret hideout spot? >> It's a bookshelf. Uh, it's more of those imagination books you found. >> You're lying. It's not five times. It's a bookshelf, but they're not real books. You really have a a lot of energy. You probably worked up an appetite. Would you like to have any food? >> Yes, but I'm so hungry. I'm starving. I could eat a cow. >> I can see if the chef has any cow. We have one of the greatest chefs in the world. Yeah. Uh, so I'll go preparing my chef specialty for you. Be right back. >> Can't wait. I'm so hungry. I really hope it's a pizza. That hurts. >> Okay. Well, just get that off of there. Yeah. And bonapetit. >> Is it a coaster for the food? >> Here at the Steve Inn, we serve Minecraft food. So, we have a carrot and wheat. >> Is this edible? >> Uh, it's edible if you try hard enough. >> Wait, is this included in my $1 or is this extra? >> No, it's it's included. >> The score. Okay. Ow. Ow. Do you actually have something else? >> We've gotten reviews about our steak. Uh, if you'd like to try that. >> Yes, please. I love steak. Well, this will be like uh unlike any other steak you've ever had. Be right back. >> I can't wait. I'm so hungry. So, how are we finding the room and all the amenities? >> Like everything is a little bit too blocky. >> Minecraft blocky. So, it's perfectly Minecraft. Got it. Oh, and our chef is here with our special steak. >> Your steak. >> It smells like a steak. >> Yes, exactly. But does it taste like a steak? >> Ah, my tooth. >> Oh. >> Um, well, there there is um also a you know a little bit more on the back as well. So, wait. What are these? It's beef, right? >> It's beef. I think so. >> You know what? Somehow I just lost my appetite. Who needs to eat anyways? Is there any activities around here I can do? >> Oh, activities. Of course. We have some of the funnest and best activities. In fact, our activities director will uh get it all set up right now. >> I'm ready. I'm ready. Activities director. >> Activities director. >> Oh, right. >> Oh, you again. >> No. Uh because it's it's a different hat. >> Oh, okay. >> Mini hats. >> Okay. >> Activities. >> Activities. We're so excited. Yay. >> Activities. >> And this is a popular one. Not only is it very Instagrammable, but it's so much fun. Right, Bradley? >> A lot of fun. >> Okay. So, why don't you explain the activity as our activity director? >> Um, blocks. Um, it's it's called Minecraft. So, >> pickax. >> Oh, yeah. Pickax. >> Pickaxe. Uh, it's called Minecraft. So, you're going to mine. >> Just go at it. >> Yeah. >> Yes. Exactly. >> Okay. >> Um, maybe one more swing and uh >> one more swing. >> Yeah. Perfect. I >> I'll try this one. I'll try this one. >> Okay. Oh, and look, mind. Perfect. Great job. >> Wait, what? >> Yeah. Uh, don't forget all of it. Yeah, of course. >> Oh, perfect. Oh, wow. Disappearing mine. Look how all this inventory you're building. She's going to be able to craft so much stuff after this. >> Hit hard. >> Great. >> Back. Watch out. Get him. >> There you go. >> Nice swing. Basically a baseball player. >> Yep. Yep. Yep. >> Yep. Yep. Everything. >> Good job. Good job. You're doing great. >> What else? >> What else? What else? Uh, activity director. What What else do we have activities? >> Uh, we got uh archery. Archery. >> Yes. Yes. Archery. Always wanting to learn archery. >> Yes. And we have one of the best archery instructors. Practically Olympic level archery instructor. >> Oh, I should have saw that coming. >> I don't know what you mean. Archery time. >> Okay. But what's the target? Only one of the best targets that there is in Minecraft. Voila. a creeper. Okay, but it can't be that easy. Does it move at least? Of course it moves, Bradley. Moving target. Moving target, right? >> No, no, no. But just just um um just just No, just just lift it. Wait. >> Careful. My hair. My hair. Oh, it took me an hour to wash. >> You're going to pull back and then release. >> Pull back. >> Wow. >> Try again. >> Wow, that was gold medal worthy. >> Wait, let me try again. Wait, do I win something if I if I would to hit it? >> Yeah, I've got a prize. Yeah, you'll win something. >> All right, here goes nothing. >> Bullseye. >> Bullseye. >> I did it. I did it. So, what do I win? >> Special. >> Oo, special >> from Chef Bradley. >> Chef Bradley. >> One of our Steve in meatsticks. >> Oh, not another one of these. >> Now, maybe like another activity or something instead then. >> Oh, okay. Uh, yes. Our inn does include a pool. >> Really? >> Let me go get it. I'll be Just hang >> go get >> I'm going to get the pool. Just hang out here. >> Okay. Bradley. Bradley. Did Did you forget about me? >> Yeah. Pool. All right. It's coming in. >> This is not what I was expecting. >> No. One of our finest amenities is our pool. >> Finest. Even comes with a towel. And you know what? You can use my goggles. Did you sanitize this? >> Okay. You probably don't want to use my goggles, but the towels. Towels. >> Uh, yes. Uh, make your own diving board. >> One, two. >> Okay. It's actually fun. Are you sure this is part of a dollar room hotel? >> Yes. This is our Well, only for you since we're customer. >> Help. Help. Oh yeah. >> Okay. Okay. >> Also, you signed the liability waiver, right? That accidents on the premises are not underability. >> Okay. We're losing her. >> It's deeper than I thought. >> Dry you off. >> If you would like to tip any of the Steves in staff for your services, we will happily accept uh anything. >> Okay. Well, when I said anything. >> Sorry. Sorry. Sorry. You're right. You're right. Sorry. Had fun with this activity and only this activity or any of the other ones, feel free to leave us a five star review, Google Yelp and all that stuff other than a five star review. If you want to leave anything else, uh just don't leave a review at all. If you would like to head to bed and um I think it's bedtime. >> Yes. Hold on. That's a good treasure for me. >> Yes. Also, if you leave a fivestar review, then you get everything in the box. >> I thought you said that was my birthday gift. It's blocks, which of course is um kind of Minecraft, but also uh I think that's a trademark infringement. But can I keep this? >> Yeah, of course. Yeah. No, it's for you as our grand opening customer. Okay. If you really enjoyed your stay, please leave a like and and you know, like Yelp and Google and all that. Refer friends. >> You owe me a birthday gift. >> Oh my goodness. Finally, you was a brick. Like, just go for a swim in the pool. >> I quit as being the chef. >> You can't quit. >> I quit all my jobs. >> No, you can't quit. I quit. >> You're the only employee. >> Hey guys, today we're trying to survive 24 hours in Minecraft school. After all, the best way to get better in Minecraft is to actually live it. Uh, lesson number one is uh try not to get blown up by that creeper. >> What should we do? >> I don't know, but he's getting closer. I don't know. >> Wait, where are all my items? I can check my inventory. [Music] >> Blink, >> there's nothing. How are we supposed to survive Minecraft when we keep losing all of our items? >> I don't know. Probably stay away from people. >> I might be of some assistance for I'm Stan. That's right, Stan. I have been playing Minecraft since I was a little kid. In fact, I enjoyed it so much that I decided to stay here forever. So, I have become an expert and I can show you noobs how to be a master of the craft. >> He's so sarcastic. >> Uh, I don't think that's sarcasm, but he's pretty intense and we're not doing very well on our own, so maybe it couldn't hurt. >> It couldn't hurt. Do you want to be stuck here forever? Uh, I mean, if if we just give it a try, I'll it's a strange. >> I'm very intense and not sarcastic. Now, let's do this. I will show you how to fish. >> Now, that's sarcasm. >> All right, new bets. Fishing is quite simple. All you have to do is cast your rod like so. Yes. Very good. Very good. Now, you just have to wait. You watch the water for the bubbles. It's the raw clothes. You see your bark go down and yes, we have a fish. We have a fish. That's how you do it. >> I can't believe that worked. >> Um well, uh I don't think >> you can trust me. In fact, I think you guys can fish on your own. >> Come on, Zadeie. You got this. Catch a bigger fish. >> Little guppy. >> Get a bigger fish. Big fish. Big fish. >> Watch the water. >> Okay. >> Become one with the water. >> Any bits. Concentrate. Concentrate. Do not allow your mind to wander. Do not become distracted. >> You can do it. Wait. >> Am I distracting you? >> Am I distracting you right now? >> I got it. Awesome. >> We have a fish. >> Fish on your first try. That's incredible. >> You are a new betat no longer. >> Okay. Where's the frying pan? >> Oh, yes. Yes. We need to cook the fish. This calls for a frying pan. Follow me. What? >> Wait, where is he going? Where he said? Follow me. I >> I went this way. Follow me. Uh, >> I think he's just going to keep coming back. We got to go. We got to go. Come on. >> Following. Following. Following. All right. So, we need to build a house, which requires wood. So, we need some wood. >> Oh, yeah. >> It's a way to do it. I mean, if I had an axe, but she she's got it. She's got it. Hey, Satie. It's working. Keep going. >> Yeah, just take a while. Do you uh want to help her out with the axe? >> Oh, this is much better. Yeah. >> Yeah. Going to need more wood than this. >> All right. Come on. A little more wood. A little more. Okay. Yeah, that's good. Keep it going. Wo. Yes. Okay. All right. Uh I think this should be enough wood now. Oh, no. It's enough wood. It's enough wood, Z. Okay. >> Wait. So, we need this for a fight. >> All right. Now that we have all this wood, we're going to have to do a bit of an advanced technique. Building a house. Now, to build a house, it takes a lot of creativity and fortitude. It took me years to be able to become a master house builder. But with my help, I think that you new bets will they go alone now. Alone. and a finishing touch. >> New beds. >> Oh, wow. Zadeie, good job. I love what you've done with the outside. >> New beds. New W. Did Did you two build this house? >> Well, yeah. Yeah, we had all the wood to do it. So, >> took me 17 years to learn how to build. >> I mean, good. Good job. Yes. You are obviously taking after me. Very well. Uh, it's good. Get inside the house and cook that fish. Hey, let's >> I I'm not sure if we build a frying pan, though. >> All right. All right. So, to cut this fish, we're going to use We don't need a pan. All we need is this trusty furnace and this coal. Well, and the fish that we need to cook, >> of course. >> First, we add the coal to the furnace. Then we cook the fish. [Music] >> Oh yes, it's cooking. >> I'm so hungry. Me, too. >> The fish is cooked. >> Golden brown delicious. >> Wait, no, wait, wait, wait. Do not. No, don't share it. Not yet. >> What? >> We need to save this fish. >> No. No. It's just dinner. >> No. Do you know what's coming? >> Dinner. No, not dinner. A battle. Wait, >> battle. >> A battle. Cuz it's going to be cuz it's going to be a night soon and that's when like all the creepers and yeah, the things come out. We need to save this. >> Wait, that'll should we be worried? >> Should we be preparing? I mean, more than just a fish. Like, do we need weapons or >> weapons? Yes. I like the way you think. Weapons. Let's make some weapons. Weapons. >> Uh, I think he needs help. >> Weapons. Weapons. Weapons. >> No. And there's no way to calm down cuz we're crafting weapons at this crafting table. Are you ready? >> Ooh. So, crafting table means you break. >> No, we're not. We already have the materials. Okay. Here. Take this. >> Wait, wait, wait. If we're crafting, what are you doing? >> Yeah, what are you doing? >> I'm supervising. Yes, supervising. Now, let's craft Minecraft. [Music] [Music] Now we're ready for battle. Wait, what's the song? >> Seriously, we don't need him. Nope. Nuh-uh. Nope. Nuh-uh. We might need him. [Music] Oh man, there's a creeper and a zombie here. Okay. Okay. Uh, Bri, since you have a shield, >> okay, >> you go for the creeper and I go for the zombie. >> Yeah, it's a good idea. >> Sword against sword. >> Okay. Uh, good luck. Hurry, hurry. >> Hey, hey, hey. Leave Lamuzini alone. I challenge you to a battle. Okay, I have to be careful. [Music] If I bring the zombie to the creeper, they probably might explode. Okay, come on. Come on, zombie. Come on. Come on. Okay. Well, it's my job to take care of the creeper, but I think if I get too close, it's going to explode. Maybe we should test it out. Let's see. Uh, hey there, friendly creeper. Okay. Uh, back away. Back away. Back away. It's calm, little I think I got far enough away that I'm in the safe zone. But how am I going to defeat this thing? Oh, man. Brie. Bri, is the creeper ready? Oh, I think I know what she's up to. Okay, we we got to do this. Hey, creeper. Hey, over here. Over here. Hey. Hello. Oh, man. I have to time this just right so that the zombie will come over right as the creeper explodes. Okay, wait for it. [Music] Three, two, one. Come on, hurry, Speedy. Hurry, hurry. Okay, take take cover behind the shield. He's about to blow. [Music] >> Oh, did it work? >> Wa Zy, you're okay. >> Wow, Zadeie, that was actually a really good plan. Hey, are you good? Hey. Hey. I think we actually survived in Minecraft. Uh, no thanks to that guy with whatever he's doing. A little more green. And bam. Boom. Check out my creeper named Larry. Larry. What? Oh no. Stay put. There we go. Well, I'll deal with him later. Time for some video games. [Music] Yes, another score. Out of snacks. Got to go reward myself after that game. Huh? A moving box. Going right for the snacks. Where did you There. There you are, you little box. Don't you move there. Hey, wait. >> Whoa. There you old box. >> Hey guys, it's Zack and I'm back with another unboxing video. Today we are unboxing the creeper. >> Larry. >> Larry. A creeper. Wa. It's beautiful. Is this Kada? >> Whoa. Is that a bee? I mean, this place is kind of low resolution. Do I need glasses? Okay, bee. Okay, I'm allergic to bees. What in the world? What is that? I can punch things. That's cool. Oh, yeah. What? You get stuff for punching things. That's pretty cool. Hey, Zach. Zach, why aren't you in here? Huh? That's weird. Zach doesn't normally leave his game running. And no snacks. >> What was that? >> Wait a second. That's a >> Oh, someone's calling. I'm a little busy right now. >> I have urgent news. There's a creeper loose in the office and his name is Larry. >> Larry. >> The only way to stop him is to catch him with a piece of paper. >> It's close. I can hear him. >> You got to hurry. >> I know what to do. When I mentioned snack earlier, that's when he popped up. So maybe if I use this M, this is a yummy snack. [Music] There he is. [Music] >> Gotcha. Hey. And it says Larry. Punching all this stuff is making me hungry. Is that a cow? >> What are you doing here? >> I was just chasing Larry and then Oh, we're in Minecraft. >> That's where we are. You good? >> Oh, yeah. This is how you say hello in Minecraft. You didn't know that? >> Oh. Uh, hey, >> wait a second. How long have you been here? Have you found Larry? >> I don't know. I've just been punching blocks all day. >> Why don't you just give me all your materials? >> Okay. Uh, here's this, this, >> I got some bread, fish, and some beef. I did beat one cow. And then here's another fish. I don't know how to cook it. >> How did you get all this stuff? Well, never mind. It doesn't really matter right now. All right, I'll be back. >> I found a chest. I guess I could build some dirt. There's one. And [Music] >> who is that? Oh, he's coming this way. Okay. Uh, hey, is there uh anything I can help you with, sir? >> Shiny. Oh, >> shiny. Shiny. >> What? Wait. Oh, you can just pick that up. >> Shiny. >> Hey. No. No. Hey. Uh, this is my shiny rock. Okay. Hey. Hey. Come on. No. Okay. Whoa. Whoa. >> Whoa. Whoa. I can tell you where to get more. Yeah. Shiny. That way over at the forest. You can just head on that way. Come on. Yay. Get out of here. >> Shiny. >> Who is that guy? Hey, let me in. You got a >> Hey, >> Alexis. >> Yeah. >> What is this place? >> Oh, I built this house with all the material you gave me. >> What? >> Come on in. >> Okay, so I got to tell you. So, there's this guy and he's like green and then >> Okay. Okay. Hold on. First, look how nice I made this house. Look at the bed. >> Okay, that's great. >> And the furnace, the crafting table. I mean, >> that's great. That's so cool. That's That's actually really cool. But just listen. There's this guy and he's green and he's kind of weird. And I was like thinking, \"Hey, how you doing?\" And then he just comes up and he steals my shiny rock. It's got this like blue and that doesn't matter. >> Well, hang on a second. That sounds like you're describing a zombie, but they can't walk around in daylight. They'll just burn. >> Yeah. Yeah, right. But he had this uh magical helmet thing on, and I think he's able to live in the daylight. >> Okay. Well, I know how to deal with zombies, so I'll just get some armor and gear up and go take care of him. >> Really? Yeah. >> That's great. >> Perfect. All right. How do I look? >> Pretty good. >> I'm so ready to go fight this guy. >> Whoa. Who said anything about you coming to fight? I think you're going to stay here and protect the house. And you got to stay with Jeff. >> Jeff? >> Yeah. >> Who's Jeff? I guess she knows what she's doing. >> Whoa. Llama. Jeff. Hey, Jeff. All right. Well, what what does a Jeff eat? Whoa. Oh, it's this. Okay, here's here's some wheat. >> Chomp chomp, buddy. >> All right. >> What? There actually is a zombie. >> Back for shiny. >> That should have worked. This is going to be a lot tougher than I thought. >> Take that. Take that. Good shiny helmets. >> Oh yeah, you get them. >> It's not going very well. Hey, get out of here. Two. Hey, come on. >> Oh no. Oh, it might be food delivery. >> Creeper delivery. It's for Diamond Z. >> Uh, >> you must have the wrong address. >> Uh, 123 Herobrine Lane. >> What's that? >> Oh, come on, man. Man, just let me get inside and deliver this food. That usually works. Oh well. Hot. >> Come on. >> No. >> I have an idea. >> No, no, no. It's I've got this. It's just too dangerous for you. >> Actually, I have two ideas. >> What? What could it possibly be? Woo! >> Hey, B. Oh, you're back. I be attack. >> Whoa, a bee. That's >> good job. >> Oh, yeah. Friendly fire. >> Yes. >> Come on, B. Oh, he's angry now. Oh, man. >> Oh, it's not working. >> All right. Uh, second idea. Right. I present >> creeper pool. >> What? >> How's that even possible? Wait, you can't. It doesn't matter. I don't want to go longer. I don't like swimming. I don't go in pool. >> See, it's fine. The water's fine. >> I don't think he likes it. Maybe try throwing in that cape of yours. >> My cape? >> Well, I love my cape. >> Oh, come on. Just throw it in here. >> No. No. Not shiny. I got >> Just put it in. >> Okay. Okay. I'm fine. >> Shiny. Go in there. >> Shiny. >> You got it. >> Oh my. Yeah. Shiny. Oh, I love that cape. >> Yes. >> Oh my gosh, >> Zach. You did it. It worked. >> Yes. And my house is safe. >> This is the craziest day of my life. >> I'm just glad we got him. >> Hey, we still need to get Larry. >> Larry. There he is. >> Larry. Hey. Oh, >> we got him. Nice. That >> was crazy. >> Now we can just go try all the nice food I got. Let's go. >> Cuz I'm hungry. >> Oh, hey Jeff. >> You fed him, right? >> Of course. >> Oh, nice. You did a great job taking care of my little guy. >> Well, you can count on me. Behave.",
    "start_time": 0.0,
    "end_time": 3742.52
}