{
    "video_id": "u_FtdP_JyAQ",
    "channel_url": "@ryansworld",
    "transcript": "Today we're on the hunt for a laboo. But not just any labu. A giant one that's pranking everybody. Let's go catch it before it pranks someone else. Come on. Go, go, go. Welcome to Ryan's world. I hope this is the right address. 123 Magic Cave Lane. I can't wait to get the rarest Laboo and add it to my collection. Now, where's the wizard that said he would meet me here? Are you looking for this? >> Yes. >> Yes. It's so pretty. >> Well, enjoy your liaboo. >> Thanks. >> Oh, well, I forgot one more thing. It's actually the most important thing, and it's you can't feed it after midnight. [Music] >> What are you doing? >> Making sure it's not hungry. >> It's 12:03. >> What? >> What have you done? What have you done? [Music] Oh no. What? No. >> A life-sized Laboo. >> The legends of the great Lubu are true. >> So soft. Oh, and cute. Ooh. I'll take this over a small one any day. A Wait, what is he doing? What? What? >> Oh, no. >> Okay. Loo boo. >> What was that? My loo turned on me and got my other loos. >> That is why I told you not to feed him after midnight. >> Too late for that. >> Well, I'm done. This is not my problem. >> Oh, no. It's your problem now. You're coming with me. Come >> now. It is so hot outside. Woo! Thankfully, I have my soda pop right here to cool me off. [Music] All right, here we go. Oh. Oh, man. What the heck? Oh, come on. It's everywhere. Now you wash this off. Oh, man. This my brand new shirt. >> This is like a life-siz little boo boo. really dangerous. >> What are you guys talking about? I have soda on my shirt. Why are you guys talking crazy? >> Oh, bye. [Music] >> Exploding sodas. That must be the Le Boooo. >> I think you're right. >> All right, let's go. >> Now the wash up. [Music] What is this? Oh my gosh. Look at all this slime. Who would turn water into slime? Ew. This is so gross. Wo wo wo wo. What was that? Was that the loou they were talking about? Oh man. Oh, gross. Where'd he go? >> What? It happened again. Yeah, that boooo. He did this to me. >> You saw him? >> Yeah. Where'd he go? Uh, I think he uh that way. >> That way? >> Yeah. >> We must find him. >> Okay. >> I just want to help. >> Come on. >> All right. Get on over here. >> Why are you dragging me here? I don't even see the laboo. >> Oh, yeah. But more importantly, I'm hungry. What? >> No, don't worry. I got enough for the both of us. I got this ham and cheese sandwich that my mommy made for me. And I also have this donut. >> No, I'm okay. Thanks. You can just eat half. >> No, really. Take a bite. >> No, take a bite. I just take a bite. [Music] >> Well, okay. More for me then. Oh, no. No, it's lonely. >> Ew. >> How dare that Lubu? He must have done it. That stone drop. Get back here. You rotten. [Music] [Music] What? What spell is he pulling me? I've been cursed. Oh, [Music] >> we're getting close. I can tell. >> Yeah, I can feel it. I just hope we don't get pranked again. Oh no. >> Are you kidding me? >> Not feathers. >> Let's go get him. >> My greatest weakness. >> I'm so tired of this evil cute little boo boo. I just want my money back. >> If only there was a way we could fight back. >> You're a wizard, Barry. >> I am a wizard. I'm going to need a bowl of shrimp. [Music] Thank >> perfect >> shrimpy boppity. Turn that loou back to me into his OG form. >> You know, you're not a really good wizard. >> Well, it works. >> Well, that should do it. >> So, this will turn him back to his original form. >> Sure will. >> Perfect. >> We need to lure him over here. Let's hide. [Music] Oh, Lab Boooo. I'm definitely not expecting a prank right now. I'm completely oblivious. [Music] [Applause] It worked. >> Oh, of course it did. >> No, he's just tiny and cute. No evil pranks. >> They're much better that way. >> You can actually just have it back. Thanks. >> Yeah. All right. Well, it's better in my hands anyway. I make sure not to feed them except for once a week. >> Oh, that's great. >> And before midnight, >> I'm going to go back to my original nice leoo. >> All right, I'm going to go hang them on my Christmas tree. >> No, not again. >> Hey guys, here's five ways to prank your parents. Today I'm going to prank my dad because my mama is helping me. >> Hi. That's right. You always have to ask an adult for help. Right. >> Yeah. >> The setup. >> Okay guys, so daddy's gone for a few hours. So that means we'll have some time to set it all up. So first prank is spill juice on daddy's lap. >> First I'm going to use red paint to make it look like it's fruit punch or you can use fake orange juice like orange paint. I'm going to put some of that. Okay. So, first you need some wax paper or some parchment paper. And then you're going to start spilling. Wo! I'm spilling. [Music] Okay, guys. What do you think? Does it look like it's spilling? Imagine what it would look like on daddy's keyboard. Next up, we're going to put it in the freezer. It's in my freezer. Not only am I going to mess with daddy's laptop, but I'm also going to mess with daddy's iPad with mommy's permission. Is that okay? >> Of course. Team work. >> So, I printed out this broken screen. So, it's going to look like his iPad has been broken. >> Yep. We just print it out online. >> And here we go. From afar, it does look like it's cracked, right? >> Oh, yeah, it does. Daddy would be fooled for sure. >> This is saran wrap. This is daddy's office. We're going to cover the entrance with Saran Wrap so that when he's not looking, he'll just bump right into it. >> All right, guys. I'm helping Ryan setting it up. Daddy's going to be so distracted he won't even notice. >> All right, it's all set. >> What do you guys think? [Music] >> Over here is our garage. So that's where daddy will come in from and we're going to set up a whole bunch of cups with water in them. So first we have to set up the cups. >> Okay. So Ryan's going to do some. Mommy's going to do some. [Music] Okay, guys. We're done setting it up. [Music] Now I'm going to add food coloring to the water. Wo. Okay, I think that's enough. And then going to start stirring. So we're going to pour this into all the cups and then green. Now we're going to add in the water. [Music] And we're adding more. Okay, green's done. Now we're going to do blue. Okay, we filled in the blue cups. Now, red. All right, we also got the red. Now yellow. All right, guys. It's all set. I can't wait for daddy to come home. Once it's all frozen solid, use the scissors to cut like this. Look how solid it looks. Now, it's working. Only use this if you're going to use it right away because you got to make sure that it doesn't melt. Wait, I think Daddy's coming home. Let's go. Okay. Okay, guys. The last prank we're going to do is the jacket fridge prank. So, we have to wear the jacket backwards. And then I'm going to pretend that I'm trying to reach for something, but it's too high. And then this. And I'm like, \"Hey, daddy, can you help me? This thing's too high.\" Then when he comes over here, >> let the pranking begin. [Applause] >> Hey, daddy. >> What is going on? >> Ready for the funnest day of your life? >> What is this? How's it fun? There's so much water. I'm just so afraid of spilling them. Okay. >> Don't spill because if you spill, you have to clean up. >> No, I won't clean up. [Music] Okay. What do I do after this? What I do? Come on, Daddy. You got this. Oh, no. It's not going that way. Yep. Yep. Easy. Oh, finally. Can I just relax at home? >> Daddy, I may or may not have accidentally stole some fruit punch. >> No, no, relax. This is just a paint. You trick me. >> Hey, do you think I can play some games on your iPad? Yeah. Okay. Go ahead. >> Ryan, what's this do? My screen. You know how expensive iPad is? It doesn't even respond to my finger anymore. What? What's this? Are you serious, Ryan? You pranked me again. >> Happy birthday. >> It's not my birthday. Okay, sliding in. Hi. >> Hi, Daddy. Where are you? I'm ready to play some video games. >> Okay, I can play video games. You must be in the gaming room. [Music] What was that? >> Happy birthday. >> It's not my birthday. [Music] Put it on. Daddy, I need your help. This thing's too high to get from the fridge. >> I need you to help me. This thing's too high to get from the fridge. >> A lot of stuff happens today. What's going on? Wow. >> Scare me for you coming. >> It just scared me because it was so loud. I didn't even pay attention to this little boy. >> Hey guys. >> Hi guys. >> Hi. >> Today I'm going to show you and my family a super cool magic trick. >> Ooh, magic trick. >> Yeah, we're doing a magic trick, Daddy. >> Okay. All right. I can't wait. Show me. Show me. >> Okay. So, I need some money. So, can I have a $1 bill? >> H You sure this is not a scam? >> No scale? >> No scam. >> All right, I'll bring my money. Hold on. >> You got the bill? >> All right. I don't have $1. So, here $5. Okay. >> Okay. >> Actually, I'm going to need some more. >> More? >> Maybe a 20. >> Okay. I guess I only have another $50 bill. >> A 50. You don't want to do anything to it, right? I can still use it right afterwards. >> Yeah. Mhm. You see this $50 bill? Nothing suspicious about it. Came from daddy >> here. You can inspect it. >> Don't keep it. It's mine. >> Nothing. You have anything? >> Yeah. Share with Emma, too. >> Nothing suspicious. >> Yeah. >> Nothing is on it. >> No. >> Okay. Well, I'm going to fold it in half and I'm going to poke a hole into it with this pen. >> What? You said you're not going to do anything to my body. No, you're going to make a hole. I don't think I'm going to be able to use it. >> Okay. Okay. You ready? >> No. No. No. No. No. No. No. No. No. Stop it. Stop it. >> Say goodbye. >> No. >> Now, I'm going to poke a hole into this $30 bill. >> Okay. >> No. >> You can expect it. Like I haven't I haven't poked a hole in it yet, right? >> Uh-huh. >> I haven't poked a hole. >> Well, don't don't poke the hole, please. I want >> back home one. >> You did it. Why? >> I messed up your >> You told me you're not going to do that. >> See you monkey. >> I want to try. >> Okay. >> Oh my god. >> No, it's really stuck there. A >> upside down. >> But >> now I need your guys' help. We need to blow on it and say abracadabra. Abra. >> Okay. Three. Two. >> Does it work? >> One. There you go. >> Wait. What? You just swagged it off. How? >> No. What? How? >> Let me see. >> Did he just glue it over? Did he scratch tape it? >> I don't see any hole. Do you guys find that? >> I want to try. He didn't make a hole. >> Normal. Oh, >> wait. Wait. Give me this. >> Oh, wait. What? >> Oh, there's another side. >> Oh. How come there's two pentacles? >> That's a double. It's a double. >> Oh, wow. You're right. There's really no hole. I don't see anything. How did you do that? >> Magicians never reveal their secrets. >> Okay guys, this is part two. So, if you want to know how to do it, keep watching for behind the scenes. So this is actually a magic pen. So you take this part off, put it on this side, and this part is actually just a magnet. >> Oh, you can take it off. >> Yeah. >> Oh. >> So the way I did it is I folded it like this. >> Then I took it and then what when I was about to put it here, I take it off and put it in my hand. >> Wow. I didn't even notice. And >> I show you guys both the sides. Then I take this, put it right there. And three. Oh, there you go. >> Wow, that's cool. That does look okay. Uh, I need my How about you guys do it? So, it doesn't need to be $50, Ryan. It could be $5, right? No, no, no. How about you guys try with $5? It doesn't need to be 50, right? Give me the 50. Give me the no. >> Give me the 15. Here you go. $5. [Applause] [Music] Oh no, you poked a hole. No, >> you can't use this $5 anymore. >> Easy. I need everyone if you blow it. Sayabra. >> Abracadabra. >> Abracadabra. >> And it's good as new. >> I'll show you how this move. Oh no, you poke a hole again. >> I told you guys not to do that again. >> No, like this. >> What? It worked without even see the collab. We didn't even say the magic word and it still worked. All right. >> Yeah. >> Does my finger work? >> You want to? >> If pen works, my finger would work too, right? >> Yeah. Try it out. >> Okay. I'll do it. Yeah. >> So, I have the $50 again. I'm going to show you guys one last time. So, this part out. >> You're giving me heart attack. No, no, no, no. >> Then I show you guys, right? And three, two, one. >> Oh, it's literally just popped out. >> Abraadama. >> Good as new. Thank you for your time. I I appreciate >> That's my 50. >> Thank you. Thank you for your time. Goodbye. >> Bye. >> That's my money. Give it back to me. [Music] >> It's actually hard. >> Thank you for watching. Remember to stay happy and rise up. Bye >> bye. Bonus trick. >> Wow. What happened to your shirt? You poke a hole through your shirt. That's funny, huh? Yay. Good job.",
    "start_time": 0.32,
    "end_time": 1234.72
}