{
    "video_id": "wXy_Hx4BYeA",
    "channel_url": "@ryansworld",
    "transcript": "Wait, do you hear that? It It sounds like like a click and then a slide and then a clack. Almost as if someone is trying to solve a Rubik's cube. But that can't be right because no one else is here. Huh. Maybe I should go investigate. You want to come with me? Okay. Well, you don't have a choice. You're You're coming. You're coming with me. Let's go check it out. [Music] I think it's coming from in there. Well, let's go check out that really ominous green glow. >> Welcome to Ryan's world. >> Wa. What is the spider webs? Why does it have to be spiderw webs? What is this? Wo! What is I mean, it looks like a normal Rubik's cube, but something feels really ominous about it. Plus, why was it covered by spiderw webs? [Applause] H, interesting. You know, I've never actually solved a Rubik's cube before, so maybe I should try this one. >> Hold on. Hold on. Don't Don't solve it. >> Wait, who are you and where did you come from? >> I'm just an old man. I live here. That Rubik's cube. >> This one? >> Yes. The Rubik's Cube to be haunted. >> Haunted? >> Yes. Long ago, there was a boy named Jiminy Jim Jim and he solved the Rubik's cube. Fate befell him. Oh, fate. Oh, so terrible. Oh, okay. So, are you going to actually tell me what this terrible, terrible V is? >> Oh, you want to know? >> Of course I want to know. Why wouldn't I want to know when I'm folding the Rubik's cube right here? >> Okay. Okay. Okay. Calm down. Okay. This boy Jimny Jim Jim after completing that Rubik's cube. >> This one. >> Anytime he would walk through a room, somehow Lego would always be on the floor and he would step right on it. >> Okay, these are awful things. You know what? I think that this should just get like locked away forever or can I throw it away or burn it or something? >> What? What? What are you talking about? >> Can I just destroy the Rubik's cube? >> Why would you Why would you destroy the Rubik's cube? >> All right, something get my tooth. I need to go take care of this. I'll be back. Uh, maybe. >> Okay, you know what? We We need to like put this on lock and make sure that nobody ever tries to solve this. Okay. Uh, yeah. I'm going to have to figure something out. >> Okay, I'm back. Oh, the Lego. Where do these things keep coming from? [Music] That should do the trick. Wow, that was exhausting. I am famished. I'm going to get a snack. [Music] You're not salt. Eh, whatever. Oh, that was delicious. Now it's time to get back to my Wait, Zadeie. Zie, what are you doing? >> Hi. No, Zadeie. Nobody was supposed to touch that. It's haunted. Oh, we have to get rid of it. Wow, it's broken now. Are you Why is the Rubik's cube glowing? Uh, you know what? Don't worry about that. We We should probably Well, let's get out of here. We got to go. We got to hurry. No. Z. No. We got to go. >> No. No. What is h What is happening? >> Don't worry about it. We just got Z. We got to get out of here right now. >> No. No. No. We got to go. Come on. >> What is happening? >> We're almost there. We're almost there. Okay. Just tell me what's going on. >> No. Look, Zie. It's a really, really long story that kind of doesn't really make that much sense, but all you need to know is that we need to leave. [Music] [Applause] Hello. What's happening? >> The Rubik's Cube. Hurry. >> I don't know what I run. [Music] Oh man, this isn't working. You know what? Let's try going that way. We haven't We haven't been that way. >> Is that another knock? >> I am not answering that again. >> What? That sounds different. I'm going to go check. >> Wait, Zinny, are you sure? >> Wait, Zinny. Oh, be careful. I don't care. >> Um, who are you? >> They call me the ghost exterminator, and I'm who you're going to call. You rang. >> No. >> All right, that's fine. I come once a month. Bri, don't you think that's just a regular vacuum cleaner? >> It does. >> This one's modified. >> Zadeie, I don't think that we have any other choices, so we're just going to have to go with it on this one. You know, >> the ghost was last seen that way, and it happens to be a haunted Rubik's cube. So, go ahead, >> Daryl. The Rubik's Cube. You got to be kidding me. Oh, where's he at? Daryl, get out here. Daryl, get yourself out of here. Daryl, where are you? Daryl. >> Okay. >> Ooh, I don't think that that ghost exterminator is going to be helping us anytime soon. >> Okay. So, what do we do now? And where do we put him? >> Satie. Satie, I think we're in danger. >> You're going Why are you pushing me in front? No, it's >> Wait, you just got to scramble it up and then it'll it'll stop. >> We can scramble it. It can't be that easy. Wait, baby. Are you sure about this? Are you sure about >> it? You get We did it. Take that, Darl. Good job, dude. >> Not you. No, not you. >> Yeah, you didn't really do much. So, >> all right. Well, y'all want to go grab some pizza? >> No. >> No. We're We're super full. Yeah, we already Thank you. >> So, I'm parched and starved. So, >> the exit's It's that way. >> Oh, yep. Thanks. >> You You just forgot something that cost $150 in here. So, >> you're back here. >> No, it's just >> Yeah, the one that didn't actually do anything much like you. >> Okay. >> Excuse me. Sorry. Excuse me. Excuse me. Sorry. All right. >> Oh my goodness. This is a heavy door. >> I'll hold the door. >> All right. Thank you. All right. Yeah. Have a good day now. >> I want 10 appreciated. >> No. Bye. >> Yay. Finally. He's gone. >> Okay. Now, uh but Ziti, what do we do with this Rubik's cube? We have to make sure nobody ever tries to >> I have an idea. >> Wait, do you? >> Okay. You want to get the pizza? >> Actually, that sounds really good. I am starving. [Music] The cube, my precious. They threw you in the trash, but now you're back to me. Oh, Daryl, I'll never let you go. >> Hey guys, today I challenge my mommy to a Rubik's cube competition. >> Okay, so you guys don't know, Ryan recently learned how to solve a Rubik's cube. It has been over one week, right? And how did you learn how to solve it? >> YouTube videos. >> YouTube videos. So helpful, right? So last week, Ryan learned how to solve it. And so I thought I was inspired and then I started watching YouTube videos and learning how to solve it, too. So I just learned last night. Okay. So I'm obviously not as fast as Ryan, but it doesn't matter. It's just for fun because the more you do it and practice, the better and faster you'll get. Okay? So, Ryan, are you ready to compete in the first Rubic cube tournament with your mom? >> We gonna each scramble each other to be fair. Okay. Ready? >> Okay. I think it's all scrambled away. What do you guys think? Right. Looks pretty evenly scrambled. Okay. All right. I give Ryan his. Okay. You ready? >> Inspect. Inspect. >> Inspect. Okay. >> Okay. I have no idea what I'm doing. inspecting. Okay, I'm so confused. Okay, >> I'm trying out my new strategy, which isn't actually super good. >> Okay, so I'm a little bit really slow. I mean, the world record right now is 3 point something seconds, so we're obviously very, very slow, but we just learned it, so you know, maybe in the future. >> You never know, you know. >> Yeah. So, today's just my second day doing it correctly. So, the first thing is to get the daisy. So, I got a little daisy here already. But it's okay. It's all for fun and games and oh my gosh, I don't know what I'm doing. Those people who knows Rubik's cubes, they're judging me right now. I'm a little bit slow. All right. So, first you got to get the white cross. So, there is an algorithm to it. >> I'm done. >> I'm talking too much. Okay. So, there it is. Ryan finished. >> Yeah. You know, while I'm doing this, Ryan, there's two more. Let's see if Ryan can beat me while I'm finishing. So, these are actually the official Rubik's Cube, but it's not as good as this. This moves easier. >> I have to scramble. >> Okay, scramble it then. We little pause here. >> Can you scramble that? >> Okay. Okay. Little pause. Yeah. See, they don't actually move very well. >> Um, so the off brandand is actually better. >> Yeah. Okay. Mine's good. You know, Ryan's pretty quick for someone who only have done it for a week, but he' been practicing. So, I'm so proud of him. What? >> Make it harder or easier? >> Easier. There's a giant block. >> Okay. Okay. Ready? Ready? >> Two, one, go. >> I'm picking up where I left off. Okay. >> Giant block. Giant block. Okay. Actually, >> I'm so confused right now. I'm so confused. Okay. >> I'm going to use my new strategy again. >> Okay. So, Ryan just came up with a new strategy on his own. >> Yeah, cuz I'm so cool. Oh my gosh, I'm doing it all wrong anyways. Okay, let's >> Okay, this is good. This is good. No, this is Uhoh. >> Spaghettio. >> Oh, wait. No, never mind. It's good. Okay. Okay. Um, >> okay. It's so hard to turn. >> Yeah, the one that Ryan has, the official brand, is actually really hard to turn. Okay. So, you see it? So, first I got the first layer. So, after you've got the first layer, then you work to the second layer. So, that's what I'm going to work on. >> I'm on the second layer. >> Okay. Ryan, the second layer ready. Oh my god, >> this hurts. Oh my god. >> Okay, done. Ryan's done with the second. I'm still working on the second layer. This is too stressful. Okay. >> Okay. I have white cross >> already. >> Yeah. My strategy. Okay. >> Oh no. I put it the wrong place. >> Oh, this one's better than the other one. >> Okay. They're not going to believe me that I even know how to solve a Rubik's cube. >> Did you mess up? >> I did. I messed up. I messed up. It's okay. I can fix it. I can fix it. I can fix it. I'm about to solve it. >> No. So, >> I'm almost done, I think. >> Oh, no. No, no. >> Oh, yeah. I'm done. Basically, >> what do you mean? Orange. Turn it away. [Music] >> Wait, wait, wait, wait, wait, wait, wait. >> Oh my gosh, I keep messing up. I don't So, Ryan's done. Look. Wow. >> I'm almost done with the second layer. >> Okay. Gross. Ryan's scrambling. I'm going to Okay. Turn it away. Okay. Once it's here, do I turn it? Hold on. Sorry. I can't answer. I can't be asking my question. Yeah, >> you can't ask. >> Okay, look. I got the second layer. I got the second layer. See it? So, I just need the top layer left. The top layer. Okay. Okay. The top layer. Let's see how many times Ryan does the queue before I finish. >> This is my fourth time right now. >> Okay. Okay. Okay. Let's see. See, I'm a little bit confused right now. >> No. >> Twist down. Twist down. >> Okay. Not done yet. >> About to finish second layer up. >> Second layer done. Oh, already have the cross. >> Twist down. Twist down. Okay. How am I getting it? Correct. Oh my gosh, I messed up the cam. Let me scramble it for Ryan. Ryan, I keep messing up. I just learned it yesterday. twists clockwise up, counterclockwise up, clockwise down, counterclockwise down. So, there is a real algorithm to it. Clockwise up, counterclockwise up. >> Well, you're solving it. >> Clockwise down. >> Oh, I already have correct. >> Clockwise down. Okay, I give up. I give up. No, you know what? I always teach Ryan not to give up. Not to give up. But I I messed up the algorithm once you messed it up. But you know what? I'm going to pause here. I I really can solve it. I solved it last night. I promise. I solved it last night. >> So basically, so now what we're going to do is we're going to see how fast Ryan does it. Okay? So we're going to do it three times. See how fast Ryan does it for average. And then maybe at the end if you guys want to stay and see me finally finish solving this Rubik's cube. Are you ready, Ryan? >> Yeah. >> All right, Ryan, are you ready to compete against yourself? >> Yeah. >> All right. Ready? Here's the Rubik's Cube. Whenever you're ready. >> Okay. Okay. Three, two, one. Uh. Uh-oh. Uh-oh. Um. >> Okay. So, this is Ryan's first attempt. Oh, >> remember he only been doing this for one week. >> And he learned it on YouTube by himself, so it's very impressive. >> Oh, and the more you practice, the faster you get. So, can't move this. I don't even know what's going on right now. >> Second layer. >> Yeah, second layer is solved. Oh, let's see from Ryan's point of view. What does it look like? >> No. [Music] What? Done. Okay. How many second was that? >> 53.8. >> Let me see. What? Hold on. Let me check that. What? Under one minute, >> buddy. High five. All right, two more times for average. >> Yeah. >> Okay. >> All right, guys. I'm scrambling it. All right. >> Oh. Oh, this is good. >> Did I not scramble it enough? >> All right. >> Three, two, one. So yeah, if you guys want to learn how to solve the Rubik's cube, just click up YouTube tutorials. >> I obviously need to practice some more. >> Oh no. >> But I did solve one last night. >> I think I'm going to go slower than last time. >> It's okay. I just ordered it a week ago. So, it's really it's still very impressive. I already have the cross. Oh, no. But I don't have anything wrapped on the cross. Oh, wait. Wait, wait, wait. >> So, I'm making sure here. See, Ryan did finish right there. >> Okay, it's done. Okay, let me see. >> Oh, 1 minute. A 1 second. >> Oh, 1 minute and 1 second. 1 minute. 1 second. Oh, >> good job. That's not bad. That's really good. All right, guys. We got the cube. We got to scramble it for Ryan here. Okay. Make sure we scramble it good. I mean, I obviously scrambled it good last time because it took you longer. [Music] You think this is good? >> Yep. That was very good. >> What do you guys think? This is scrambled enough. >> Good. >> Yeah. Okay. Amazing. >> Ooh. Three, two, one. Oh no, I started from a different side. So now it looks weird. Can't do green. Can't do green. [Music] You got this, Ryan. It's okay. Okay. Okay. Okay. Okay. And cross already. >> I mean last week when he started you know the first few time it took him what 3 4 minutes and >> oh >> over a week he his time has went down. So good job. What what is it? >> 55. >> 55. Wow. Okay. Inspecting, making sure you guys know who did complete it. See? Wow. Okay. Got to show the time. Making sure it's legit time. Wow. And what is your average? >> It is 56.8. >> Wow. Good job. >> Y. >> Okay, guys. Thank you for watching. And if you want to learn how to solve the Rubik's Cube, just search up how to solve Rubik's Cube >> on YouTube. There's many fun tutorials. All right, guys. Thank you for watching. >> Bye. Remember, always say happy and rise up. Bye. >> And mommy will get better and then I'll show you that I can actually do it. I really did solve it last night. >> Bye >> bye. >> Listen up everybody. I've got a brand new channel. It's called Alpha XP. Every week I'm going to be sharing the craziest stories. Like this one time when I was training to become a demon hunter. Coco, I am so obsessed with K-pop Demon Hunters. I'll be playing the latest games, reacting to the wildest trends on social media, and sharing the funniest memes I've seen that week. Subscribe now so you don't miss when new videos start dropping. See you there.",
    "start_time": 8.08,
    "end_time": 1286.3200000000002
}